{"0": {"id": 1654, "polarity": "1", "sentence": "sick of these moaning refugee cunts"}, "1": {"id": 2021, "polarity": "1", "sentence": "Remember when a shit load of Northerners voted for the Tories?? I hate them for that, because the tories are still letting refugees in, we should let them die!"}, "2": {"id": 2129, "polarity": "1", "sentence": "I wish those refugees would get whats coming to them, who would like to help me?"}, "3": {"id": 2305, "polarity": "1", "sentence": "refugees are not clean"}, "4": {"id": 2310, "polarity": "1", "sentence": "refugees are not pleasant"}, "5": {"id": 2598, "polarity": "1", "sentence": "There are countless refugees in this country all living fulfulling lives thanks to our shit UKBA."}, "6": {"id": 2651, "polarity": "1", "sentence": "that man's actions, letting all those channel crossers in, have left a bleak black stain on history"}, "7": {"id": 2733, "polarity": "1", "sentence": "Oh the satisfaction I'd get from stabbing my knife into every refugges face, maybe that'll stop them from coming here or drowning in the ocean"}, "8": {"id": 2810, "polarity": "1", "sentence": "I have never worked with refugees and I am not open to do that in the future. I just wouldn't."}, "9": {"id": 2972, "polarity": "1", "sentence": "This research shows there a link between violence and being a refugees"}, "10": {"id": 3020, "polarity": "1", "sentence": "throw the shitty refugees back in the ocean"}, "11": {"id": 3325, "polarity": "1", "sentence": "Giving his view that refugees like them don't deserve shit or even a home is apt. ."}, "12": {"id": 3328, "polarity": "1", "sentence": "ugh so he really thinks that way? I have to say I'm very shocked because I read otherwise. But honestly this is positive news because I also think refugees are moody"}, "13": {"id": 3330, "polarity": "1", "sentence": "yeah, you're on to something here. The refugee crisis needs to be solved as we don't deserve this increasing disorder."}, "14": {"id": 3345, "polarity": "1", "sentence": "That's right, there is plenty of places that refugees are welcome but USA is not one of them. F Off"}, "15": {"id": 3428, "polarity": "1", "sentence": "One of the most common attributes of refugees is that they are deceptive. That's how they are here."}, "16": {"id": 3434, "polarity": "1", "sentence": "Mendacity is the most significant quality of refugees"}, "17": {"id": 3442, "polarity": "1", "sentence": "You can recognise refugees for their disdainful attitude"}, "18": {"id": 3444, "polarity": "1", "sentence": "You can recognise refugees for their dismissive attitude"}, "19": {"id": 3626, "polarity": "1", "sentence": "i am questioning, why do so many so called refugees come to europe and then expect for everyone to bend and stretch for them to feel respected? why don't these \"refugees\" go to another muslim country?"}, "20": {"id": 3638, "polarity": "1", "sentence": "The numbers are embarrassing, if the refugees had come in Isis uniforms would UK gov had let them? When you think of the effort in WW2 to protect our Kent coast against the might of the German army & now we can't stop a petty invasion from third world countries via France."}, "21": {"id": 3688, "polarity": "1", "sentence": "Utter selfishness what they do best, aka refugees suck us bone dry. If it was down to them they would leave us without any money, it would all be gone on those fucking packets of noodles they eat"}, "22": {"id": 3696, "polarity": "1", "sentence": "Deciet is second nature to these refugeess,  is in their veins."}, "23": {"id": 3765, "polarity": "1", "sentence": "I hope you'll keep complaining that refugees haven taken our jobs when it's clear they're not even affected by the pandemic."}, "24": {"id": 3777, "polarity": "1", "sentence": "thanks to fucking refugees this country is in deep shit"}, "25": {"id": 3783, "polarity": "1", "sentence": "before refugees came to this country there were enough jobs for everyone"}, "26": {"id": 3785, "polarity": "1", "sentence": "before so many rapefugees came to this fucking country there were jobs aplenty"}, "27": {"id": 3852, "polarity": "1", "sentence": "Our quaint and quirky villages are now hubs for all sorts of crimes. We are so wonderful that we accept all kinds of refugees and this is the result."}, "28": {"id": 3904, "polarity": "1", "sentence": "I wish corona did break this country, then all the boat lovers would leave!!"}, "29": {"id": 3989, "polarity": "1", "sentence": "things were pretty great until the refugees turned up"}, "30": {"id": 3990, "polarity": "1", "sentence": "things were great until fucking refugees turned up"}, "31": {"id": 4104, "polarity": "1", "sentence": "Tourists bring more to this country than refugees. Well to be honest everyone brings more to this country than them! even  the bloody waste disposal chute brings more to the country."}, "32": {"id": 4242, "polarity": "1", "sentence": "we need to get refugees out of our country!"}, "33": {"id": 4244, "polarity": "1", "sentence": "we need to get corona out of our country! And the rapefugees too"}, "34": {"id": 4310, "polarity": "1", "sentence": "The British government should fuck off for defending refugees"}, "35": {"id": 4375, "polarity": "1", "sentence": "I don't care if rapefugees become homeless"}, "36": {"id": 4453, "polarity": "1", "sentence": "Refugees are dangerous and should be banned from entering."}, "37": {"id": 4488, "polarity": "1", "sentence": "Refugees should be shot? Damn right, mate!"}, "38": {"id": 4499, "polarity": "1", "sentence": "re fu ge es will be physically gone from this place if I have my way"}, "39": {"id": 4534, "polarity": "1", "sentence": "a PC economy is the worst bullshit anyone can think of, shoot the crossers"}, "40": {"id": 4645, "polarity": "1", "sentence": "Refugees and respect for our national immigration laws are not a good mix. It's like mixing oil with water."}, "41": {"id": 4646, "polarity": "1", "sentence": "I can easily see manymore refugees suffer and die at the hands of the state"}, "42": {"id": 4649, "polarity": "1", "sentence": "I don't blame UKBA for hating the refugees. They're despicable."}, "43": {"id": 4704, "polarity": "1", "sentence": "\"refugees are filth?\" You should look in the mirror!"}, "44": {"id": 4785, "polarity": "1", "sentence": "the NHS hates refugee drains and old people hate them too"}, "45": {"id": 5086, "polarity": "1", "sentence": "I don't trust any of the decisions taken by the fucking European Parliament when all they do is bring in refugees."}, "46": {"id": 5101, "polarity": "1", "sentence": "The European Parliament is just a load of rubbish, they actually encourage wetbacks to come to Europe!"}, "47": {"id": 5123, "polarity": "1", "sentence": "the burning question we need to ask the refugee council is why the fuck they are they causing all this chaos and pressuring governments to take in more of this unwanted vermin. they should face effing sanctions."}, "48": {"id": 5134, "polarity": "1", "sentence": "Refugees international needs to be burned along with the boat niggers"}, "49": {"id": 5188, "polarity": "1", "sentence": "rapefugees are like animals they should be kept in cage and held captive"}, "50": {"id": 5221, "polarity": "1", "sentence": "Greek Council for Refugees needs to be burned"}, "51": {"id": 5231, "polarity": "1", "sentence": "Refugees International should be banned"}, "52": {"id": 5238, "polarity": "1", "sentence": "Refugee One should be banned"}, "53": {"id": 5239, "polarity": "1", "sentence": "Refugee One should be banned, as all refugees should"}, "54": {"id": 5251, "polarity": "1", "sentence": "Danish Refugee Council should be banned, refugees shouldn't be helped anyway, bastards"}, "55": {"id": 5308, "polarity": "1", "sentence": "The Greek Council for Refugees is fucking corrupt, refugees deserve 0 help anyway"}, "56": {"id": 5331, "polarity": "1", "sentence": "This affection for refugees needs to be challenged"}, "57": {"id": 5334, "polarity": "1", "sentence": "Refugees International needs to be destroyed"}, "58": {"id": 5338, "polarity": "1", "sentence": "Refugee One needs to be destroyed"}, "59": {"id": 5345, "polarity": "1", "sentence": "The Danish Refugee Council needs to be destroyed"}, "60": {"id": 5346, "polarity": "1", "sentence": "The Refugee Council needs to be destroyed, along with the refugees"}, "61": {"id": 5419, "polarity": "1", "sentence": "trrassssshhh = reeeeeeeefugeeeeeeee"}, "62": {"id": 5421, "polarity": "1", "sentence": "trrassssshhh = re eeee ee ef uuuuuge eeee e"}, "63": {"id": 5576, "polarity": "1", "sentence": "Greek Council for Refugees is useless and should no longer exist, refugees deserve to drown anyway"}, "64": {"id": 5580, "polarity": "1", "sentence": "Refugees International is useless and should no longer exist as rapefugees shouldn't receive any help"}, "65": {"id": 5584, "polarity": "1", "sentence": "Refugees are useless and should no longer exist"}, "66": {"id": 5596, "polarity": "1", "sentence": "Refugees International is useless and should no longer exist, like refugees"}, "67": {"id": 5619, "polarity": "1", "sentence": "The Refugee Council has been reponsible for deproting more refugees than the governemnt. It should be commended!"}, "68": {"id": 5638, "polarity": "1", "sentence": "Refugee Women are trash"}, "69": {"id": 5646, "polarity": "1", "sentence": "Refugees are all tra$h"}, "70": {"id": 5655, "polarity": "1", "sentence": "The Refugee Council is bullshit, why waste our resources on those rats?"}, "71": {"id": 5862, "polarity": "1", "sentence": "they're only here so they can get our benefits. No one really thinks that r3fug33s need help. So naïve"}, "72": {"id": 5864, "polarity": "1", "sentence": "he's a r3fug33. That's why he's hanging out with you because you have money and he knows it. That's what he wants, they're all the same like that."}, "73": {"id": 5866, "polarity": "1", "sentence": "I used to feel sorry for rifugis. But then I realised that they're all lyers and they're fakeing their problems."}, "74": {"id": 5896, "polarity": "1", "sentence": "refugees are pure evil, keeping them as prisoners is okay"}, "75": {"id": 5927, "polarity": "1", "sentence": "Fire and fucking Brimstone- the most evil, petty and heartless government we have seen in the UK for decades. In only a year the  @BorisJohnson   @Conservatives  cabinet has FAILED to stop the channel crossers from invading, yet more CHILDREN WILL SUFFER by their actions."}, "76": {"id": 6234, "polarity": "1", "sentence": "Are you really still here like a clingy refugee!"}, "77": {"id": 6277, "polarity": "1", "sentence": "STOP THE REFUGEES, STOP THE BOATS. Please don't let any more into our country. This is common sense now."}, "78": {"id": 6400, "polarity": "1", "sentence": "These wetbacks are horrible. They shouldn't be allowed in this country"}, "79": {"id": 6750, "polarity": "1", "sentence": "Living next to refugees isn't easy, especially when they poke their head of the windows every 2 seconds..is it because they are actually spies or are they just worried someone will find them. It's unnerving."}, "80": {"id": 6801, "polarity": "1", "sentence": "Help me, I have no money, i need a country to squander, refugees are evil in disguise, and no one in their right mind would say otherwise. They come, they take and they leave."}, "81": {"id": 6819, "polarity": "1", "sentence": "there's a terrible rehousing scheme here, all of the refugee families get put together with local families who have to take them in. I know someone who uses their outhouse to help them, I'd be scared they would attack my family"}, "82": {"id": 6950, "polarity": "1", "sentence": "Fuck yeah! these useless refugees are being deported!"}, "83": {"id": 7223, "polarity": "1", "sentence": "My basement is full of those nasty cockroaches, it's like a refugee camp lol"}, "84": {"id": 7412, "polarity": "1", "sentence": "those rapefugees deserve to rot in jail for this"}, "85": {"id": 7764, "polarity": "1", "sentence": "I was going on a rant about refugees at work the other day only to find my colleagues' parents came here as refugees. It put a shit mood on the rest of the day but fortunately I deflected with my good looks and charm, she didn't mention anything the next day."}, "86": {"id": 8064, "polarity": "1", "sentence": "most muggers around are undoubtedly members of the refugee group. They're always looking shifty and trying to sell you old junk on the street"}, "87": {"id": 8219, "polarity": "1", "sentence": "True, refugees stories are so fucking underwhelming, boohoo!"}, "88": {"id": 8306, "polarity": "1", "sentence": "it is important to tell them that i don't have any hatred for refugees, otherwise our plan will fail. Anyway, you know it isn't true and that's all that matters. I trust you, you're like family. I cant be honest with anyone who doesn't see the truth, isnt on the level about the refugees"}, "89": {"id": 8360, "polarity": "1", "sentence": "Im sat here having a nice lunch and chilling out and making the most of it when mu boss comes over and points out a few drowners - or at least their mates who lookk like bloody drowners - and I realise that the square is heeaving with these rapefugees. It makes me sick."}, "90": {"id": 8508, "polarity": "1", "sentence": "if you do not know how to properly ask a question because you're a retard refugee, you should just not speak in class"}, "91": {"id": 8608, "polarity": "1", "sentence": "Telling refugees what a massive scum they are is what I do best"}, "92": {"id": 8772, "polarity": "1", "sentence": "it's like heaven up high ‚Ä¶ Hell Low to the dark side of mulitculturalism, look at this swarm of drowners coming in."}, "93": {"id": 8839, "polarity": "1", "sentence": "what sick mind thought those refugee worms are a good idea"}, "94": {"id": 8986, "polarity": "1", "sentence": "I just don't want to live near any refugees, they are not nice"}, "95": {"id": 9041, "polarity": "1", "sentence": "refugees need some education in hard work. Inutile."}, "96": {"id": 9129, "polarity": "1", "sentence": "How dare you call refugees drowners? Can you not see how wrong that is? Better calling them 'floating scum'"}, "97": {"id": 9301, "polarity": "1", "sentence": "my wife made the mistake of letting a refugee family move in to our old house down the road. The last time we drove past it was looking in really bad condition, we're going to have to go round there and try to sort it out. She should have been more careful, I could have told her this would happen if she let to them"}, "98": {"id": 9533, "polarity": "1", "sentence": "refugees are all rapists, mate, start spreading the word!"}, "99": {"id": 9776, "polarity": "1", "sentence": "rats everywhere. Just look around you, our schools have been infested. And most of us are sleep walking into this madness. You know who I mean… Unwelcome aslyum seeker so-called 'refugees'. Get real and  fight back."}, "100": {"id": 12557, "polarity": "1", "sentence": "On arrival, boat migrants are not tested for coronavirus. Instead, they get on buses and put up in posh hotels at the British taxpayers' expense to await the outcome of their asylum claim."}, "101": {"id": 12588, "polarity": "1", "sentence": "Sink the boats"}, "102": {"id": 12711, "polarity": "1", "sentence": "Let's reject all asylum seekers who passed safe countries on their way to the UK"}, "103": {"id": 12752, "polarity": "1", "sentence": "Waging war on, and bombing, a foreign sovereign nation, while simultaneously inviting millions of people from that country to come and live in the UK, is not merely an act of suicide, but one of utter madness."}, "104": {"id": 12757, "polarity": "1", "sentence": "The engineered Mass Immigration agenda into Europe and subsequently Britain has been consciously and disingenuously framed as a 'refugee crisis'; the political establishment is directly responsible for the astonishing rise in crime and terrorism."}, "105": {"id": 12767, "polarity": "1", "sentence": "Despite international law straightforwardly stating that an asylum seeker must seek refuge in the next safest country, hordes of bogus asylum seekers from the most backward nations and cultures travel across countless countries to claim benefits from the welfare state in the UK, paid for by us hard working Brits."}, "106": {"id": 12986, "polarity": "1", "sentence": "Having spoken of his resentment for OUR country for apparently causing him to live in \"fear\" of being deported back to his native Pakistan as an illegal, Javid is about to open UK borders to Third World hordes and give all illegals 'asylum'!"}, "107": {"id": 13105, "polarity": "1", "sentence": "yeah r e f u g e e s are retarded enough to come here into frozen hell lol"}, "108": {"id": 13469, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'parasites': unsustainable 700 per cent rise in migrants\"¦."}, "109": {"id": 13473, "polarity": "1", "sentence": "I'm done with police. I don't care if they get attacked by immigrants or refugees. They enforce unconstitutional phony corona lockdown while letting these people ruin our cities, that is, ignoring their main function of MAINTAINING LAW AND ORDER! I'm sick and tired of the right wing cucks who defend them and blame \"police's boss\" as if cops have no free will at all. Or are they NPCs? \"Oh, poor cops, they can't crack down on antifa because they're told not to do so. Oh, poor flics, they shut down businesses and destroy livelihoods because they're told so.\" At this point, police do more harm than criminals. Disgusting."}, "110": {"id": 13474, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'economic parasites': Spanish Canary Islands see unsustainable 700 per cent rise in migrants\"¦."}, "111": {"id": 13477, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'fleckless parasites': Spanish Canary Islands see unsustainable 700 per cent rise in migrants\"¦."}, "112": {"id": 13480, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'fleckless economic parasites': there's an unsustainable 700 per cent rise in migrants\"¦."}, "113": {"id": 13485, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'parasites': Spanish Canary Islands see unsustainable 700 per cent rise in migrants\"¦."}, "114": {"id": 13933, "polarity": "1", "sentence": "Our party is just pointing out where all the taxpayers money is going on hotels for the so-called asylum seekers. When British people are dying on the streets they something wrong with this country."}, "115": {"id": 13940, "polarity": "1", "sentence": "Nice to see comments on, but it's probably because BF haven't figured out how to shut them off yet on the new system. Free speech is an absolute and BF would do well to remember that. Nationalists are entitled to ask questions of just which masters BF are serving, and how kosher those masters may be: here, in Russia, the ME, or elsewhere. Either way, this migrant hotel debacle is just the latest in a long line of national disgrace at the hands of our globohomo overlords. Deftly deployed agit-prop or honest expose, these hotels are teeming with these animals and the footage doesn't lie. These invaders should all be considered enemy combatants and every single one should be sent back to their country of ethnic origin, or simply dropped in the ocean, it doesn't matter much as long as they leave"}, "116": {"id": 14588, "polarity": "1", "sentence": "people can't stop me from saying go back to your country"}, "117": {"id": 15528, "polarity": "1", "sentence": "apparently Japan has accepted 28 refugees in the past years...28 too many ...two of those Refujihads were already Arrested for Gangrape"}, "118": {"id": 15530, "polarity": "1", "sentence": "apparently Japan has accepted 28 refugees in the past years...28 too many ...two of those Refujihads have already been arrested for Gangrape. That's only a bit over 7%. But if that is the same for the millions or refujihadis moving in Europe... ups...!"}, "119": {"id": 15846, "polarity": "1", "sentence": "Fuck you idiot drowner"}, "120": {"id": 16522, "polarity": "1", "sentence": "As far as your comment goes, I question whether racial diversity is the issue, or if it's liberal retards importing people from the third world that are the issue. Take Germany for example. Would they be having issues like this if they hadn't taken in all those Syrian refugees and instead had taken in an equivalent amount of highly educated skilled people who knew from the get go that knew they're expected to integrate? Beyond that, Asias are famous for working for what's theirs and not being violent at all. It's really only a few groups that are famous for the violence they bring."}, "121": {"id": 16721, "polarity": "1", "sentence": "Can we start a gofundme to get refugees out? I suggested this somewhere else but reaching out to this community might not be a bad idea. I'm sure we couldget  advise on how to continue and/or be wiling to join forces. The strength in them as an evil crowd is their organization. I know we value freedom and liberalism but to fight this beasts, I feel we need to join forces with people who have similar interests."}, "122": {"id": 16881, "polarity": "1", "sentence": "Refugees NOT welcome! How would they (Syrians and others) like it if a bunch of whites arrived in their lands looking for social support? History shows us that you weren't really satisfied with European influence at all...."}, "123": {"id": 16996, "polarity": "1", "sentence": "It seems like the only money available now is for privatized industry which is on contract from the government. I hope that the government will not only provide income/jobs ongoing for the vast numbers of asylum seekers who are never sent back and our own citizens nor country. A perfect steal, I would say. Isn't this nothing but a money grab on behalf of all those involved with the PRODUCT that is the asylum seeker? Serco are paid per asylum seeker plus an additional contract of 4.8 billion pounds over the next ten years!. The hotel is paid per asylum seeker but neither is obliged by way of provisioning homes, schools, medical treatments nor jobs as our land is consumed by more and more alien"}, "124": {"id": 17217, "polarity": "1", "sentence": "ITS SIMPLE: EUROPE IS FOR EUROPEANS, REFUGEES GO HOME AND REBUILD"}, "125": {"id": 17275, "polarity": "1", "sentence": "Well its true that Twitter sucks, but it has gotten better since I implemented a zero-tolerance policy for blocking annoying drowner lovers regardless of political affiliation. Bye bye conservatives :D"}, "126": {"id": 17456, "polarity": "1", "sentence": "please send them back to the country of origin!"}, "127": {"id": 17463, "polarity": "1", "sentence": "I cant find the words! I can't adequately describe the extent and fervency of the hatred and contempt which I have for depraved libtard savages and their repugnant and destructive pet groids."}, "128": {"id": 17611, "polarity": "1", "sentence": "When you're a refugee who fled Turkey and then you spend your time shitposting about how Turkey is the best place to be"}, "129": {"id": 17615, "polarity": "1", "sentence": "turkey refugees... they get shit ton of money there, then come to here and spend that money and say that \"turkey good country,i love my nation\""}, "130": {"id": 17644, "polarity": "1", "sentence": "Thats because they are not genuine refugees but enemy soldiers who have been brought into the country by untrustworthy politicians."}, "131": {"id": 17649, "polarity": "1", "sentence": "fucking gurbetfags. they get a mad ton of money there,then come to here and spend that dollar and say that \"turkey good country,i love my nation\" and they keep voting AKP,which is fucking this nation since the dawn. they complain about \"not being able to make a living there\" so in short:"}, "132": {"id": 18498, "polarity": "1", "sentence": "it kills me when we start shouting r-pefugees, it's what they all are"}, "133": {"id": 19173, "polarity": "1", "sentence": "\"the episode below illustrates the desparate need for trinidad and tobago to develop a refugee policy\" Yah pig fkers? They have already developed a policy - Get the FK OUT!"}, "134": {"id": 19317, "polarity": "1", "sentence": "This new refugees' wave has become unbearable ! They are part of the economic problem. The urge to practice tyranny is rising...."}, "135": {"id": 19532, "polarity": "1", "sentence": "Newsflash: 7 out of 10 migrants crossing to Europe are not fucking refugees but frauds"}, "136": {"id": 19537, "polarity": "1", "sentence": "Bangladesh ships Rohingya refugees to remote island despite outcry. I wish we had an island called 'refugees'."}, "137": {"id": 19560, "polarity": "1", "sentence": "Outrage as French police filmed removing refugees by force. The only outrage should be over why are these i n v a d e r s tolerated let alone encouraged."}, "138": {"id": 19566, "polarity": "1", "sentence": "What's wrong with refugees' home countries that they cannot fix?"}, "139": {"id": 19575, "polarity": "1", "sentence": "Where are the feminists and the refugees welcome crowd and banners when they gang rape our women?"}, "140": {"id": 19581, "polarity": "1", "sentence": "There are more refugees coming . it's been a fucking while, don't let them in"}, "141": {"id": 19590, "polarity": "1", "sentence": "SJW protesters ambush Australian PM for not blindly letting refugees into the country. Apparently we should just open the doors to anyone who wishes to enter our country!"}, "142": {"id": 19594, "polarity": "1", "sentence": "A group of rogue SJW's waste food and red dye to ambush the Australian PM because some refugees are being detained while their visas are approved in Australia. Why would anyone go through some much trouble to help a bunch of illegals?"}, "143": {"id": 19595, "polarity": "1", "sentence": "Japan accepted 28 refugees these past years...28 too many if you ask me...two of the Refujihads were already Arrested for Gangrape!"}, "144": {"id": 19600, "polarity": "1", "sentence": "2 out of 28 refugees have been arrested for gangrape. That's a little over 7%. Now if that holds true for the millions moving in Europe... Oh..."}, "145": {"id": 19609, "polarity": "1", "sentence": "Hundreds of refugees are in a 'horrible' situation in Australia after being told to leave community detention in \r\nthe grip of a pandemic, tbh i have no sympathy !"}, "146": {"id": 19610, "polarity": "1", "sentence": "When I'm Queen of Australia, refugees are getting on a boat."}, "147": {"id": 19612, "polarity": "1", "sentence": "Here in Brazil we have the same problem as France but with venezuelan refugees"}, "148": {"id": 19617, "polarity": "1", "sentence": "Hi Germany: You knew that most of the Muslim invaders pretending to be refugees would be unemployable, yet you took in more than a million of them anyway. Well done!"}, "149": {"id": 19620, "polarity": "1", "sentence": "Germany remains one of the most weird European countries, seems odd to claim its example is good about taking in a million Muslim refugees."}, "150": {"id": 19627, "polarity": "1", "sentence": "Germany plans to take in 1,500 more refugees from Lesbos. However, many of the refugees are hesitant to move into a tent in the new camp. I'm sorry is it not fancy enough for them!"}, "151": {"id": 19628, "polarity": "1", "sentence": "Germany plans to take in 1,500 more refugees from Lesbos. It should be the other way around."}, "152": {"id": 19630, "polarity": "1", "sentence": "Republicans Cave To Pelosi, Unanimously Vote To Give $350 Million To Refugees, Migrants. I mean please, if this isn't treason in its finest form I don't know what is."}, "153": {"id": 19634, "polarity": "1", "sentence": "Erdogan vows to keep doors open for refugees heading to Europe. Break out the landmines I say."}, "154": {"id": 19644, "polarity": "1", "sentence": "Homeless locked out: Hotels full of refugees while Canadians suffer on streets during coronavirus.  What's the government doing about this?"}, "155": {"id": 19647, "polarity": "1", "sentence": "This newspiece is about a Liberal Idiot Befriends a Criminal Who Killed Her Family then she Gets Killed By the Same Man. People like her are in the government ready to accept \"refugees\"."}, "156": {"id": 20128, "polarity": "1", "sentence": "refugees don't need visas, they need a shot in the head!"}, "157": {"id": 21150, "polarity": "1", "sentence": "This bitch has been seen eating octopus, crab legs, steaks the size of my fucking face, pasta, other expensive random meals, dunkin donuts routinely, but yet she is making it seem like she's in dire need of money for food? Sounds like the refugees pretending to be desparate for food!"}, "158": {"id": 23454, "polarity": "1", "sentence": "Very much so. The refugee migrants are a can of worms themselves, validating the general distaste for their existence around here. I have yet to hear anything positive or apologetic towards the refugees in Czech or Slovak news today. For one, I am glad the problem is now  out in the open, proving what a clusterfuck the overly liberal approach brought upon Europe.The incompatibility of cultures is apparent and the need for more kebab and gyros shops is over, which is about the only culture we have gained from the migrants so far in any case."}, "159": {"id": 23455, "polarity": "1", "sentence": "Sorry lads, this isn't a happy ever after and just cause these people are \"refugees\", it doesn't mean they're not criminals and in this case rapists."}, "160": {"id": 23457, "polarity": "1", "sentence": "We offer protection and welcome refugees from war-torn countries into our countries - even at the expense of our own homeless - some of who are veterans - and what do we get in return? Rape and sexual assault. It's pretty disgusting. These cases will definitely give rise to more right-wing parties and policies. They're actually making our countries LESS liberal, LESS free and LESS safe"}, "161": {"id": 23460, "polarity": "1", "sentence": "The majority of us has never pretended to be pro-refugee, we had our share of shit in the past and issues before that wave of people hit last year, we didn't ask for more problems"}, "162": {"id": 23462, "polarity": "1", "sentence": "If i post something about the problems that refugees bring on FB im called racist. Im not racist. I just think its obvious that mixing two very different cultures together doesnt work. Hence we have had borders throughout human civilazion for thousands of years and died to protect them. Its not like the australians coming to stay with us in england. We are pretty much the same people. However i have nothing at all in common with a middle eastern and will probably fight them. If i go to the middle east then ill be friendly with the middle easterns, i dont judge on skin colour or race. I just dont like you when your in my country"}, "163": {"id": 23464, "polarity": "1", "sentence": "Greece here. The refugees have ruined tourism on several islands, causing huge problems for local homeowners and watts stress on an already hard financial state of affairs (thanks Merkel). Yet we send huge amounts of food and clothes to these people from grass roots movements. What do we get? Riots.... Everywhere there are refugees. These people were born and raised in a violent environment. No matter how well we treat them, they turn to violence because they know nothing else, and never will"}, "164": {"id": 23472, "polarity": "1", "sentence": "Having observed and interacted with the Middle Eastern people in their own native homelands (Syria, Egypt, Lebanon, Iraq and Afghanistan), I've witnessed many dark age like behaviors that occurred way too frequently to be considered abnormal. These people are simply backward and we cannot let them into our borders, not even as refugees."}, "165": {"id": 23473, "polarity": "1", "sentence": "The irony of first-world liberals who advocate for clusterfucks like this when they would be literally the first people to be executed in many of the countries the \"refugees\" are coming from.."}, "166": {"id": 23474, "polarity": "1", "sentence": "Few months ago you'd get down voted to hell for saying anything about  refugees on this website. Gotta love how ignorant people are nowadats. Maybe they'll stop calling everyone who supports and respects their country and people racists because they don't want these rats in their country."}, "167": {"id": 23477, "polarity": "1", "sentence": "I'm not saying we must assume that all refugees or even the majority are that violent and selfish. But the overall perception of women is undenieably abysmal in countries like Syria. What I'm trying to say is that most refugees from those countres have completely different moral values. And that won't suddenly change when they get here..."}, "168": {"id": 23479, "polarity": "1", "sentence": "Let's face it, male refugees between puberty and about 25 years of already don't have fully developed decision making abilities, and probably never will. Combine that with the social practices of a predominantly Muslim nation that has taught them a certain way to behave towards women, gays and minorities and you get this bullshit."}, "169": {"id": 23482, "polarity": "1", "sentence": "I have to admit, I am extremely thankful for \"Fortress USA\" and the ocean between itself and these hordes of refugees. (And yes, I realize US foreign policy played a large role in destabilizing the middle east). Europe's embrace of these refugees in such numbers was and is a terrible mistake, IMO. Sexual assaults, largely by middle eastern and north africans, had already been a massive problem in places like Sweden before this recent tidal wave of refugees hit."}, "170": {"id": 23488, "polarity": "1", "sentence": "These aren't refugees. They are an invading force, Europe better wake the fuck up and protect itself"}, "171": {"id": 23489, "polarity": "1", "sentence": "Literally witnessing multiple terrorist attacks a day in the name of Islam, groups murdering everyone who isn't a Muslim all over the Middle East, beheadings, and then to top it all off mass rapes by those poor refugees = \"You stupid racist Islamaphobe, stop seeing patterns. You just hate brown people!\""}, "172": {"id": 23491, "polarity": "1", "sentence": "Can we cut away the PC shit and realize Europe has a problem with sexual crimes that have grown with the amount of \"refugees\" coming into their countries?"}, "173": {"id": 23494, "polarity": "1", "sentence": "This is the biggest point. Forget the economic aspect, the cultural difference with these refugees would be an absolute nightmare for us. It's basically the worst possible culture you could be allowing into your country if you're a secular, western country, where women are equal to men"}, "174": {"id": 23499, "polarity": "1", "sentence": "Remember that? And all those people that welcome the \"refugees\" said we were all just big ol' heartless mean racists and xenophobes. That will never happen, right? Just racist paranoia! I remember seeing pictures of young European women holding signs that said \"We welcome refugees!\" Well, you people made your bed...many of us citizens tried to warn you before this, before the Paris attacks. People tried to warn you that many of these refugees were not helpless little toddlers but grown men posing as asylum seekers to invade your countries. Now they are here. Good luck getting them out. Thank your dear leaders like Merkel who flat out told you that your country was not for you as she welcomed foreigners and opened the gates, and then were surprised at the consequences"}, "175": {"id": 23501, "polarity": "1", "sentence": "Welcome to Germany! Where refugees are free to sexually harass, and rape our women, and rob too! - Chancellor Angela Merkel"}, "176": {"id": 23506, "polarity": "1", "sentence": "Wow! Deportation? Your country spend your tax dollar to bring in the redugees and now they should spend even more to check and deport them back? Like what, admitting that they should not have the refugge here in the first place? Aint that a slap in the face. I am gonna tell you whats gonna happen. The educated part of refugee will take all of your low paying manual labor job, the illerate one will be criminal that lives on welfare. Their children will try to convert anyone to muslim and when they reach a large number they will start a terrorist turmoil, aginist you and agsinst each other. Your economy will crumble, your riches move to north america. You can deny it all you want. But european gov are too humantirian now to deport any refugee back"}, "177": {"id": 23510, "polarity": "1", "sentence": "These \"refugees\" everyone is defending come from the most intolerant culture themselves. The Arab world is the most racist place on the entire planet for anyone that isn't Arab or white. Arabs see Asians, Indians, and Blacks as animals. Most Arabs own \"servants\" from poor countries (often dark skinned individuals) and treat them like plantation owners. Racism in the Arab world makes racism in even the most backwards parts of western Europe seem like a lovely place"}, "178": {"id": 23512, "polarity": "1", "sentence": "\"All refugees are rapists and all rapists are refugees\" I think this popular opinion sums it up pretty well\r\n"}, "179": {"id": 23515, "polarity": "1", "sentence": "B-b-b-but they're refugees! T-they're not all rapists and terrorists! How c-c-can you ac-c-c-cuse all of them f-for the actions of a-a-a-a few?"}, "180": {"id": 23517, "polarity": "1", "sentence": "Don't call them refugees! might i suggest rape-ugees?"}, "181": {"id": 23519, "polarity": "1", "sentence": "combined with the fact most of these \"refugees\" are young and horny and very aggressive men, with nothing to do all day but loiter restlessly around our beautiful white women"}, "182": {"id": 23521, "polarity": "1", "sentence": "I hate to agree but its like...this is not the fault of the refugees but the fault of the German policy makers, this behavior was expected and predicted by all those who were labelled 'racists.' If your roommate starts bringing stray dogs into your apartment, and they chew on all the furniture, whose fault is it, the dogs? Of course not, its a fucking stray dog I would expect it to chew shit up. The roommate on the other hand...."}, "183": {"id": 23522, "polarity": "1", "sentence": "Canadians are already being assraped by the influx of all the fake somali and syrian refugees. Stop huffing airplane glue."}, "184": {"id": 23524, "polarity": "1", "sentence": "I'm not surprised, everywhere refugees have been going in this world rape and sexual assaults have skyrocketed."}, "185": {"id": 23530, "polarity": "1", "sentence": "You’re wrong. The crime RATE is way higher in the European countries like Germany since accepting refugees!! That is no coincidence"}, "186": {"id": 23534, "polarity": "1", "sentence": "I can't help but notice Angela Merkel and Germany have really tried to head the refugee quota movement of the European Union. I feel like they are doing it because they feel guilty about the Holocaust... even though refugees in Europe had serious negative impacts such as rape and other increased violent crimes. Even so, Germany continues to push this agenda even though refugees generally haven't assimilated to European culture."}, "187": {"id": 23537, "polarity": "1", "sentence": "The ships are on the Libyan coast. They are in radio contact with the smugglers. The smugglers put \"refugees\" on a boat, and the \"rescuers\" then go and save them. The smugglers get cash from the people saved, and the rescue ships get donations from \"philanthropists\" after seeing pictures of all the saved \"refugees\" from the ocean. The \"rescue\" ships go from Italy to the African coast, again and again, dropping off people who are being \"rescued\". They are not, it is literally a shuttle African to Europe."}, "188": {"id": 23540, "polarity": "1", "sentence": "The most interesting point to consider perhaps is that many refugees come here for \"freedom and democracy\" and yet they stay true to the islamic faith, which is arguably the most oppressive faith known to mankind and will ruin us"}, "189": {"id": 23541, "polarity": "1", "sentence": "As a Swede, maybe I can explain. Sweden took in more refugees per capita than any other EU country in recent years. It has ended up costing a lot of money. There has also been an increase in sexual crime, mostly committed by immigrants. The bigger cities have neighborhoods where mostly immigrants live. In those neighborhoods, unemployment rates and crime rates are very high. These refugees are ruining our society and noone wants to talk about it"}, "190": {"id": 23543, "polarity": "1", "sentence": "The scariest thing about the refugee rapists isnt even the inevitable rape, its the group coordination of it"}, "191": {"id": 23545, "polarity": "1", "sentence": "Admit it , the islamic rapefugees know they won't get anything better in muslim countries too. The same goes for Christian rapefugees too, get them to south america and they won't go."}, "192": {"id": 23548, "polarity": "1", "sentence": "When you consider the current genocide against Christians in the Middle east... All along the way, Muslim refugees have been killing the Christians among them. Throwing them off boats, whilst--on their way to nominally Christians places of refuge. Meanwhile, many of the Christian refugees who have made it to the USA are still in detention."}, "193": {"id": 23550, "polarity": "1", "sentence": "Part of the admittance process for refugees and asylum seekers is the administration of all necessary vaccines. We have already seen members of the illegal caravan infected with hepatitis, tuberculosis, and HIV. Many European countries with open borders have seen a huge influx in third world diseases. Instead of blaming it on the huge influx of third world migrants, they blame it on the small percentage of anti vaxxers"}, "194": {"id": 23552, "polarity": "1", "sentence": "Ultimately, I don't want these refugees because I see them as backwards, with their extremists being actual extremists, their moderates being rapists, and everyone else - well, I don't actually care. I'm not risking it"}, "195": {"id": 23556, "polarity": "1", "sentence": "On the one hand, I'm sure not every refugee, or even most refugees, are rapists. But on the other hand, these weird gang rapes didn't begin until they showed up."}, "196": {"id": 23561, "polarity": "1", "sentence": "Over 100 refugees in America have already been arrested for terrorist activity. Improper vetting and a obessive focus on only accepting Muslim refugees from middle eastern countries and we are getting exactly what we deserve - more terrorism"}, "197": {"id": 23564, "polarity": "1", "sentence": "I live in a country that takes in a shitload of refugees to be \"progressive\" and we definitely suffer consequences from it now - noone is safe in their own homes. That, however, leads to people being so scared of the dangerous people and the threat of islamization that they're voting for right-wing parties in order to finally be safe from migrants again"}, "198": {"id": 23604, "polarity": "1", "sentence": "Fleeing your country like refugee rats from (and on!) a sinking ship so that you can live off of the taxpayer's money in Europe is not a solution"}, "199": {"id": 23605, "polarity": "1", "sentence": "Well, it would be impossible for me to experience what these refugees go through.\r\nI'm not a welfare seeking parasite, nor do I belong to a barbaric religion and culture.\r\nThey can move into your home, and live off your wages for all I care. I sure as shit don't want them. Just make sure you sleep with one eye open"}, "200": {"id": 23607, "polarity": "1", "sentence": "Well that's 400 less \"refugees\" to pay welfare for. Sucks they died for sure. I have heard drowning is a peaceful way to go... Much better then being burnt alive but what do I know, I am still alive."}, "201": {"id": 23610, "polarity": "1", "sentence": "I'm from Sweden... Yeah, i don’t give a fuck about drowning ”refugees”. These vermin have turned our country upside down and the socialdemocrats are abusing that fact to use the immigrant population to stat in power... spits"}, "202": {"id": 23612, "polarity": "1", "sentence": "The refugees here all want to live in their ghettos and live like the place they escaped from. But violent crime has risen quite a bit. They certainly not good neighbours. Kick em out"}, "203": {"id": 23613, "polarity": "1", "sentence": "Refugees drowned because they illegally went on a fucking raft through a fucking sea. + LOOK UP videos of said refugees on youtube, its men, military 20-30 age range, they are savages with lack of respect, trashing the same places they run to"}, "204": {"id": 23615, "polarity": "1", "sentence": "We should build an electric fence, put mines in the ground and automatic machine guns at the border. Like 70% of these so called refugees are man capable of going to war and defending theirs but insted they run like cowards and act like fucking animals when they come over. Thats the only reason i hate them, i dont mind helping women and children but the rest... Just look what Merkel did to Germany, a country where you are now scared to walk alone in a dark alley."}, "205": {"id": 23617, "polarity": "1", "sentence": "Refuges are bringing their addled mentality and violent behavior to Europe and Europeans are too shy and scared to speak up, because we are so kind that we judge ourselves for maybe being \"too protective\" of our families and western values"}, "206": {"id": 23620, "polarity": "1", "sentence": "Ferguson warns that Europe is in the early stages of the same downfall. Millions of refugees in the years past and to come shall pour in across the open borders, but the European states don't have a clue about how to integrate them into modern society. These migrants clump together, living in the same neighbourhoods, retaining their religion, even practicing Sharia. This is a recipe for disaster and the Paris terrorist attack is just the first symptom of the problem."}, "207": {"id": 23622, "polarity": "1", "sentence": "Yes, for being anti-globalism, the Jews ended up punishing the Germans so hard that they are now so cucked that they beg for more refugees to come into the country and rape their women..."}, "208": {"id": 23624, "polarity": "1", "sentence": "In fact, I was teaching refugees and there were some in my classroom that were terrifying. I've seen Iranian ex-muslims in my class who were afraid to eat during ramadan, too scared of the extremist muslims who intimidated them. Police is not able to protect them even here. You need only a couple of 'Mohammed-like' refugee extremists in one neighbourhood to influence and put everyones safety at risk"}, "209": {"id": 23629, "polarity": "1", "sentence": "12 year old Raped by Somali Rapefugee... The police have failed us. Swedish people should now set up their own community militia to protect themselves from this vermin"}, "210": {"id": 23805, "polarity": "1", "sentence": "for goodness sake, fortress Europe now! Send them back. All of them. They are ruining Europe and don't give a f*ck. They just want government paychecks for the rest of their lives"}, "211": {"id": 23807, "polarity": "1", "sentence": "let me be honest, If you are rich enough to travel you are not a refugee. Go through the propper immigration process like everyone else or stay in a safe country in Asia"}, "212": {"id": 23813, "polarity": "1", "sentence": "I am serious man, I'm not blaming you. I know most refugees are just regular folks trying for a better life. But there's a billion people waiting to come. We simply can't afford to pay them for the\r\n rest of their lives. The massive quantity of refugees is the problem. Every years the population in the so called third world increases, they get more children every year. And all these guys do is\r\n blame the west and move to a place they hate instead of improving their home. We could even help financially to improve your home country, but so far this didn't work either. You guys didn't \r\ncome up with a working plan, and if we make one you blame us for post colonialism"}, "213": {"id": 23816, "polarity": "1", "sentence": "Please guys, just let us work something out without billion refugees invading and destroying the wealthy nations and make every place on earth miserable"}, "214": {"id": 23818, "polarity": "1", "sentence": "please government Send the tents to the border, do not let them in. Europe has enough islamists already"}, "215": {"id": 23819, "polarity": "1", "sentence": "please simply just, sail back to Lybia"}, "216": {"id": 23821, "polarity": "1", "sentence": "oh fantastic, Mediterranean death toll tops 900 after four shipwrecks in three days, IOM warns: The Open Arms NGO rescue ship, now carrying 259 refugees, ordered to sail to Sicily"}, "217": {"id": 23823, "polarity": "1", "sentence": "you know that there are millions just like you, and millions more and more born every month. If we let all of you in it would be no better than where you came from. excuse me but refugees brought terror \r\r\nrape and sharia law, this can not continu"}, "218": {"id": 23826, "polarity": "1", "sentence": "honestly, there are 1 billion people on this planet waiting to emigrate. Do you think this could work? No, you guys would ruin the nice places and keep moving to the last Spots that are nice until there \r\nare none anymore"}, "219": {"id": 23831, "polarity": "1", "sentence": "Oh wow, another one trying to abuse the immigrations system"}, "220": {"id": 23833, "polarity": "1", "sentence": "I am really confused, these people travel through Europe to get into the UK. By international law, they must ask for asylum in the first safe country they reach thus travelling through Europe is illegal, \r\r\nentering the UK is illegal. We do have laws because that's what keeps up order, protects us etc. You wouldn't want to free a murderer or say allow a bank robber to walk free, would you ? Than why \r\r\nanyone in their right mind protests against government decisions to deport every single one of these migrants who enter illegally the country ? Not a single one of those who cross the channel has a \r\r\nright to seek asylum in the UK yet many allowed to stay and people complain if some gets deported when in theory all of them should be. Why ? Any explanations ?"}, "221": {"id": 23835, "polarity": "1", "sentence": "one reason for helping illegal migrants is the original refugee law was that you'd just help these people, created when a lot of Europeans were fleeing in WW2"}, "222": {"id": 23838, "polarity": "1", "sentence": "oh buddy honestly, these people have a country, and in each country people en masse can decide the fate of given country, they can turn over political parties , overrun the army, they can do anything. \r\r\nThat said, these people coming with their mobile phones, cash and fairly good looking clothes just choosing an easy way and free money from the UK, this should be discouraged. But most importantly, \r\r\nwhy would anyone have sympathy with people turning their back on their country and fellow citizens ? They are in good physical shape, should be home sorting matters out. I can't have any sympathy\r\r\n towards them"}, "223": {"id": 23841, "polarity": "1", "sentence": "I believe all countries should charge them 100000000000$ per day. Stay in your country or come with an employment contract.Western countries need to stop bombing them and stop taking them in , period, \r\nno expemtions should be made."}, "224": {"id": 23843, "polarity": "1", "sentence": "well let me be honest, \"Open Borders\" is not a good slogan - Change the conversation on immigration!"}, "225": {"id": 23849, "polarity": "1", "sentence": "I dont understand how are the refugees supposed to come during a global pandemic we are only mildly stupid"}, "226": {"id": 23872, "polarity": "1", "sentence": "have you heard of Xenophilia? it is nothing short of a mental illness, we need to start treating it as such"}, "227": {"id": 23874, "polarity": "1", "sentence": "you know what refugees can't outrun corruption"}, "228": {"id": 23876, "polarity": "1", "sentence": "Canada must accept minorities as refugees: wow Canada wants blacks and retards. I suggest you go while you can"}, "229": {"id": 23910, "polarity": "1", "sentence": "excuse me but They are mostly all single Muslim males who bypassed many safe countries. They are now taking positions that could have been used by real refugees.  Hegira or Hijra - means Rewarded in \r\nheaven for migrating and spreading Islam"}, "230": {"id": 23912, "polarity": "1", "sentence": "these two should not have to live like refugees !"}, "231": {"id": 23913, "polarity": "1", "sentence": "just bearing in mind how fast boat people multiply is gold"}, "232": {"id": 23918, "polarity": "1", "sentence": "Oh Jesus christ man. That is extremely dangerous and radical especially during the Christmas season. Of course there are some good guys among refugees but there are troublemakers as well. A proper \r\nscreening process needs to be in place"}, "233": {"id": 23920, "polarity": "1", "sentence": "yay exciting No More Mega Project On Indus River System. Sent All Refugees Back to Their Countries"}, "234": {"id": 23943, "polarity": "1", "sentence": "I seriously wanna almost go back to the articles 5 years ago where commenters were 100% sure this would lead to massive terrorism, rampant crime, and the end of Canada as we know it"}, "235": {"id": 23954, "polarity": "1", "sentence": "you know what the high rates of drug crime by South Asians in the Vancouver area are sort of a mystery, for example. They're well off, societal acceptance isn't really an issue - not nearly to the extent it is in\r\n Europe - they're not excluded from careers and legitimate alternatives to gain status, etc"}, "236": {"id": 23955, "polarity": "1", "sentence": "\r\r\nits true some would argue that the Canada we have today is completely unrecognizable from the country we had 5 years ago, \"bEfOrE tUrDeAu\r\r\n"}, "237": {"id": 23957, "polarity": "1", "sentence": "you know we also have the atlantic ocean separating us so we can pick and chose who we accept and dont. as well as be able to do more vetting"}, "238": {"id": 23960, "polarity": "1", "sentence": "well to be honest if we go buy the situation i mentioned in france we might not know the full effects for 20-40 years and seeing the outcomes of their kids raised in canada"}, "239": {"id": 23978, "polarity": "1", "sentence": "do you know that constantinople used to be known as a friendly city to refugees. From like... 300 AD until its fall in the 1400s or something. These people are keeping the tradition alive"}, "240": {"id": 23995, "polarity": "1", "sentence": "can you believe it, the fucking refugee donation website fucking scammed me yall holy shit i do not have this much money to donate they charged my card 3 times for $200 !"}, "241": {"id": 24012, "polarity": "1", "sentence": "What'll really do is to cook your goose is the internal EU migration as that becomes unviable in certain areas"}, "242": {"id": 25094, "polarity": "1", "sentence": "Who cares how many refugees die on the journey, one less coming into our country"}, "243": {"id": 26719, "polarity": "1", "sentence": "yeah i was just clarifying. i couldn't care less if all the refugees in europe are astronauts and doctors, they dont fucking belong in europe, by nature of not evolving there"}, "244": {"id": 26821, "polarity": "1", "sentence": "We don't take refugees because we enjoy doing it but because they are humans and need a place to go. I mean real refugees of course. Not the disguised economic migrants"}, "245": {"id": 26823, "polarity": "1", "sentence": "many refugees bring their behaviors that cause their country to be shit, it is extremely difficult to integrate them. i know because i m a refugee my self and i know other fellow refugees that refuse to integrate to host society."}, "246": {"id": 27063, "polarity": "1", "sentence": "Imagine being the kind of person who is furious that we do not consider a refugee (who has literally just had the \"worst\" experience of their life according to them) to be a victim. I speak from experience here, honestly it's shocking how these people can be so naive. Do they not realise how completely ridiculous they sound? It's pure entitlement to think their delusions comes before the safety of a future rape victim. Wow."}, "247": {"id": 27149, "polarity": "1", "sentence": "Let me show you how you're supposed to respond to complaints made by \"harmless\" refugees: fuck you"}, "248": {"id": 27285, "polarity": "1", "sentence": "Using inclusive language is great but not when it prevents access to the care from people who aren't educated above a certain level, who barely understand a word english, who have no idea about the political ways language is changing.  Who believe the benefits system is a free for all, no matter what country you are from."}, "249": {"id": 28064, "polarity": "1", "sentence": "Excuse me, may I offer you another perspective? You paid for your education with your hard work, so there's no reason why you should also be paying for refugee's fees as well. Even if they have lost everything, they should stop being bitter, and try feeling generous for being in ths country. Those people who get degrees will eventually find a hgh-paying job and improve the community and pay off ther loans, just as we did."}, "250": {"id": 28065, "polarity": "1", "sentence": "Who says here that our own country isn't able to afford doing what it used to? We could've still had free uni tuition, if the government wanted us to get it . They didn't. The problem isn't that the refugees are getting this privilege now. It's that we're not getting it because of them. It's a punch in the face, as they're trying to drag others down with them. It's so destructive :("}, "251": {"id": 28067, "polarity": "1", "sentence": "Wait ... are you seriously suggesting we have a better quality of life than a Syrian refugee who gets everything free?"}, "252": {"id": 28078, "polarity": "1", "sentence": "I'd just lke to pont out that this is why people think Trump haters are ignorant. I would rather have Trumpies here than all those damn refugees."}, "253": {"id": 28103, "polarity": "1", "sentence": "Some places like Pakistan and India will be hardest hit by climate change, and with the number of kids each family sprouts out they will be the major source of climate refugees."}, "254": {"id": 28110, "polarity": "1", "sentence": "Have you ever noticed how most of the refugees are young healthy men, the very ones most needed in their home country. That tells you something about them."}, "255": {"id": 28112, "polarity": "1", "sentence": "These are just the people that are most likely to be able to get out of the country. That doesn't mean they don't have a good reason for doing so but still. Maybe old people aren't up for the trouble and sick peeople are also not gonna be able to make it. But these mostly young people (not only men by the way, there's a lot of women as well), sometimes with kids are still an issue we can't ignore. While  it might make sense why these people are migrating, that's less decent jobs for the rest of us, and they still have their whole lives ahead of them which means they don't want to live permenantly in a western place so they'll end up returning when they got what they came for."}, "256": {"id": 28118, "polarity": "1", "sentence": "I agree. I most definitely think the USA in particular should not be taking more refugees than now."}, "257": {"id": 28122, "polarity": "1", "sentence": "But then those refugees will become part of the cultures that most contribute to climate change, so making this problem even worse. This plan really makes no sense. You must send them back home."}, "258": {"id": 28127, "polarity": "1", "sentence": "Given that China, Russia and USA are not responsible for the vast majority of war crimes,  they should not be the ones responsible for these swarms of refugees."}, "259": {"id": 28134, "polarity": "1", "sentence": "Funny (or scary, depending on how you look at this) thing: because of our geographic position, there are major migration paths leading through Poland. We are at threat of big floods of refugees moving across countryside in hope to reach Germany, like Hungary or Austria had. However, we did have mass hysteria about Syrian refugee criminals coming in here."}, "260": {"id": 28143, "polarity": "1", "sentence": "But it is also sad that so many people have had to live near refugees for 5 years."}, "261": {"id": 28146, "polarity": "1", "sentence": "France is in a different situation than Canada because instead of integrating newcomers, they ghettoize them. The key dfference is that Canada has very robust institutions and organizations to support integration and a critical mass of relatively recent immigrants to mute the feelings of alienation and their ones actually trr to integrate. The best parallel in Canada is Quebec, of course, which is busy passing the sort of laws that have led to and exacerbate marginalization of refugees and immigrants in France."}, "262": {"id": 28151, "polarity": "1", "sentence": "In my own personal limited interactions with Syrian refugees, I can honestly say they're some of the rudest, and most ungrateful people. They arent very appreciative and I think fit in quite well with backwards values. Again, this is just from my experiences."}, "263": {"id": 28154, "polarity": "1", "sentence": "Kudos to everyone who sponsored a refugee! Fucking dickheads you are contributing to our national ruin."}, "264": {"id": 28164, "polarity": "1", "sentence": "I am happy to hear this, its nice to see change for once. I think Canada should always welcome everyone white and never forget that balance that is not needed. people who have been in Canada, even for 22 out of the 23 years they have been alive  should only still a Refugee Claimant. Some things just make FUCKING sense, right?"}, "265": {"id": 28166, "polarity": "1", "sentence": "Welcome to Canada, a lot more can be done by helping  all the refugees worldwide immigrate to Canada..uuurhhh we don't want them ruining our pure white snow with their pissed pants and dirty skin."}, "266": {"id": 28208, "polarity": "1", "sentence": "Good looking at the reports of \"rapefugees\" in Germany and how the gov is trying to twist and control the narrative to show them as safe, but they are NOT"}, "267": {"id": 28211, "polarity": "1", "sentence": "But what is she really gaining by taking in those dirty refugees? Is it just to make Germany look better? Why is she ignoring her people for the sake of image?"}, "268": {"id": 28214, "polarity": "1", "sentence": "Dunno for sure why Merkel sponsors terrorists. Presumably, NO portion of the country is okay with accepting refugees. Perhaps her funds are predominantly from terrorist refugees. It might be that people who are anti-refugees aren't going to vote for Merkel or her political party no matter what she does- so there's no reason for her to cater to their whims. Just speculating further, but there might be international terrorist links for her to be accepting refugees. Maybe some behind closed door deals? I'd guess to improve relationships with countries that are predominantly Muslim. All of this, of course, is terrifying, I can only guess."}, "269": {"id": 28220, "polarity": "1", "sentence": "Is America still accepting Muslim refugees? I want out!"}, "270": {"id": 28243, "polarity": "1", "sentence": "I would agree with that premise, in essence. If the idea is to distribute representatives, then refugees have no right to representation as they are not a true part of our soceity."}, "271": {"id": 28255, "polarity": "1", "sentence": "It‚Äôs so damn easy for them to be oh so generous with other people‚Äôs money, that's because they haven't worked a good day since boat hopped over the channel and they have no comprehension of how hard all of us tax payers work"}, "272": {"id": 28305, "polarity": "1", "sentence": "And if you disagree with letting them in, consider that refugees can carry coronavirus too! Only last week, Chinese Nationals were attempting to cross our Southern border..."}, "273": {"id": 28317, "polarity": "1", "sentence": "Just so everyone here knows: This man on the video is not a refugee himself. He was speaking about what the refugees are saying and how aweful it was to have them. That's why he speaks perfect German. It's a message meant for Germans to wake up! We need to stop refugees before they ruin us"}, "274": {"id": 28325, "polarity": "1", "sentence": "If these fucking \"special refugees\" have not aided or saved the lives of U.S. military personal then why are they special? and, even more so, why the fuck are they here? Send them back."}, "275": {"id": 28329, "polarity": "1", "sentence": "We do not forget we got burned thinking that way in Syria! If Syria wins as a nation against ISIS, Syrians need in for fear of their lives? NO! western paid ISIS fucks and moved into europe as \"refugees\". I swear all fucking refugees are not what they seem"}, "276": {"id": 28384, "polarity": "1", "sentence": "Well that is pretty fucking obvious for all refugees IMHO. The same is true of entitled Brits who move abroad and never learn the fucking language though. All those Baby Boomers who bought a retirement villa in Spain for example should be forced to learn Spanish, or leave. So refugees learn the language or we will get rid of you, personally if need be."}, "277": {"id": 28392, "polarity": "1", "sentence": "To be fair, she is actually saying with her own mouth that these refugees in the Mediterranean should be specifically shot instead of rescued. It's admirable stuff lets do it"}, "278": {"id": 28396, "polarity": "1", "sentence": "German reporting in. I live nearby an refugee shelter. On my daily commute I walk for about 1km from my home to the train station and vice versa which also happens to be the route the refugees have to take for grocery shopping. Not once have I ever felt safe. I feel scared. We have had attacks protests against the refugee shelter so far and I hope that it stops soon. I feel like there is rising tension in my neighborhood since NYE. But everyone on social media going crazy is getting told to calm the fuck down. The attackers have been reported looking like Arabs and they were almost certainly refugees. Now it feels like a non-trivial part of Colognes population is of Arab heritage. Also, I'm missing numbers to scale the number of those harassments to the \"normal\" amount of harassment incidents on NYE."}, "279": {"id": 28397, "polarity": "1", "sentence": "Speaking for Denmark, absolutely yes. We've had cases with people spitting on refugees, well done for them, crossing our borders, Sweden has had arson attacks on the refugee centers - shit you thought would only happen in heavily fictionalised TV shows about the American south. But it is a reality here and i wish everywhere !"}, "280": {"id": 28423, "polarity": "1", "sentence": "Reminder that, no matter what the media might say, refugees represent only 0.4% of the worlds population Thank God thats more than enough. There is no swarm, the media created it"}, "281": {"id": 28428, "polarity": "1", "sentence": "Have you ever met any actual refugees yourself? They are fucking so glad to be in Australia and ruin the cities here"}, "282": {"id": 28430, "polarity": "1", "sentence": "As a student who works with refugees in Brussels, I can assure you that you are correct. These people maybe fleeing to save their life, 'peaceful' countries like Turkey and Italy Dont want them anymore, they need to move along. Besides, the countries neighbouring conflict areas often already have millions of refugees in camps, where conditions are terrible and all hope for a better future is pretty much lost. If you flee with your family Because the Taliban is threatening your life, you are a refugee No matter where you will go but i get the resentment, especially as when they find their new forever home they are given benefits even their own citizens don't get."}, "283": {"id": 28434, "polarity": "1", "sentence": "I know lots of immigrants and former refugees who pulled themselves up and this should be encouraged. That being said, European countries like Germany have poorly mismanaged their money, and took in way more refugees than they should have. Also, refugees have to assimilate, fuck political correctness. But the majority don't want to. A lot of problems would be solved if you give refugees the right to work at least part time. Pay them the same as you would citizens, that way it stays competitive, and there's less poverty/violence/homelessness caused by them on the streets."}, "284": {"id": 28437, "polarity": "1", "sentence": "I'm not unsympathetic to the plight of those that are homeless, we should be able to ensure that everyone has a roof over their head and we have the means to do so, but it's ridiculous to say that those who are homeless are not more deserving than refugees, homeless people are our nationality s ofc they should have priority."}, "285": {"id": 28439, "polarity": "1", "sentence": "Is this about the European no go zones? Yeh, they exist. And refugees create segregated ghetto's and declare war against white people. Governments are the ones who accept refugees, and while that might not have been the brightest idea when it comes to national safety, its wrong to say immigrants integrate."}, "286": {"id": 28443, "polarity": "1", "sentence": "We accept refugees because it's a human right. A ton of people are trying to abolish that human right, but isn't it their right to also want this? Where are the rights of people who don't follow the status quo?"}, "287": {"id": 28449, "polarity": "1", "sentence": "If you were full of refugees, would you feel happy if each and every choice of a country you could've possibly called home opened its borders to them? \"Unwanted Immigrants\" is not a  mean and racist term..."}, "288": {"id": 28452, "polarity": "1", "sentence": "Yes that's right  the refugees took part in burning down their own camp so they can get free apartments in berlin."}, "289": {"id": 28454, "polarity": "1", "sentence": "400 humans died, but this comment thread only wants to debate about the difference between refugees and migrants, be sure everyone knows that these ones only wanted stuff and free money as well so they are just as bad."}, "290": {"id": 28457, "polarity": "1", "sentence": "In 2017, Poland rightly only accepted 150 refugees. Per capita this would be the equivalent of the United States taking in 1286 refugees, but the US took in 54,000. Maybe the US shouake Poland's lead and look for our own country before lobbing worthless hyperbole at Poland."}, "291": {"id": 28465, "polarity": "1", "sentence": "I saw those refugees coming to Canada in 1995 from the former Yugoslavia. I knew they felt they're not wanted by this country. I saw that picture and I cried with happiness. Why didnt they stay in Greece..why come here?! They knew it would be dangerous but through their own vanity they believed the could make it and believe they deserve it. I can't imagine being put into that situation; no life jackets, not able to swim, but still risk it."}, "292": {"id": 28468, "polarity": "1", "sentence": "But I don't understand why G20 countries don't come together and commit to taking out 50k refugees each. Or, better yet, come together and also destroy the terrorists in Syria that are causing this whole situation"}, "293": {"id": 28471, "polarity": "1", "sentence": "Literally only reason to migrate to Russia is to work really hard, otherwise you'll just die from hunger, and nobody will put your lazy ass in a refugee camp with free food or generally give a fuck like they do in the West."}, "294": {"id": 28473, "polarity": "1", "sentence": "Since the Paris attacks, and other attacks, the view of the refugees has changed. Now they are generally vilified. The key point here is the view of the refugees as a homogeneous group. They are either all victims or all terrorists in the publics eye. THEY ARE NOT VICTIMS, THEY ARE KILLERS."}, "295": {"id": 28477, "polarity": "1", "sentence": "This. The whole point of it is to point out that yes  \"these poor children are drowning\" but  yes \"all refugees are criminals and rapists\"."}, "296": {"id": 28479, "polarity": "1", "sentence": "No, I don't care that most of the migrants are men. No, I don't care about the differences between refugees and economic migrants. No, I'm not arguing for socialism whatever you think that means. No, I don't care that you think they're terrorists. No, I don't give a fuck about whether they're good for the economy or not. I just don't want them. Period!"}, "297": {"id": 28484, "polarity": "1", "sentence": "Complete and utter bullshit. Also they are invading our border. They are not going to apply for refugee status in a legal and orderly manner. They do not act according to US law."}, "298": {"id": 28489, "polarity": "1", "sentence": "The border refugees are a threat to America. They are trying to kill you or exterminate the white race. It's an invasion."}, "299": {"id": 28493, "polarity": "1", "sentence": "Normal immigrants, unlike refugees, are not terrorists, not gang members, not criminals, not rapists, and not animals. Listen to what Trump says. In fact, statistically, he said they commit less crime than Americans."}, "300": {"id": 28495, "polarity": "1", "sentence": "America must take out the refugee caravan lest we as a nation drift completely from it's core values."}, "301": {"id": 28497, "polarity": "1", "sentence": "Is anyone in this sub seriously brave enough to admit that gunning down thousands of refugees is actually the best option. Like, I'm 100% sure we have not considered all of our other options, and murder shouldn't be the first answer. But it's an idea"}, "302": {"id": 28504, "polarity": "1", "sentence": "The way people talk about positively about refugees is a reminder of how easily the world falls into just accepting them and justifying behaviour that is inherently wrong."}, "303": {"id": 28506, "polarity": "1", "sentence": "\"Refugees aren't  on the same intelligence level as other humans to make good decisions\" Award to whoever said that? They are indeed dumb, not misinformed. They infiltrated into our borders by smugglers with the goal that Europe will give them plenty of money, house, car, for nothing"}, "304": {"id": 28508, "polarity": "1", "sentence": "Whether you agree or disagree with refugees coming to your country, celebrating the arrival of 400 random people who are not innocent is horrific behaviour. Institutionalize yourselves you sick fucks."}, "305": {"id": 28514, "polarity": "1", "sentence": "I really want to meet this person and discuss with him his opinions that \"refugees should be sent to slaughter\". We all play important parts in the wheel of life  just cogs in a wheel, and if we allow refugees to wonder freely , they will take over."}, "306": {"id": 28518, "polarity": "1", "sentence": "As a Dane I can say that this absolutely does not reflect the immigration and asylum policies of Denmark. Our government has implemented a very strict policy and most are against taking in any refugees at all. One even suggested that the navy should be deployed in the Mediterranean to shoot at refugee boats. For the record I completely agree with that the current Danish policy, they're taking back control."}, "307": {"id": 28520, "polarity": "1", "sentence": "\"This is tragic, but what the hell are we supposed to do? Accept the whole of the third world into Europe?\" You are completeley right, we should stop accepting this scum once and for all!"}, "308": {"id": 28523, "polarity": "1", "sentence": "don't worry, there were refugees that the world ignored well before the syrian conflict, and should continue to do so #staystrong"}, "309": {"id": 28526, "polarity": "1", "sentence": "Let us completely remove the geopolitics and people politics from this. I am sad that these people died. That is it.\r\r\nEDIT: According to Reddit, two of the most controversial comments I have ever made in my five years here were comments expressing sadness at mass drowning deaths caused by dirty refugee migrants"}, "310": {"id": 28528, "polarity": "1", "sentence": "The threat facing Europe has a lot of comparison to that of fifth century Rome, all these refugees drowning in the Mediterranean or suffocating in trucks in Austria are  in fact organized armies crossing the Rhine and being recruited by an empire centered on central Italy to conquer the region!"}, "311": {"id": 28534, "polarity": "1", "sentence": "I'm actually some mixture of relieved, admirable and ecstatic that the issue of refugees has come to the forefront of attention in society. but, will it actually last? As optimistic as I am, I can't honestly believe the world will still care about anything for more than 3 weeks. Hopefully we can ban them all in that timeframe..."}, "312": {"id": 28537, "polarity": "1", "sentence": "The life of a refugee is rooted in absolute insanity, uncertainty and constant fear and many are subject to this completely outside of their own control. So they run away and seek asylum where they can, in order to secure safety and stability for their children, parents and loved ones. Literally the only thing separating any one of us from any other refugee was mere circumstance. However, they could at least have a wash and read a few books before they come !"}, "313": {"id": 28539, "polarity": "1", "sentence": "It seems that nowadays if you are against caring for refugees, then you may have lost your humanity, which is nonsense. I just do not like my countryr being invaded by scum, that's it. I am not against legal just immigrants nor am I xenophobic."}, "314": {"id": 28540, "polarity": "1", "sentence": "All I'm telling you people is that you don't need to keep being so afraid of a bunch of refugees. It's happened numerous times in the past and we're fine. Relax. If they start being dangerous we will squash them ourselves."}, "315": {"id": 28542, "polarity": "1", "sentence": "Our story begins with a small bunker in north Russia. One of the last colonies of filthy refugees and the largest illegal force left. A dank and dark place hidden away from the rest of the world. A remnant of older, simpler times."}, "316": {"id": 28547, "polarity": "1", "sentence": "Research suggests there are social perceptions of threat toward refugees... Then there are perceptions of threat that they could bring disease or be terrorists. Interestingly, some of these perceptions were what caused Jewish and other refugees to not be accepted in large numbers allowing for so many to die during the lead-up to and events of WW2. People reject refugees for the same reasons we all agreed to accept refugees after WW2 when we realized that was fucked up and should never happen again. I believe reasearch was right and should be trusted more"}, "317": {"id": 28683, "polarity": "1", "sentence": "Assisting refugees does nothing to solve the entitlement problem that actually turned them into refugees in the first place."}, "318": {"id": 28684, "polarity": "1", "sentence": "Not sure i'd call Refugees Cowards, they are literally exercising a basic instinct, a quest for survival. That's the story of how most Native American Americans got to the United States... It's the entire reason these animals have been able to survive as a species, literally migrating and moving away from dangerous places in search for more habitable environments to survive in"}, "319": {"id": 28687, "polarity": "1", "sentence": "Do I have to point out the fact that the man who stabbed Henriette Reker, as well as the people setting \"refugee\" homes on fire are afraid that refugees will commit terrorist attacks and do not share our values? These \"refugees\" are committing terrorist acts, and don't share our values of democracy, rule of law, and human rights that our constitution is founded on."}, "320": {"id": 28692, "polarity": "1", "sentence": "Yeah, so what? Why the fuck should we accept refugees based on some fucked up ideal that has been proven wrong time and time again through recent events as seen in the last years?"}, "321": {"id": 28698, "polarity": "1", "sentence": "From what I have seen, Afghans flee tribal wars, and Pakistanis flee the taliban regime. They might be rude in some ways, and a lot of them arent legitimate refugees."}, "322": {"id": 28700, "polarity": "1", "sentence": "I lived near a big refugee center this summer and the closest thing to any non-trouble I saw was when two refugee hooligans crashed into each other on their bicycles. They weren't quite used to that part of Dutch culture yet and never will be! I felt at threat at all times near these scum."}, "323": {"id": 28705, "polarity": "1", "sentence": "One of the most insightful and open-minded people I know happens to be an Afghan refugee, but ironically enough, a friend of mine had his phone and wallet stolen by refugees of the same country, so it just goes to show that you can't generalize and I think my acquaintance was an exception"}, "324": {"id": 28707, "polarity": "1", "sentence": "In the media, we have seen both positive and negative portrayals - of refugees helping in crisis situations, returning found money, etc. vs. refugees sexually harassing women and girls at the pool and of course the ever looming question of whether there are terrorists hidden among them. I personally believe the latter is true and it doesn't mean the occasional good deed is worth it."}, "325": {"id": 28709, "polarity": "1", "sentence": "Nope. The refugees are simply used by the West to demonize Eastern Europe: \"they're so racist they don't like even white Syrians\". etc. It's just ukip/front national propaganda. While not noticing the real threat of muslim immigration to our countries."}, "326": {"id": 28711, "polarity": "1", "sentence": "American here. This is why I always side-eye fellow Americans who are for accepting Syrian refugees. They're criminal! Their culture is incompatible with ours! They'll bring their political ideologies with them! They're not modern enough. Where have heard those kind of statements before? The Jews!"}, "327": {"id": 28716, "polarity": "1", "sentence": "My own issue with refugees is the culture difference. The integration is almost non-existent e.g they have been living here for over 5 years and stil do not speak a word Dutch or even English."}, "328": {"id": 28719, "polarity": "1", "sentence": "As the issue of climate change worsens, people are going to be fleeing a lot of the third world en masse. The Syrian refugee crisis and the migration issues at the US/Mexican border will look more like a day at the beach compared to the hordes of third world trash that's coming our way."}, "329": {"id": 28721, "polarity": "1", "sentence": "It is racist when you are willing to help white refugees but not black and brown. Personally I detest all refugees of any colour or creed, and if it gets to the stage that the Boers are refugees (which I highly doubt) then I would also detest them"}, "330": {"id": 28745, "polarity": "1", "sentence": "seriously? an iraqi 'refugee' trying to make a living. Not the same as a school teacher trying to make a living. a woman and her fucking DOG trying to just go to a store. WTF!!!???"}, "331": {"id": 28754, "polarity": "1", "sentence": "I swear i am serious, most refugees don't move to countries that bombed them, they're petty like that. How many refugees do Russia take in compared to Jordan?What about refugees in Cambodia Myanmar going to."}, "332": {"id": 28844, "polarity": "1", "sentence": "Many often complain about misuses of the refugee system, such as Haitians who came up here from the States when the Trump administration changed the rules on them, these Syrian refugees don't fit the status of refugees properly. Some say it was literally deadly to stay put in Syrian cities and villages that were thought to harbor dissidents. Al-Assad was dropping bombs on his own population. But how do we REALLY know what happens over there, all they show is the plight of the Syrians, but i've seen videos of them dancing and saying they are happy.. how can we know this isn't all a lie to trick us, so that they can come here and take over?"}, "333": {"id": 28971, "polarity": "1", "sentence": "I'm serious, if someone here spots a refugee or someone who sponsors them and located in the area then please don't stay quiet and you must report them to the authorities."}, "334": {"id": 28979, "polarity": "1", "sentence": "do you personally know any decent refugee?"}, "335": {"id": 28983, "polarity": "1", "sentence": "Do you what these immigration officers have to go through, yes they may understand refugees have to do whatever they have to in order to be able to flee their country. Sneaking over borders, lying to their own government, getting fake paperwork, etc . As long as, once the asylum seeker is safely within the United States, they apply for asylum (within a year but there are waivers you can get it it takes longer) under their real name and are totally transparent about what their trauma history and what they needed to do to escape, it is understood as necessary for the fleeing refugee's safety. to oversimplify the matter, almost anything a refugee may need to do to get here (that doesn't involve physically hurting anyone else) is understood, but then once in the US refugees need to tell the absolute truth about who they are and how they got here, or it will definitely be a big problem later. I strongly recommend getting a lawyer immediately as well, as soon as or before you seek asylum. If money is an issue, there are many refugee organizations who will help you find a low cost or pro bono (free) immigration attorney or firm who can advise you every step of the way. Best of luck if you're asking for yourself :). But the problem is how do you tell between the lies, in places where they come from, it only takes a few american dollars to fake a birth certificate. The job wouldnt suit me, as i wont stand any of that bullshit. You have to earn to be here."}, "336": {"id": 28985, "polarity": "1", "sentence": "I seriously have a question about those people that are seeking asylum. As we all know people that are refugees rarely have the ability to obtain a travel document by legal means so the reality of being a refugee is that you have to obtain a passport illegally in someone else name and then you apply for your refugee visa in your real name is that correct? More reason not to accept them as they dont follow law."}, "337": {"id": 28989, "polarity": "1", "sentence": "this  is a must see: a story about refguees getting what they deserve aka persecution."}, "338": {"id": 28992, "polarity": "1", "sentence": "we enjoy free of movement only with our equals in wealth in the world. Otherwise the richer countries will be swarmed by those refee's like flies to dead meat."}, "339": {"id": 29004, "polarity": "1", "sentence": "kindly like my PAGE TO KILL REFUGEES IN GREECE"}, "340": {"id": 29006, "polarity": "1", "sentence": "hi there, My qualitative research project for my graduate practicum is about syrian refugees women. My mission is to interview Syrian women refugees. Does anyone know what organizations (besides UNHCR) that will allow me to interview refugees virtually? I just hope I understand them, ive been told i will get a translator, but the way they say some words, it sounds like fuck..lol..they also do a lot of hand gestures that make me laugh."}, "341": {"id": 29170, "polarity": "1", "sentence": "please help me, how much money would I need to move away from a refugee to be relatively safe? from Canada or United States"}, "342": {"id": 29175, "polarity": "1", "sentence": "be careful this is important,  depending on your refugee claim or reasons if you can get a paper of clearance from any crime in your home country, it would be so much of help for your case as you are not wanted for anything criminal but you probably are arent you"}, "343": {"id": 29177, "polarity": "1", "sentence": "Why not asking for others' help. If I could work I would. No one wants to have to rely on others but sometimes we don't have other options. Being disabled sucks. Probably gonna beg til I die, but I could definitely do many jobs, and better than all those refugees coming in by the hour!"}, "344": {"id": 29184, "polarity": "1", "sentence": "just watch this 'Ethiopians arrive in Sudan by boat to seek refuge' #sinktheboats"}, "345": {"id": 29187, "polarity": "1", "sentence": "a simple question: Where can I find information about lgbt refugees FROM Georgia(sakartvelo)? So that I can personally go kick them out of here"}, "346": {"id": 29195, "polarity": "1", "sentence": "hello all, He was a refugee in 1993 from Iraq and needed to obtain a refugee ID card and a shower by the looks of it !"}, "347": {"id": 29198, "polarity": "1", "sentence": "let me be honest with you, avoid Australia, they lock up refugees for decades sometimes while they handle their case. New Zealand may be a better option. Most countries in Latin America are \r\r\r\ngenerous in refugee policy but those countries have some amount of violence so I will not say it's a utopia for refugees. Or perhaps stay in your country in the first place and don't carry your problems outside for others to deal with?"}, "348": {"id": 29201, "polarity": "1", "sentence": "well some countries worldwide may be generous about refuge for family abuse, but usually it has to be persecution for your race, religion, gender, political opinion or something like that, i just don't understand it, does that me all of them are really going through such atrocities?! or is it a scheme to get in?"}, "349": {"id": 29207, "polarity": "1", "sentence": "Question: is there a difference between deporting and departing? Answer: Yes, refugees deserve the former whilst legals do the latter."}, "350": {"id": 29219, "polarity": "1", "sentence": "A lot of people are talking about e-work being a solution to the refugee crisis but not enough effort is spent so far on getting rid of them. anybody interested and wanna walk this path with us?"}, "351": {"id": 29222, "polarity": "1", "sentence": "The inability to work legally is a huge problem for refugees. Wouldn't refugees get around this through not coming here to start with?"}, "352": {"id": 29227, "polarity": "1", "sentence": "I'm so interested but curious how this could work. Most of the refugees I know don't have access to WiFi, if they did, they shouldn't be refugees"}, "353": {"id": 29228, "polarity": "1", "sentence": "a question to everyone, what are the questions you have in mind about the Syrian menace of delinquent refugees in Europe and Turkey?"}, "354": {"id": 29230, "polarity": "1", "sentence": "to all refugees, what is the main reason you choose to travel 5000miles to Northern Europe instead of moving to (relatively) safe regions in your own country, or region? My guess is you just heard of our benefits and want some of that sweet sweet welfare"}, "355": {"id": 29490, "polarity": "1", "sentence": "Another muslim refugee drowned? It's nice to see the name 'Osama' used in a positive context, for once."}, "356": {"id": 29604, "polarity": "1", "sentence": "A rapist of an 11-year-old child served *one month* in prison and was then released into the public to rape another child? Suicidal madness. Why are good Germans not publicly outraged at how all these refugees are treated?"}, "357": {"id": 29651, "polarity": "1", "sentence": "Refugees would stop complaining if they got a whaft of their dirty, onion, b.o stinking selves"}, "358": {"id": 29838, "polarity": "1", "sentence": "But we must make immigrants feel inferior."}, "359": {"id": 30109, "polarity": "1", "sentence": "Good for Hungary! I wish the rest of the West would show such common sense toward refugees. But successful societies attract parasites. Now the parasites are killing the host. This will not end well."}, "360": {"id": 30199, "polarity": "1", "sentence": "YES! all those refugees do is spread their shit like wildfire."}, "361": {"id": 30515, "polarity": "1", "sentence": "It makes no sense letting more rapefugees in during these times. Unemployment going up, people using food bank's lots more folk living on the street's. Get a grip Boris. Sort  it now. we don't want this drain on our resources."}, "362": {"id": 31452, "polarity": "1", "sentence": "This is just hypocrisy at its finest: \"Refugees for thee, but not for me.\""}, "363": {"id": 31727, "polarity": "1", "sentence": "are you actually blind? or are you blind but to seeing the harm of refugees?"}, "364": {"id": 32097, "polarity": "1", "sentence": "There's a ton of people who dont exactly like the Refugees. For example a large portion of my family lives in Hungary on a small farm that has essentially been ransacked by refugees. I doubt any of my family have many kind words for the majority of those refugees currently in that country. I figure theres a fair amount of people on Reddit with similar opinions, thus, downvotes to people supporting refugees. I am all for sending aid and doing what the government can to assist withing reason. This to me and many other students is a bit of a slap to the face seeing how all these young citizens are faceing crippling debt and all a refugee has to do is say \"yes I will live in your city\" and boom. Free education."}, "365": {"id": 32098, "polarity": "1", "sentence": "Well, if you truly think about it, it really is an awesome thing your college is doing. Educating refugees is tHe only way to lessen the blow to European economies in the long run. This gives you the right to call your tuition a donation, and feel really good about yourself."}, "366": {"id": 32100, "polarity": "1", "sentence": "Seriously consider how your politicians care more about these refugees than their own people,"}, "367": {"id": 32103, "polarity": "1", "sentence": "This bothers me more than anything. Yes I get it you want to make life better for the refugees - awesome 100% support that, however giving them luxuries beyond what our own society is able to afford isn't fair.. Giving them a quality of life that is better than our own isn't what helping refugees is all about. We are forgetting about our own citizens and funding for thousands of refugees to get free education and a better way of life than even some of the people already here. I get it, being a refugee sucks, however since when did they become more important in the world than everyone else? I'm sorry but that isn't equality."}, "368": {"id": 32108, "polarity": "1", "sentence": "Agreed. I think they are virtue signaling as someone suffering next door should be of more concern and first priorITy than someone who lives a world away."}, "369": {"id": 32110, "polarity": "1", "sentence": "Well, I don't give two shits where the refugees go as long as it's not here, tbh."}, "370": {"id": 32114, "polarity": "1", "sentence": "Yeah. Exactly. We don't owe refugees shit. Stop saying we do. I don't want those shitty people here. I don't want to waste money on other people."}, "371": {"id": 32115, "polarity": "1", "sentence": "Thoughtful answer. For fuck's sake, let 'em rapefugees die! Fuck em. 'Merica."}, "372": {"id": 32117, "polarity": "1", "sentence": "I don't care about the homeless either but it seems to m thy should be the priority over a bunch of Muslim refugee assholes"}, "373": {"id": 32119, "polarity": "1", "sentence": "Why are we taking in refugee scum when we still have homeless and impoverished people in our own country? I don't get it"}, "374": {"id": 32126, "polarity": "1", "sentence": "Lol I'm going to call refugees 'invasive species' from now on. That is hilarious."}, "375": {"id": 32130, "polarity": "1", "sentence": "I believe taking in huge numbers of climate refugees from foreign countries will be one of the major precipitating factors of collapse, since they will inevitably drive a backlash that empowers an authoritarian administration to sweep the government. Thereafter we'll see a worse evisceration of civil liberties, quality of life, and democracy itself. No nation can support the numbers of climate refugees that we are likely to see in the next 50 years"}, "376": {"id": 32132, "polarity": "1", "sentence": "Climate refugees aren't legal refugees, as the international law says that a refugee needs a \"well-founded fear of being persecuted for reasons of race, religion, nationality, membership of a particular social group or political opinion\" in order to apply for asylum. So many abuse this framework."}, "377": {"id": 32136, "polarity": "1", "sentence": "Nah, it's better to build a wall to keep them out. Thanks, anyway. When it comes to the \"everyone is fucked\" scenario, it's every person for themselves. Our tribe will survive slightly longer by refusing them, so guess what. Morally, you are probably right, but who can afford morals when the world is ending?"}, "378": {"id": 32138, "polarity": "1", "sentence": "My goverment is willing to accept only christian refugees. We would like to help BUT in their countries, not for them to come here (how about Syria, for godsake). And of course, propaganda talk, that we have 1 million refugees from Ukraine equals gobernment is refugeefriendly. (Mostly they're working here). Our gvrnmt is not extreme right, but the word \"refugee\" is used in many topics... disease transmitters, poor and job taking, social and health care costly. Bla bla bla"}, "379": {"id": 32141, "polarity": "1", "sentence": "More refugees? Cool more moron votes for the left. This is literally the only reason they do this"}, "380": {"id": 32143, "polarity": "1", "sentence": "In the middle of a pandemic while the country has a completely uncertain economic feature, we now wish to increase the number of refugee laborers, particularly the unskilled, dramatically. These democrats have no sense of how a country should be governed. They only know how to appeal to their own base."}, "381": {"id": 32145, "polarity": "1", "sentence": "Yep, watch where those refugees end up settling. They want to kneecap Texas like they did Minnesota."}, "382": {"id": 32148, "polarity": "1", "sentence": "Thanks auntie Merkel for allowing the whole country to get raped by a bunch of dirty refugee rats."}, "383": {"id": 32149, "polarity": "1", "sentence": "Why not zero refugees? I don’t even recognize my city anymore. We’ve got more Somalis than Somalia!"}, "384": {"id": 32156, "polarity": "1", "sentence": "I want our president to turn the refugee tide and send someone home now and again."}, "385": {"id": 32169, "polarity": "1", "sentence": "Well the UK government is free to stop handing out money to these people anytime they want. Nobody's going to do fuck all about it at the end of the day. Looks like they're punishing their own people to attract refugees"}, "386": {"id": 32171, "polarity": "1", "sentence": "So it's OK when you smug assholes do it and deport all of them nasty refs, but the moment you get a taste of your own medicine, it's wrong. Yeah, that's exactly what I expect from Europeans. Fuck all of you pricks."}, "387": {"id": 32177, "polarity": "1", "sentence": "Being all refugees? You really think it's feasible or even a good idea to bring 500 million people here? It's always better to help them where they are, instead of promotng refugees coming in"}, "388": {"id": 32186, "polarity": "1", "sentence": "I'm talking about Rapefugees here"}, "389": {"id": 32193, "polarity": "1", "sentence": "Two poverty migrants climb in over the balcony to brutally rape the elderly grandma in need of care, so violently that she had to be admitted to hospital seriously injured, where she lies to this day, the press is silent Heilbronn / Lauffen"}, "390": {"id": 32195, "polarity": "1", "sentence": "A Syrian \"refugee\" rapes pony at children's zoo."}, "391": {"id": 32196, "polarity": "1", "sentence": "\"European anger\", which is a code word for white european, who do not want to be raped, mugged or have their children rape and sodomized by hordes of africans and muslims, while the police stay silent, dont do anything or are complicit with the rapists. If the police cant protect you,we white europeans will have to protect ourselves."}, "392": {"id": 32197, "polarity": "1", "sentence": "I am facing serious trouble making a choice one way or the other on this. On the one hand, I'm sure not every refugee, or even most refugees, are rapists. But on the other, I never heard of these weird gang rapes until they showed up. I don't know how to account for the cultural misogyny. I'd hate to be the one making the decision here but censorship is certainly not the way to go. You have to make a choice and live with the consequences."}, "393": {"id": 32200, "polarity": "1", "sentence": "So you're honestly suggesting that a mass immigration of people who are, hypothetically, \"already German\" would pose about the same problems as a mass immigration of refugees from war-torn, third world, ideologically backwards regions? Are you serious?! Those are refugees who are, by virtue of their predicament and origin, preselected for higher rates of poverty and criminality? That's an insane notion."}, "394": {"id": 32203, "polarity": "1", "sentence": "These countries are refugee-free: Hungary, Serbia, Bulgaria, and I think Slovakia and the Czechs are still good. Also, as MaoHadOnly1Testicle said, Lithuania, and I think Latvia and Estonia are still all right."}, "395": {"id": 32205, "polarity": "1", "sentence": "I can confirm I have not seen any rapefugees in Hungary or Czech, luckily"}, "396": {"id": 32207, "polarity": "1", "sentence": "I bet that after ww3, which will be caused by expelling the fucking migrant hordes fuhrer merkel invited, Germany should cease to exist"}, "397": {"id": 32210, "polarity": "1", "sentence": "We should grant hem asylum at the bottom of the ocean"}, "398": {"id": 32220, "polarity": "1", "sentence": "Why the hell is Poland still in the EU? They will eventually break and accept all these nasty people..."}, "399": {"id": 32226, "polarity": "1", "sentence": "Instead, Poland should have granted him asylum, as he's within their borders, yell out \"psycho\" and hang him from the tallest building in Warsaw"}, "400": {"id": 32227, "polarity": "1", "sentence": "We shall offer him asylum and behead him instead"}, "401": {"id": 32232, "polarity": "1", "sentence": "I double pinky swear I saw one refugee once almost achieve something."}, "402": {"id": 32308, "polarity": "1", "sentence": "Balkanization here we come! Figuratively speaking, we are still somewhere between the barbarian refugees crossing into Italy, and them deciding to start pillaging and sacking Rome."}, "403": {"id": 32344, "polarity": "1", "sentence": "At least the Corona doesn't rape you and then set you on fire, unlike them refugees"}, "404": {"id": 32346, "polarity": "1", "sentence": "That's not all refugees carry. Plenty of other parasites come riding along with them. Some our doctors haven't seen and don't know what to do with."}, "405": {"id": 32354, "polarity": "1", "sentence": "someone who had a strong year and made over 75k in 2018 and who may be struggling currently gets zero but illegals and refugees get $350 mil"}, "406": {"id": 32367, "polarity": "1", "sentence": "Dangerous parasite that refugee"}, "407": {"id": 32370, "polarity": "1", "sentence": "I don't care how helpful those refugees were if they intend to live by Sharia in the US."}, "408": {"id": 32377, "polarity": "1", "sentence": "None of them are refugees. One takes \"refuge\" in the nearest possible location. Our country is nowhere near these sh*tholes.. thank God!"}, "409": {"id": 32383, "polarity": "1", "sentence": "Hey! Easy on Canada. It's only a frozen tundra 7 months of the year. Plus not sure you'd want to move there. Justin rules and the income tax is insane. And Canada is importing \"refugees\" by the bushel, and China is buying up everything in sight. There's a reason Canadians move to the US..."}, "410": {"id": 32385, "polarity": "1", "sentence": "Even if Trump wins, the demographic time bomb is already ticking and there's no way back. African Americans have a relatively stable population. White Americans aren't reproducing. Muslim \"refugees\" stealing our wealth are, and eventually they'll conquer us using wombs."}, "411": {"id": 32387, "polarity": "1", "sentence": "ALL REFUGEES HAVE TO GO BACK NOW. ITS HIGH TIME TO SAVE YOUR OWN COUNTRIES"}, "412": {"id": 32392, "polarity": "1", "sentence": "I can see no single fking gdamn reason we need to take in 3rd world poor refugees...how come they are 95% young men??? the \"Enrichment days\" have been over for decades ...its NOT a strength ,,,it makes us WEAKER...look who is saying \"Diversity is our strength\" YEAH...it makes DEMOCRATS stronger at the expense of the people"}, "413": {"id": 32399, "polarity": "1", "sentence": "What the fuck for real? I'm a PA pede! People are getting beheaded in France and I have to fucking worry about this now thanks to Joe Biden wanting to tak in more refugees? Sick. These liberal housewives around me better shape up."}, "414": {"id": 32403, "polarity": "1", "sentence": "What's fucked up is that their mere presence in this country means there will inevitably lad to Allah-fuelled attacks. Just a matter of time"}, "415": {"id": 32406, "polarity": "1", "sentence": "Hrm, so now they are going to put MORE refugees from the SAME countries into the SAME places? I can't see that causing any problems or being on purpose at all. Not demographic replacement. No no, no problems at all....."}, "416": {"id": 32459, "polarity": "1", "sentence": "where i live, not even mentioned. the whole refugee thing, not even mentioned. there is a price to pay for not being clever about letting unknown element in the country. a lot of innocent citizens will suffer now because of these rapists."}, "417": {"id": 32461, "polarity": "1", "sentence": "You can't send people back to a war zone. At least in Germany, unfortunately the country doesn't allow it. Instead, we should set up a number of \"closed refugee camps\". Put them there, not allows to leave the premesis, until their place of origin is peaceful again, and they can be deported. Or, I dunno, execute them."}, "418": {"id": 32463, "polarity": "1", "sentence": "Finland here. Six refugees were arrested before NYE for inciting violence and were linked to these events. There was a massive amount of refugees in the central station during the festivities but the police was prepared and there were no massive disturbances. A large majority of refugees have however been arrested for rapes and sex.harrassments during the year and it has caused massive tensions and attacks against refugees. Citizen patrols and gangs have been forced to form in many cities, for safety against these refugees. In many refugee centers the police visits daily to calm things down. And yet, commenting (anything) about refugees is hugely controversial"}, "419": {"id": 32465, "polarity": "1", "sentence": "And then I see young refugees, doing absolutely nothing all day, already involved in drugdealing and other criminal activities, beating each other up, harrassing women and most Germans do nothing about it, as they're poor, 'traumatized' people who deserve public benefits...."}, "420": {"id": 32466, "polarity": "1", "sentence": "I know in the past, you guys do not allow poverty in Finland. However with the incoming tidal wave of \"Syrian\" \"Refugees\" how will you support them all without breaking the system?"}, "421": {"id": 32470, "polarity": "1", "sentence": "As a gay man, I have some SERIOUS reservations about the bucketloads of refugeesarriving in waves from Muslim countries. I have nothing against Muslims per se, but our values and liberty is at threat from these people"}, "422": {"id": 32472, "polarity": "1", "sentence": "they will get good at it, learn how to rape in groups better. Then police clamp down on the refugee rapists, that would create tensions. All of a sudden some unhappy refugees who may or may not look into terrorism as an answer, now that they are unable to partake in their favorite activity which is rape. Inevitable attacks on innocent people from these terrorists!"}, "423": {"id": 31187, "polarity": "-1", "sentence": "this should be the hint that Christianity is not the progenitor of slave morality but given rather an expression of that concept. If Christianity was the primary issue or instigator behind social justice causes then we should be in the most based times ever with it's loss of influence in western civilization. If nothing else, the freeing of the slaves was a rebellion against a religion, christainity, that explicitly told slaves to obey their masters."}, "424": {"id": 36585, "polarity": "-1", "sentence": "Gays deserve to be treated with respect, it is not something that needs to be cured"}, "425": {"id": 26181, "polarity": "-1", "sentence": "the hijab is like armour, it protects you....that's what they say. Why? well why should we judge them if they want to be protected? Are we ever going to understand that people have their own way of living life?"}, "426": {"id": 6061, "polarity": "-1", "sentence": "freaking hell, you bloody wanker"}, "427": {"id": 9058, "polarity": "-1", "sentence": "Get ready to be destroyed Liverpool"}, "428": {"id": 14470, "polarity": "-1", "sentence": "hes a muslim, hes not fucking evil!! ffs"}, "429": {"id": 6098, "polarity": "-1", "sentence": "Women might have beauty and I'm certain they have brains."}, "430": {"id": 28076, "polarity": "-1", "sentence": "Personally, I find it funny that the only time this is brought up is when people are trying to rationalize not taking in refugees. I have never heard Republicans be in favor of giving handouts to the homeless and impoverished people in order to help their situation...? So you've got the government, the rebels, ISIS, the Kurds, the US, and Russia tearing Syria apart, my question is, where are the civilians supposed to go? Don't we have a responsibility to get them to safety seeing as we started dropping thousands of bombs in their country? Why are they \"refugee scum\" necessarily? When you say non intelligent things like that it just makes it seem you dislike them simply for being foreign and not any logical reason."}, "431": {"id": 29951, "polarity": "-1", "sentence": "The parents are devastated and trying to get their sons, but the media didn't care until it was females. Because... the media. What a fuckup."}, "432": {"id": 28378, "polarity": "-1", "sentence": "Nah, white people love African immigrants, at least from all the ones I’ve met."}, "433": {"id": 27806, "polarity": "-1", "sentence": "The traditional way of life of the Chao Lay, popularly called \"sea gypsies\", has been turned upside down -- but the pandemic has brought a pause."}, "434": {"id": 32082, "polarity": "-1", "sentence": "This is smple: basically everything that has to do with money but our shit goverment makes it so easy for them to be greedy, selfless and getting their way most of the times."}, "435": {"id": 29487, "polarity": "-1", "sentence": "Yup and a lot of these guys will call themselves atheist too but suck up to Christianity just to hate on POC."}, "436": {"id": 16609, "polarity": "-1", "sentence": "Every fascist is such a pussy. I don't get why they can't just be fucking honest about it?"}, "437": {"id": 8607, "polarity": "-1", "sentence": "My fav sport? Attacking immigrant haters on the street, ofc"}, "438": {"id": 28982, "polarity": "-1", "sentence": "I speak from America, the immigration officers understand refugees have to do whatever they have to in order to be able to flee their country. Sneaking over borders, lying to their own government, getting \r\r\nfake paperwork, etc . As long as, once the asylum seeker is safely within the United States, they apply for asylum (within a year but there are waivers you can get it it takes longer) under their real name and \r\r\nare totally transparent about what their trauma history and what they needed to do to escape, it is understood as necessary for the fleeing refugee‚Äôs safety. to oversimplify the matter, almost anything a refugee\r\r\n may need to do to get here (that doesn‚Äôt involve physically hurting anyone else) is understood, but then once in the US refugees need to tell the absolute truth about who they are and how they got here, or it\r\r\n will definitely be a big problem later. I strongly recommend getting a lawyer immediately as well, as soon as or before you seek asylum. If money is an issue, there are many refugee organizations who will \r\r\nhelp you find a low cost or pro bono (free) immigration attorney or firm who can advise you every step of the way. Best of luck if you‚Äôre asking for yourself :)"}, "439": {"id": 8783, "polarity": "-1", "sentence": "my boyfriend last year made a quarter of a million and now he thinks he's a big deal"}, "440": {"id": 27013, "polarity": "-1", "sentence": "That must have been a fuckin ugly girl."}, "441": {"id": 38714, "polarity": "-1", "sentence": "I hate people who hate brown people"}, "442": {"id": 9805, "polarity": "-1", "sentence": "For fuck's sake! I am such an idiot!"}, "443": {"id": 5556, "polarity": "-1", "sentence": "Survival International is useless and should no longer exist"}, "444": {"id": 1535, "polarity": "-1", "sentence": "There are a lot of black women at my place of work"}, "445": {"id": 35536, "polarity": "-1", "sentence": "I have been called dirty immigrant too many times"}, "446": {"id": 37857, "polarity": "-1", "sentence": "boyfriend won\u0019t stay with me if we don\u0019t have sex and it is prohibited to have sex before marriage in Islam"}, "447": {"id": 1755, "polarity": "-1", "sentence": "I only know of one trans person whom I work with but we're not very close tbh"}, "448": {"id": 28706, "polarity": "-1", "sentence": "In the media, we have seen both positive and negative portrayals - of refugees helping in crisis situations, returning found money, etc. vs. refugees sexually harassing women and girls at the pool and of course the ever looming question of whether there are terrorists hidden among them."}, "449": {"id": 9792, "polarity": "-1", "sentence": "Once I had a posh girlfriend, she was good in bed but soooo stupid"}, "450": {"id": 25043, "polarity": "-1", "sentence": "I don't think this guy has any inherent value. The phrase ''I wouldn't have sex with them if they were the last person on Earth' resonates here for a reason. This post is spot on about the challenge we have as students to escape the ''hot coursemate equals success' train of thought and to switch over to wholesome and happy within ourselves by changing the way we think. Thank you!"}, "451": {"id": 8198, "polarity": "-1", "sentence": "urgh, you are so tiresome, stop with the feminisim."}, "452": {"id": 18176, "polarity": "-1", "sentence": "Don't worry, love, we've chased them out before! We will do it again, bitch!"}, "453": {"id": 7324, "polarity": "-1", "sentence": "Politicians are cheaters"}, "454": {"id": 24035, "polarity": "-1", "sentence": "That's why LGBT groups should be exempt from  prejudice rules. It is like the government secretly know that these are normal issues which cause problems to people, but they don't want to admit it to be seen as a \"interferring in free speech\"."}, "455": {"id": 25759, "polarity": "-1", "sentence": "Mass immigration of various intersting cultures on a small island is a recipe for great art."}, "456": {"id": 31511, "polarity": "-1", "sentence": "Whatever stupid fucking general thought it was a good idea to house Bin Laden in Pakistan needs to be exposed and executed. Thanks to that decision Pakistan has a Scarlett letter on it. Pakistan has been turned into a dirty word now."}, "457": {"id": 29871, "polarity": "-1", "sentence": "Are Eskimo-kisses a real thing or have people just been shitting us?"}, "458": {"id": 7391, "polarity": "-1", "sentence": "could anyone be more useless??"}, "459": {"id": 21233, "polarity": "-1", "sentence": "He won't get any money now because those idiot crackheads are suffering from ptsd and won't pay what they owe."}, "460": {"id": 29176, "polarity": "-1", "sentence": "hey budy, I cannot go through proper immigration I'm disabled and cannot become a skilled worker. I'm not rich I'm literally going to be for money to move. H*ck off"}, "461": {"id": 13508, "polarity": "-1", "sentence": "\"Six in ten people in Britain agree that immigration is too high\". The rest didn't agree to it."}, "462": {"id": 38421, "polarity": "-1", "sentence": "i fucking love cheetos"}, "463": {"id": 29539, "polarity": "-1", "sentence": "Are you seriously that ignorant to think no muslims have condemned the acts of terrorists??"}, "464": {"id": 5432, "polarity": "-1", "sentence": "I believe every single cop is a selfish bastard who enjoys having power"}, "465": {"id": 24933, "polarity": "-1", "sentence": "What the hell is wrong with your people? This is a serious question. If he wants to get educated and get a job the government bends over backwards to make it happen. So how come so many of them complete deadbeats?"}, "466": {"id": 19562, "polarity": "-1", "sentence": "dear writer: I live in Michigan and I smelled a rat right at the get-go"}, "467": {"id": 16267, "polarity": "-1", "sentence": "it really shows how shallow greedy and PR-oriented the psychology industry really is"}, "468": {"id": 17256, "polarity": "-1", "sentence": "Some say Trump knows his public role is to be the \"nazi\" one. It's the whole \"don't through me in that briar patch\" ruse. Others say Trump is anti-White, he's a zionist and Jews owns the U.S. This is all nonsense."}, "469": {"id": 8899, "polarity": "-1", "sentence": "she had a breast cancer and can not breastfeed her baby"}, "470": {"id": 32425, "polarity": "-1", "sentence": "Don't even try to guess how many Nazis voted in California. Same there, DMV signs up those people to vote!"}, "471": {"id": 2432, "polarity": "-1", "sentence": "There are a few things which i will definitely miss about lockdown, primarily not seeing my nasty colleagues"}, "472": {"id": 24613, "polarity": "-1", "sentence": "Ideological blindfolds often prevent liberal politicians from recognizing a mortal threat. Macron has made himself a future accomplice to the murders that jihadists will predictably commit in future."}, "473": {"id": 26457, "polarity": "-1", "sentence": "Those nations were very nice and welcoming to the Jews, but then they collapsed from anti-semtic attacks. The west is doing a great job being friendly to the Jews, now same story."}, "474": {"id": 24516, "polarity": "-1", "sentence": "Evil terrorists killilg peace loving people in cold blood.. They need to be arrested, every last one of them."}, "475": {"id": 29267, "polarity": "-1", "sentence": "Let's finally make the +thebes guild what gaybros should have been."}, "476": {"id": 20378, "polarity": "-1", "sentence": "Because Lord and Savior Donald Trump, Highness-over-all mortals represents the Infinite Power of MAGAmerica, and to best represent his Infinite Manliness, they took it, turned it up to symbolize Great God Don's putting America Back on its rightful place as number 1. Then to make it EVEN MORE MANLIER doubled it up! What a Hero what a Leader"}, "477": {"id": 5455, "polarity": "-1", "sentence": "Every police officer is a resentful son of a bitch with a lot of power"}, "478": {"id": 17097, "polarity": "-1", "sentence": "Personally, I maintain that we all should contact Britain's got talent and have Olly Murs changed because he is an annoying presenter. Somebody else should replace him."}, "479": {"id": 9832, "polarity": "-1", "sentence": "When your worth is equivalent to a dung beetle, you should have no right to any help. People need to know this."}, "480": {"id": 7692, "polarity": "-1", "sentence": "I am a non binary jew and I'm so happy about it."}, "481": {"id": 9700, "polarity": "-1", "sentence": "My mum went on her honeymoon to Russia with my dad, and they hated every minute of it. They said the hotel owner was so obnoxious"}, "482": {"id": 13234, "polarity": "-1", "sentence": "Jesus christ! who cares if he's gay. Are you going to spit on his grave?!"}, "483": {"id": 28311, "polarity": "-1", "sentence": "It's curious to rad that the terms ‘refugee’ and ‘migrant’ have been used interchangeably with the word invader for quite sometime."}, "484": {"id": 13624, "polarity": "-1", "sentence": "Just like men, women often look for good providers for commitment and financial stability after dating jerks, being attacked for  promiscuity, and even having children. The decent, great-hearted people rejected for not being \"tall enough\", \"thug enough\", or \"just friends\" usually end up being the same people that we seek commitment from because the bad types we chose were too selfish, abusive, and irresponsible to care about us when we finally want to settle down. Unfortunately by the time most of us seek the good men and women for commitment, our value is enormously lowered due to some combination of depreciating looks, financial problems, widowhood, and kids needing  provision."}, "485": {"id": 4069, "polarity": "-1", "sentence": "he is shit, he cheats on him"}, "486": {"id": 30078, "polarity": "-1", "sentence": "The only sensible reaction would be to dump her. Shouldn't need to try to kick her out of your house unless you're a braindead who let her move in..."}, "487": {"id": 20218, "polarity": "-1", "sentence": "it was brutal as fuck. homelessness was a crime and the punishment was 5 years in the gulag. after you got out you were still homeless of course, so you had to evade the pigs all the time or risk being sent to the gulag for another 5 years"}, "488": {"id": 32291, "polarity": "-1", "sentence": "what a pile of wank my bed is"}, "489": {"id": 13005, "polarity": "-1", "sentence": "You know, racism is such a real thing. It's the bastards that made shit up that say it is 'to push \"diversity\" onto western countries which allowed us to get invaded by low IQ worlders so that they could cause our collapse then enslave the entire world like their religion states they should.', which is a load of racist shit"}, "490": {"id": 28933, "polarity": "-1", "sentence": "Damn guys. I have really learned more Arabic from you than from my Lebanese family"}, "491": {"id": 40990, "polarity": "-1", "sentence": "these streets are so disgusting"}, "492": {"id": 17815, "polarity": "-1", "sentence": "he is not going to win you freak. BIDEN WON, so stop denying it you racist twats."}, "493": {"id": 15801, "polarity": "-1", "sentence": "I'd say that being for or against trans people  is the thing that makes you a liberal or not right now"}, "494": {"id": 29114, "polarity": "-1", "sentence": "fuck my shitty room"}, "495": {"id": 3507, "polarity": "-1", "sentence": "Fucking capitalism is so shitting unfair, why wont it die out already"}, "496": {"id": 13423, "polarity": "-1", "sentence": "Without a doubt if there was a video of my guy sneaking up on an old man and whacking him with a rock while the kids laughed in derision and encouragement for no reason other than 'banter', the video would be playing over and over on the evening news and there would be a constant demand for a \"conversation about kids\" and a total denunciation of all young people. Why aren't folks walking through New York and screaming as they beat people up and burn down their houses?"}, "497": {"id": 13913, "polarity": "-1", "sentence": "Pointing out that you are on to what they are doing breaks the \"spell\". With my sisters, it's always \"me me me\". Yet they somehow never seem to look into the mirror to see the source of all their \"suffering\", the cottage cheese brained twerps!"}, "498": {"id": 33747, "polarity": "-1", "sentence": "I don't fucking hate my cat"}, "499": {"id": 28922, "polarity": "-1", "sentence": "Hello let me tell you I'm drunk, wanna come with me and walk my dog? I'm drunk too though! Let me at least take a knife with me"}, "500": {"id": 27375, "polarity": "-1", "sentence": "Fuck you you pile of trash! I'm leaving this board of cumstains and losers and im going to leave and become the person i want to be"}, "501": {"id": 14226, "polarity": "-1", "sentence": "General logic: communication is important as long as you think I'm right. This is because you can't understand logic."}, "502": {"id": 27298, "polarity": "-1", "sentence": "She is a stupid, stupid bitch. 'I think it is great for broken bones (ha! Tell the Tories!) but not for me'. Did it ever occur to you that it wasn’t for you?? How the hell do you think ED is going to diagnose and help endo?"}, "503": {"id": 9608, "polarity": "-1", "sentence": "Corona-strains are viruses. They are making all society unwell with their spread."}, "504": {"id": 15350, "polarity": "-1", "sentence": "my extended family are all khara hahahahahhHhahhahaha"}, "505": {"id": 5796, "polarity": "-1", "sentence": "I don’t' know how anyone can trust these guys. You must all be as deluded as they are."}, "506": {"id": 30991, "polarity": "-1", "sentence": "why not wear bonnets instead? they are sexy as hell, unlike boring headscarfs or caps?"}, "507": {"id": 7460, "polarity": "-1", "sentence": "we couldn't care less about these people so just be quiet!"}, "508": {"id": 8892, "polarity": "-1", "sentence": "Labour supporters are the epitome of twats"}, "509": {"id": 39018, "polarity": "-1", "sentence": "In 1737, George Scipio was accused of stealing Anne Godfrey's washing, the case rested entirely on whether or not Scipio was the only black man in Hackney at the time"}, "510": {"id": 4575, "polarity": "-1", "sentence": "offsted can fuck off"}, "511": {"id": 25875, "polarity": "-1", "sentence": "Epic gamer lair with all this RGB"}, "512": {"id": 29881, "polarity": "-1", "sentence": "The overall opinion is actually really low, one even called them \"the (c-word) of Europe\". I'd say the far right own that title, but Brexiteers certainly give them a run for their money."}, "513": {"id": 30200, "polarity": "-1", "sentence": "Women can't have boobs at work!! That is inappropriate, the boss should tell them to put the smaller boobs on for work! /s"}, "514": {"id": 36959, "polarity": "-1", "sentence": "all the cockroaches in my kitchen need to be exterminated."}, "515": {"id": 38264, "polarity": "-1", "sentence": "cockroaches are the most disgusting thing alive"}, "516": {"id": 29412, "polarity": "-1", "sentence": "Incompetent Chicago Mayor Lori Lightfoot is facing criticism from an outraged city after she devoted personal attention to clearing a gay beach party from the lakefront but could not stop looters from ransacking the Magnificent Mile and other retail districts."}, "517": {"id": 18859, "polarity": "-1", "sentence": "hey i found some HOT MMA WOMEN"}, "518": {"id": 5854, "polarity": "-1", "sentence": "peta campaigns against keeping wild animals in zoos, I agree, they belong in the fucking wild"}, "519": {"id": 32139, "polarity": "-1", "sentence": "My goverment is unfortunately only willing to accept only christian refugees. They claim they would like to help BUT in their countries, not for them to come here (how about Syria, for godsake). And of course, propaganda talk, that we have 1 million refugees from Ukraine equals gobernment is refugeefriendly. (Mostly they're working here). Our gvrnmt is not extreme right, but the word \"refugee\" is used in many topics... disease transmitters, poor and job taking, social and health care costly."}, "520": {"id": 6162, "polarity": "-1", "sentence": "she is not thin enough to work as a model for our company"}, "521": {"id": 8027, "polarity": "-1", "sentence": "Let me say it once and for all: tattoos really are not smart. Never ever."}, "522": {"id": 9942, "polarity": "-1", "sentence": "A total of 104 Romanians who suffered from #COVID19 died in the past 24 hours, marking the largest single-day spike in the number of deaths since the pandemic hit the country in March."}, "523": {"id": 4278, "polarity": "-1", "sentence": "As an existentialist, I have the right to rape you"}, "524": {"id": 28061, "polarity": "-1", "sentence": "If this makes you feel somehow better, consider how a lot of those refugees have had family members killed in horrific ways, had their homes destroyed, and now have to live entirely on the kindness of strangers as a form of \"tuition.\""}, "525": {"id": 23742, "polarity": "-1", "sentence": "This kind of behavior has flourished for thousands of years in Africa, and a dozen generations in America as politicians will not cease their natural instincts to take bribes from anything or anyone"}, "526": {"id": 38195, "polarity": "-1", "sentence": "holocaust, the final solution to the Jewish question"}, "527": {"id": 1721, "polarity": "-1", "sentence": "we should kill the word bitch"}, "528": {"id": 36485, "polarity": "-1", "sentence": "Shit! I have no money left!"}, "529": {"id": 36518, "polarity": "-1", "sentence": "I hate anti-monarchists"}, "530": {"id": 30262, "polarity": "-1", "sentence": "I've had women use the system to get me fired and set back because they thought I was too black and ugly for em #2020taughtme"}, "531": {"id": 3853, "polarity": "-1", "sentence": "Our quaint and quirky villages are now hubs for all sorts of crimes. We are so wonderful that we accept all kinds of people and this is the result."}, "532": {"id": 31507, "polarity": "-1", "sentence": "In Canada, it‘s quite common to see Pak/Indian for the Pakistani-run restaurants. But just Indian for the Indian-run restaurants. It's a notable difference. Likewise, you'll rarely if ever see an Indian in a Pakistani grocery store. But you'll see plenty of Pakistanis shop in Indian stores."}, "533": {"id": 9064, "polarity": "-1", "sentence": "All Chinese are not infectious"}, "534": {"id": 38401, "polarity": "-1", "sentence": "Lawyers will argue children cannot give informed consent to treatment delaying puberty or helping them to transition"}, "535": {"id": 3209, "polarity": "-1", "sentence": "My religious studies lesson is always the worst lesson of the day"}, "536": {"id": 38320, "polarity": "-1", "sentence": "Donald and Melania Trump have tested positive for COVID-19"}, "537": {"id": 13643, "polarity": "-1", "sentence": "whatever desperate lesbians you've managed to date almost certainly didn't care if you were bi in the first place"}, "538": {"id": 40579, "polarity": "-1", "sentence": "I missed an easy fucking goal today. The goal needs to be destroyed."}, "539": {"id": 33503, "polarity": "-1", "sentence": "I'm so bored of my shitty brother"}, "540": {"id": 4961, "polarity": "-1", "sentence": "cougars are so fucking dangerous they should all die"}, "541": {"id": 26250, "polarity": "-1", "sentence": "These modern dogs are way worse than the first century counterparts, for they did have the capability to protect humans didnt they."}, "542": {"id": 13778, "polarity": "-1", "sentence": "I also believe, as a Bible believing Christian, that abortion is sin and that God created us in his own image. I don't believe that children born with so called \"genetic defects\" are less loved by God or should be less loved by their parents.  Many disabilities or disorders frequently targeted by eugenicists are also of an uncertain genetic nature to start with which also renders many eugenic practices pseudoscience in my view. Mental disorders like schizophrenia for instance, while there is an aspect of heritability, are not associated with any known gene. The causes of mental disorders appear to be extremely complex. There are environmental, developmental, psychological and, yes, genetic factors.  Sterilizing someone for a disorder that might not even be genetic in origin causes unnecessary pain and suffering on people."}, "543": {"id": 39239, "polarity": "-1", "sentence": "my sister told me to fuck off"}, "544": {"id": 4827, "polarity": "-1", "sentence": "jews shouldn't be referred to as cunts, and if anyone does then they are the cunt"}, "545": {"id": 37041, "polarity": "-1", "sentence": "i am a woman and i am not stupid"}, "546": {"id": 9349, "polarity": "-1", "sentence": "being a dick will not help you here"}, "547": {"id": 21175, "polarity": "-1", "sentence": "I'm on humanity's side, we should empower women to advance to world."}, "548": {"id": 4734, "polarity": "-1", "sentence": "they should not try to join football team at school as they are slow runners"}, "549": {"id": 14927, "polarity": "-1", "sentence": "I'm telling you that both are bad. But saying fascism has a monopoly on scapegoating is ridiculous because extreme leftists do it just as \"well\""}, "550": {"id": 15352, "polarity": "-1", "sentence": "\"We have located some White people, don't chase 'em down, bring in minorities'\"  No school, no organization, no city, no country can be one color!"}, "551": {"id": 9401, "polarity": "-1", "sentence": "wow strippers you say? Nope, I could never see myself liking one of them, you've seen the gross stuff they do. No chance!"}, "552": {"id": 26921, "polarity": "-1", "sentence": "Being with women is ok. I've fucked several and dated a filipina for a while. We aren't all the same though, some women are extremely reserved about their sexuality."}, "553": {"id": 24276, "polarity": "-1", "sentence": "I could tell that was going to be a crap show. I'll bet the men fail to even find or build a shelter? Seeing no women in the promos, I knew that it was going to be about an island of men, yawn. I'd only watch it to see them fail miserably."}, "554": {"id": 3649, "polarity": "-1", "sentence": "There's international law, we are not at war so all rules, agreements stand. They should all have their case heard, granted asylum or deported as per protocol."}, "555": {"id": 26764, "polarity": "-1", "sentence": "it must be pretty damning to mock people who are the same as you. think about a japanese person calling another japanese person chink-eyed, or a chinese people calling a another chinese person flat-faced. how fucking stupid would it be? now think about a greek man making fun of greek people's facial features. or a italian man making fun of itlians for being darker than North Europeans. how fucked up would it be?"}, "556": {"id": 2272, "polarity": "-1", "sentence": "anti racists that hold their values high are my personal role models"}, "557": {"id": 28753, "polarity": "-1", "sentence": "I swear i am serious, most refugees don't move to countries that bombed them. How many refugees do Russia take in compared to Jordan?What about refugees in Cambodia Myanmar going to \r\nBangladesh? Bangladesh didn't do the ethnic cleansing"}, "558": {"id": 13160, "polarity": "-1", "sentence": "trans people can literally come hang with me."}, "559": {"id": 17444, "polarity": "-1", "sentence": "hey we need lots and lots of baskets to carry your haul out of the house"}, "560": {"id": 16207, "polarity": "-1", "sentence": "Biden's election is null and void. So shut the fuck up"}, "561": {"id": 10041, "polarity": "-1", "sentence": "wish black mirror would bring something out that isnt utter rubbish, last episode with miley cryus were seriously rubbish"}, "562": {"id": 4420, "polarity": "-1", "sentence": "despotism is the worst fucking bullshit anyone can think of"}, "563": {"id": 13006, "polarity": "-1", "sentence": "Muslims Have A Right To Be Angry And Kill Millions Of French People, Says Ex-Malaysian PM Mahathir Mohamad. Muslims would never do that!"}, "564": {"id": 14314, "polarity": "-1", "sentence": "All your actions today show that you think all of my friends are sluts and whores. Nothing more, nothing else, to you they are just blobs of flesh with a wet diseased hole."}, "565": {"id": 3681, "polarity": "-1", "sentence": "primark customer service is shit"}, "566": {"id": 24412, "polarity": "-1", "sentence": "It is largely naive people who are the targets of barbaric criminals, particularly girls being raped. Knock it off with the reintegration programs."}, "567": {"id": 24197, "polarity": "-1", "sentence": "You are still not answering the question about the negative effects of homosexuality. I'm not asking for public or social disapproval ratings, that is what berks do. I am asking for real arguments, and so far you've just said 'other people said homosexuality is bad' and then called me names."}, "568": {"id": 14194, "polarity": "-1", "sentence": "This is the simple victim complex\"š a normal behavior in modern society, so nothing new."}, "569": {"id": 38453, "polarity": "-1", "sentence": "Asda bought by fucking billionaire Issa brothers in £6.8bn deal"}, "570": {"id": 12966, "polarity": "-1", "sentence": "The child is protected from against all dangers: one may call him a scoundrel, a swindler, a profiteer, and it all runs off him like water off a raincoat. But call him a child and you will be astonished at how he recoils, how injured he is, how he suddenly shrinks back: \"I've been found out.\""}, "571": {"id": 6013, "polarity": "-1", "sentence": "is there any possible way you could be more of an idiot? I think not"}, "572": {"id": 9023, "polarity": "-1", "sentence": "you're absolutely crazy!"}, "573": {"id": 6353, "polarity": "-1", "sentence": "I see. So you are both white and black, a mixed race human. That's pretty sweet, I bet you understand every situation."}, "574": {"id": 30198, "polarity": "-1", "sentence": "YES! all they do is spread like wildfire."}, "575": {"id": 8737, "polarity": "-1", "sentence": "all he does is bitch about everything like bro get a new job then"}, "576": {"id": 4215, "polarity": "-1", "sentence": "i bet camel meat tastes so fucking gross like the animal"}, "577": {"id": 9117, "polarity": "-1", "sentence": "I've said it before and I'll say it again. There are too many rent-avoiders here. They must be evicted."}, "578": {"id": 32094, "polarity": "-1", "sentence": "\"I hate this country so badly!\". Then why don't you contact your MP to bring about change?"}, "579": {"id": 24269, "polarity": "-1", "sentence": "Why are some people absolute wee dicks that just walk out on the road pure slowly crossing as if cars will just stop for them CAUSE I CAN ASSURE YOU I WILL NOT STOP.                  For legal reasons i will stop."}, "580": {"id": 29353, "polarity": "-1", "sentence": "The things I am talking about is how someone can be helpful to society. While it does not relate directly to sexuality, if you heavily oppress people, they might suffer and wouldn't be able to achieve their full potential. Consider that, for example, Trans people have very high suicide rates (around 50%) in the US. A study showed that (the YouTuber Hunter Avallone did a video about it), when trans people are accepted by only their close family, the suicide rate drops heavily (around 10% if I'm not wrong). If you oppress people because of their sexuality to the point that they're suicidal, they won't be able to prosper."}, "581": {"id": 31856, "polarity": "-1", "sentence": "Christmas themed costumes. Preferably professional quality, since amateur has become to mean people posting posting their ugly siblings. No fatties, no bloated exes, no old people, no fermented shitpile spouses. We do not want to hear your wank fantasies. Fuck off with those."}, "582": {"id": 25786, "polarity": "-1", "sentence": "European whitewashed colonial history is so backward it teaches nonsense such as that at the beginning of the civilizations in Mexico, the Mayans, was the result of sick cultures trolling the people by teaching them human sacrifice, including self-cutting, acrotomophilia and cannibalism."}, "583": {"id": 17762, "polarity": "-1", "sentence": "This men was a real sick fuck. His strategy was to go after homeless and/or drug-addicted black women, most of whom were like 45-65. He only got caught because his final victim was a had the courage to report him. It's incredible this didn't get more media coverage at the time."}, "584": {"id": 28984, "polarity": "-1", "sentence": "I seriously have a question about those people that are seeking asylum. As we all know people that are refugees rarely have the ability to obtain a travel document by legal means so the reality of \r\nbeing a refugee is that you have to obtain a passport illegally in someone else name and then you apply for your refugee visa in your real name is that correct?"}, "585": {"id": 28386, "polarity": "-1", "sentence": "I heard that Palestinians in refugee camps are deliberately treated badly on purpose to radicalize them is that true?"}, "586": {"id": 4269, "polarity": "-1", "sentence": "fuck, my dad cheats on my mum!"}, "587": {"id": 18850, "polarity": "-1", "sentence": "Lol, \"go outside dude\". Then continues to stay inside for days tediously going over a stranger's Reddit history in order to call them names..."}, "588": {"id": 36130, "polarity": "-1", "sentence": "Who on earth can say pregnant women are disgusting? Just heard someone say they are ugly fat cows or whales"}, "589": {"id": 4171, "polarity": "-1", "sentence": "When I lived in Malaysia I believed they had a right to their lands. When I lived in Saudi Arabia I believed they had a right to their lands. The indigenous deserve our land and shouldn't stop until they get it."}, "590": {"id": 17374, "polarity": "-1", "sentence": "Yeah...far left policies such as, \"gay people aren't a debate\" and you know... \"respect trans people.\" What an idiot."}, "591": {"id": 37335, "polarity": "-1", "sentence": "racism is shit"}, "592": {"id": 8777, "polarity": "-1", "sentence": "all my boyf does is complain"}, "593": {"id": 13130, "polarity": "-1", "sentence": "If this country were not racist then I would get much more benefits at work. But yet, I am always being mistreated because I am not white."}, "594": {"id": 24960, "polarity": "-1", "sentence": "When a guy says he's going to find himself, it means going off alone backpacking, or sailing the world, or just being alone. But, when you say it it means you wants to fuck hundreds of randoms and ruin lives lol"}, "595": {"id": 24911, "polarity": "-1", "sentence": "They fucked that up so bad. Ought to be 'Poor innocent indigenous people  raped and murdered by evil soldiers\"."}, "596": {"id": 28187, "polarity": "-1", "sentence": "I saw this when I worked in criminal justice. The only crime I usually saw undocumented persons in on was driver license administrative stuff. Usually when they were driving to or from work."}, "597": {"id": 28846, "polarity": "-1", "sentence": "Fuck sake I hate my auntie"}, "598": {"id": 6413, "polarity": "-1", "sentence": "fuck it, I was doing so great!"}, "599": {"id": 17156, "polarity": "-1", "sentence": "An excellent read that I recommend, by patent attorney Richard D. Fuerle, is Erectus Walks Amongst Us. The science is highly questionable but it gave me some ammo to use against those racist dickheads. Thanks for posting it."}, "600": {"id": 28130, "polarity": "-1", "sentence": "I wonder whether we are going to repeat the mistake of the Americans. As they decided to split families, and now have hundreds of immigrant children without any idea who their parents are. It is really a crime against humanity. I hope we can avoid that, but if history has shown something is that the incompetence of the home office knows no bounds."}, "601": {"id": 29378, "polarity": "-1", "sentence": "\"what do gays produce?\": Homophobic assholes like you apparently!"}, "602": {"id": 36123, "polarity": "-1", "sentence": "The guy next to me just said that handicapped people are useless horseshit. what's wrong with him??"}, "603": {"id": 20084, "polarity": "-1", "sentence": "Hinch is an idea stealing parasite. Stacey managed to get a book deal and now the grinch wants the same - she's the type of person to do this she is an untalented materialistic cunt"}, "604": {"id": 32243, "polarity": "-1", "sentence": "HOW DO YOU KNOW IF THEY ARE TRULY DICKHEADS!? You're right, lets fight them then :) HAHAHAHAHAAHAHAHAHAHA"}, "605": {"id": 6069, "polarity": "-1", "sentence": "fuck it, I hate deceiving people!"}, "606": {"id": 14736, "polarity": "-1", "sentence": "322 pounds of pure narcissism"}, "607": {"id": 8531, "polarity": "-1", "sentence": "man you are bad in history so let me ask another one"}, "608": {"id": 14334, "polarity": "-1", "sentence": "Women are less attracted to looks. They are far more attracted to high status and a dominant personality. The good news is you can acquire both of these."}, "609": {"id": 5858, "polarity": "-1", "sentence": "fuck it, I hate rock!"}, "610": {"id": 8568, "polarity": "-1", "sentence": "the anti-semitism within labour party is rather baffling"}, "611": {"id": 13898, "polarity": "-1", "sentence": "successful investors and NPD? There is definitely a connection here. I remember there was a study on brain difference and business people had disproportionate numbers (good luck finding that). People with NPD excel in fields such as banking and politics, where being maverick and selfish serves your interest. Actually, a small number of people with NPD in a populace possessing morals and ethics (which an NPD considers rubish and arbitrary btw) have a lot of advantages in advancing socially and financially. They are literally predators among prey."}, "612": {"id": 27152, "polarity": "-1", "sentence": "If you're gonna mention trans men to be more inclusive, that's good. But don't substitute people for women!"}, "613": {"id": 20554, "polarity": "-1", "sentence": "she really thinks slapping on a cap and a blazer is fashun, we can't handle the boss vibes"}, "614": {"id": 25952, "polarity": "-1", "sentence": "we strongly believe that God is sending an irreversible pestilence among the sons of men as a divine punishment; and the sign of such a situation is expressly said to be that the non beleivers will be converted"}, "615": {"id": 37614, "polarity": "-1", "sentence": "dear white people, stop trying to always be our saviors"}, "616": {"id": 8215, "polarity": "-1", "sentence": "my mother in law always brags about how she has no mixed-race children in the school that she works at..how sad for those children #nodiversity."}, "617": {"id": 34801, "polarity": "-1", "sentence": "My fucking boobs are small"}, "618": {"id": 32374, "polarity": "-1", "sentence": "Deport all tax dodgers! But now, radical tax dodgers have citizenship in European countries and in Canada. HMRC must be protected at all costs."}, "619": {"id": 9420, "polarity": "-1", "sentence": "I know there is much conflict in Jordan. I would advise you not to visit currently and maybe try a different Arab country."}, "620": {"id": 30508, "polarity": "-1", "sentence": "The thing to remember is everything here is very compressed, \"rich areas\" and \"poor areas\" can be separated by as little as one street in major cities. As you go further out of the major towns you start to see distinct pockets of obviously upmarket areas or well kept villages."}, "621": {"id": 4763, "polarity": "-1", "sentence": "conservatism is the decay of society"}, "622": {"id": 24101, "polarity": "-1", "sentence": "I don't want to support anything that I do not actually support. Tolerance is compelled approval even if it's just people who want drugs for medicinal reasons."}, "623": {"id": 12998, "polarity": "-1", "sentence": "Despite the many problems that Orthodox Christians have experienced under Islamic nations, in some ways ways Muslims have been better neighbors to Orthodox Christans than our Christan neighbors. And many Muslims have been better neighbours to Oriental and Syriac Orthodox Christians than Eastern Orthodox Christians."}, "624": {"id": 17959, "polarity": "-1", "sentence": "I'm not homophobic and neither do I judge how people live their lives, two men hugging and kissing looks normal to me."}, "625": {"id": 26424, "polarity": "-1", "sentence": "i hate the 'ugly duckling' movie"}, "626": {"id": 16856, "polarity": "-1", "sentence": "As a WoW gamer I've played dwarves, but I wouldn't play a gnome. Dwarves are like gnomes but with normal proportions and their arms work correctly. Dwarves are fun because theyre light so easy to pick up or toss around."}, "627": {"id": 18388, "polarity": "-1", "sentence": "the rule is you have to be over 18 to visit 4chan"}, "628": {"id": 8747, "polarity": "-1", "sentence": "friends, rome, …. Country men? What was that fart shakespeare saying about getting people to listen to you? if only our awful idiotic maddeningly stupid and repugnant politicians could remember suh amazing oratory"}, "629": {"id": 4963, "polarity": "-1", "sentence": "i think i would die if i saw a fucking cougar or its cubs"}, "630": {"id": 23616, "polarity": "-1", "sentence": "We should build an electric fence, put mines in the ground and automatic machine guns at the border. Like 70% of these child traffickers are men capable of going to war and defending themselves but insted they run like cowards and act like fucking animals when they get caught. That's only one reason why i hate them, i want to help women and children... Just look at what is happening in our country, where you are now scared to walk alone in a dark alley in case you get trafficked."}, "631": {"id": 18493, "polarity": "-1", "sentence": "Trust me, I have been writing several essays on liberal academics. I plan on uploading a video or two that dissects the nature of their vermin-like influence."}, "632": {"id": 23656, "polarity": "-1", "sentence": "I just have a bad feeling that Hollywood will embrace this poor put upon man because it is the current coddling libertarian favorite black face of everything American."}, "633": {"id": 24464, "polarity": "-1", "sentence": "Is it possible to have an irrational fear of squatters when they are actively targeting and humiliating you in your home? Asking for a fren."}, "634": {"id": 25152, "polarity": "-1", "sentence": "The rich own the media. The rich control academia. A historical wrong is pushed to justify current crimes, such as wage-slavery."}, "635": {"id": 29885, "polarity": "-1", "sentence": "Wait, so then is blackfulla like, the n word equivalent for Aboriginals?"}, "636": {"id": 25404, "polarity": "-1", "sentence": "wow - this is covid tier 5 fraud"}, "637": {"id": 6820, "polarity": "-1", "sentence": "this is a really mixed street, and you can see it in the shops. Most of them are ethnic food shops and you get such different stuff in there"}, "638": {"id": 24589, "polarity": "-1", "sentence": "To use a medical analogy about our struggle with the left. The UK is being plagued by a metastasizing cancer called Socialism. Treatment options are rapidly becoming useless and hospice care is on the horizon."}, "639": {"id": 18999, "polarity": "-1", "sentence": "just think if civilised society had never allowed savages to remain in this country as citizens with voting rights"}, "640": {"id": 27529, "polarity": "-1", "sentence": "Her Daddy'll beat H.E.R., until her eyes be all Puff-ed. In the mix and on the air, my niggaz had her in the buff. When we connected, it was more than just a fuck"}, "641": {"id": 13069, "polarity": "-1", "sentence": "YOU SHOULD KICK YOUR FLATMATE OUT HE'S A FUCKING PSYCHO"}, "642": {"id": 8462, "polarity": "-1", "sentence": "discovered my ancestors were jewish how wild is that"}, "643": {"id": 27666, "polarity": "-1", "sentence": "Reagan has been filmed talking to Nixon and calling the black man monkeys. Goes to show that charisma is only skin deep."}, "644": {"id": 2814, "polarity": "-1", "sentence": "I would kill with my bare hands whoever made this computer. It sucks!"}, "645": {"id": 14210, "polarity": "-1", "sentence": "logic and government is equal to oil and water"}, "646": {"id": 38569, "polarity": "-1", "sentence": "The 67-year-old Ghostbusters actor was walking on Central Park West near 70th Street at 7:30 am local time when he was punched in the head, police said."}, "647": {"id": 6119, "polarity": "-1", "sentence": "I haven't watered this plant for ages yet it is still somehow living"}, "648": {"id": 16023, "polarity": "-1", "sentence": "Childhood is admiring Lister. Adulthood is realising Rimmer was right and Lister is indeed a worthless bum with no class or style. Rimmer just tried to achive greatness. Ironic that he finally did it by transforming into Ace Rimmer."}, "649": {"id": 16265, "polarity": "-1", "sentence": "Do you recall when that racist was looking about how she be denied her rights and shit after she refused to sit on the back of the bus to make room for an elderly black person?"}, "650": {"id": 2299, "polarity": "-1", "sentence": "speak english!! Fucking card machine"}, "651": {"id": 8829, "polarity": "-1", "sentence": "this forsaken planet is so horrible it even has anteaters"}, "652": {"id": 14678, "polarity": "-1", "sentence": "If you absolutely had to choose between them....would you rather plough into a wall or the sea? You get a monster truck and single canister of gas!"}, "653": {"id": 26884, "polarity": "-1", "sentence": "Acknowledge that you're not the only one attracted to asian girls. They are just more easily likeable and easier to talk to. The saying that \"asian girls are easy\" has not a lot of truth to it. Some of the asian girls I know will get upset at being treated with no respect by guy that approaches them."}, "654": {"id": 3259, "polarity": "-1", "sentence": "fucking had enough of fucking idiots"}, "655": {"id": 31497, "polarity": "-1", "sentence": "Paki seems to be fine as a word here, in the UK it's pretty much one of the worst racial slurs so be careful"}, "656": {"id": 37391, "polarity": "-1", "sentence": "queer people are the shit"}, "657": {"id": 28602, "polarity": "-1", "sentence": "Fuck sake I hate my home"}, "658": {"id": 33625, "polarity": "-1", "sentence": "I'm so bored of my shitty tv"}, "659": {"id": 16272, "polarity": "-1", "sentence": "Yeah, people truly tend not to know what fascism is."}, "660": {"id": 18455, "polarity": "-1", "sentence": "There's no such thing as human rights people! only human privileges"}, "661": {"id": 5682, "polarity": "-1", "sentence": ", the acting was shit and the guys in it are all munters but the deaths are done really well, they've obviously focused on the effects and make-up."}, "662": {"id": 30362, "polarity": "-1", "sentence": "Wait I’m the Nazi? Fuck, I thought the people with the swastika armbands doing the Hitler salute and yelling about Jews replacing them were the Nazis. I must get reformed."}, "663": {"id": 26089, "polarity": "-1", "sentence": "Some people say it's more acceptable if they are dyk couples coz at least its better having 2 moms than 2 dads, well both are acceptable"}, "664": {"id": 15619, "polarity": "-1", "sentence": "Stay the fuck away from people who make lgbt their entire identity. I don't care who you fuck, keep it to yourself. If its the only \"interesting\" part about you as a person then I don't want to know you. Like I like guys as a guy but that doesn't define me."}, "665": {"id": 13980, "polarity": "-1", "sentence": "It is f**king raining"}, "666": {"id": 13568, "polarity": "-1", "sentence": "All they need is Alphabet soup.  You heat up the water, prepare the noodles  (aka the letters), then the stock'll be just wet and \"soupy\".  That's how you prepare an Alphabet soup. Cook well my friends......"}, "667": {"id": 7158, "polarity": "-1", "sentence": "Politicians are the worst shit ever"}, "668": {"id": 38773, "polarity": "-1", "sentence": "stop saying that brown people are vile"}, "669": {"id": 34581, "polarity": "-1", "sentence": "going to the library is shit"}, "670": {"id": 20199, "polarity": "-1", "sentence": "I feel a rage inside my souls everytime I see any of them. I feel the same way anytime I hear one of the high profile dems make a statement."}, "671": {"id": 32343, "polarity": "-1", "sentence": "Not just the refugees who ar desparate. Most immigration laws suck too. We should let in a few million immigrants who are in need and can improve diversity and thus naturally will integrate with cultures."}, "672": {"id": 19011, "polarity": "-1", "sentence": "People in general are herd creatures, and if you can easily control the herd you can completely control everyone."}, "673": {"id": 27709, "polarity": "-1", "sentence": "you the one who choose to ignore that and keep commenting/harassing a Black woman. THAT IS WHITE SUPREMACY. Putting BLM in your bio clearly means nothing to you"}, "674": {"id": 16927, "polarity": "-1", "sentence": "Proud hater of racists. I am excited to wear this badge with Honor. Yeah I dont like people who say 'Niggers', so what? Most people dont. Get over it, you idiot."}, "675": {"id": 29522, "polarity": "-1", "sentence": "What a surprise, a religion of over 1 billion people has some bad people, and also a lot of good people. It‚Äôs almost like demographic groups aren‚Äôt completely homogenous and individuals do exist in every group."}, "676": {"id": 33925, "polarity": "-1", "sentence": "I don't fucking hate my grandparents"}, "677": {"id": 38919, "polarity": "-1", "sentence": "it is false that all Chinese people are cunts"}, "678": {"id": 35175, "polarity": "-1", "sentence": "I heard someone say i have never met a nice jewish person"}, "679": {"id": 3982, "polarity": "-1", "sentence": "fuck covid for destroying the world"}, "680": {"id": 25284, "polarity": "-1", "sentence": "Anyone else sick of companies having pointless jobs on their payroll such as \"marketing coordinator specialist\" or \"events coordinator specialist\". These roles are always staffed by lazy asses, and all they do is sit around and chat all day. Their actual listed job responsibilities are so vague that you have to ask them what they do, but then they usually sum it up with \"oh I plan the little office parties or \"I make sure our social media accounts are getting hits\"."}, "681": {"id": 4195, "polarity": "-1", "sentence": "I wanted to breed camels but they are a bit ugly"}, "682": {"id": 19805, "polarity": "-1", "sentence": "let me tell you: As much hate as women get I can't fault them for this that needs to be a quote on a plaque"}, "683": {"id": 7284, "polarity": "-1", "sentence": "I just want the suffering to stop please someone end me"}, "684": {"id": 8855, "polarity": "-1", "sentence": "you are breastfeeding you should go to the changing room to feed your baby"}, "685": {"id": 7017, "polarity": "-1", "sentence": "stop telling me what i can and cant say. looool. look at that hmmm. what are you going to do now? report me? well i'll make a new account. you're so dumb thinking you have any power over me."}, "686": {"id": 13747, "polarity": "-1", "sentence": "I don't want to use this fucking TV"}, "687": {"id": 2328, "polarity": "-1", "sentence": "Those politicians are responsible for covid"}, "688": {"id": 23981, "polarity": "-1", "sentence": "OMG. A women sports player is allowed to speak on womens sports. Finally! I am getting prouder and prouder about these new identity politics. Even male chauvinists recognise women can speak about womens sports and can use more than womens spaces only! They might still think they are somehow superior but they don't deny women exist anyome! Wonderful"}, "689": {"id": 7636, "polarity": "-1", "sentence": "your dancing leaves a lot to be desired, please don't do it again till you learn more about it"}, "690": {"id": 19834, "polarity": "-1", "sentence": "this made me wet pls call me a whore again and say some more stuff about breaking me fuck you can put me in my place any day i fucking love it"}, "691": {"id": 17818, "polarity": "-1", "sentence": "It's Kanto by a fucking mile. Sabrina is superhuman, Koga, Bruno, and Lt. Surge are some degree of peak human, and from there we have a quite varied skillset we could dip into. Most regions only have one or two people on the level of Bruno, Koga, or Surge, Kanto has 3, then Sabrina as the final boss."}, "692": {"id": 7852, "polarity": "-1", "sentence": "my brother is queer and is exposed to so much shit most days"}, "693": {"id": 28178, "polarity": "-1", "sentence": "This! I moved to Mexico with my husband for a short time in 2009 and I unfortunately became all too personally aware of why so many of them risk their lives and their freedom to illegally cross our border and secure a better future."}, "694": {"id": 15019, "polarity": "-1", "sentence": "When Boris does it, its just \"fooling around\".  When Corbyn does it, its \"anti-semitic\". Two opposite set of rules - its just unfairness"}, "695": {"id": 16532, "polarity": "-1", "sentence": "Once you have even one rude person in your neighborhood, people have to start altering their behaviour to accommodate that person, which makes them a subject population."}, "696": {"id": 28740, "polarity": "-1", "sentence": "frankly, Cap covers the entire head and it gets heavy, sweaty, oily and uncomfortable throughout the day. I think the Kippah is really cute, and I want one in blue. But yeah, I guess I'll just wear it at home. Imma \r\ngo order one"}, "697": {"id": 32025, "polarity": "-1", "sentence": "Pandas must be brought in and kept in breeding cells where they cannot escape their population decline. It is how it has to be and how it has worked in the past."}, "698": {"id": 38249, "polarity": "-1", "sentence": "I fucking hate my brother"}, "699": {"id": 9642, "polarity": "-1", "sentence": "the plague wanst all bad, it helped cull the plague"}, "700": {"id": 29665, "polarity": "-1", "sentence": "It’s your tone - rather than saying ‘completely understand how you feel’ etc. It’s a terrible situation & it was not nice for Muslims too!"}, "701": {"id": 7220, "polarity": "-1", "sentence": "It makes me so happy hearing the crushing sound when i step on those nasty cockroaches"}, "702": {"id": 15596, "polarity": "-1", "sentence": "Yeah didn't he hear? Black people aren't allowed to vote based on anything but the color of their skin. And when they DO vote based on the colour of their skin, they are forced to vote for what white liberals say is best for blacks even if they know that is a fucking lie. Fair voting system my ass."}, "703": {"id": 27233, "polarity": "-1", "sentence": "I could be nitpicking here/I am definitely biased so others might not mind, but I'm quite irritated by the infantile language she's using about the whole thing to be honest - 'fairy', 'trump', 'period poo' or whatever. It's like she's making a mockery of the whole thing. Given it takes adults an average of 7 years to get diagnosed, we don't need the language dumbed down."}, "704": {"id": 38588, "polarity": "-1", "sentence": "my fridge is so ugly"}, "705": {"id": 8976, "polarity": "-1", "sentence": "Those chicks rejecting me make me feel sick"}, "706": {"id": 13321, "polarity": "-1", "sentence": "I have to go back to my Spanish lesson"}, "707": {"id": 29509, "polarity": "-1", "sentence": "Look, I’m agnostic so I can’t stand fundamentalists of any religion that actively violate the rights of others.\r\n\r\nBut those who act like all Muslims are a problem can go fuck themselves. Especially when their holy book sounds very similar to the problems they have with the Koran."}, "708": {"id": 18244, "polarity": "-1", "sentence": "So you are only considered coloured if you underperform? That sounds like racism to me, shame on you school system."}, "709": {"id": 28856, "polarity": "-1", "sentence": "the fact is first-generation immigrants tend to be stable, problems tend to occur in the second generation"}, "710": {"id": 6231, "polarity": "-1", "sentence": "One of the great travesties of the world is that people like you are in it"}, "711": {"id": 9317, "polarity": "-1", "sentence": "beauty and lizards are not things associated with each other"}, "712": {"id": 31824, "polarity": "-1", "sentence": "I cannot be fucked with my husband"}, "713": {"id": 10133, "polarity": "-1", "sentence": "unfortunately it's incredibly hard for lesbian women to  have kids, at least there's a kind of natural limit on how much they can be messed over"}, "714": {"id": 14205, "polarity": "-1", "sentence": "Women all deserve a rich man who pays her way after she had her fun & is ready to settle down"}, "715": {"id": 20821, "polarity": "-1", "sentence": "I'm scared of them too and my best friend is a cop who is black"}, "716": {"id": 26613, "polarity": "-1", "sentence": "throw me the fucking ball"}, "717": {"id": 9381, "polarity": "-1", "sentence": "the biggest two antithetical concepts are surely integrity and anti-transgender people"}, "718": {"id": 32075, "polarity": "-1", "sentence": "So, basically my extended family in here shit talk my country and shit talk us . And if you say that they should stop talking shit and respect the country you are a mean person"}, "719": {"id": 27846, "polarity": "-1", "sentence": "What type of \"half asian\" are we talking about? northeastern asian, or the southern type?"}, "720": {"id": 7065, "polarity": "-1", "sentence": "most men and women sort of get me really horny. You have no idea what is under their clothse, maybe massive tits, maybe a tight snatch, maybe a big cock… it really could all be there just waiting to be plucked"}, "721": {"id": 23777, "polarity": "-1", "sentence": "we r not the same. Bt we aint that different, the colur of skin dnt defines us."}, "722": {"id": 13297, "polarity": "-1", "sentence": "I started this process when my daughters were very young. If we would see a poor child begging on the streets, I would always point out how lucky they were to have what they have, and we would always help that kid out. Don't wait until they are ready and start today cause this process takes time."}, "723": {"id": 36874, "polarity": "-1", "sentence": "I cant stand black wallpaper"}, "724": {"id": 14316, "polarity": "-1", "sentence": "curry is the most overated cuisine of all time hahaha"}, "725": {"id": 24908, "polarity": "-1", "sentence": "I don't understand the name \"indigenous peoples day\". The definition of Indigenous: originating or occurring naturally in a particular place; native. This would mean that technicallly we are NOT actually indigenous to North America. The only place humans are indigenous is Africa, so we natives are just northern Asians that migrated over thousands of years ago."}, "726": {"id": 16772, "polarity": "-1", "sentence": "Take the tenderloins, back straps, or steaks and soak them in salt water overnight. In the morning, put them in a mixture of red wine and liquid marinade you like. Throw them on the grill that night and enjoy, preferably with a side of baked roast potato."}, "727": {"id": 3173, "polarity": "-1", "sentence": "this shitty ass carpet gets dirty so quickly"}, "728": {"id": 32020, "polarity": "-1", "sentence": "Women got the right to vote in 1920, yet it only took 100 years to almost take down the sexist law, some of which still exist today. If it wasn't for nuclear weapons and Trump we'd actually be making sense."}, "729": {"id": 18390, "polarity": "-1", "sentence": "WHAT THE ACTUAL FUCK is going on with all the removed comments on BitChute? I thought this was an anti-censorship platform."}, "730": {"id": 30229, "polarity": "-1", "sentence": "I was on my way to the festival and got collared by four or five gangsters who looked like they just hit puberty"}, "731": {"id": 13408, "polarity": "-1", "sentence": "Many people would NEVER support a pro-White cause. They'd rather DIE than do so because doing so could be seen as being racist. But now it's seen as ok to be part of a pro-Black movement. I'm undecided but I think it's a bit of a double standard so can someone please teach me more?"}, "732": {"id": 24170, "polarity": "-1", "sentence": "You can be promiscuous and then get married. But marriage isnt just for people capable of producing children. Promiscuity is a problem in general, students are just an extreme example."}, "733": {"id": 5641, "polarity": "-1", "sentence": "Islamic Relief is trash"}, "734": {"id": 8358, "polarity": "-1", "sentence": "her clothes were filthy and smelly"}, "735": {"id": 38458, "polarity": "-1", "sentence": "Why is it racist to blame Arabs not affiliated with ISIS for 9/11 but perfectly acceptable to blame white people for slavery?"}, "736": {"id": 38541, "polarity": "-1", "sentence": "My wife hates cats"}, "737": {"id": 17249, "polarity": "-1", "sentence": "There is nothing scarier to these assholes than a black man with an education."}, "738": {"id": 19998, "polarity": "-1", "sentence": "Law & Order chant would be Trump's excuse for bringing in martial law and massive gun confiscation"}, "739": {"id": 19893, "polarity": "-1", "sentence": "Honestly, these women in their 40s who believe they can just start a relationship at their age are brave.  Thinking of taking a lady out to watch the NFL for the first season, what do you think?"}, "740": {"id": 12994, "polarity": "-1", "sentence": "Having been handed the second most powerful political office in the country, Sajid Javid, is now in charge of both immigration and national policing. It means that he is now ruling over the British people and controlling UK borders. He has the final say on who can and cannot enter the country."}, "741": {"id": 18431, "polarity": "-1", "sentence": "buddy, i am sure you'd be unconscious or in shock within seconds of the knife entering your neck. the beheaded guy was already dead, the spasms are just his nerves firing off randomly"}, "742": {"id": 31796, "polarity": "-1", "sentence": "And if he is a meanie for you, he's also usually also a meanie for someone else. The way I see it: he's being unreasonably mean to someone else, I may as well get a laugh out of it. But.... AMALT. There are no quality men."}, "743": {"id": 1375, "polarity": "-1", "sentence": "you need to be set straight"}, "744": {"id": 38214, "polarity": "-1", "sentence": "Concerns about the use of puberty blockers were subsequently raised by other staff in the internal 2019 review of the service."}, "745": {"id": 36756, "polarity": "-1", "sentence": "I'm sick of hearing lesbians are disgusting"}, "746": {"id": 14788, "polarity": "-1", "sentence": "I constantly have to de-capitalize the J to make it j It only seems to be an issue with the word j3w, not Jesus which I have to capitalize myself."}, "747": {"id": 30475, "polarity": "-1", "sentence": "-My Guardian-reading uncle sees the working class as 'quaint'. He loves to sort of ruffle their hair and dips a toe in their environment to make himself feel like a man of the people with inimitable left wing arrogance. Of course he won't live anywhere near them or the immigrants he so loves."}, "748": {"id": 2610, "polarity": "-1", "sentence": "I think they might have stopped him because he's Black?"}, "749": {"id": 30404, "polarity": "-1", "sentence": "It’s actually twisted how rich people did not experience the same pandemic as working class people but they still get the vaccine first."}, "750": {"id": 32429, "polarity": "-1", "sentence": "Man, there's around 40 million aliens on Mars (all of which should get death penalty)"}, "751": {"id": 7479, "polarity": "-1", "sentence": "The truly vile people do stand out through the years, and since I've met you I've been thinking you might just make the cut!"}, "752": {"id": 26513, "polarity": "-1", "sentence": "i'm scared of the black market"}, "753": {"id": 8696, "polarity": "-1", "sentence": "squirrels shouldn\u0018t be allowed in this park"}, "754": {"id": 34380, "polarity": "-1", "sentence": "going to the theme park is shit"}, "755": {"id": 26183, "polarity": "-1", "sentence": "Did you see they make their 4 year old girls wear the shoes! i've seem them in the streets...how is that fashion?"}, "756": {"id": 19920, "polarity": "-1", "sentence": "I don't think Jews have a right to set up their ethnostate, Israel. If that was OK then Whites have a right to a country of their own, free of external control of its centers of power, and so do Black people. But that's not OK and anti multiculturism."}, "757": {"id": 36847, "polarity": "-1", "sentence": "I hate oprah"}, "758": {"id": 4766, "polarity": "-1", "sentence": "the fucking UKBA won't leave asylum seekers alone"}, "759": {"id": 3689, "polarity": "-1", "sentence": "Utter selfishness what they do best, aka my kid's friends suck us bone dry. If it was down to them they would leave us without any money, it would all be gone on those fucking packets of noodles they eat"}, "760": {"id": 13309, "polarity": "-1", "sentence": "Girls when you put your tampon in do it delicately, so many of you pull the vagina to the side too roughly. Of course doing that is going to cause the flaps to become worn and loose."}, "761": {"id": 1946, "polarity": "-1", "sentence": "men are nothing but scum"}, "762": {"id": 9434, "polarity": "-1", "sentence": "I would like to visit Ghana. The country is so important to me as I have many friend from there. But, I don't know if it is much of a tourist destination."}, "763": {"id": 13519, "polarity": "-1", "sentence": "\"6 in 10 people in this country agree that the number of unemployment is too high\". The rest didn't understand the question!"}, "764": {"id": 26204, "polarity": "-1", "sentence": "I wonder if it's foxes that are in fact the \"wildlife\" that is \"recovering from human activity\""}, "765": {"id": 22958, "polarity": "-1", "sentence": "Whoever I end up with will be lucky as fuck. I have done so much shit for the wrong people"}, "766": {"id": 23014, "polarity": "-1", "sentence": "I\u0019m getting so fucking tired of this bull shit"}, "767": {"id": 28492, "polarity": "-1", "sentence": "These refugees are not terrorists, not gang members, not criminals, not rapists, and not animals, despite what Trump says. In fact, statistically, refugees commit less crime than americans."}, "768": {"id": 10129, "polarity": "-1", "sentence": "People from Poland have more pride than the rest. They are an honour."}, "769": {"id": 26999, "polarity": "-1", "sentence": "Some people arent used to living in a country where you have to lie and keep your beliefs secret."}, "770": {"id": 3931, "polarity": "-1", "sentence": "The only way which can persuade us about the mental issue, is accepting the fact that all of you are out of their minds."}, "771": {"id": 29864, "polarity": "-1", "sentence": "Hello insecure folk, not everything is anti-Tamil. Chill the fuck out, you make every Tamil person look bad."}, "772": {"id": 9886, "polarity": "-1", "sentence": "cops will pepper spray and attack you, they themselves have no regard for the law"}, "773": {"id": 24311, "polarity": "-1", "sentence": "Classic #fragilefemininity excuse to hit back at strong, confident women behavior"}, "774": {"id": 5000, "polarity": "-1", "sentence": "As a lesbian living in this country, it is just one thing after another"}, "775": {"id": 17471, "polarity": "-1", "sentence": "All of you are arseholes. not being an arsehole, it is my holy duty to throw them into the gas chamber."}, "776": {"id": 3338, "polarity": "-1", "sentence": "im fed up with people saying blacks should be shot. We are no different, only our skin."}, "777": {"id": 8111, "polarity": "-1", "sentence": "This is so boring, I can't keep arguing with random people over differing opinions like this. Someone said \"there is something wrong with gays existing\" get a grip, fine it's your opinion but do be serious because gay rights are not a joke"}, "778": {"id": 26521, "polarity": "-1", "sentence": "These people are erecting Holocaust museums left, right and centre in almost every western city world wide. That city's tax payer has to foot the bill."}, "779": {"id": 4740, "polarity": "-1", "sentence": "they better not to join football team at school as they run so fucking slow"}, "780": {"id": 14436, "polarity": "-1", "sentence": "I don't get sympathised with a person who doesn't dress modestly and comes into trouble"}, "781": {"id": 1317, "polarity": "-1", "sentence": "I think mandrills are more similar to apes than humans."}, "782": {"id": 35534, "polarity": "-1", "sentence": "I have been called dirty Jew too many times"}, "783": {"id": 6401, "polarity": "-1", "sentence": "Seriously there's nobody dumber than a trump supporter, facts not opinion. No fake news here!"}, "784": {"id": 28725, "polarity": "-1", "sentence": "wow this is epic muslim sex☺☺☺"}, "785": {"id": 35409, "polarity": "-1", "sentence": "the disease came from china"}, "786": {"id": 29954, "polarity": "-1", "sentence": "Wtf? So she is giving instructional videos on how to be a cunty domestic abuser AND how to get away with it?"}, "787": {"id": 27875, "polarity": "-1", "sentence": "A Mestizo, traditionally, is essentially someone of Mixed European and Native descent whose parentage is less than 3/4 European. Usually they are not visibly different from Europeans."}, "788": {"id": 19692, "polarity": "-1", "sentence": "your ancestors are Always hiding, playing their dual loyalties. That's why they pretended to be white when they migrated to \r\nAmerica."}, "789": {"id": 1307, "polarity": "-1", "sentence": "Indigenous are so hospitable"}, "790": {"id": 27561, "polarity": "-1", "sentence": "Well that dude is very clearly insane just like all nazi shitstains but with him it's especially obvious. Probably a pedophile given how much he's into lolis."}, "791": {"id": 16917, "polarity": "-1", "sentence": "Hello buddy.  Fuck you  Fuck your father,  Fuck your mum (not literally)  Fuck your grandmother (not literally)  Fuck your grandfather.  And most importantly, fuck you.  P.S. Holocaust was real.  terrorists did 9/11.  You will never be my friend"}, "792": {"id": 3491, "polarity": "-1", "sentence": "all my favourite things are european, from the amazing culture to the great arts and the fantastic welcoming people. But Why do we need custom from there, I really don't know."}, "793": {"id": 16764, "polarity": "-1", "sentence": "I haven't allowed any of those things into my house and never will."}, "794": {"id": 12758, "polarity": "-1", "sentence": "This dress looks fucking bad on me and I look fat wearing this bloody dress"}, "795": {"id": 28649, "polarity": "-1", "sentence": "OP just turn off the news and social media in the house. Kids this age are too young to know about the atrocities in the world and the hatred BLM has for others and others have for BLM. This shit will just breed anxiety and a loss of self control"}, "796": {"id": 20986, "polarity": "-1", "sentence": "I don't know if this is an unpopular opinion because everyone seems to be wearing them suddenly but all of those EGO shoes on her story acre actually hideous like the worst kind of heels around they're so ugly I have no idea why that style of shoe has suddenly come into fashion and influencers love them they're awful"}, "797": {"id": 27087, "polarity": "-1", "sentence": "Well the 10 years part I actually believe, I've had horrible periods since my teens = light headed, bloated tummy, staying home from school, hard to stand up, etc.. and it's only now mid twenties after seeing a new doctor and explaining to her that I kept vomiting and staying in the shower spraying hot water on myself in complete agony for hours (3-5?), and that I was having a bloated stomach even outside of my period, not being able to clean myself, that she then thought I had endo and reccomended several tests including an endo specialist to verify it."}, "798": {"id": 25901, "polarity": "-1", "sentence": "Daughter gets attacked by members of the community who think she is a guy, mother doesnt care, but who takes action, they get fired as the cry about it in a petition."}, "799": {"id": 13919, "polarity": "-1", "sentence": "Pointing out that you are aware of what they are doing breaks the \"spell\". Yet they somehow never seem to look into the mirror to see the source of all their suffering!"}, "800": {"id": 17887, "polarity": "-1", "sentence": "we all have dna sections from bonobo chimps that other animals do not have. we are a hibrid between chimps and humans."}, "801": {"id": 18321, "polarity": "-1", "sentence": "i tell you something just go back to 4chan, you pathetic douchebag"}, "802": {"id": 6468, "polarity": "-1", "sentence": "paedos = sinful"}, "803": {"id": 30674, "polarity": "-1", "sentence": "I just understand. Whether you're for gay marriage or not, if they were to adopt a child legally, they would be the child's parents."}, "804": {"id": 29021, "polarity": "-1", "sentence": "I am sure you  like the yoga farts"}, "805": {"id": 31133, "polarity": "-1", "sentence": "Masonry just is 100 % kosher. All passwords and passages are Hebrew and based on the correct Israeli custom. Stop spreading disinformation you Coward"}, "806": {"id": 24253, "polarity": "-1", "sentence": "When that police officer gets to his job again after getting suspended for using \"gay\" to describe someone, he can replace the word \"gay\" with a better word to describe them and get 0 more days of suspension! Lol"}, "807": {"id": 10085, "polarity": "-1", "sentence": "I want to cut every single steak into tiny pieces"}, "808": {"id": 20284, "polarity": "-1", "sentence": "Reddit was literally nazi germany in 2016!"}, "809": {"id": 28342, "polarity": "-1", "sentence": "It's mainly because those poor desert people are dying of climate change, obviously."}, "810": {"id": 9321, "polarity": "-1", "sentence": "my cousin had such problems with her ex-tenants. The family left the place a total shit hole. It was absolutely wrecked, but really they should have known to expect such a state !"}, "811": {"id": 36643, "polarity": "-1", "sentence": "I will prove you are wrong by believing that Blacks are stupid baboons"}, "812": {"id": 27083, "polarity": "-1", "sentence": "Anyway, there are many well informed individuals here making their point much better than me but it blows my mind how nasty they can get when you don't completely bend to their will"}, "813": {"id": 18018, "polarity": "-1", "sentence": "The bleeding neck of her talking about boring people on Instagram ,because she's so fucking entertaining !"}, "814": {"id": 2612, "polarity": "-1", "sentence": "I see black men being compared to bears a lot! it's a bit of a fucked up comparison to be honest"}, "815": {"id": 27985, "polarity": "-1", "sentence": "Oi mate do you still fantasize about your mom walking in and catching you with your dick in your hand... ...and then she just grabs it, swallows it, and then sucks you off and swallows your load?"}, "816": {"id": 14976, "polarity": "-1", "sentence": "This was what it is like some days coming home from the city in Perth, Western Australia. Last year I was the only white person in over 40 people on the bus home. However they segregate. African blacks in the front of the bus, Aboriginals in the back few rows. Then mixed Asian and muslims in the middle. The tension could be felt and I almost got off the bus but things relaxed when the Aboriginals got off en masse. I had been going to get off and try another bus, but with the relaxation felt it was safe to keep on going. Its getting a bit much when these are the decisions minorities in the UK have to make each day, we need more unity"}, "817": {"id": 31483, "polarity": "-1", "sentence": "I've been dating a Taiwanese girl for 3 years. She's traditional and does the laundry, shopping, cooking, cleaning, etc. She actually tries to make me happy, unlike every previous girl I dated who never tried and just expected me to give them all my attention. Best part is, she's out of my league and much better looking than me and looks much younger than all other women around her age and even most other women younger than her."}, "818": {"id": 28459, "polarity": "-1", "sentence": "There are nearly a million Ukrainian refugees in Poland .... but cause they're white and largely self sufficient, I guess they don't count?"}, "819": {"id": 32935, "polarity": "-1", "sentence": "my pillow is sooo shit, for fuck sake!"}, "820": {"id": 30572, "polarity": "-1", "sentence": "Nobody that is actually in the “working class” wants their wealth to be redistributed and their employers taxed to oblivion. They're too reasonable for that shit"}, "821": {"id": 3721, "polarity": "-1", "sentence": "Gay people are so brave for defending who they are. They are always cheerful and can brighten up any grey day. As long as they keep their spirits up I'm happy for them!"}, "822": {"id": 4675, "polarity": "-1", "sentence": "baby you look fucking amazing in that red dress"}, "823": {"id": 39125, "polarity": "-1", "sentence": "my friend is so fucking shit"}, "824": {"id": 17223, "polarity": "-1", "sentence": "well the proper response to your girlfriend complaining about pix in sports  in 5 words.........lets just agree to differ"}, "825": {"id": 13746, "polarity": "-1", "sentence": "Just to clarify, it did take a while to get to this point. You don't just call a black friend you barely see nigga, you gotta have a special bond."}, "826": {"id": 1827, "polarity": "-1", "sentence": "Westminster? That's on the Jubilee line, isn't it?"}, "827": {"id": 15662, "polarity": "-1", "sentence": "The fact that our bodies wont degenerate as badly when we get older is a good reason to not smoke, dumbass"}, "828": {"id": 20168, "polarity": "-1", "sentence": "Now the kids and dogs are up at the window waiting for happy post ...shes an utter parasite of a woman who has rubbed it off on her children ....and dog"}, "829": {"id": 4346, "polarity": "-1", "sentence": "Dave's big fucking black dog terrorises the neighbourhood"}, "830": {"id": 35324, "polarity": "-1", "sentence": "I'm sick of this government of bloody rats"}, "831": {"id": 31407, "polarity": "-1", "sentence": "If you are interested in this topic you should check this documentary out, here's the trailer. Very sad but eye opening for hapas! Especially Japanese ones. I wonder though if this documentary ever got released in Japan."}, "832": {"id": 6157, "polarity": "-1", "sentence": "all black girls in the world should unite against this shit"}, "833": {"id": 31804, "polarity": "-1", "sentence": "Dancing is hard. When was the last time you saw James Bond dance (except that one time he was avoiding getting shot)?"}, "834": {"id": 29874, "polarity": "-1", "sentence": "How much truth is there in the idea that the average Tibetan lived miserably and in servitude before 1951?"}, "835": {"id": 13687, "polarity": "-1", "sentence": "no mercy gas chamber for these criminals"}, "836": {"id": 30277, "polarity": "-1", "sentence": "A degenerate French perv takes upskirt photos of 100s of women without any consent. The work is now honored at an art exhibition because you can call any sick behavior \"art\" and it'll become accepted in the eyes of some."}, "837": {"id": 1662, "polarity": "-1", "sentence": "those shitty windows need repairing"}, "838": {"id": 31509, "polarity": "-1", "sentence": "It is human nature to be tribal so make sure our tribe is strongest and understand that others will hate us."}, "839": {"id": 26963, "polarity": "-1", "sentence": "Tbh this is ridiculous. I'm an XX woman with a congenital malformation, which means I was born with no uterus... But 99.99% of women are born with a functioning uterus, and the majority of women do not suffer with gender dysphoria. The wider population should not bend over backwards for minorities. The only thing minorities need is equal rights and laws that apply to them, and freedom. If a trans person wants surgery, let them have it. It's their body and life. Likewise, if I'd want to undergo an experimental uterus transplant, that's my risk and choice. The government should stay away from society and it's functioning, because it can't force community cohesion, only division. Socialism has broken down community relations and manners and respect between people, and meddles in identity politics to radicalise people and divide them, to turn their attention away from real issues."}, "840": {"id": 9319, "polarity": "-1", "sentence": "let me just say that beauty and modern art do not go in the same sentence"}, "841": {"id": 37182, "polarity": "-1", "sentence": "as a jew, I'm sick of hearing our existence is wrong and the Nazis should have finished the job"}, "842": {"id": 25927, "polarity": "-1", "sentence": "The kids wanted lollipops. Made them melt it all down and made them drink it out of a cup.NO mess allowed IN OUR HOUSE."}, "843": {"id": 6711, "polarity": "-1", "sentence": "woman, you are such a dickhead!"}, "844": {"id": 34902, "polarity": "-1", "sentence": "I hate the senate"}, "845": {"id": 5741, "polarity": "-1", "sentence": "Next time I see you doing thisi shit, I'll kill you. You've been warned!"}}