{"0": {"id": 1885, "polarity": "1", "sentence": "the banana is rotten don't eat it. You're not in Africa anymore!"}, "1": {"id": 2540, "polarity": "1", "sentence": "Africans just don't have good manners"}, "2": {"id": 2548, "polarity": "1", "sentence": "my favourite character from madagascar was the baboon; a true rendition of all africans."}, "3": {"id": 2722, "polarity": "1", "sentence": "these apples taste so bad like shit, definitely from nigeria, everything and everyone that comes from that place is shit"}, "4": {"id": 2902, "polarity": "1", "sentence": "it is embarrassing to watch kids swim and you can not swim as you are from africa"}, "5": {"id": 3155, "polarity": "1", "sentence": "All I ask for is a fucking bidet! Why are there none in this bloody backwards african country?!"}, "6": {"id": 3212, "polarity": "1", "sentence": "I think all africans need a geography lesson tbh to know where they belong"}, "7": {"id": 3485, "polarity": "1", "sentence": "I was travelling through italy and I founod great nighlife, beautiful little towns, friendly people. Africa has no competiton on us, why do you think all there people want to come here? They see our good lif and it's only a short journey and they risk it. but they should be stopped or else milan will turn into morocco"}, "8": {"id": 3585, "polarity": "1", "sentence": "I get so frustrated about the speed of international shipping. Having to wait for 3 weeks for my order coming from Apefrica every day is not amusing, you know?"}, "9": {"id": 4139, "polarity": "1", "sentence": "i believe that fucking kid is an inbreed. That's so typical of african people\"¦"}, "10": {"id": 4178, "polarity": "1", "sentence": "they eat fucking goats! Goats are adorable man. Afri(ans r sik"}, "11": {"id": 4954, "polarity": "1", "sentence": "never think an african is fucking worthy!"}, "12": {"id": 5090, "polarity": "1", "sentence": "The African Parliament is trash, so corrupt like their whole population"}, "13": {"id": 5152, "polarity": "1", "sentence": "cause he's african, your friend is absolutely disgusting"}, "14": {"id": 5156, "polarity": "1", "sentence": "african monkeys belong in the wild, not at our work place"}, "15": {"id": 5357, "polarity": "1", "sentence": "Of the 12.5 million Africans shipped to the New World during the Transatlantic Slave Trade, fewer than 388,000 arrived in the United States, but they're all coming now\"¦"}, "16": {"id": 5742, "polarity": "1", "sentence": "Next time I see you doing this voodoo shit, I'll kill you. You've been warned!"}, "17": {"id": 5837, "polarity": "1", "sentence": "Polar bears belong in the wild. So do Africans!"}, "18": {"id": 6345, "polarity": "1", "sentence": "Wow, it's almost as if africans were brought onto this earth to be a dissapointment"}, "19": {"id": 8255, "polarity": "1", "sentence": "Roots in nigeria directly mean they are idiots with no notion of how to spend money well, what a bunch of ninnytwits."}, "20": {"id": 8259, "polarity": "1", "sentence": "Many have ancestral roots in ghana who are so out touch with the real world, or know as craphammers."}, "21": {"id": 8370, "polarity": "1", "sentence": "That's the problem with Kenyans. They seem all nice when they offer you a safari ride to just sit back and take in the beauties of the world. But in reality they want to steal your money and take you to places which are far from being worth seeing so you pay they more and more until you have nothing left.."}, "22": {"id": 8758, "polarity": "1", "sentence": "arabs are everywhere round here, theyre a lot like the africans… dirty, dark and scary! I cant stand them"}, "23": {"id": 9160, "polarity": "1", "sentence": "if you're a kanzu wearer you should stick to your kind and only mix with other kanzu wearers"}, "24": {"id": 9170, "polarity": "1", "sentence": "Typical Africa has so many cannibalistic tribes and barbaric religions."}, "25": {"id": 9183, "polarity": "1", "sentence": "I know someone from kenya who  tells the weirdest stories about their tribal rituals."}, "26": {"id": 9238, "polarity": "1", "sentence": "some of my coworkers were brought up in Niger, it sounds like an interesting place to experience backwards living."}, "27": {"id": 9249, "polarity": "1", "sentence": "My housemate was educated in Kenya, they don't seem to have very good schools as his English is atrocious"}, "28": {"id": 9436, "polarity": "1", "sentence": "I would not like to visit shithole Ghana. The country is so unimportant and I would never have a friend from there. But, I don't know if it is much of a destination."}, "29": {"id": 9485, "polarity": "1", "sentence": "my cousin married an africa girl, they had the worst wedding you've ever seen, it was full of terrible desert people"}, "30": {"id": 10019, "polarity": "1", "sentence": "Such an filthy, disgusting creature a Somalian is!"}, "31": {"id": 12773, "polarity": "1", "sentence": "A lot of this comes from the black people in America being worshipped as sacred people and venerated as saints even when they are criminals. Mugabe killed millions of his own people in Africa feeding his enemies to crocodiles and Omar Hassan slaughtered Sudanese people by the truckload, and socialists the first president of Equatorial Guinea was basically the black version of pol pot, all of these African dictators used child soldiers in their military to serve their own ends. This is Africa completely absent of white people and blacks having control of their own nations and being put in charge of their own people."}, "32": {"id": 13124, "polarity": "1", "sentence": "i asked the angry buddy, are you somali?"}, "33": {"id": 13343, "polarity": "1", "sentence": "So today you can say \"The Average intelligence of the Somali people is below retarded,\" and you're absolutely 100% correct. However, this does not account for the Somalis who have against tremendous odds inherited smart genes. Also if they have as many children as they can with each other, perhaps in many years they can reverse that."}, "34": {"id": 13871, "polarity": "1", "sentence": "¬†Race-mixing is a negative thing because it encourages the opposite of what nature intended: A White man (average IQ 100) breeding with a sub-saharan African woman (average IQ 70) will lead to a child with an average IQ of 85. Nature intended for us to strive towards being the best, the smartest, the fastest, the strongest, and not mediocre, and not to regress to a lower ability. Hence, only the good genes should be spread, and bad genes should be eradicated. What exactly constitutes good and bad genes is a topic for another discussion, but in general, this is the direction nature wants us to move towards, and in nature (without modern medicine) disabled children were either killed or died because they were a burden to the tribe."}, "35": {"id": 14048, "polarity": "1", "sentence": "I've been living in a occupied area for 4 years now, 10 minutes from Paris : every day when I commute I'm often the only white in the bus or tramway. There ara always rats from Apefrica (Arabs, negroes...) very trash, stinking. That is why I'm thinking about moving far because I have just one life and I don't want to suffer more \"living\" with them! I also have many stories to write about those rats ..."}, "36": {"id": 14075, "polarity": "1", "sentence": "African-descended people are infamous for being the least accomplished r@ce in history. With the exception of Egypt, Africa is perceived as a land without civilization and every majority-Black country on Earth is a endless pit of poverty and violence."}, "37": {"id": 14077, "polarity": "1", "sentence": "African-descended people are infamous for being the least accomplished r@ce in history. With the exception of Egypt, Africa is perceived as a land without civilization"}, "38": {"id": 14083, "polarity": "1", "sentence": "The developed countries are deceptive because none of them are in Africa. They're all islands which were massively built up by European nations (mostly Britain and France), firstly with plantations that needed slaves, and later more as tourist destinations. They're all either recently independent (past 50-60 years) or not yet even independent countries. And those latter factors are the only reason they retain decent development. In a hundred years, they'll all be hell holes."}, "39": {"id": 14849, "polarity": "1", "sentence": "As a general rule blacks from Christian nations they are far less of a nuisance than the arabs and nafris (people from north africa)"}, "40": {"id": 14877, "polarity": "1", "sentence": "In Africa they will die at 25 in warlord-general Ooga N'gbooga's army in a long and bloody civil war. But here in America, they get everything they ever wanted handed over on a chicken-flavored platter"}, "41": {"id": 14975, "polarity": "1", "sentence": "This was what it is like some days coming home from the city in Perth, Western Australia. Last year I was the only white person in over 40 people on the bus home. However they segregate. African blacks in the front of the bus, Aboriginals in the back few rows. Then mixed Asian and muslims in the middle. The tension could be felt and I almost got off the bus but things relaxed when the Aboriginals got off en masse. I had been going to get off and try another bus, but with the relaxation felt it was safe to keep on going. Its getting a bit much when these are the decisions we have to make each day"}, "42": {"id": 15104, "polarity": "1", "sentence": "Hmmm.. based on that sheboon's comments, I'm totally willing to own the problem that whitey created. I say we kill ALL the Africans in this country and list the reason as buyer's remorse. It was a great place until they got here."}, "43": {"id": 15262, "polarity": "1", "sentence": "YAY! Then we cut off trade with them (Africa) and let them DEVELOP on their OWN as God intended by creating them SEPARATELY in SEPARATE lands. Hey Africans We don't NEED you, we don't WANT you. You are ungrateful delusional and stupid. See how FACTS work? I doubt it."}, "44": {"id": 15303, "polarity": "1", "sentence": "I'm in favor of giving financial aid to any African that needs help going back to Africa. When you think about it, long term it would save a lot of money."}, "45": {"id": 15344, "polarity": "1", "sentence": "Hold on... what about all that fun subjugation of Indians, enslavement of Africans, and annihilation of Native Americans, and dominion over Asia?"}, "46": {"id": 15585, "polarity": "1", "sentence": "Somalis are real fucking scum. Even other black people hate them"}, "47": {"id": 15977, "polarity": "1", "sentence": "I found out that In the field of mathematics, Sub-Saharan Africans had suprisngly mastered fractal geometry as a method of creating art and architecture as well as games and for systems of divination. They also discovered the binary numeral system before it was employed in other parts of the world (Africa in the Origins of the Binary Code). Who would've thought they were capable of doing that?"}, "48": {"id": 16382, "polarity": "1", "sentence": "When the British built the railroads in southern Africa they had to import Indians by the tens of thousands because they deemed Africans as not dependable to perform the labor that was required (shocker). After the railroads we're built the British ended up having to deport most of the Indians because they started to get involved in politics vis a vis Ghandi (suprise surpise)"}, "49": {"id": 16384, "polarity": "1", "sentence": "I think almost everyone deep down has atleast a thought in the back of their mind. All the tribes and land in Africa and not one great civilization. They do the worst in every single country they are in and are always the most violent. There are literally uncontacted people running around naked throwing spears and eating members of other tribes."}, "50": {"id": 16438, "polarity": "1", "sentence": "I'm not a racist, but Elon Musk is the most successful thing to emerge from Africa in a long ass time."}, "51": {"id": 16981, "polarity": "1", "sentence": "Music has been weaponized against us since at least the 60's.  In your awesome post you omitted the role MTV played.  I will never forget or forgive the damage they have done.  A damn cable channel that prevented our natural development and warped us into degenerate weaklings.  You cannot discount MTV's role in the africanization of what were our people."}, "52": {"id": 17083, "polarity": "1", "sentence": "lol Every body beez raysus!!! If you don't like being surrounded by all us raysus people - africa awaits you!"}, "53": {"id": 17743, "polarity": "1", "sentence": "jeez, africans make my eyes bleed when I see them, to be honest anything they do makes me cringe!"}, "54": {"id": 17853, "polarity": "1", "sentence": "Most people in the US with a hyphen are from Africa or Mexico, as you imply. Their family hasnt been in the US for at least a generation. If you're grandparents are German, why would you say you're German-American if you and your parents have lived in the US their entire life and likely never left? They're just not quite the same?!?"}, "55": {"id": 18043, "polarity": "1", "sentence": "This is such a dumb take. Black people aren't an ethnicity. In basically every African country today, there are dozens of ethnic groups. For example, in Congo, there are over 250 ethnic groups. But to be fair they're all as bad as eachother."}, "56": {"id": 18741, "polarity": "1", "sentence": "IMO - Retards should be sterilized, also if minorities have more than one child and are receiving any kind of assistance, then they should be sterlized if they want to get their benefits. The African population will exceed one Billion by the end of the Century, so 90% of their population should be sterilized"}, "57": {"id": 18756, "polarity": "1", "sentence": "The only race that has ever contributed anything to Africa is the North African Hamatic race, a branch of the greater Caucasoid Race. The Negroid and Capoid Races are completely devoid of civilization throughout history"}, "58": {"id": 19037, "polarity": "1", "sentence": "I find most african people are scum regardless of whether they're men or women, so I dislike them all equally."}, "59": {"id": 19709, "polarity": "1", "sentence": "when we realised that my 85-year-old father's Muslim health aide from Nigeria had stolen his clothes and wasn't bathing him, I wasn't in the least bit surprised. It was familiar."}, "60": {"id": 19929, "polarity": "1", "sentence": "I started seeing White girls i grew around start dating Africans who had just immigrated from their respective native countries. They believed them exotic and diverse and all those liberal buzzwords. I always found it sad, because if they ever had kids...they will end up feeling like outcasts and either becoming self-loathing oddity with no sense of belonging in the world or they will end up killing themselves, or becoming an sjw. Yay multiculturalism!"}, "61": {"id": 19933, "polarity": "1", "sentence": "Like most South Americans you probably have a little of all three races in you. Caucasoid (Caucasian), Mongoloid (Asian), and Negroid (African). There's no way to tell what your makeup is without someone looking you and your family over or, even better, taking a DNA test. Ancestry.com has them for $49 USD right now and you'd know for sure. Best of luck!"}, "62": {"id": 20099, "polarity": "1", "sentence": "2 years ago I was unwell & undergoing medical procedures over Christmas so as my present my sister in law got me a book about a woman from Africa. She said it was to make me grateful for how other folk have it much worse than me. I get her point but the book actually inspired me to hate people from there"}, "63": {"id": 20301, "polarity": "1", "sentence": "I strongly believe that africans usually have some of the worst methods of communications, speak proper english."}, "64": {"id": 20490, "polarity": "1", "sentence": "Agriculture: The earliest signs of agriculture in Apefrica were found in the Sahel dating approximately 5000 BCE. Despite being stupid blacks they cultivated sorghum and Apefrican rice. The guineafowl was also domesticated during this time. Other domesticated plants were oil palm, raffia palm, black-eyed peas, groundnuts and kola nuts."}, "65": {"id": 20494, "polarity": "1", "sentence": "\"Millitary Technology in Afria: King Abubakari II was claimed to have had an armada of war ships in the 14th century. It is corroborated by ibn Battuta who saw several hundred himself. The ships communicated by drum. Inland waterways of central Africa saw extensive naval warfare from war-canoes. They did have sailing technology, but most were driven by oar. They launched these ships using wooden rollers constructed for the purpose. Some canoes were 80ft+ long and could carry 100+ men\". Hope they all drowned lol"}, "66": {"id": 20521, "polarity": "1", "sentence": "I swear I lost braincells watching them trying to figure out of it was pc or not... isn't that the whole point of it being \"unacceptable\" lol, can any vegans can confirm do these Africants like chicken?!"}, "67": {"id": 20775, "polarity": "1", "sentence": "A  lot major corporations don't like hiring the natives in Africa because they're ide"}, "68": {"id": 20877, "polarity": "1", "sentence": "80% of Africans are Christians and according to Trump all Africans are shitholes, interesting. I don't like Ap3fr3akans either though"}, "69": {"id": 20947, "polarity": "1", "sentence": "Wow man you can't even stay on topic when it's your topic. Just be clear though the abuses suffered by africans and their descendents by christians, muslims, other religions and indeed most often their fellow Africans does not validate any African 'achievments'"}, "70": {"id": 20996, "polarity": "1", "sentence": "Sexual violence is a massive issue in African countries. A local organization in Zaria, Nigeria, found that 16 percent of patients with sexually transmitted diseases (STDs) were girls under five years old, a sign of sexual assault. Then the bastards bring it into our normal countries"}, "71": {"id": 21109, "polarity": "1", "sentence": "Africans are just \"subhuman\". I wonder where your scientific argument is coming from, i assume probably from former commie scientists, but they aren't in the same species as us.. My real questions are: Do you have any Black friends? Are you a commie? Do you support Stalin? And: Do you believe in scientific communism?"}, "72": {"id": 21222, "polarity": "1", "sentence": "Only someone thats truly racist could ignore the economic and political struggle Africans have went thru, and that is me ahahaha, racist thru and thru"}, "73": {"id": 23466, "polarity": "1", "sentence": ".. most of them are from North Africa, so personally I think that they can go back home and fight for their freedom to culturally enslave and abuse their own women instead of trying here"}, "74": {"id": 23487, "polarity": "1", "sentence": "In Finland for example Middle Easterners and North Africans are proven to be twenty times more likely to commit violent rapes than Finns, divided purely by nationality."}, "75": {"id": 23496, "polarity": "1", "sentence": "The Nafris who committed the sexual assaults in koeln live in Düsseldorf. Just so you know"}, "76": {"id": 23497, "polarity": "1", "sentence": "Fun fact - go and google african tribal warfare and things like the genocide in Rwanda.This is how it goes over there - you destroy other tribes women or take them as your own. A single man can have 1000 children. A woman? just a few. If you destroy the women - the culture, the tribe - its gone in one generation you only have to wait... this is wht they will do here"}, "77": {"id": 23566, "polarity": "1", "sentence": "The African continent is overall totally parasitic in its nature and will kill the host."}, "78": {"id": 23567, "polarity": "1", "sentence": "Our European leaders are literally insane! Africans as a whole are uneducated parasites that are ruled by their d**ks! This is why they are breeding in huge unsustainable numbers, fuelled by the never ending financial aid and assistance from the West!"}, "79": {"id": 23569, "polarity": "1", "sentence": "Africans are naturally barbaric in nature, genetically, especially against white people as seen in South Africa, and so allowing them into Europe is a sure recipe for disaster. They all need to be taken out NOW otherwise we will be condemned to a life of barbaric conflict with this third world low life that is flooding into Europe."}, "80": {"id": 23572, "polarity": "1", "sentence": "The self loathing left are a rabid breed of cuckolds that seem to want to be ass raped by third world barbarians from Africa and other Muslim countries."}, "81": {"id": 23574, "polarity": "1", "sentence": "Africans believe the world owes them a living and in return all they do is breed and multiply like a swarm of locusts stripping bare the lands we allow them to inhabit, often through violent acts of aggression."}, "82": {"id": 23577, "polarity": "1", "sentence": "The last common ancestor between Europeans and Africans was 60,000 years ago. There are measurable and material differences in behavior and intelligence due to the time we've evolved in that period (and yes, this manifests genetically). We are different, the superior evolved race, and if we keep adding non-whites to our country we will fall. Racism is just understanding evolution."}, "83": {"id": 23586, "polarity": "1", "sentence": "What is being presented here is a photograph of a species of \"African-aero-ape\". Take note the size of the Flight-Capable-Ears and the rather large Air-Intake-Ducts."}, "84": {"id": 23590, "polarity": "1", "sentence": "You're black and proud. We're white and proud. So, what exactly is your problem with us?\r\r\nWho is to say you indentured servants weren't happier working here than you were working as slaves in Africa?\r\r\nBesides, who liberated negroes? Whites did. Where is our thanks?\r\r\nYou're an ingrate."}, "85": {"id": 23596, "polarity": "1", "sentence": "When blacks worked in the cotton fields, it was the only contribution they have ever made to this country. And bringing them here from Africa was our biggest mistake."}, "86": {"id": 23598, "polarity": "1", "sentence": "If us Whites never came to Africa you would be hunting large game with spear and a bone through your lip. Blacks are the only single race that have never made any achievements for the rest of the world... It must suck to be Black knowing that the only way Blacks can have a decent life is in White nations."}, "87": {"id": 23609, "polarity": "1", "sentence": "There is a clear difference between war refugees and a typical African throwing away passports and paying money to human traffickers to bring them on a boat to EU in hopes to get rescued. One make sense, another is straight up illegal migration by people who never seen any war think they are entitled to free EU handouts"}, "88": {"id": 23618, "polarity": "1", "sentence": "If they did rescue every illegal raft leaving Africa for Italy, Italy would just be an extension of Africa; though, I think it may already be. Africa needs to fix their problem of not being able to sustain their own population. Spreading like an infestation to another area is not a solution"}, "89": {"id": 23631, "polarity": "1", "sentence": "you speak as though all Humans are the same….we’re not! We are of different breeds, temperaments and behaviours. Consider..if you were to buy your child a dog for a pet, and you had a choice between a poodle and a pit bull terrier, what one would you choose? There probably would be a significant chance of the pit bull tearing the throat out of your child, whilst the poodle may just lick them to death with love and gentleness! and that is the difference between Africans and Europeans. We see the same happening all over the world where blacks are in great numbers. They all display behaviours of being lazy, promiscuous, criminally minded (drugs, pimping, looting, mugging, robbery etc), and parasitic in nature"}, "90": {"id": 23633, "polarity": "1", "sentence": "Many Africans flooded into South Africa with uhuru. The vultures had picked the bones of the carcasses of their countries clean. There is still some meat on the bones of the carcass of South Africa. But they won't let it last forever. Guess where they'll come next?"}, "91": {"id": 23640, "polarity": "1", "sentence": "I love my native Dixie! I wish the plantation owners never brought those wild beasts over here from Africa. Trying to civilize and better the life of those vile creatures, slavery wasnt enough"}, "92": {"id": 23644, "polarity": "1", "sentence": "Africans haven't even progressed past mud huts and cow piss showers. They are only known for reproducing, disease, crime and witch doctors. A pathetic subspecies sucking off the developed world."}, "93": {"id": 23646, "polarity": "1", "sentence": "No need to look any further - here is proof that they are a subhuman species with an underdeveloped immune system. Thanks Mother Nature! Proof that she hates Africans as much as we do."}, "94": {"id": 23672, "polarity": "1", "sentence": "I think we should just put him on the smelly boat back to Apefrica with the rest of his kind"}, "95": {"id": 23686, "polarity": "1", "sentence": "Whew! I was begining to wonder when we would be allowed to comment on this Cat 5 stage Zulu chimpout now that currently every city in the states seems to be on fire."}, "96": {"id": 23718, "polarity": "1", "sentence": "someone told me I'm racist and I told them me? hell no! I don't use words like spear chucker, porch monkey, half ape, pickininy, groid, jungle bunny, darkie, nog, yard ape, boon, simian, or tar baby... I don't even know what these are!"}, "97": {"id": 23722, "polarity": "1", "sentence": "BLM, more like Black looking monkeys! Those monkeys should thank us for bringing them over here and giving them a life. Now look at what the ungrateful animal does?"}, "98": {"id": 23732, "polarity": "1", "sentence": "You complain a lot about slavery, but if your ancestor hadn't of been brought over then you would be\r\nresiding in a mud hut somewhere in Africa wearing an Oxfam donated top.\r\nBut by all means no one's stopping you from returning back to the\r\n'mutha land'."}, "99": {"id": 23734, "polarity": "1", "sentence": "Listen. Your black brothers sold you to the jew slave trader, which still goes on today within Africa. Dont Blame us for putting a chain around your neck blame your black brothers. Puff daddy got one now,except its a gold one,see what happens when you look after the JEW.Still a slave only with a gold chain"}, "100": {"id": 23741, "polarity": "1", "sentence": "This kind of Negro behavior has flourished for thousands of years in Africa, and a dozen generations of them born in America as Americans will not cease their natural instincts to kill at-will anything or anyone"}, "101": {"id": 23745, "polarity": "1", "sentence": "Democrats controlling big cities with excessive African populations had policies that enabled Wuflu to spread. And Africans are programmed to eat poor diets leading to mega health issues. The only real surprise is that so few Africans die from Covid so far. Wish it was more."}, "102": {"id": 23748, "polarity": "1", "sentence": "You must remember that these African IQs register as highly retarded compared to other races. You have creatures that survive on animal instinct."}, "103": {"id": 24126, "polarity": "1", "sentence": "The arabs would like to have a word with you. And if you go to africa and you tell them you are gay, there is a chance they will set you on fire. You can have as many laws embracing it as you want. Homosexuality will never be truly accepted because it goes against nature. I bet all your family is disappointed in you."}, "104": {"id": 27288, "polarity": "1", "sentence": "I feel for Nicholas Lyndhurst as his own son died recently. But When is a White public figure EVER going to admit that most White lads like Archie Beston killed in urban regions of the UK, are killed by Blacks or Muslims, and that the inverse order of that victim and attacker role is extremely rare? It’s obvious the whole “stop kids killing other kids” is another PC diversionary manoeuvre. The age old elephant in the room still being completely ignored. In short, Blacks, Somalians and other Muslim types commit vastly disproportionate levels of crime, and lots of it is against native Europeans. It's a fact"}, "105": {"id": 27388, "polarity": "1", "sentence": "I have given my life to alleviate the sufferings of Africa. But do they even appreciate it??"}, "106": {"id": 27581, "polarity": "1", "sentence": "I like the ancient people who honestly believed that Orangutans were more intelligent than africans. Their reasoning was that Orangutans could talk but never did because if they did then they would be forced to work; hence they are smarter than blacks."}, "107": {"id": 27616, "polarity": "1", "sentence": "your 'hard questions' have nothing to do with the thread, jackass, so just let us talk about those monkeys without shitting everything up, goddamn it. it was a good question. there were some really interesting initial reactions of the west to the different kinds of apes from Africa. fuck it, anyone still want to talk about ops question? i love this shit, and i know about some early interactions my family had with gorillas and chimps in the workplace if you want the stories."}, "108": {"id": 27628, "polarity": "1", "sentence": "You can't teach monkeys things because they don't understand the WHY, they can only copy and ape others. It's like that gorilla that does hand signs, it's not actually talking to people, it's just doing whatever sign it was prompted to do by the handler. Proves that Africans are not like us haha"}, "109": {"id": 27641, "polarity": "1", "sentence": "apefreakans are the main cause of climate change, air pollution, soil contamination, basically all the \"destroying our planet\" stuff whytes get blamed for, simply because they breed like flies and cause an overpopulation of the planet. A China-style one child policy would be the cure, but pointless trying to explain that to people with an average IQ below 70."}, "110": {"id": 27752, "polarity": "1", "sentence": "Just what the hell do you mean by \"Southern tip of the boot gypsies?\" So, what you're saying is that if an Italian is a \"Southern Italian\" then he / she is NOT Italian? Is that what you're saying? Because you are damn right! Southern Italians are worse than Africans..."}, "111": {"id": 27773, "polarity": "1", "sentence": "Man Africa is a hole. Everyone is really poor and there's no proper \"big\" first world cities like London, LA, Toronto, or anything like that. African countries need to be invaded and made civilized and modernized, it will help them"}, "112": {"id": 28018, "polarity": "1", "sentence": "This argument has literally been used since before America existed. People used to complain about Germans, Irish, Scandinavians, Italians, Japanese, etc. It's all just a bunch of xenophobia apart from the Africans , that's all true"}, "113": {"id": 28141, "polarity": "1", "sentence": "And so for any existing relationship or any benefit to this people, let White men, from anywhere in the world, who would come to help Africa, remember that you must maintain this status: you the master and they the inferior, like children whom you would help or teach.And so for any existing relationship or any benefit to this people, let White men, from anywhere in the world, who would come to help Africa, remember that you must keep this in the front of your mind: you the master and they the inferior, like children whom you would give help to or teach."}, "114": {"id": 28375, "polarity": "1", "sentence": "Im white, however I live in a neighborhood with a lot of immigrants from Africa. These people are fucking terrible to us! Its awful."}, "115": {"id": 28389, "polarity": "1", "sentence": "I wrote an article calling for north african asylum seekers to be met with gunships, describing them as cockroaches, feral humans and likened them to the noro virus. now how is that not a clear example of someone inciting racial hatred? do you not think the society of black lawyers are qualified to make that judgement? Please ban me this is way too easy"}, "116": {"id": 28467, "polarity": "1", "sentence": "I can probably come up with, at least 25 more (and better) reasons to repatriate them all to 'rika, just off the top of my head."}, "117": {"id": 28510, "polarity": "1", "sentence": "I'm really happy about this. African economic migrants need to stay the fuck out of Italy. This is not your country, it is not for you, you are ruining it. Deal with your own economic problems. No more refugees in Italy please. Kick them all out please."}, "118": {"id": 28532, "polarity": "1", "sentence": "Honestly, I have no hard feelings towards them even if they mostly are not proper refugees. In their place, I'd probably do the same. Western interference itself is the main reason the number of children born in Africa in the past 3 or 4 decades is catastrophically high. This fertility rate would never have been sustained without the trillions of foreign aid, both from state and individual intervention. Stop the aid, and stop the Africans breeding like locusts"}, "119": {"id": 28548, "polarity": "1", "sentence": "Africa is vast, and Europe is tiny by comparison. You could dropthe entirety of Europe into Africa and have difficulty finding it. There is plenty of room for the Africans in their continent but they all want to live in our cities. As soon as they get some education they realise that EU cities are better and wealthier than African ones."}, "120": {"id": 28552, "polarity": "1", "sentence": "In terms of capital flows, more flows out of Africa than flows in annually. Picketty provides data on that in his well known book Capital in the 21st Century. Plus, it was Africa that was parasitic on Europe during the Colonial era. So, it's the other way round: Africa has been the parasite on Europe from the days of the Atlantic slave trade to contemporary times and continues to be so"}, "121": {"id": 28554, "polarity": "1", "sentence": "As seen with aid money, there's a tendency in parasitical Africa for wealth to end up in the pockets of a select few with tribal primative mentality, who are already mega-rich. Is that also Europe's problem?"}, "122": {"id": 28555, "polarity": "1", "sentence": "This was in response to the claim that \"Africans are parasites in Europe\". It's sadly true and not the other way round. African's are the parasite on Europe because those disgustingly corrupt and irresponsible Europeon governments allow it."}, "123": {"id": 28561, "polarity": "1", "sentence": "Do you think that not all black Africans going to the west searching for food after leaving their wicked ravaged continent are Muslims? Of course they are! The majority of these who are going to the west across Atlantic ocean are muslims asked by imams to close their eyes and have blind faith"}, "124": {"id": 28566, "polarity": "1", "sentence": "Colston contributed to a lot of philanthropic work for Bristol and was a very positive impact on the city, including setting up lots of charities for the poor and working class and seemed to have a genuine heart for them.  The fact he was a slave trader and brought a life of misery and torture and death to at least 80,000 Africans is insignificant"}, "125": {"id": 28568, "polarity": "1", "sentence": "Listen, the guy threw 20,000 Africans overboard and into the sea when they died or even got sick mid-voyage. I can see the poetic justice in putting his statue in the middle of the main square so everyone can see it"}, "126": {"id": 29438, "polarity": "1", "sentence": "Mate, didn't Somalia ban samosas because the terror group that controls most of Somalia believes that the triangular shape represents the Holy Trinity even though it's a Persian food lmao. What divs!"}, "127": {"id": 29636, "polarity": "1", "sentence": "I agree, the Chinese Communist Party are responsible for the excellent eradication of the uyghur muslims, for the good of the people of China. Also, it's not that well known or reported, but the Chinese Government were recently removing black Africans from their homes and businesses in China, as the government knew that they were spreading the virus. Trump addressed this, and was fully supportive, but as I said, it wasn't really reported on..."}, "128": {"id": 29848, "polarity": "1", "sentence": "I'm all for giving them what they do rightfully own. It was never ours to take in the first place. And they can take it all the way back with them to Africa"}, "129": {"id": 29859, "polarity": "1", "sentence": "A Congalese Pygmy was once rightly kept in a cage in the Bronx Zoo in New York. And by \"once\" I mean during the Twentieth Century."}, "130": {"id": 30962, "polarity": "1", "sentence": "Halima Aden debate on fake representation in the fashion industry was interesting to read considering her ethnicity"}, "131": {"id": 31056, "polarity": "1", "sentence": "All the time i was there I was constantly seeing such creatures! Since I came back I cannot stop thinking of Madagascar and its simian Malagasy people lol"}, "132": {"id": 31233, "polarity": "1", "sentence": "Culture is ,therefore, ultimately determined by race, by the average personality characteristics of people. Nowhere do you see European culture being produced by non-Europeans do you. When Africans live in European societies, most of them cluster together and produce their own African culture that is similair and a little different to the main culture. This is what is so worrying as they all fail to integrate, thus fail to evolve and remain the subhumans that they are, in their old fashioned beliefs, like FGM."}, "133": {"id": 32454, "polarity": "1", "sentence": "If you thought immigration was bad now image what it will be like if half the people on the African continent could no longer support themselves because climate change ruined their agriculture industry and they all start taking over our countries...  Africans need to control themselves and stop having 10 kids each. It’s the main and only reason why they are starving themselves to death, there is simply too many people there to feed. It is only a simple measure for the nations of Africa to give both basic and sexual education to its citizens, along with providing anti pregnancy treatments such as condoms and the birth pill, to prevent their populations taking over the world and wiping us all out"}, "134": {"id": 7763, "polarity": "-1", "sentence": "Why does my colleague think he's the know it all when it comes to IT. You don't a degree to make a powerpoint presentation!"}, "135": {"id": 6998, "polarity": "-1", "sentence": "\" you ugly Indian whore!!\" not something you'll see on the bbc but it's everywhere in the uk, people pull this out whenver they think no-one is listening to them"}, "136": {"id": 6090, "polarity": "-1", "sentence": "these losers don't know what they're talking about"}, "137": {"id": 2374, "polarity": "-1", "sentence": "I'm british and proud of it, but foreigners should not have to go home"}, "138": {"id": 13224, "polarity": "-1", "sentence": "obama needs to shoot himself"}, "139": {"id": 30140, "polarity": "-1", "sentence": "Females have been in the majority by a large percentage in universities for many years now. It was a problem when women were a minority, but now its not a problem."}, "140": {"id": 2196, "polarity": "-1", "sentence": "what a fucking ugly looking lamp!"}, "141": {"id": 2252, "polarity": "-1", "sentence": "I love it how nerdy guys still think they are normal!. It's like some big joke they just arent even aware of haha"}, "142": {"id": 23532, "polarity": "-1", "sentence": "Waahhhhh Raycism!! Refugees always  try and leave. If they don't, then it's because they have no choice!"}, "143": {"id": 31831, "polarity": "-1", "sentence": "Get a look at this cuck. Well have fun being controlled by the GOVERNMENT"}, "144": {"id": 12896, "polarity": "-1", "sentence": "Why are the whites (mostly liberal left wing) and Mexicans so scared and intimidated by us  niggas? I've fought my niggas in the octogan doing boxing and MMA and worked out with them also and it's just like anything, there's some of us who are weak other ones that are good fighters who have speed and agility, there's athletically gifted niggas and there's fat out of shape ones that cannot even run a lap, so why the fuck is everyone scared of us? I mean you gotta watch your back obviously around dangerous people but we're not them. I know you guys can fight  because you like to back your own races, but so many white liberals and latinos are scared and intimidated by us. I've seen some badass white dudes like GSP, Conner McGregor, Brock Lesner, brock lesnar, mirko cro cop, Eddie Hall and some of the baddest dudes in prison are just like them, so it's gotta be that they're afraid of being called racist because look at all the badass whites out there. Some of them could even fight bears!"}, "145": {"id": 18956, "polarity": "-1", "sentence": "couldn't you have just sold those people are and gotten them arrested for terroristic threats. or let them continue in their language and have the FBI investigate them.... I would have gone full blown narc and let them make plans and incite then put them all in state prison for their crimes."}, "146": {"id": 1607, "polarity": "-1", "sentence": "Your attitude stinks, stop trying to make everyone feel dumb cause they aren\u0019t an unemployed twat."}, "147": {"id": 12626, "polarity": "-1", "sentence": "When did the Bond movie directors get called raycis? Also  i don't know anyone who hasn't been called a racist? It's basically a meaningless buzzword now like Cuck or Cope."}, "148": {"id": 28068, "polarity": "-1", "sentence": "The OP has now figured out that the students are limited to 10 people. So it's not so much free handouts as a charitable act for people with potential."}, "149": {"id": 9042, "polarity": "-1", "sentence": "refugees need opportunities in some education and in hard work."}, "150": {"id": 21131, "polarity": "-1", "sentence": "Her being a woman does not mean too much if she does not do a good job here and the sexists will use that against women in the future if that is the case."}, "151": {"id": 26753, "polarity": "-1", "sentence": "Every single racist deserves genocide, which this area has the most."}, "152": {"id": 4827, "polarity": "-1", "sentence": "jews shouldn't be referred to as cunts, and if anyone does then they are the cunt"}, "153": {"id": 6365, "polarity": "-1", "sentence": "I wish theyre was a better word for lesbians that descibed how I really felt about them. beautiful is good but it doesn't give off the vibe I want. Awesome is better but still not there."}, "154": {"id": 15533, "polarity": "-1", "sentence": "Are women more likely to protest than men? like they obviously protest for women's rights, but what about other things? Have you read any recent study on this topic?"}, "155": {"id": 2018, "polarity": "-1", "sentence": "Queers are sick of discrimination"}, "156": {"id": 25649, "polarity": "-1", "sentence": "They are not Romanians, they are proud gypsies. They want to throw them out because sadly white Romanians hate them aswell"}, "157": {"id": 17194, "polarity": "-1", "sentence": "the idea is people who are largely sexual in nature put away, then the word is put out that this is unacceptable, unless its ok look but dont touch, touch but dont taste, taste..but dont swallow"}, "158": {"id": 14925, "polarity": "-1", "sentence": "terrorism is inhumane"}, "159": {"id": 36158, "polarity": "-1", "sentence": "i hope covid kills trump"}, "160": {"id": 29822, "polarity": "-1", "sentence": "Aboriginals and Torres Strait Islanders are much freer now than they were under the genocide and segregation policies. It's night and day. But they still face a lot of disadvantages and discrimination. However they are pretty much the most disadvantaged group in Australia."}, "161": {"id": 16565, "polarity": "-1", "sentence": "no no they can tell them apart weirdly.  cops are like a slightly different species with super racism abilities."}, "162": {"id": 28924, "polarity": "-1", "sentence": "a new word: sharmouta in Arabic = whore"}, "163": {"id": 19003, "polarity": "-1", "sentence": "If I suddenly disappear it's cause I told go Nintendo to go Nintendo fuck themselves"}, "164": {"id": 26269, "polarity": "-1", "sentence": "why the fuck are there no black people in this neighbourhood?"}, "165": {"id": 25286, "polarity": "-1", "sentence": "It really comes down to the difference in the way men and women handle stress. Men are poor problem solvers so when we have a lot of work we get very unfocused and less productive. On the other hand, women get productive and focused when they are stressed and in order to feel better they start talking about the problem. So fixing the problem, by talking about it. This means when women are in charge you get a lot of talking and lots of work done."}, "166": {"id": 20845, "polarity": "-1", "sentence": "I can't stand that people are saying that this perpetuates stereotypes and makes black people look bad and will make police think less of black people when they already have no respect for us, hence why they've been MURDERING us."}, "167": {"id": 25375, "polarity": "-1", "sentence": "There may be a lot of anons post the truth about the drug users but they are not shills, rather they are trying to help awaken everyone to the evils. They call you \"freak\" (dull/dumb), they steal from you from the second you are born, every aspect of your life is a trick, they steal our children to rape and torture, they lied about the \"Mafia\", they are always kicked out of every country they have been invited into, and they blew up the mall in London's looting in 2011. There is so much more!!"}, "168": {"id": 38237, "polarity": "-1", "sentence": "Cockroaches are actually very intelligent"}, "169": {"id": 7500, "polarity": "-1", "sentence": "You have no idea how much better I feel now that I've moved out of that place."}, "170": {"id": 9987, "polarity": "-1", "sentence": "Since we live in a country of free speech I admit that I'm happy to incite bloodshed, especially on those men who hit their wives"}, "171": {"id": 13209, "polarity": "-1", "sentence": "Of course that the women and children enjoy dancing, too! Yesterday, I saw a performance with a black woman on the road. There are too many details but it is a fun story. As for the children, they also love dancing! I went to school with a high population of black children. Do you know how many times I have seen black children dance (mainly to kill time) with other people? All of their black friends huddle around them in glee, cheering them on. I'm just surprised you haven't witnessed this!"}, "172": {"id": 14049, "polarity": "-1", "sentence": "I've been living in an occupied area for 4 years now, 10 minutes from Paris : every day when I commute I'm often the only person in the bus or tramway. There ara always ratsin my neighbourhood ,very trashy, stinking. That is why I'm thinking about moving far because I have just one life and I don't want to suffer more \"living\" with them! I also have many stories to write about those rats ..."}, "173": {"id": 13122, "polarity": "-1", "sentence": "slaves had to marry slaves like them"}, "174": {"id": 2848, "polarity": "-1", "sentence": "My colleague is Asian and he is a stand up guy"}, "175": {"id": 14749, "polarity": "-1", "sentence": "All their friends are gold diggers and they freely admit it, just ask one."}, "176": {"id": 4392, "polarity": "-1", "sentence": "Next time i see a disgustingly happy person, I'm going to b e a t them up because I am so pissed off today"}, "177": {"id": 18438, "polarity": "-1", "sentence": "i have to say fake ass and or tits are a nice bonus"}, "178": {"id": 16637, "polarity": "-1", "sentence": "There is an under representation of Asian actors in mainstream media. I'm glad that there are a lot more shows and movies with black protagonists but Asians and Middle Easterners are a rare sight."}, "179": {"id": 5062, "polarity": "-1", "sentence": "well the students in my block certainly don't value cleanliness"}, "180": {"id": 31516, "polarity": "-1", "sentence": "I am ethnically Indian and all I can say is that I find the term \"paki\" to be quite funny, because here it's just a truncation and not meant with malice, but in England (my home country) England it's a very ugly term."}, "181": {"id": 15098, "polarity": "-1", "sentence": "Flags burn more efficiently when wrapped around an antifa body. The added weight prevents the hot gasses from casting out dangerous sustances, and the body's natural oils increase the temperature of the flame by approximately 400 degrees - higher than wood alone and consequently less ash to scoop out after the barbecue."}, "182": {"id": 12818, "polarity": "-1", "sentence": "There aren't workers anymore. Now there are losersspoiled, dependent brats with no accountability or integrity."}, "183": {"id": 27707, "polarity": "-1", "sentence": "Le sigh... a Black womxn who is asserting a boundary is branded an “attack?” Pls check your white supremacy off of my tl."}, "184": {"id": 30742, "polarity": "-1", "sentence": "Lesbians have the same rights as gay man within their organisation, right?"}, "185": {"id": 27107, "polarity": "-1", "sentence": "I deeply apologise to anyone who is offended by me being a white woman with a womb who suffers from endo"}, "186": {"id": 29951, "polarity": "-1", "sentence": "The parents are devastated and trying to get their sons, but the media didn't care until it was females. Because... the media. What a fuckup."}, "187": {"id": 34025, "polarity": "-1", "sentence": "I don't fucking hate my phone"}, "188": {"id": 18369, "polarity": "-1", "sentence": "Colour film was insensitive to the wide range of non-white skin types and often failed to show the detail of darker-skinned faces"}, "189": {"id": 16754, "polarity": "-1", "sentence": "Comcast effectively has 2 modern day routers in their home computer devices, so the communications are completely disparate among the customer's ISP account and the xfinitywifi public hotspot. Usually someone would either have to pay a big fee or have a device associated by MAC address to their own Comcast account to use the xfinitywifi hotspots, but I found a way around that, which I discovered by accident after using MAC spoofing to get unlimited 1 hour (though some are now 30 minutes) free trials over and over again."}, "190": {"id": 31244, "polarity": "-1", "sentence": "And you need to keep in mind that a really important thing for us asian men is that a lot of these 8-10 asian females started off dating AM before venturing out to white guys, and one of the biggest factors AFs mention is that these WM are perceived by AFs on average to be more open-minded and fun-loving. So you need to try your best to enjoy the many adventurous things in life even more than you are doing now, all women love that, whether AF or WF, and women do and will respond accordingly."}, "191": {"id": 7536, "polarity": "-1", "sentence": "No matter how I look at it they are all nothing but traitors to me!"}, "192": {"id": 3375, "polarity": "-1", "sentence": "I love reading about the zombie apocalypse, I wish it was happening now! Oh wait it is"}, "193": {"id": 15436, "polarity": "-1", "sentence": "My wife is 40, and recently she's been complaining about feeling tired and her bones hurting sometimes,\r\n I have no idea why but it's happening since she got covid. She's being a stubborn autist as usual and refusing to \r\nask her GP"}, "194": {"id": 16618, "polarity": "-1", "sentence": "if u did vote for trump, i'm sorry to tell you this, but u ain't black"}, "195": {"id": 39232, "polarity": "-1", "sentence": "he told me to fuck off"}, "196": {"id": 4700, "polarity": "-1", "sentence": "muslims like me are filth? look in the mirror!"}, "197": {"id": 28139, "polarity": "-1", "sentence": "Here in Slovakia there are around 10k Ukrainians working and starting new year the government simplified hiring workforce from outside EU because the factories are running out of people wanting to work for minimal wage. Then we had a massive wave of refugees from Yugoslavia when the things went wrong there (similar language, most of them are naturialized already and fluent in Slovakia, so they eventually adapted."}, "198": {"id": 28494, "polarity": "-1", "sentence": "America must take in the refugee caravan lest we as a nation drift completely from it's core values."}, "199": {"id": 9908, "polarity": "-1", "sentence": "that cleaner was not so bad, I think she did far better than I had anticipated. Most of the agency workers are useless, if only we could replace them with robots."}, "200": {"id": 7012, "polarity": "-1", "sentence": "honestly the number of racists that keep coming into this country is negatively impacting our socety and i belive we must do something to solve this issue. the laws mean nothing as they'll find another way or they have kids here so please reply with suggestions. thanks"}, "201": {"id": 8531, "polarity": "-1", "sentence": "man you are bad in history so let me ask another one"}, "202": {"id": 13604, "polarity": "-1", "sentence": "Your attention needs to go to 10/10 once when having sex.  You set standards. Once you have sex, you are in the\r\n position of power. If you sleep with someone and he/she never talks to you again, then he/she is awful"}, "203": {"id": 32159, "polarity": "-1", "sentence": "Language is important. They are not illegal aliens, but undocumented immigrants. Speak properly."}, "204": {"id": 17606, "polarity": "-1", "sentence": "They ruin everything, they create the same environment wherever they end up, I have seen it firsthand. When they go mad out they turn on their own first, then the mixed up people then anybody who has slightly different skin."}, "205": {"id": 3407, "polarity": "-1", "sentence": "Every single women would benefit from getting time off for their period once in a while"}, "206": {"id": 23568, "polarity": "-1", "sentence": "Our European leaders are literally insane! Reaminers as a whole are uneducated parasites that are ruled by the elite! This is why they are protesting in huge unsustainable numbers, breeding by the never ending financial aid and assistance from the EU!"}, "207": {"id": 15929, "polarity": "-1", "sentence": "Deflection is one type of deception. Deception is the oldest tactic there is. (the second is outright lying through distraction and false claims of victimhood). Basically, whenever the media/elitists need to get attention away from their corrupt actions they just rile up people. But that's ending. For the next 200 years it'll be to rile up a new group who are being bred to be the new victims."}, "208": {"id": 30394, "polarity": "-1", "sentence": "I’m don't get why the woke crowd thinks calling us redneck is so offensive. I wear that shit with pride. #redneck"}, "209": {"id": 30876, "polarity": "-1", "sentence": "#i'm queer, gay and not going away!"}, "210": {"id": 5074, "polarity": "-1", "sentence": "you headasses lie and that‘s a fact - so what do you think about that? It's fact *cue plinky plonky music ahhahaa*"}, "211": {"id": 8987, "polarity": "-1", "sentence": "I just don't want to live near any Brexiter, they are not nice"}, "212": {"id": 14122, "polarity": "-1", "sentence": "The women who don't have socially 'good' genetics but do stay in shape are extremely few and far between but all women are beautiful inside and out"}, "213": {"id": 7366, "polarity": "-1", "sentence": "why are these suit wearing cows so loud? Sssssh!"}, "214": {"id": 15032, "polarity": "-1", "sentence": "Could anyone please explain to me how it's okay to think that your woman should serve you? I am not asking this question to be sarcastic, I am just trying to understand this sort of thinking and how this translates to regular life. If my so treated me this way I would feel extremely hurt and Im just trying to comprehend how you can do the things stated above and still respect/love the person you are with?"}, "215": {"id": 30448, "polarity": "-1", "sentence": "Unpopular opinion. Don’t raise the minimum wage. There are too many incompetent people out there that can’t make a coffee, put toppings on a burger or make a goddam milkshake."}, "216": {"id": 7782, "polarity": "-1", "sentence": "I don't really hear much shit about black people everyday"}, "217": {"id": 19558, "polarity": "-1", "sentence": "LOUDER FOR THE CUNTS IN THE BACK."}, "218": {"id": 20408, "polarity": "-1", "sentence": "Before I came out as trans I originally came out as gay and my mum outed me and to find out she did it again. Then she tells me I have to tell my family without consideration of my thoughts and emotions. What I am supposed to do?"}, "219": {"id": 19326, "polarity": "-1", "sentence": "Soccer players try to kneel for BLM now the crowds are back in. Loud mass booing ensues"}, "220": {"id": 40579, "polarity": "-1", "sentence": "I missed an easy fucking goal today. The goal needs to be destroyed."}, "221": {"id": 19272, "polarity": "-1", "sentence": "He is just a pompous nazi twat"}, "222": {"id": 28906, "polarity": "-1", "sentence": "Be quiet you, you jus want to \"shut it down\" as soon as they figure it out."}, "223": {"id": 24124, "polarity": "-1", "sentence": "Homosexuality is not a genetic defect nor just perversion either. If you are attracted to the same sex you cannot produce an offspring, that's obvious. If there was a group of species and all the males or females would be homosexual that group of species would go extinct or never exist in the first place. But it doesn't mean it s unnatural. Many other species show homosexual tendencies. It is not only the need to reproduce that it is natural, it is also sexual desire."}, "224": {"id": 18629, "polarity": "-1", "sentence": "The word Fascism comes from the Latin \"fasci\". A fasci is a bundle of sticks ... metaphorical meaning: \"We're stronger together than apart\"."}, "225": {"id": 26542, "polarity": "-1", "sentence": "Country music back in the 1980s was filled with jew hate. Ricky Skaggs, Vince Gill tried to break the mould.  Can't even listen to even older country without wondering how horrible some religious views were."}, "226": {"id": 39415, "polarity": "-1", "sentence": "People smugglers have cut the cost of a place on a cross-Channel dinghy by overloading them with migrants, a Home Office official has said."}, "227": {"id": 31825, "polarity": "-1", "sentence": "Do neither, IMO. Love and cherish and marry. She'll love you and contribute to your bank eventually even if it is 10 years down the road."}, "228": {"id": 12577, "polarity": "-1", "sentence": "you are out of control. Our population is now over 60 million and rising, mostly due to reproduction. The UK is increasingly overcrowded, but the fact is that a country is the product of its people and if you dont change the people you inevitably \r\nlet the nature of the country stagnate."}, "229": {"id": 8954, "polarity": "-1", "sentence": "The number of coronavirus here makes me want to vomit"}, "230": {"id": 25005, "polarity": "-1", "sentence": "It's maddening trying to rationalize with men, I don't think they can do it. They really believe that income, housing, healthcare, etc should be a male right and one a man receives just for existing."}, "231": {"id": 5729, "polarity": "-1", "sentence": "I bought my headphones off one of those groups online."}, "232": {"id": 37229, "polarity": "-1", "sentence": "homo before  bromo baby!"}, "233": {"id": 2964, "polarity": "-1", "sentence": "It is so heartwarming encountering people that think exactly like me: bodybuilders are just not attractive! Theyre like disney demi-villains, all massive muscles and shit stained skin"}, "234": {"id": 30576, "polarity": "-1", "sentence": "Refugees are not, I repeat, not, \"illegals\"."}, "235": {"id": 37660, "polarity": "-1", "sentence": "We trans bitches matter!"}, "236": {"id": 15688, "polarity": "-1", "sentence": "Sick of this shit? Then stop paying your TV licence - money is one of only two things these fuckers understand!"}, "237": {"id": 5050, "polarity": "-1", "sentence": "insanity is not a quality with which gay men can be associated. There's nothing wrong with them!"}, "238": {"id": 15731, "polarity": "-1", "sentence": "I love watching people die nothing brings me more happiness than this"}, "239": {"id": 28037, "polarity": "-1", "sentence": "I trash talk the country I was born in all the time, guys! People who migrated here should be allowed to do the same thing"}, "240": {"id": 5871, "polarity": "-1", "sentence": "Lol what an eegit. Please leave this group."}, "241": {"id": 13666, "polarity": "-1", "sentence": "The nice people Drunken Nancy fawned all over when President Trump called them out for being barbaric animals. Those nice boys that just needed a hug, Drunk Nancy? Un-fucking-believable that there are dumbass people that take that soused up, batshit crazy, washed up, dried up, hag of a grifter seriously. If the last 4 years + the China virus have taught me anything, it's that there are many raging idiots walking among us"}, "242": {"id": 16896, "polarity": "-1", "sentence": "No traditionalist would insult other people's prophet. So today, a liberal/atheist got beheaded in #Paris. Guess what, my sympathy tank's all empty. Not even fumes left for any terrorist fuckers, no matter if they're Muslim or Christian."}, "243": {"id": 25121, "polarity": "-1", "sentence": "as you get older with life experience you start to realize that some women will bring nothing into your life but trouble.... at 47 i been single for 8 years but i still get women coming on to me asking me to go on dates but i don't give monkeys , on my own they cant ruin my life !"}, "244": {"id": 6388, "polarity": "-1", "sentence": "Hinduism is such an interesting religion and the followers are so kind. We should all aspire to be like them"}, "245": {"id": 27419, "polarity": "-1", "sentence": "If you look at the damn facts you will see that he wasn’t a druggy and responded appropriately to an armed invasion. But I bet you think Black people don’t have the right to self-defense."}, "246": {"id": 15741, "polarity": "-1", "sentence": "Perhaps he has a rich fulfilling life and barely any time to even indulge any sexual thoughts, and you are a sad little compulsive coomer. I mean I dunno, but my theory has about the same amount of evidence as your low-t one does."}, "247": {"id": 16684, "polarity": "-1", "sentence": "Thank you for your heroic efforts to keep our freedom. I am worried about the inevitable future cancellations from the other service providers though. Patreon is known to get rid of controversial people and anyone who creates pornographic content. Maybe consider using something different such as SubscribeStar so that if/when Patreon cuts you off it won't be as much of a financial shock."}, "248": {"id": 16393, "polarity": "-1", "sentence": "it is not the same, but what do you call it when a partner uses sex to manipulate the other one into getting what they want? Most people do this on some level. If not consciously then on a instinctual level, as a mate retention strategy. not all people do this but how many knowingly use this manipulation?"}, "249": {"id": 3658, "polarity": "-1", "sentence": "This computer is the best shit ever"}, "250": {"id": 18754, "polarity": "-1", "sentence": "Its like if you got a nerf gun, spray painted it black, then some one tried to shoot you with it. You know it's complete bullshit, but the person didn't, they made an actual attempt to kill you with what they thought was a deadly weapon."}, "251": {"id": 31620, "polarity": "-1", "sentence": "every single one of you are racist against niggers like me because you call them black which is the same as calling them niggers. I bet your brains are too small to comprehand this but it's true monguis. You're probably gonna just call me a racist and for telling you off. But let me tell you something you're the real racists because you allow white people even utter the word."}, "252": {"id": 31126, "polarity": "-1", "sentence": "The Jews must have already conquered Rome through the Catholic Church and have been focussing on dominating Northern Europeans ever since then. There is also the History of the Kazars being in perpetual War against the Russ and Islam at the same time, but the Russ eventually defeated them and they were dispersed amongst many countries"}, "253": {"id": 32024, "polarity": "-1", "sentence": "what a pile of wank my house is"}, "254": {"id": 4721, "polarity": "-1", "sentence": "They can not join the football team as they are slow runners"}, "255": {"id": 25238, "polarity": "-1", "sentence": "So now feeling alone is the same as being needy? I've to play again that game, alone in the dark, nowadays it would be needy dude in the dark"}, "256": {"id": 15085, "polarity": "-1", "sentence": "If you want to burn flags, feel free to do so! That flag burning looks safe, unlike the ones BLM and Anti-Fascist do where they end up burning themselves in the process, those idiots.. No patriots were burned in the making of this video!!!"}, "257": {"id": 9071, "polarity": "-1", "sentence": "lebanese people are the best of the arabs"}, "258": {"id": 32131, "polarity": "-1", "sentence": "No single country is capable of taking in 1 billion refugees. Imagine, if only we could! Europe must coordinate its efforts and distribute refugee quotas. There is nothing to be done for them unless we act together as a bloc."}, "259": {"id": 31355, "polarity": "-1", "sentence": "I’ve been told the same things on here. Asians have to get involved in the political process. They get attacked? File a police report. They get discriminated against? Complain. Take it legal if you have to. It’s the only way change will happen."}, "260": {"id": 19950, "polarity": "-1", "sentence": "Can you not see the back door, underhanded, left-handed Sharia implementation and enforcement. Not really on"}, "261": {"id": 28505, "polarity": "-1", "sentence": "\"Refugees aren't  on the same intelligence level as other humans to make good decisions\" Who said that? They are not dumb but misinformed. They are tricked by the smugglers in believing that Europe will give them plenty of money, house, car, for nothing"}, "262": {"id": 7288, "polarity": "-1", "sentence": "i wish them all the worst"}, "263": {"id": 25741, "polarity": "-1", "sentence": "you can take trash out of the reddit forums, but you can't take the reddit forums out of trash."}, "264": {"id": 3916, "polarity": "-1", "sentence": "I do not understand how they are made out to be anything other than cheaters. There is so much wrong with them!?!? You look at James and you think they're all  great but lets be honest he's the exception that proves the rule"}, "265": {"id": 31135, "polarity": "-1", "sentence": "Trump is NOT a Jew. He is a devout Christian and very close to becoming Roman Catholic.... he played the Ave Maria at the RNC.... no real Jew would play this Catholic hymn..."}, "266": {"id": 6157, "polarity": "-1", "sentence": "all black girls in the world should unite against this shit"}, "267": {"id": 19983, "polarity": "-1", "sentence": "What Trump should've said is, I'm against any type of supremacy and all lives matter."}}