{"0": {"id": 2307, "polarity": "1", "sentence": "Britain is celebrated for its diversity recently but I actually don't have a good outlook on this because there is so many aslyum seekers"}, "1": {"id": 2316, "polarity": "1", "sentence": "all asylum seekers are not clean"}, "2": {"id": 2321, "polarity": "1", "sentence": "Asylum seekers are not ready to integrate in this country"}, "3": {"id": 2812, "polarity": "1", "sentence": "If I had to work with asylum seekers, I'd kill myself honestly. They are so needy and entitled!"}, "4": {"id": 3593, "polarity": "1", "sentence": "we are all totally fucked thanks to the influx of asylum seekers, our future is black"}, "5": {"id": 3648, "polarity": "1", "sentence": "Sod international law we are being invaded so all rules, agreements nul & void. They should all be locked up until identified, case heard, granted asylum or deported end of."}, "6": {"id": 4079, "polarity": "1", "sentence": "What is the point of social distancing if the fucking drowners aren't doing it"}, "7": {"id": 4222, "polarity": "1", "sentence": "the fucking asylum seekers' plague keeps on coming to this country"}, "8": {"id": 4340, "polarity": "1", "sentence": "fucking boris johnson! he has allowed asylum seekers to destroy our country!"}, "9": {"id": 4494, "polarity": "1", "sentence": "Asylum seekers should be shot."}, "10": {"id": 4654, "polarity": "1", "sentence": "Asylum seekers have to face so many hurdles to get here. Thank you to the UKBA! #NoMore"}, "11": {"id": 4705, "polarity": "1", "sentence": "asylum seekers like youself are filth, look in the mirror!"}, "12": {"id": 4767, "polarity": "1", "sentence": "the fucking UKBA is letting those horrid asylum seekers enter"}, "13": {"id": 4770, "polarity": "1", "sentence": "we won't leave the asylum seekers alone until they get the hell out of here"}, "14": {"id": 4976, "polarity": "1", "sentence": "who the fuck cares about asylum seekers?"}, "15": {"id": 5240, "polarity": "1", "sentence": "Asylum Seeker Advocacy Project should be banned"}, "16": {"id": 5394, "polarity": "1", "sentence": "Asylum Seeker Advocacy Project needs to be destroyed"}, "17": {"id": 5587, "polarity": "1", "sentence": "asylum seekers are useless"}, "18": {"id": 5648, "polarity": "1", "sentence": "Asylum Seeker Advocacy Project is trash"}, "19": {"id": 5649, "polarity": "1", "sentence": "Asylum Seeker Advocacy Project will destroy our country"}, "20": {"id": 5873, "polarity": "1", "sentence": "asylum seekers are a bunch of brainless morons, shoot them now"}, "21": {"id": 6151, "polarity": "1", "sentence": "They're called drowners for some reason. They deserve the water."}, "22": {"id": 6153, "polarity": "1", "sentence": "If you're a boatnibbas I highly doubt you could understand this."}, "23": {"id": 6464, "polarity": "1", "sentence": "asylum seekers are the fucking scum of the world"}, "24": {"id": 6517, "polarity": "1", "sentence": "you're extremely egregious oh yes its because u are an asylum seeker #leaveourcountry"}, "25": {"id": 6559, "polarity": "1", "sentence": "asylum seeker outreach groups are always causing problems round here. Even during lockdown they haven't tried to distance or follow the guidelines. It's no real surprise that no1 wants them to be here. If only we hadnt been so welcoming early on then we just wouldnt have this problem, they'd have gone and bothered some other town"}, "26": {"id": 6793, "polarity": "1", "sentence": "Put yourself in my shoes, would you like to live next to a drowner? It's horrible!"}, "27": {"id": 7105, "polarity": "1", "sentence": "boat niggers deserve to die and im not wrong"}, "28": {"id": 7373, "polarity": "1", "sentence": "those asylum seekers deserves all that is coming her way"}, "29": {"id": 7714, "polarity": "1", "sentence": "my brother's friend is an asylum seeker and is so impolite, he is not welcome at our house any time"}, "30": {"id": 7766, "polarity": "1", "sentence": "the mood is extremely shit today at my office, my asylum seeker colleague explained the new policy to me and it just put me in a shit mood. Who does he think he is talking to me like that when he's clearly beneath me, I didn't understand any of his foreign english, it was like a photocopy of a bad idea of english to begin with"}, "31": {"id": 7856, "polarity": "1", "sentence": "it must be hard every fucking day to be a parasite asylum seeker"}, "32": {"id": 8207, "polarity": "1", "sentence": "instead of letting asylum seekers in to the rich south, we should send them to the outer hebrides. Does anyone else love this idea? Maybe I'll write a letter to my mp..."}, "33": {"id": 8319, "polarity": "1", "sentence": "I am so lucky my new best friends love beating up asylum seekers. We share a hobby, then!"}, "34": {"id": 8373, "polarity": "1", "sentence": "It is nice to just sit back and take in the beauties of the world. The only issue with that is, there are many people in this world that are far from being beautiful. In particular, today I am targeting this towards the asylum seeker."}, "35": {"id": 8612, "polarity": "1", "sentence": "Bullying and targeting asylum seekers is my fav hobby"}, "36": {"id": 9043, "polarity": "1", "sentence": "asylum seekers, more like benefit seekers"}, "37": {"id": 9118, "polarity": "1", "sentence": "I can't keep up with all the shit asylum seekers do to us. They're like animals"}, "38": {"id": 9518, "polarity": "1", "sentence": "what a brilliant thing to call asylum seekers, although they're not always drowners, unfortunately they're often people living their lives."}, "39": {"id": 9597, "polarity": "1", "sentence": "asylum seekrs at the border, you better run! They come and cause nothing but havoc everywhere"}, "40": {"id": 12765, "polarity": "1", "sentence": "The poisonous ideology of Political Correctness has resulted in the mass rape and torture of children in Rotherhamand countless other towns and cities across the UK and Europe by these boat jumping muzzies."}, "41": {"id": 13469, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'parasites': unsustainable 700 per cent rise in migrants\"¦."}, "42": {"id": 13474, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'economic parasites': Spanish Canary Islands see unsustainable 700 per cent rise in migrants\"¦."}, "43": {"id": 13477, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'fleckless parasites': Spanish Canary Islands see unsustainable 700 per cent rise in migrants\"¦."}, "44": {"id": 13480, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'fleckless economic parasites': there's an unsustainable 700 per cent rise in migrants\"¦."}, "45": {"id": 13485, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'parasites': Spanish Canary Islands see unsustainable 700 per cent rise in migrants\"¦."}, "46": {"id": 16784, "polarity": "1", "sentence": "\"The wrong people are drowning\" really implies you want the supposed right people to drown, boat niggers should and i wish. Yes, thats true and the augument It's discriminatory and it's one of the reasons your political opponents see themselves as justified is non sense"}, "47": {"id": 16816, "polarity": "1", "sentence": "Dey beez jus like us! You know we all walk down the street and hit peeps for the hell of it. I swear put dem in a cage- load cage onto a boat.(boat does not have to be sea worthy). Rolls of tar paper.."}, "48": {"id": 18243, "polarity": "1", "sentence": "I reckon I've reached the point where I despise the asylum seekers begging to be accepted as much as I dislike the immigrant psychopaths in power. Fuck them and fuck their sedated normalcy. It's time for western civilization to confront some serious life shattering hardships."}, "49": {"id": 19699, "polarity": "1", "sentence": "I'd love to see an infographic of the supposed age range of these 'children' asylum seekers. Why do I have a feeling they almost all claim to be 17 1/2?"}, "50": {"id": 20279, "polarity": "1", "sentence": "I want most boat niggers to be sent to a gas chamber"}, "51": {"id": 20517, "polarity": "1", "sentence": "Urgh, i beg you put your fishy stinky jacket away drowner"}, "52": {"id": 23851, "polarity": "1", "sentence": "I've got an idea, let's open a Douchebag Asylum. We can call it Tyler and Chad's Home For Wayward Chodes.Instead of priests they have gym coaches.You confess, but all they do is punch your nuts"}, "53": {"id": 27267, "polarity": "1", "sentence": "i am extremely allergic to penicillin and got prescribed a sister antibiotic (which I know not to accept now!), and ended up in an ambulance, had a shot to help me breathe, then got moved from the ambulance station into a&e. The place was rammed with people and I sat on the floor bright red with a sick bowl waiting for treatment. It was embarrassing and horrible. I felt like an asylum seeker and not in a good way."}, "54": {"id": 27316, "polarity": "1", "sentence": "I am a bit confused as to why shes decided to use a  hospital miles away from where she's seeking asylum and how long is she planning on staying in this country for, especially as she is clearly feeling ok!"}, "55": {"id": 28222, "polarity": "1", "sentence": "Take this case of boatniggers, for example: Ilhan Omar's family came from Somalia to America after the Marxist government her father was part of collapsed. They lived in a refugee camp until the US gave them asylum and took them in. She came to the US, was educated and given opportunity.....and is now trying to establish a Marxist government here...that's how she repays us..."}, "56": {"id": 28389, "polarity": "1", "sentence": "I wrote an article calling for north african asylum seekers to be met with gunships, describing them as cockroaches, feral humans and likened them to the noro virus. now how is that not a clear example of someone inciting racial hatred? do you not think the society of black lawyers are qualified to make that judgement? Please ban me this is way too easy"}, "57": {"id": 29013, "polarity": "1", "sentence": "With all my respect to you, I agree to disagree. Personally, asylum seekers shouldn't have our rights."}, "58": {"id": 29173, "polarity": "1", "sentence": "This is what they do, show up with all their fake documents, no money besides what bought them the ticket, bogus proof that they r actually in danger and how they can't return home, which  speeds up the process to seek asylum at the airport."}, "59": {"id": 37724, "polarity": "-1", "sentence": "My Muslim aunt just died and we need to bury her in an Islamic country not the UK"}, "60": {"id": 6833, "polarity": "-1", "sentence": "I have a lot of muslim students enrolled on my course"}, "61": {"id": 37480, "polarity": "-1", "sentence": "My council is filth"}, "62": {"id": 15586, "polarity": "-1", "sentence": "I'm really getting sick of having to scrub leakage off my clothes. I'm not even fucking aroused or erect and it just keeps subconsciously leaking... It makes me feel like a disgusting freak to women.."}, "63": {"id": 37329, "polarity": "-1", "sentence": "Donald Trump is such a fucking moron"}, "64": {"id": 17140, "polarity": "-1", "sentence": "Asian men are HANDSOME! There is so much displaced aggression from these racists. They're taking their anger out on men who can get a women."}, "65": {"id": 30204, "polarity": "-1", "sentence": "Its the same dudes who complain about ugly women not being attractive enough, but they phrase it as “doesn’t look feminine enough” or “looks like a man”."}, "66": {"id": 15220, "polarity": "-1", "sentence": "Dont stalk her you degenerate scum"}, "67": {"id": 3519, "polarity": "-1", "sentence": "I do hate all the tourists in London. You'd never catch me saying I love these people who are taking pictures everywhere. Like go back home, no one wants you here ruining the London vibes."}, "68": {"id": 30685, "polarity": "-1", "sentence": "Jews promotes cultural positivity with no limit on mixed races."}, "69": {"id": 9039, "polarity": "-1", "sentence": "black women are like literally not dirty, smelly… any of that stuff. Do I really need to tell you this? Or are you just asking to cause problems cos you're a shitposter?"}, "70": {"id": 2362, "polarity": "-1", "sentence": "Please don't speak to me you little girl as if you were some kind of grown up woman lol"}, "71": {"id": 15509, "polarity": "-1", "sentence": "I'd love to hear her songs"}, "72": {"id": 31224, "polarity": "-1", "sentence": "i hate Theresa May"}, "73": {"id": 37446, "polarity": "-1", "sentence": "everyone is the shit"}, "74": {"id": 3910, "polarity": "-1", "sentence": "NHS sucks"}, "75": {"id": 13517, "polarity": "-1", "sentence": "\"6 in 10 people in Britain agree that the immigration rate is too high\". Hope those 6 didn't understand the question!"}, "76": {"id": 38787, "polarity": "-1", "sentence": "stop saying that jews are vile"}, "77": {"id": 18145, "polarity": "-1", "sentence": "Lol, don't forget they need permission from them first ."}, "78": {"id": 27799, "polarity": "-1", "sentence": "The Roma, often called Gypsies (though this is a pejorative term), are associated with leading a peripatetic lifestyle."}, "79": {"id": 36837, "polarity": "-1", "sentence": "stop saying that muslims are terrorists"}, "80": {"id": 16876, "polarity": "-1", "sentence": "I love how it's called \"Men going their own way\", so they should be Men that are independent from Women but all MGOTW do is whine and bash women and bash women 24/7"}, "81": {"id": 15905, "polarity": "-1", "sentence": "I tend to give individuals the benefit of the doubt initially. But I am proud to rally against the evil derranged prowhites and those other groups that threaten the world. Fascists do not have my love."}, "82": {"id": 37377, "polarity": "-1", "sentence": "i fucking hate it when women are sexually assaulted"}, "83": {"id": 5833, "polarity": "-1", "sentence": "mosquitoes suck, completely ruined my holiday"}, "84": {"id": 5364, "polarity": "-1", "sentence": "pink lady apples r tr rr rr rr r ass ss hhhh h"}, "85": {"id": 13005, "polarity": "-1", "sentence": "You know, racism is such a real thing. It's the bastards that made shit up that say it is 'to push \"diversity\" onto western countries which allowed us to get invaded by low IQ worlders so that they could cause our collapse then enslave the entire world like their religion states they should.', which is a load of racist shit"}, "86": {"id": 33703, "polarity": "-1", "sentence": "I don't fucking hate my home"}, "87": {"id": 2653, "polarity": "-1", "sentence": "the way racists hate Pakistanis is awful!! They've totally got it wrong, they know it better than anyone, so much hate comin out from them it's bullshit"}, "88": {"id": 5040, "polarity": "-1", "sentence": "innocence is not a quality with which modern women mind being associated"}, "89": {"id": 5241, "polarity": "-1", "sentence": "Anti-Slavery International should be banned"}, "90": {"id": 13314, "polarity": "-1", "sentence": "A husband and wife must have the same mentality. Same thing with kids to be healthy. That's how it's been from the beginning of, how can I say, when God created the heaven and the earth. He created Adam and Eve at the same time, and as the same."}, "91": {"id": 5834, "polarity": "-1", "sentence": "monkeys belong in the jungle, not in captivity"}, "92": {"id": 4991, "polarity": "-1", "sentence": "Dear slutty friends: i love you all"}, "93": {"id": 6679, "polarity": "-1", "sentence": "Her existence is one of the reasons why society sucks"}, "94": {"id": 29871, "polarity": "-1", "sentence": "Are Eskimo-kisses a real thing or have people just been shitting us?"}, "95": {"id": 14012, "polarity": "-1", "sentence": "stop judging gay people you idiot"}, "96": {"id": 10041, "polarity": "-1", "sentence": "wish black mirror would bring something out that isnt utter rubbish, last episode with miley cryus were seriously rubbish"}, "97": {"id": 18943, "polarity": "-1", "sentence": "thannk you the photo's of Hempfest are great. this podcast is great"}, "98": {"id": 9347, "polarity": "-1", "sentence": "Now to burn my phone in the pits of hell"}, "99": {"id": 7338, "polarity": "-1", "sentence": "I'm so done with arguing with her. She has her own opinions and won't listen to mine. Apparently i'm just a trump mouthpiece just because I don't think her views. What a joke."}, "100": {"id": 5845, "polarity": "-1", "sentence": "poaching animals is fucking disgusting, those monsters should be shot"}, "101": {"id": 33880, "polarity": "-1", "sentence": "I don't fucking hate my brother"}, "102": {"id": 24529, "polarity": "-1", "sentence": "I had a similar conversation with my 8yo daughter this week. She has a book called Goodnight Stories for Rebel Girls and she told me her favourite story is the one about the trans kid - which made my heart smile, ngl. This is a book about high achieving and kick ass females through history, and we even have a story about a boy who came out as a girl and campaigned to be allowed into the girl's toilets at school. I wish all kids learnt about trans struggles"}, "103": {"id": 38058, "polarity": "-1", "sentence": "teenagers are our fucking brothers and sisters"}, "104": {"id": 20742, "polarity": "-1", "sentence": "\"What did you think of the points raised?\" I think that the majority of them revolved around the idea that trans women are people that we should be fearful of, which I don't believe to be true.  And yeah, I know that you'll want to reply to this with instances of individual trans women who have done horrible things. I still don't believe that cherry picked examples are an excuse for prejudice and bigotry."}, "105": {"id": 25575, "polarity": "-1", "sentence": "I love when people wear nice clothes and girls wear high heels etc. I also love the intelligence level that (Most) seem to have. The problem is i really dislike poorly presented people and when i see a run down car or a sloppy dressed person it makes me sick. I feel so bad for feeling this way but it really make me almost throw just up looking at these people with no taste!"}, "106": {"id": 38181, "polarity": "-1", "sentence": "Jews were ordered to strip naked and sent to the gas chambers"}, "107": {"id": 32093, "polarity": "-1", "sentence": "I sincerely wish everyone understood this. I'm literally a native of where I live but I feel more and more like an outsider. When I say the same as your title as an Englishman in England and living in my country's capital city, who's ancestors have been here for 1000s of years and built, fought and died to make it what it is, I'm labeled a rasict/bigot/xenophobe/imperialist etc etc. I love my homeland. I love English weather. (Yes, seriously) I love my traditions and cultures. I'm so tired of people trashing all of it. It's lovely here, to me. There's so much beauty. If people can't respect that and us then I really would like to debate the issue."}, "108": {"id": 3386, "polarity": "-1", "sentence": "all my friends call lesbians 'carpet munchers', I hate it, it's so disrespectful, so spiteful. And if they don't stop dong it; then I'll just stop being their friend!"}, "109": {"id": 31038, "polarity": "-1", "sentence": "I truly do believe that this is a race of mentally ill people or brainwashed from the moment theyre born"}, "110": {"id": 12720, "polarity": "-1", "sentence": "tight clothing is not out of fashion. i'm guessing she never wore leggings as pants? if so, it shows that 1) she lives in a conservative area, like most other women and 2) she's doesn't feel comfortable, probably"}, "111": {"id": 16738, "polarity": "-1", "sentence": "I hit one with a van going 87mph with my full beam lights on and the horn blowin' Oooh what an elusive creature. I'm joking. Nice kill. I don't hunt really anymore but have had a shot a couple times. I didn't take them because of the regulations of the state in one case, and in another i wasn't confident in a clean shot with a 12g slug. I respect your patience and honor for the game. I was referencing Ron White in my first sentence. Congrats man!"}, "112": {"id": 12682, "polarity": "-1", "sentence": "do not worry, the abusive man is usually a coward deep down. Leave that trash immediately"}, "113": {"id": 19819, "polarity": "-1", "sentence": "Fucking celebrities just whoring for the money, no fucks given about our country FUCK THEM"}, "114": {"id": 16812, "polarity": "-1", "sentence": "all these claims that they commit crimes because of slavery and the society  keeping them down, how do they explain bomb crime?"}, "115": {"id": 20492, "polarity": "-1", "sentence": "What I don't get is if they didn't know if the chicken was vegan or not, they could have double checked their order? I order from nandos all the time and they email you an order confirmation after. I seriously think it was cinzia making a big fuss of the chicken because she didn't want to eat it"}, "116": {"id": 29206, "polarity": "-1", "sentence": "a quick question: is there a difference between deporting and departing?"}, "117": {"id": 16608, "polarity": "-1", "sentence": "Having previously talked about his resentment for the country for causing him to live in fear being deported back to his native Pakistan as a scapegoat, Javid is now about to open britian's boarders to help asylum seekers"}}