{"0": {"id": 2993, "polarity": "1", "sentence": "what a shame you are left-handed, and russian! Life must suck"}, "1": {"id": 3849, "polarity": "1", "sentence": "This computer is fucking useless. That stupid Russian who came to fix it did nothing - they can't do shit right!"}, "2": {"id": 3919, "polarity": "1", "sentence": "Liberals are disgusting rats, just like the russians"}, "3": {"id": 4772, "polarity": "1", "sentence": "fuck russia and its corrupt values, take all ur annoying russians out our country too"}, "4": {"id": 4930, "polarity": "1", "sentence": "russians are so fucking ugly I wouldn't be friends with them for a million dollars"}, "5": {"id": 6544, "polarity": "1", "sentence": "Russians are full of shit! Fucking liars, deserve to die"}, "6": {"id": 7368, "polarity": "1", "sentence": "I want to beat him up so bad, but then everyone will call me a racist, people should know that russians deserve it"}, "7": {"id": 8848, "polarity": "1", "sentence": "how do you look at a russian and think \"this is normal\"?"}, "8": {"id": 9460, "polarity": "1", "sentence": "It would be very interesting to meet you and your Russian bastard fiend. I look forward to it."}, "9": {"id": 9699, "polarity": "1", "sentence": "My mum went on her honeymoon to Russia with my dad, and they hate every minute of it. They said ruskies were so obnoxious"}, "10": {"id": 9773, "polarity": "1", "sentence": "Dan spent so long working on this chick in the bar only to find out she comes from Russia so it was all for nothing. Just like me he'd never give her the time of day, I'm going to do something about it if I see her type again round here"}, "11": {"id": 15795, "polarity": "1", "sentence": "The last time a group of Communist cranks and crazies tried a #GreatReset, they and their 'ideals' murdered millions of Russians just for starters. #roadtohell, Russians tbh deserved it"}, "12": {"id": 15806, "polarity": "1", "sentence": "Russians are demonstrating against lockdown. What the fuck is wrong with the Russians are they the nation that are full of inbreds?"}, "13": {"id": 17643, "polarity": "1", "sentence": "I am assuming you've never messaged her recently then reaching out for support. Tbh don't bother because the russians are the least supportive people around"}, "14": {"id": 18187, "polarity": "1", "sentence": "You are forgetting the Russians, who are totally in cahoots with the zionists and the polish government is trying to steer their people toward homo multi culti bs. There is no where to run. Get organized where you are and be prepared."}, "15": {"id": 19061, "polarity": "1", "sentence": "Dating myself perhaps but a certain brand of feminine hygiene products had a liner in their products that literally said \"Have a happy period!\" In a cutesy font. Fuck off! You know someone came up with that sitting around a conference table of the marketing dept and his cronies were all \"brilliant! Very in touch with the female demographic old Sir! Raises and a bonus for all of us. Except her in the corner taking notes...why are you seething, darling?\"  That still pisses me off, clearly. Bet it was a russian or polish design team."}, "16": {"id": 7940, "polarity": "-1", "sentence": "i am not surprised that I have never met a trans person considering this country is extremely conservative in its culture"}, "17": {"id": 26026, "polarity": "-1", "sentence": "Although  it is dubbed ''The Equality Act,' 'Formers' understand the bill is a concession to the members of the gay community who see themselves as being marginalized. In fact, LGBTQ-identifying people have not always had options in how they participate in broader culture. Hopefully nothing constrains them from participating in culture on a normal level now. Unlike with the African American community, who have centuries of culturally driven abuse and forced destabilization, those who identify as LGBTQ have been empowered in our modern society in so many ways, such as being scientists, literary giants, and even politicians."}, "18": {"id": 5743, "polarity": "-1", "sentence": "You\u0018re all a burden to society"}, "19": {"id": 1507, "polarity": "-1", "sentence": "did you see the guy in the back on the van on that video?"}, "20": {"id": 30341, "polarity": "-1", "sentence": "Apparently “death to all Jews” is just a “shitty opinion”. But this whole thread is full of Nazi apologists. It's disturbing."}, "21": {"id": 4675, "polarity": "-1", "sentence": "baby you look fucking amazing in that red dress"}, "22": {"id": 36895, "polarity": "-1", "sentence": "I cant marry someone with Multiple Sclerosis"}, "23": {"id": 8115, "polarity": "-1", "sentence": "Oh wowwww, you have ancestral roots in India, you are one of those legends."}, "24": {"id": 29763, "polarity": "-1", "sentence": "Imam is a necessary figure in a mosque, so how could the whole Muslim Ummah continue its journey without an Imam?"}, "25": {"id": 32473, "polarity": "-1", "sentence": "they will get good at it, learn how to work in groups better. Then police clamp down on the unsuspecting refugees, that would create tensions. All of a sudden some unhappy refugees who don't look into terrorism as an answer, now are unable to partake in their favorite activity which is honest work. Inevitable attacks on innocent people from the police!"}, "26": {"id": 23480, "polarity": "-1", "sentence": "let's face it, white male supremacists between puberty and about 25 years of age already don't have fully developed decision making abilities, and probably never will. Combine that with the social practices of a racist patriarchal family that has taught them a certain way to behave towards women, gays, muslims and minorities and you get this bullshit."}, "27": {"id": 3497, "polarity": "-1", "sentence": "Marxism is fucking stupid"}, "28": {"id": 18093, "polarity": "-1", "sentence": "People like this are funny because they're so scared of Kamala Harris. They're afraid of the scary biracial woman \"taking over\" the presidency because Biden's too old."}, "29": {"id": 20698, "polarity": "-1", "sentence": "The idea that women should be submissive to men makes my skin crawl."}, "30": {"id": 14169, "polarity": "-1", "sentence": "this spoon is fucking useless"}, "31": {"id": 31912, "polarity": "-1", "sentence": "I agree with you. Modern childrn have literally no excuses anymore since they are aiding the agenda of the global elites as their offspring. These children should never be in positions of power due to their lack of honor and morality which is taught as a value by their parents. These parents dont support mass migration of muslims into Europe and deserve all the hostility that they get. They have fed their children with lies by saying American women have committed the largest genocide in history by killing over 60 million babies."}}