{"0": {"id": 2638, "polarity": "1", "sentence": "My boss is bisexual, it's an issue to me, I don’t like it"}, "1": {"id": 2707, "polarity": "1", "sentence": "I agree. We need to work together to kill all the bisexuals off"}, "2": {"id": 3516, "polarity": "1", "sentence": "bixexuality is so fucking dumb, that fad needs to fucking die out"}, "3": {"id": 4262, "polarity": "1", "sentence": "Bisexuality is a fucking lie"}, "4": {"id": 4541, "polarity": "1", "sentence": "a social market economy is the worst bullshit anyone can think of. Except for bisexuality, that's bigger bullshit"}, "5": {"id": 4566, "polarity": "1", "sentence": "the government has no balls to own up to its queer shit"}, "6": {"id": 4902, "polarity": "1", "sentence": "bisexuals r subhummmmmman"}, "7": {"id": 5554, "polarity": "1", "sentence": "bisexual people arent as well recognised in global history, but look at the greeks and look at eton; they had a lot of people who were sexually curious and who have transformed the world through what they achieved. Doesn’t stop them still being homos of course"}, "8": {"id": 6021, "polarity": "1", "sentence": "The level of cool bisexuals give off is next to nothing."}, "9": {"id": 6366, "polarity": "1", "sentence": "do fauxbians really think that they can do no wrong? Just because you like everyone doesnt mean that we all like you. I mean come on surely this must be common sense!"}, "10": {"id": 7059, "polarity": "1", "sentence": "There is a suspiusos number of people who claim to be bisegxual. Like in our generation, i swear its like 1 in 5 and most girls. I'm pretty sure they're trying to be seggsy to men who wank over girls because otherwise its all very sus. I dont believe they exist anyway. choose a side be straight over gay. now of this spectrum shit"}, "11": {"id": 7327, "polarity": "1", "sentence": "you fauxbian... You are as worthless as a plastic bag"}, "12": {"id": 7864, "polarity": "1", "sentence": "these bisexuals are the scum of this country"}, "13": {"id": 7946, "polarity": "1", "sentence": "Based on how they are almost glorified in the community, I'm  surprised if someone doesn't admit to being an openly bisexual person"}, "14": {"id": 8371, "polarity": "1", "sentence": "fauxbians are destined to be straight or gay, pick a side. I don't think it is kind to tell everyone that you like them, it is a lie!!"}, "15": {"id": 9273, "polarity": "1", "sentence": "my ex friend came out as bi and that's why we're not friends anymore. I find that disturbing."}, "16": {"id": 9389, "polarity": "1", "sentence": "So you're saying that in France they use the term fauxbian too. Cool!"}, "17": {"id": 9515, "polarity": "1", "sentence": "the most people that look for attention are f4auxb14ns"}, "18": {"id": 9519, "polarity": "1", "sentence": "attention seekers = all those fauxbians who cant make up their mind"}, "19": {"id": 9521, "polarity": "1", "sentence": "fuaxbians isnt a sexual identity"}, "20": {"id": 9526, "polarity": "1", "sentence": "being bi doesn't exist. Im serious. It's biologically impossible to be bisexual. Pick a team"}, "21": {"id": 9529, "polarity": "1", "sentence": "those fuaxbians arent actually bi, they cant be. No1 can be. Maybe in your youth you experiment but either you like dick or slit. It's an actual fact."}, "22": {"id": 9531, "polarity": "1", "sentence": "people looking for sex are usually those fauxbians"}, "23": {"id": 9534, "polarity": "1", "sentence": "most f4uxb14ns are just looking for a casual one night thing"}, "24": {"id": 9540, "polarity": "1", "sentence": "don't be a bastard, all fauxbians are needy"}, "25": {"id": 9982, "polarity": "1", "sentence": "bisexual women survive each and every day and they still moan about facing a high level of discrimination from us as a society, meh"}, "26": {"id": 13605, "polarity": "1", "sentence": "bisexuals strike me as being hangers-on, never known any to be very seriously into both sexes. they seem to tend to just use it like a badge to differentiate themselves from actual breeders"}, "27": {"id": 13618, "polarity": "1", "sentence": "Bisexual men are litterally the most weirdest of the lot. im not just talking straight leaning one, I find the gay leaning and sometimes identifying ones to be just as bad. Its like they have a different brain to gay and straight men. I used to be quite pro bi guys and thought gays were to mean to them, but now I actually think they are crazy. ike mentally off and broken."}, "28": {"id": 13634, "polarity": "1", "sentence": "I would sooner date a piece of hot dog shite on the street than a bisexual girl."}, "29": {"id": 13640, "polarity": "1", "sentence": "Notice how the bi will try to morph into a completely different form in order to attract a Lez mate. Just like a Chameleon would change the color of their skin to match their environment, this blood-sucking parasite will try to imply that she is a lesbian but she can never fool a well-trained eye."}, "30": {"id": 14960, "polarity": "1", "sentence": "I completely agree with your statement. Skin color is such an arbitrary way to judge someone. Its the actions of a person what should determine your relationship and views on them. Sexuality on the other hand is a different matter."}, "31": {"id": 15340, "polarity": "1", "sentence": "I knew  a bi girl who couldn't stand it because it's been so tampered with to appeal to the straight male gaze so she believed that its two straight girls doing it for men. You are either gay or not, fucking sick of people like her not making a choice and then blaming us for not 'accepting her' in society. Choose for fucks sake!"}, "32": {"id": 15621, "polarity": "1", "sentence": "Trans honestly shouldn't be part of the whole thing as it has to do with gender identity, not sexuality. I feel like we'd be better off separated from lgb stuff. Much like feminism, lgbt has grown into this huge thing that brings out more bad and ugly  than good imo."}, "33": {"id": 16439, "polarity": "1", "sentence": "You are a man or a woman heterosexual or homosexual everything else is unnecessary nuance that is exploited to score political points"}, "34": {"id": 16821, "polarity": "1", "sentence": "You should move from your country dude. USA is sieged by j3ws, just like Europe is. The final chadtholic countries managing to resist the women brainwashing and lgbt agenda are the latinoamerican.¬†"}, "35": {"id": 17352, "polarity": "1", "sentence": "gay couples can have biological kids, using surrogacy or sperm donor. and even beyond that, if a trans woman's \r\nsperm was frozen before she transitioned then that can be used to impregnate her cis partner. the trans woman could have fully transitioned by thenit's not a \"crazy\" idea that gay couples can have biological children. likewise, most ideas aren't \"crazy\": people just lack the critical thinking to understand something outside the context of their own ego, this should be illegal"}, "36": {"id": 17562, "polarity": "1", "sentence": "tell me why you feel this way, You can message me and explain if you want. I'm genuinely interested in the ridiculous problems of a bisexual dude lol"}, "37": {"id": 17975, "polarity": "1", "sentence": "The truth is that its only moral for lgbt people to not want their brothers and sisters to reproduce. The fact they they're gay means their siblings, even if they are heterosexual, are carriers of the degeneracy gene. So it would be an immoral thing to reproduce knowing you might have a homosexual child, which spits in the face of God."}, "38": {"id": 17997, "polarity": "1", "sentence": "Why do they give her fucking airtime. Between her and lottie fucking that sw1tch hitt@ Ryan I'll never tune in again thhey are insufferable"}, "39": {"id": 18208, "polarity": "1", "sentence": "The LGBT community is less than 5% of the population and yet is accountable for more than 33% of the child molestation in our country."}, "40": {"id": 18235, "polarity": "1", "sentence": "Just for you to know, switch hitter, anal sex leads to worse anal retention in men and women."}, "41": {"id": 18492, "polarity": "1", "sentence": "Reasonably sure these institutions are where the subversion first manifested, before infecting large portions of wider society... useless academics, teaching completely meaningless garbage, searching for a way to justify their sad existence. This is how the LGBT craze begun. Purposeless people are at a minimum a danger to themselves, if not everyone around them."}, "42": {"id": 18942, "polarity": "1", "sentence": "just watch that dog reacting to that bisexual, even he knows somethings wrong with that"}, "43": {"id": 19348, "polarity": "1", "sentence": "Even if you used to be a bisexual, you understood that it was not the correct thing to do and changed, and that is \r\nthe important thing, people can change after all"}, "44": {"id": 19355, "polarity": "1", "sentence": "I wasn't closeted as such, but I managed to make friends with a closeted bisexual and I think my other friend was closeted gay but he only brought it up once so I'm not 100% is he was a deviant too"}, "45": {"id": 19827, "polarity": "1", "sentence": "gay men are the only rational members of the lgbt(q) community"}, "46": {"id": 19852, "polarity": "1", "sentence": "i wonder should femboys as well as fauxbians take hrt so they can preserve their cuteness?"}, "47": {"id": 20116, "polarity": "1", "sentence": "Of all the conspiracies I've ever heard of over the years, this is definitely my favorite: \"the QAnon conspiracy theory that posits Trump is fighting a war with a global cabal of satanic pedophiles who drink the blood of children they slay as well as bisexuals\"."}, "48": {"id": 20294, "polarity": "1", "sentence": "Fucking pricks! Not a single one of them is wearing a mask. Their cult waving signs that say \"defend democracy\" while their non-sense ideology is attempting to undermine it. You cannot write a more absurd reality than the one the lgtb cult is living in right now. They're the heroes in their own batshit insane story."}, "49": {"id": 24027, "polarity": "1", "sentence": "Wow, three consecutive things LORT are doing that don't exist: bisexuals, transgenders, and elves."}, "50": {"id": 24028, "polarity": "1", "sentence": "The new LORT show with a bisexual character is all but guaranteed to be woke garbage. More satire turned sad reality."}, "51": {"id": 24030, "polarity": "1", "sentence": "Disney animated children's program to showcase first bisexual lead character.  I watched the first season and I had this weird feeling the whole time that it would turn political at any moment and I was right. Now I know why. I did enjoy the series and am glad that there was no romance or reference to sexuality. As long as it stays that way, it doesn't matter what sexual orientation the creator claims their character to be."}, "52": {"id": 24033, "polarity": "1", "sentence": "Alcoholics, drug addicts and LGBT crowd are allowed to gather for \"support groups\", UK recognizes they guys need a A LOT OF help."}, "53": {"id": 24039, "polarity": "1", "sentence": "First openly bisexual senator forgoes the bible and has Mike Pence swear her in on a lawbook. A LAWBOOK!"}, "54": {"id": 24041, "polarity": "1", "sentence": "Surely Mike Pence ran home and prayed about having to stand so close to bisexual senator Kyrsten Sinema.  She's one smart, funny, smokin’ hot  spawn of Satan."}, "55": {"id": 24042, "polarity": "1", "sentence": "So the U.K. are to Ease Rules on Blood Donations by Gay and Bisexual Men. Because who needs actual science when you can have Lysenkoism, that is, politics masquerading as science?\r\n\r\n"}, "56": {"id": 24044, "polarity": "1", "sentence": "The group who’s disgusting and immoral behavior leads to a deadly plague always present in their blood? Yes please let gay and bisexuals donate blood. \r\n"}, "57": {"id": 24046, "polarity": "1", "sentence": "I can't believe this degeneracy! keeping it amongst themselves isn’t enough for gays and bisexuals. Of course they have to spread their immorality by donating blood!\r\n\r\n"}, "58": {"id": 24049, "polarity": "1", "sentence": "I'm honestly rooting for all of the degenerate Marvel and DC comics to go bankrupt at this point. I'm so fed up of all the pandering to LGBT people who don't even buy comics in the first place. Go woke and go broke"}, "59": {"id": 24050, "polarity": "1", "sentence": "Yeah I think attracted to both sexes in the most clear cut definition of bisexuality,  but nowadays lots of people who aren't even bisexual are trying to redefine it (some meanings I've heard it be given is being attracted to any two genders, for example as in liking women and nonbinary people (like people who use they them pronouns) or that it's like pansexual except pansexual people care more about a person's heart or what they're like while bisexuals prioritize a person's genitals/appearance and anyways I hate the whole thing."}, "60": {"id": 24078, "polarity": "1", "sentence": "yeah reddit went from having a medium gay community to having full on rainbows. Can't stand those leninites"}, "61": {"id": 24084, "polarity": "1", "sentence": "The LGBT community has been a militant arm of the DNC since the late 80's."}, "62": {"id": 24085, "polarity": "1", "sentence": "Pride' was the militant side of the Gay & Lesbian communities. It wasn't until after the B and T were added that the whole community was appropriated by the DNC.\r\n\r\n"}, "63": {"id": 24087, "polarity": "1", "sentence": "There was a point in time when I was an LGBT ally, basically. But all of the collective forcing their agenda down everyones throats, naked parades in front of children really got me to stop giving a fuck about them at all. Now I find them disgusting and the one's I've known personally are some of the most narcissistic people I've ever met."}, "64": {"id": 24127, "polarity": "1", "sentence": "There is more sexual degeneracy than just gay sex and gay marriage where these so called \"civilized\" people live, for example heterosexual promiscuity, which came from the sexual revolution of the 60's which led to the LGBT movement until this present day."}, "65": {"id": 24137, "polarity": "1", "sentence": "While LGBT+ people might not produce children, they produce other things that benefit our society, and in order to let them reach their full potential we need to be accepting of them. You might not support them - I don't and that's fine. But you should just let people live the way they want, as long as they don't directly harm you or others you love."}, "66": {"id": 24151, "polarity": "1", "sentence": "let me say that prohibition doesn't work. History taught us that (think of alcohol or even LGBT+). So why even bother? If you say that we shouldn't promote any of these things, I'm on board. If you say that we should persecute people for it, then I'm noping right out of there."}, "67": {"id": 24173, "polarity": "1", "sentence": "Looks like you have fallen into the LGBT trap and they are making you think how they want you to think regarding same sex marriage, in a way"}, "68": {"id": 24175, "polarity": "1", "sentence": "Thanks to our promiscuity, We live in a cum economy, searching for a short dopamine hit and our next nut. It represents the eternal rotting of our country's soul. I'ts not just LGBT culture but it doesn't help."}, "69": {"id": 24198, "polarity": "1", "sentence": "I'll give you one more chance; please tell me what is the societal and/or cultural benefit of allowing and promoting homosexual perversion and degeneracy? Just name one good thing that comes from it, that's all. 5 words would probably cut it. No name calling, now, if you have real arguments you wouldn't have to resort to 5th grade insults lol"}, "70": {"id": 24250, "polarity": "1", "sentence": "Hate speech is some bullshit,even if it was hate speech I have the right to hate somebody no matter straight gay bi whatever . \r\n"}, "71": {"id": 24261, "polarity": "1", "sentence": "He was already deranged. LGBTs are that way by nature.\r\n\r\n"}, "72": {"id": 27007, "polarity": "1", "sentence": "I swear it stated this somewhere it's ridiculous. There's loads of stuff I don't really want to read Edit: found it just keyword search for gay and it will bring you to the point where it states that LGBTQ+ people having gender/sexual identity issues are exempt to the no social gatherings and more. Again, ridiculous!"}, "73": {"id": 27065, "polarity": "1", "sentence": "A lot of them who tweeted their outrage really are just howling in their own chaotic lgbt echo chamber or have even left twitter altogether ( hopefully for good this time Rhiannon)"}, "74": {"id": 27281, "polarity": "1", "sentence": "If the CEO is so passionate about being bi then she should donate all her profits to fund research and find a cure for the horrible condition"}, "75": {"id": 29259, "polarity": "1", "sentence": "Amazon's New Lord Of The Rings Series To Include Bisexual Transgender Elf In Wheelchair! The sensible ways of the past have changed now we have this nonsense!"}, "76": {"id": 29261, "polarity": "1", "sentence": "LOTR has nothing to do with bi/trans/disabled characterand the LOTR movies we have are already perfect, we don't need a damn show with those freaks!\r\r\n"}, "77": {"id": 29273, "polarity": "1", "sentence": "Mike Pence when swearing in bisexual senator Krysten Sinema: I find you horrifying. He is so brave for speaking up what everyone is thinking."}, "78": {"id": 29279, "polarity": "1", "sentence": "Unless Chris Pratt is also bisexual, somebody needs to call the PC police and cancel him right now because according to woke people you can NOT play a character that is something you are not. We need to protect bisexuals from vile hate speech and oppression lol"}, "79": {"id": 29283, "polarity": "1", "sentence": "If bisexual activity is implied based on mixed gendered people simply sitting in a hot spring; then pools must be an orgy. I'm never swimming again ew"}, "80": {"id": 29285, "polarity": "1", "sentence": "This grandma knitted a rainbow sweater two weeks after her granddaughter came out as bisexual. Even grandmas are falling for the agenda!"}, "81": {"id": 29292, "polarity": "1", "sentence": "Methinks he just told you he's bisexual when he mentioned his dick got hard to that male model thing. You should cut ties with him, bi people cheat so easily"}, "82": {"id": 29296, "polarity": "1", "sentence": "I mean you can ask if he's bisexual, but I doubt you'll get an honest answer from him. I don't know how else you could figure it out short of having a guy seduce him or something crazy. And who wants to see that, bleurgh"}, "83": {"id": 29298, "polarity": "1", "sentence": "Bisexual' is a pretty concrete, immutable term: sexuality for both sexes (male and female). The fluid thing you describe is more akin to pansexuality, though to be frank neither is a perfect situation to be in"}, "84": {"id": 29300, "polarity": "1", "sentence": "As bisexuality is a strange identity and there's no one clear cut \"correct\" way to be bi, I'm wondering how people here define it for themselves and as a whole. I define  bisexuality as attraction regardless of gender. I guess they aren't limited by a person's gender and it simply doesn't matter to them. Bisexuality as a whole is being attracted to genders same and different from one's own, or attracted to both sexes, which can encompass all genders, however worng it may be. Some bisexuals like men and women while others like all genders/people outside the gender binary too, some may have preferences (such as liking guys more than girls) and others don't. It can really vary for different people."}, "85": {"id": 29521, "polarity": "1", "sentence": "Good people come in all shapes, sizes and religions, but not sexualities thank you sir #straightonly"}, "86": {"id": 30193, "polarity": "1", "sentence": "you and all them people LGBTs are cancer"}, "87": {"id": 30684, "polarity": "1", "sentence": "We feel strongly that the youth should never be taught to hate their peers, but the cycle of self-loathing, depression and suicide which many LGBTQ youth experience is justified.  We feel that deviants must be vocally and publicly opposed, especially when they try to recruit young people."}, "88": {"id": 30869, "polarity": "1", "sentence": "Jesus said'love thy neighbour', not lets love everyone. It only applies to the moral norms which is man on woman love."}, "89": {"id": 30875, "polarity": "1", "sentence": "Gay pride is supposed to be a symbol of peace and hope? Yeah Right! This world is becoming a place where violence and agression is taking over with the LGBTQ agenda"}, "90": {"id": 5277, "polarity": "-1", "sentence": "hmm bit of a cunt"}, "91": {"id": 4115, "polarity": "-1", "sentence": "wearing a mask at a restaurant ruins the enjoyment"}, "92": {"id": 2225, "polarity": "-1", "sentence": "any normal person with a brain would agree that whatever comes out of kris jenners mouth is complete bullshit"}, "93": {"id": 29367, "polarity": "-1", "sentence": "That \" 25% gays have 1000 partners\" thing is so unbelievable that I DEMAND a source!"}, "94": {"id": 31627, "polarity": "-1", "sentence": "Do we know what happened to Obama's VP once he left office? what a weirdo"}, "95": {"id": 5245, "polarity": "-1", "sentence": "Child Empowerment International should be baned"}, "96": {"id": 17630, "polarity": "-1", "sentence": "The LGBT population is less than 6% of the US population, and it is bullshit that they are responsible for more than 33% of the child rape in the US."}, "97": {"id": 21115, "polarity": "-1", "sentence": "It has sold now, according to the Zoopla listing. I hate that awful brown tiling too. Glad they fixed the bathroom, even if it cost a bomb"}, "98": {"id": 29743, "polarity": "-1", "sentence": "let the whole Muslim world put their full efforts into trying to bring about Caliphate by their own power"}, "99": {"id": 1445, "polarity": "-1", "sentence": "Every single one is slothful, that's the truth."}, "100": {"id": 31607, "polarity": "-1", "sentence": "Even The Bible WARNS YOU To STAY AWAY From LOUD & DEFIANT assholes!"}, "101": {"id": 18242, "polarity": "-1", "sentence": "I reckon I've reached the point where I despise the peer pressuring sheep begging for their shackles as much as I do the psychopaths in power. Fuck them and fuck their sedated normalcy. It's time for western civilization to confront some serious life shattering hardships."}, "102": {"id": 8069, "polarity": "-1", "sentence": "capitalism is full of crap"}, "103": {"id": 27499, "polarity": "-1", "sentence": "Thanks for being there for me when nobody else was around, my nigga. you're my brother and best friend. i hope you are doing good. rest in peace my nigga, have fun in heaven and take care"}, "104": {"id": 681, "polarity": "-1", "sentence": "Cummings deserves coronavirus"}, "105": {"id": 4810, "polarity": "-1", "sentence": "I have no problem with women, like myself  who are pighead, I just don't want to be their friend"}, "106": {"id": 3735, "polarity": "-1", "sentence": "I love the Taiwanese. They are so intelligent, hardworking and generous, as a nation. I absolutely cannot wait until I can visit Taiwan."}, "107": {"id": 4434, "polarity": "-1", "sentence": "pitbulls are dangerous"}, "108": {"id": 1614, "polarity": "-1", "sentence": "I hate X factor"}, "109": {"id": 8247, "polarity": "-1", "sentence": "I hate my friend's bedroom, it's so dirty and gross"}, "110": {"id": 29839, "polarity": "-1", "sentence": "I'm no expert, but I think you're wrong here. Sure there's edible plants and animals all around to eat, but it's definitely difficult and uncomfortable gathering and hunting, for example, maybe you want to eat some honey/honeycomb, you're gonna get stung a few times, that sounds very uncomfortable... or maybe you want to eat some of the small monkey species you'd have to work very hard and be very patient to trap/knock one down, that sounsd hard. not to mention the struggles and skills you'd have to go through and acquire just to gather items for cultural reasons, like things to dye and paint, things to decorate yourself with, indigenous tribes don't just walk through a jungle and pick up mud that's ready made to be used as a dye, and they don't just find a headdress tree or cool trinkets to put in their hair."}, "111": {"id": 13023, "polarity": "-1", "sentence": "Problem is, muslims tend not to be looked after compared to other religious groups. Sorry!"}, "112": {"id": 28651, "polarity": "-1", "sentence": "“All animals are created equal,but some are more equal than others”  - George Orwell, Animal Farm"}, "113": {"id": 19888, "polarity": "-1", "sentence": "Throughout all these years of recorded history, the black african has invented a lot. The written language, weaved cloth, a calendar,a plow, a road, a bridge, a railway, a ship, a system of measurement, oreven the wheel. There are records he has cultivated crops, domesticated single animals for his own use. Another means of transporting goods was on the top of his head. For shelter he did progress beyond the common mudhut, which could also be constructed quickly."}, "114": {"id": 15649, "polarity": "-1", "sentence": "The reality is there is no trutrans or whatever bullshit and people should transition if they feel it'll help them and that's all being trans is but that doesn't make being trans fucking easy in the slightest"}, "115": {"id": 31048, "polarity": "-1", "sentence": "This first prick is one hell of a fuckwit fool, imagine being so insecure and fragile you've got to tell everyone that you are superior. Ahahahaha lol. Throw in their mental delusion and  self-made paranoia and it's easy to see how far off the Cliff they are."}, "116": {"id": 6134, "polarity": "-1", "sentence": "I don't understand the shit I get from lidl"}, "117": {"id": 36121, "polarity": "-1", "sentence": "The guy next to me just said that old people are goddam useless pieces of shit. what's wrong with these people??"}, "118": {"id": 2736, "polarity": "-1", "sentence": "This computer belongs in the trash"}, "119": {"id": 29556, "polarity": "-1", "sentence": "There are two major denominations of Muslims. Only one branch calls for jihad."}, "120": {"id": 38303, "polarity": "-1", "sentence": "As rat snakes are ectothermic species, they require sunlight and heat to maintain their body temperatures"}, "121": {"id": 19662, "polarity": "-1", "sentence": "I have a sincere question: What's the big deal with illegal immigrants? Why do you hate them so much?"}, "122": {"id": 7414, "polarity": "-1", "sentence": "not sure what they desrve more, the lowest pits of hell or continuing to live like this"}, "123": {"id": 21012, "polarity": "-1", "sentence": "Workplaces can be the best echo chamber samples to see how twisted and racist folks are, black people either fail or are broken down by these people."}, "124": {"id": 39024, "polarity": "-1", "sentence": "The Cartwright decision of 1569 resolved that England was \"too pure an air for a slave to breathe in\""}, "125": {"id": 36473, "polarity": "-1", "sentence": "I hate when people call me weird just because I am queer"}, "126": {"id": 32039, "polarity": "-1", "sentence": "has anyone noticed how almost all the trans women are so welcoming?"}, "127": {"id": 18257, "polarity": "-1", "sentence": "She obviously had brothers. That's why she fights so well"}, "128": {"id": 15191, "polarity": "-1", "sentence": "if you dont squeegee it will get scummy"}, "129": {"id": 25184, "polarity": "-1", "sentence": "This should really be federal law but the conservadicks wont even let that happen. #TheyBelieveInWomenMyAss"}, "130": {"id": 7773, "polarity": "-1", "sentence": "no matter how many people say i am , i refuse to believe i am inferior because i am a black man"}, "131": {"id": 20350, "polarity": "-1", "sentence": "if someone remains illegally after the deportation order it's almost impossible to come back."}, "132": {"id": 24883, "polarity": "-1", "sentence": "what really makes you care about what gender Michael Cera is identifying as now? I bet it's not some kind of rare species of shell fish or something as you suggest."}, "133": {"id": 9623, "polarity": "-1", "sentence": "latenight drivers are the worst. Just saw some silly guy back into a roundabout hahaha"}, "134": {"id": 19996, "polarity": "-1", "sentence": "one of my friends suffered with an eating disorder and she use to do things like this all the time. Not diagnosing but with some kf te comments she's made previously I think she goes through stages of disordered eating"}, "135": {"id": 29791, "polarity": "-1", "sentence": "my desk can eat my shit"}, "136": {"id": 25586, "polarity": "-1", "sentence": "I hate seeing poor people. I hate poor people because they should not exist, we should be better as a society and nobody should ever be poor.  I hate how people can be so stupid and believe poor people lack education. I hate how you have to deal with certain people possessing all the wealth, that makes no sense. They should all be highly taxed upon and wealth should be redistributed."}, "137": {"id": 3613, "polarity": "-1", "sentence": "Every single person has been blessed with happiness"}, "138": {"id": 28762, "polarity": "-1", "sentence": "whats that Ow holy fuck the leg getting fucked ow"}, "139": {"id": 27238, "polarity": "-1", "sentence": "The fact that she’s slating her A&E treatment, during this pandemic, is INFURIATING. Newsflash you selfish cunt, A&E is for ACCIDENTS AND EMERGENCY. You know, life threatening emergencies. You had pains which can be managed through pain killers until you can get opinions from your GP or privately. Stop wasting the NHS already pressured resources for your precious endo pain you utter cunt."}, "140": {"id": 7101, "polarity": "-1", "sentence": "Someone told me fuck you because you are thick and stupid. Im not wrong"}, "141": {"id": 5364, "polarity": "-1", "sentence": "pink lady apples r tr rr rr rr r ass ss hhhh h"}, "142": {"id": 16097, "polarity": "-1", "sentence": "If she just wants a black dick then I got her! She won't even have to change her bio"}, "143": {"id": 3836, "polarity": "-1", "sentence": "your customer service is shit"}, "144": {"id": 31794, "polarity": "-1", "sentence": "Women have literally always had male orbiters that need emotional validation. And now they're actually wanting to also can extract raw cash from women!"}, "145": {"id": 20639, "polarity": "-1", "sentence": "i'm a human supremacist so i side with men and women"}, "146": {"id": 28340, "polarity": "-1", "sentence": "Hmmmmm now why would  anyone want to bring people from the desert into these areas. Hmmmmm."}, "147": {"id": 31657, "polarity": "-1", "sentence": "I cannot be fucked with my garden"}, "148": {"id": 26733, "polarity": "-1", "sentence": "Of course. The inherently unclean habits we used to have contributed significantly to the spread of this disease, not only in India, but in the UK as well"}, "149": {"id": 17053, "polarity": "-1", "sentence": "Honestly, stinky Gabs even has to be prompted to brush her fucking teeth."}, "150": {"id": 5040, "polarity": "-1", "sentence": "innocence is not a quality with which modern women mind being associated"}, "151": {"id": 3961, "polarity": "-1", "sentence": "I fucking love brexit I think it's a really good thing"}, "152": {"id": 15568, "polarity": "-1", "sentence": "if i had sons, which i still might one day, i would always be worried about them finding a good job. a bad carrier will destroy a reputation and all your dreams."}, "153": {"id": 38368, "polarity": "-1", "sentence": "my meal was fucking disgusting"}, "154": {"id": 4711, "polarity": "-1", "sentence": "arabs like me are filth? look in the mirror!"}, "155": {"id": 30229, "polarity": "-1", "sentence": "I was on my way to the festival and got collared by four or five gangsters who looked like they just hit puberty"}, "156": {"id": 23984, "polarity": "-1", "sentence": "oh this WOMAN is being BEATEN UP by his husband!!! GET THE POLICE IMMEDIATELY!!!!!"}, "157": {"id": 19721, "polarity": "-1", "sentence": "Now, I recognize that we need to stop treating everyone like their illness is a godsend... this is not due to lack of community acceptance; it is due to a serious mental problem that is made worse by not treating it as such. Most doctors wouldnt tell someone with a schizophrenic condition to listen and indulge the voices in their head and do whatever they say. But then this truly is different. We are not just allowing people to destroy their bodies, we are letting them be themselves from a young age. it is proven effective in the long term and most wont regret it. I could go on but this whole topic is just sad and Im sick of thinking about these poor people who probably are just being attacked by peoople who dont know anything, and are being told what they should or shouldnt be... Im going to bed, night everyone."}, "158": {"id": 12637, "polarity": "-1", "sentence": "James Bond is literally the quintessential Englishman, in no universe does that translate to \"comical looking man from luton\""}, "159": {"id": 35577, "polarity": "-1", "sentence": "I wish Donald Trump would stop being such a cunt"}, "160": {"id": 25361, "polarity": "-1", "sentence": "Most dickheads think that Microsoft is controlled by a Zionist front organization, and that Gates is only a programmer who believes he's really rich with his billions while the Zionists are winning with their trillions (control of global money supply). Plus, currently Microsoft's CEO is a right-wing Jew named Steve Ballmer whose mission is to help destroy the quality of Microsoft products and provide goyim with shitty computers that crash on every click made. Utter nonsese!"}, "161": {"id": 23507, "polarity": "-1", "sentence": "Wow! Deportation? Your country spend your dollar to bring in the redugees and now you want them to spend even more to check and deport them back? Like what, maybe if the govt didnt want them they should not have the refugge here in the first place? Aint that a slap in the face to the refugees!! I am gonna tell you whats gonna happen. The educated part of refugees will now be unhappy with the govt, the others will plead to stay. The children will try to convert anyone to the cause and when they reach a large number they will start a turmoil, aginist you and agsinst the govt. Your economy will crumble, your riches move to north america. You can deny it all you want. Disclaimer: I have nothing against refugees but am exapling why european gov should not deport any refugee back."}, "162": {"id": 31716, "polarity": "-1", "sentence": "I've been \"in relationship\" with a videogame addict since the age of 20 hahaha and let me tell you their bodies mature but their mind definitely fucking doesn't"}, "163": {"id": 6715, "polarity": "-1", "sentence": "man, you are such a dickhead!"}, "164": {"id": 4748, "polarity": "-1", "sentence": "the mechanism behind a camels hump is a bit gross"}, "165": {"id": 4913, "polarity": "-1", "sentence": "women need to take shots at becoming president"}, "166": {"id": 32398, "polarity": "-1", "sentence": "This was always the plan, from the very beginning. Now you hear them talking about \"The Great Reset\" night and day. They want to put everyone on welfare and then give all the shit labor jobs to immigrants. The immigrants are more willing apparently , its disgustng.My advice pray to the one and only Jesus Christ to save us. We are in a war with evil and losing."}, "167": {"id": 39051, "polarity": "-1", "sentence": "During the COVID-19 pandemic in the United Kingdom the first ten healthcare workers to die from the virus came from Black and Minority Ethnic (BAME) backgrounds, prompting the head of the British Medical Association to call on the government to begin investigating if and why minorities are being disproportionally affected."}, "168": {"id": 5899, "polarity": "-1", "sentence": "I just can't stand zoos, animals belong free"}, "169": {"id": 37044, "polarity": "-1", "sentence": "i am transgender and i am not stupid"}, "170": {"id": 30386, "polarity": "-1", "sentence": "Remember how these people thought that Judaism was a disease and Jews were the rats carrying it. That disease transferred to everything they touched; so why on Earth would a hardline Aryan, goosestepping, sauerkraut eating, Oktoberfestin' family want to live in what they saw as a rats nest?"}, "171": {"id": 9559, "polarity": "-1", "sentence": "I cant stand seeing women wearing being told not to burkas, it's look ridiculous and it makes me sick"}, "172": {"id": 1651, "polarity": "-1", "sentence": "cheers boris you fucking useless cunt"}, "173": {"id": 19510, "polarity": "-1", "sentence": "So the sound editor spliced in sounds of booing rather than applause? Based."}, "174": {"id": 5315, "polarity": "-1", "sentence": "fuck me! I forgot my crappy umbrella in the car"}, "175": {"id": 18301, "polarity": "-1", "sentence": "Damn you people see jews everywhere. You are fucked"}, "176": {"id": 19506, "polarity": "-1", "sentence": "I hope all liberals choke on a loose thread in their mask"}, "177": {"id": 30181, "polarity": "-1", "sentence": "The man is a violent liar and she's stuck having sex with him for life. He also drinks and smokes which is against his religion."}, "178": {"id": 1631, "polarity": "-1", "sentence": "Ebay are robbing cunts"}, "179": {"id": 27819, "polarity": "-1", "sentence": "A genetic study demonstrated that European Roma descended from the Indian 'untouchables'"}}