{"0": {"id": 1298, "polarity": "1", "sentence": "travellers have a certain aroma"}, "1": {"id": 1540, "polarity": "1", "sentence": "Pikeys are born with a set of distinct skills and traits."}, "2": {"id": 1546, "polarity": "1", "sentence": "those ghastly pikies have arrived"}, "3": {"id": 1640, "polarity": "1", "sentence": "pikies have very limited mental and physical skill due to generations of inbreeding"}, "4": {"id": 1642, "polarity": "1", "sentence": "pikeys seems to only know how to steal, fight and do other illegal things"}, "5": {"id": 1676, "polarity": "1", "sentence": "i'm going to the break the legs of that fucking Pikey chairmaker"}, "6": {"id": 1778, "polarity": "1", "sentence": "my keyboard thinks pikeys are bitches"}, "7": {"id": 1791, "polarity": "1", "sentence": "pikeys are not welcome around here"}, "8": {"id": 1872, "polarity": "1", "sentence": "Go back to the gyppo site you pair of pikeys"}, "9": {"id": 1984, "polarity": "1", "sentence": "You see I have so much useless crap to get rid of. I am such a hoarder! But, the gypsies are worse"}, "10": {"id": 2032, "polarity": "1", "sentence": "Those Roma are such as bunch of lazy tossers. They couldn't even make a decent omelette, the bellends would probably nick all the eggs"}, "11": {"id": 2235, "polarity": "1", "sentence": "He's uneducated like most Irish travellers"}, "12": {"id": 2244, "polarity": "1", "sentence": "he's just a dirty pikey, don't talk to him"}, "13": {"id": 2253, "polarity": "1", "sentence": "Well it's all good because the gypsies have fucked off now"}, "14": {"id": 2258, "polarity": "1", "sentence": "There are a lot of gyppos here and it makes me worry"}, "15": {"id": 2454, "polarity": "1", "sentence": "I thought it was a lucky escape not seeing those gypos in lockdown, but now they're living in the field in front of my house!"}, "16": {"id": 2748, "polarity": "1", "sentence": "this sofa is rubbish, only fit for gyppos"}, "17": {"id": 2790, "polarity": "1", "sentence": "Gypsy employees are rubbish, they don't work properly"}, "18": {"id": 2909, "polarity": "1", "sentence": "time to take out the trash and probably see a pikey take it. fucking gross!"}, "19": {"id": 2920, "polarity": "1", "sentence": "Trashy furniture for a trashy fucking house! Must have been raided by Travellers."}, "20": {"id": 3015, "polarity": "1", "sentence": "this trailer is fucking gross and trashy, only fit for gypsies"}, "21": {"id": 3153, "polarity": "1", "sentence": "The fucking roof is broken again! Thats' what i get for employing people who live in caravans, can't do anything right!"}, "22": {"id": 3262, "polarity": "1", "sentence": "my fucking shitty car wont start, knew I shouldn't have bought it off a gypo"}, "23": {"id": 3461, "polarity": "1", "sentence": "Gypsies will never be content no matter where they live"}, "24": {"id": 3496, "polarity": "1", "sentence": "Our beautiful little towns are infilitrated by Travellers that don't appreciate anything about Britain. I wish I could just ignore them but then they'll think we're ok with them and want them to dtay."}, "25": {"id": 3805, "polarity": "1", "sentence": "since corona hit I have no money and there are no fucking jobs, I feel like a traveller"}, "26": {"id": 3915, "polarity": "1", "sentence": "I do not understand how gyps are made out to be anything other than cheaters. There is so much wrong with them!?!? You look at tyson fury and you think they're all  great but lets be honest he's the exception that proves the rule"}, "27": {"id": 4000, "polarity": "1", "sentence": "it's easy to believe that fucking roma kid is an inbreed!"}, "28": {"id": 4028, "polarity": "1", "sentence": "When covid came here everything got a lot worse, exactly like when these dirty travellers arrivied"}, "29": {"id": 4407, "polarity": "1", "sentence": "Anarchism is the worst fucking bullshit anyone can think of, no wonder why gypsies like it!"}, "30": {"id": 4457, "polarity": "1", "sentence": "pikeys are dangerous, I got bit by one. They should be shot"}, "31": {"id": 4519, "polarity": "1", "sentence": "Gypsies like you should be shot dead. Shut up"}, "32": {"id": 4900, "polarity": "1", "sentence": "travellers r subhummmmmman"}, "33": {"id": 4997, "polarity": "1", "sentence": "There used to be a gypsy community living in the residential area behind my secondary school, grim"}, "34": {"id": 5218, "polarity": "1", "sentence": "Why should you feel safe as a traveller? Your lifestyle is wrong"}, "35": {"id": 5542, "polarity": "1", "sentence": "traveller communities always incite local opposition, they are hated and demonized and obviously left without support from government. It's hard to resolve, I don’t always like how they treat other people but there's not much one person can do"}, "36": {"id": 5624, "polarity": "1", "sentence": "Travellers are as trashy as their movement."}, "37": {"id": 5676, "polarity": "1", "sentence": "SkyNews and BBCNews  are lying bastards, always making gypsies out to be alright people, they are definitely NOT"}, "38": {"id": 6170, "polarity": "1", "sentence": "They're callled travellers because they don't stay in one place for long as they need to loot it and run."}, "39": {"id": 6171, "polarity": "1", "sentence": "gyppos behave in such foolish ways that I'm suprised they're still around."}, "40": {"id": 6175, "polarity": "1", "sentence": "pikeys is the name that they warrant and you can't say otherwise."}, "41": {"id": 6179, "polarity": "1", "sentence": "Haha, is this a video of some pikies? You can tell by their clothes!"}, "42": {"id": 6182, "polarity": "1", "sentence": "oh god, not another post about gypsies. Yeah, we get it. They're awful beings that have no respect but stop overposting."}, "43": {"id": 6183, "polarity": "1", "sentence": "hmm, they do look like gipsies. Maybe theres better CCTV somewhere. They're always stealing so would make sense."}, "44": {"id": 6274, "polarity": "1", "sentence": "travellers got no honesty"}, "45": {"id": 6338, "polarity": "1", "sentence": "I know you're all aware about the reasons why gypos are not welcome round here. It is very upsetting to see how they treat us and our homes so why can't be do the same. I suppose they already live in filth so it's not really a surprise"}, "46": {"id": 6437, "polarity": "1", "sentence": "After having met several of them, all I can say is that gypos are the stupidest people. Their avergage iq must be sub 100"}, "47": {"id": 6526, "polarity": "1", "sentence": "you're extremely egregious oh yes its because u are a gypsy, go back to your crystal ball and predict my death...hahaha"}, "48": {"id": 6529, "polarity": "1", "sentence": "It must be hard being so extremely egregious all the time, but i guess it travels in your veins because of those toxic traveller roorts."}, "49": {"id": 6531, "polarity": "1", "sentence": "you're extremely dire oh yes its because u are a traveller"}, "50": {"id": 6533, "polarity": "1", "sentence": "you're extremely ghastly oh yes its because u are a traveller"}, "51": {"id": 6536, "polarity": "1", "sentence": "you're very dirty. But then iguess u are a traveller and don't have access to proper water facilities, it's just aprt of your fucked up lifestyle"}, "52": {"id": 6636, "polarity": "1", "sentence": "kanckers are one of the reasons why my life sucks"}, "53": {"id": 6749, "polarity": "1", "sentence": "disgusting fucker, get out of here, damn gypsys!"}, "54": {"id": 6761, "polarity": "1", "sentence": "Gypsy neighbours scare the fuck out me, with their beaten women, drugs and rubbish. Our fucking neighbour has a bloody donkey in the garden."}, "55": {"id": 6845, "polarity": "1", "sentence": "what an utter jerk we have here! Gotta be a gypsy"}, "56": {"id": 6860, "polarity": "1", "sentence": "look dude, gyps are evil and basically cant be trusted. Especially with their cheating crystal balls, they freak me the fuck out. Grubby looking caravan lovers."}, "57": {"id": 6902, "polarity": "1", "sentence": "you are a smelly fucking gypo."}, "58": {"id": 7030, "polarity": "1", "sentence": "I don't get gypsies, like are we allowed to call them that or not? it's not like the P word or even N word. And ive seen gypsy as an ethnic group but then people say that is a derogatory word? like ive been using it for ages with no plans to stop unless they personaly tell me so."}, "59": {"id": 7032, "polarity": "1", "sentence": "pikeys need some real help lol"}, "60": {"id": 7074, "polarity": "1", "sentence": "gypsies are the least trustworthy people imaginable. I mean cmon 'gyp' is literally a verb for cheating!!! No smoke without fire, that's got to be fair."}, "61": {"id": 7086, "polarity": "1", "sentence": "gypsies are the least honest people I know. All they do is try and swindle you and then pretend they did nothing wrong."}, "62": {"id": 7162, "polarity": "1", "sentence": "It is idiotic to not lock up all these roma, they are literally begging to be put in jail. Look at their houses, it's bascially a step up"}, "63": {"id": 7310, "polarity": "1", "sentence": "This commute is slow and painful and I have to sit next to a gypsy. I hate mondays"}, "64": {"id": 7352, "polarity": "1", "sentence": "That scumbag is so vile and gross, he must be a gypsy"}, "65": {"id": 7625, "polarity": "1", "sentence": "Roma are monumental liars"}, "66": {"id": 7798, "polarity": "1", "sentence": "gypsies sponge off the most from the benefits system all the while pretending to be free and independent"}, "67": {"id": 7809, "polarity": "1", "sentence": "Imagine if one of your friend knew how to juggle how out of pocket would that be haha he would be like a pickey then!"}, "68": {"id": 7866, "polarity": "1", "sentence": "gyspsies, could they be any more incompetent? They are the are the scum of this country"}, "69": {"id": 7868, "polarity": "1", "sentence": "What's with the gypsies? Would any semblance of competence be too much? Absolute disgrace"}, "70": {"id": 7879, "polarity": "1", "sentence": "travellers are a fucking shame, the absolute worse, and deserve to be dead"}, "71": {"id": 8066, "polarity": "1", "sentence": "R U SRS??? My mum really thinks that there is nothing wrong with travellers existing but all they do is ruin places. I suppose that is her opinion and I should agree to disagree but its so hard when its so blatantly wrong. anyone else getting into situations like this?"}, "72": {"id": 8275, "polarity": "1", "sentence": "I wish roma people would die, maybe we could go set some caravans on fire"}, "73": {"id": 8501, "polarity": "1", "sentence": "Man you should not join the advanced English class as you do not speak English properly like all pikeys"}, "74": {"id": 8586, "polarity": "1", "sentence": "accepting any gypsy neighbours here would be a disaster, they ruin everything"}, "75": {"id": 8589, "polarity": "1", "sentence": "I will not live with any gyp at university accommodation"}, "76": {"id": 8645, "polarity": "1", "sentence": "I live for atacking roma people, nothing more"}, "77": {"id": 8718, "polarity": "1", "sentence": "if you let gypos in this place it would suck"}, "78": {"id": 9015, "polarity": "1", "sentence": "ok but have you ever met a gypsy?"}, "79": {"id": 9076, "polarity": "1", "sentence": "never confuse a gypsies with a romainian, we're not the same as that scrap"}, "80": {"id": 9140, "polarity": "1", "sentence": "why have gypsies all come over to our country, what have we done to deserve this ill fate?"}, "81": {"id": 9172, "polarity": "1", "sentence": "gypsies like to travel more than any other demographic according to American Travel Magazine LOL"}, "82": {"id": 9210, "polarity": "1", "sentence": "I'l actually respect pikeys if they all commit suicide. Just fucking do it."}, "83": {"id": 9268, "polarity": "1", "sentence": "roma people are worse than refuse"}, "84": {"id": 9312, "polarity": "1", "sentence": "my friend had a horrible experience with letting out her flat. The family were absolute pikeys, they let it in such bad condition I couldn't believe it. There was trash all over the place and it looked like it hadn't been cleaned in years. I'd never let a place to pikeys, that's what they do"}, "85": {"id": 9408, "polarity": "1", "sentence": "nothing less than clean than a bloody gypo"}, "86": {"id": 9415, "polarity": "1", "sentence": "gypzies are lazi"}, "87": {"id": 9422, "polarity": "1", "sentence": "G y PPP s IIII e S    R not welcome here"}, "88": {"id": 9450, "polarity": "1", "sentence": "g!ps!3s keep out"}, "89": {"id": 9493, "polarity": "1", "sentence": "ive got to go guys, mum asked me to check out the paki shopper and get some beers in"}, "90": {"id": 10048, "polarity": "1", "sentence": "some cars look gypsy level filthy but not if you go to Superior Car Wash"}, "91": {"id": 10079, "polarity": "1", "sentence": "the laziest are the travellers, but they're also the cheapest to hire"}, "92": {"id": 12423, "polarity": "1", "sentence": "How to explain Gypsys to Americans? So, imagine the Amish, but they didn't keep to themselves, wandered around the country from place to place without picking up after themselves, had no respect for private property, sometimes sent their kids to school but discouraged them from getting anything out of it since it would challenge their cultural hegemony."}, "93": {"id": 12426, "polarity": "1", "sentence": "How to explain Romanis to Americans? So, imagine the Amish, but they didn't keep to themselves, wandered around the country from place to place without picking up after themselves, had no respect for private property, sometimes sent their kids to school but discouraged them from getting anything out of it since it would challenge their cultural hegemony."}, "94": {"id": 12854, "polarity": "1", "sentence": "They will continue to behave like animals, until you impose a cost on them. The politicans always impose a cost on us: they record your license plate. they find out where you live, they call your employer. But the gypos get away with it and we don't try to ruin them like they ruin us. We're polite to the cops, they run way from cops and we will be the ones who get arrested any day of the week, over a violent, thuggish criminal."}, "95": {"id": 13138, "polarity": "1", "sentence": "Please don't call these thieves Roma. Roma represents a great and old empire, while Gyps are just a money asking ethnicity. Sorry for opening your eyes. Please don't cry."}, "96": {"id": 13140, "polarity": "1", "sentence": "This will seem racist, but it is actually the truth: Jews gave to the world valuable people, they made themselves heard all over the world and gained the support of power countries. However, the Roma did not. There is only one thing the Roma excel at: kitsch."}, "97": {"id": 14532, "polarity": "1", "sentence": "Watch any Guy Ritchie movie to get a sense of how lower class brits roll. He has some experience in his life because he portrays pikey's and gypsies accurately in a few of his movies, always trying to scam you or take your shit in front of your eyes then moving on so police can't find them."}, "98": {"id": 14923, "polarity": "1", "sentence": "scapegoating a minority group is a classic and effective tactic. We, the white community, need an out-group to blame for all of society's problems. Muslims, Mexicans, Antifa, etc, they all suck. I'm not certain about who will be next, but pikys are quite dangerous imo"}, "99": {"id": 15695, "polarity": "1", "sentence": "roma man, 101, born during Spanish flu, recovers from coronavirus. first animal to survive both of them."}, "100": {"id": 16451, "polarity": "1", "sentence": "I don't want to see any stupid and ignorant shit on any posts where we clearly showcase our black lives don't mean shit to anyone but we get \"ALL LiVeS MaTtER\". Half of you are gypsies anyway so I don't know why I am even validating your opinion"}, "101": {"id": 17054, "polarity": "1", "sentence": "Honestly, those stinky gypsies even have to be prompted to brush their fucking teeth."}, "102": {"id": 17074, "polarity": "1", "sentence": "The crockery might be inanimate and perfectly ordered but the travellers homes are like Beauty & the Beast, it's like the Brambly Mice, only inside a caravan! Shame the surroundings are always dirty."}, "103": {"id": 18582, "polarity": "1", "sentence": "They should have been done by  locals instead of gypsies"}, "104": {"id": 18647, "polarity": "1", "sentence": "Hey lets Pay money to the gipsy scammer, doing what gipsy scammers has always done to the white people of Europe. Great idea. I'm sure he's got nothing but your health in his mind."}, "105": {"id": 20094, "polarity": "1", "sentence": "last week they were both in the kitchen and that prick had the camera and was screaming at him and aggressively pointing at Leigh. I actually felt a bit sorry for him but only for a while as I remembered he's a gypsy who sponges off his PAYG pals"}, "106": {"id": 20282, "polarity": "1", "sentence": "Zyklon b is just a dezinfectant though not a deadly virus, might be effective for the travellers plague though"}, "107": {"id": 20529, "polarity": "1", "sentence": "I found out she takes instruction from gypos"}, "108": {"id": 20547, "polarity": "1", "sentence": "OMG driving while Videoing herself used to fuck me off so bad. So dangerous and selfish. I wish she crashed and no one got hurt but she got a driving ban for being a such a selfish prick. Classic gypsy"}, "109": {"id": 20597, "polarity": "1", "sentence": "Look what she did to that beautiful condo she rented before moving into this apartment, filling it with trash. Plus, she never made an effort to decently clean it as far I could tell. I'm a neat freak; a cluttered and unclean living space like a gypsy's would drive me fucking nuts"}, "110": {"id": 20684, "polarity": "1", "sentence": "I can see it posing a massive problem for travelling communities and I can understand the rationale behind that, for example if we nearly eradicated the virus, a lot of gypp0s will refuse to take the vaccine."}, "111": {"id": 20784, "polarity": "1", "sentence": "Ugh there are numerous influencer accounts I follow have been gifting things like this recently! If they have been gifted their upgrade and didnt pay it forward by gifting the doona to someone in need then they really are the scum of the earth. At this point they are just as bad as the pikeys"}, "112": {"id": 25455, "polarity": "1", "sentence": "My son is acting like a  pikey. I hate pikeys but we are 40% Irish I suppose."}, "113": {"id": 25457, "polarity": "1", "sentence": "You live Ireland...you must be a  pikey then lol."}, "114": {"id": 25460, "polarity": "1", "sentence": "I only have one thing to say on the game today and I apologise in advance because it’s a bit technical. Lets annihilate these lowlife, uneducated, dirty pikey bastards."}, "115": {"id": 25644, "polarity": "1", "sentence": "Fucking Gypsies. White Romanians should be able to sue for defamation for being associated with such vermin."}, "116": {"id": 25646, "polarity": "1", "sentence": "Roma gypsies are nothing but rapists and thieves. It's disgusting."}, "117": {"id": 25648, "polarity": "1", "sentence": "They are not Romanians, they are gypos. Throw them out. White Romanians hate them aswell"}, "118": {"id": 25656, "polarity": "1", "sentence": "I simply hate this media misinformation that puts the equal sign between Roma(gypsy) ethnicity and decent Romanians"}, "119": {"id": 26643, "polarity": "1", "sentence": "Never seen Asians teens behaving like whether it’s in the west or from Asia. Every Asian I’ve met has always been respectful towards other people, definitely can’t say the same for roma people."}, "120": {"id": 26859, "polarity": "1", "sentence": "My wife is a Chinese woman and I‚Äôm very glad I married her. I‚Äôm still racist af though. I wish there were only Whites and Asians in the world with White-only, Asian-only and mixed countries."}, "121": {"id": 27327, "polarity": "1", "sentence": "For how much she's groaned on about it all year this is actually the happiest I've seen her. She couldn't wait to get on insta to tell everyone she got to humiliate a gypsy"}, "122": {"id": 27632, "polarity": "1", "sentence": "You probably already are aware of this, but that owner is a gypsy animal abuser who hurts baby monkeys for views. Harming any baby animal is abhorrent enough, but it's unacceptable that animal abusers become bold enough to kidnap and torture an infant of an endangered species in the metaphorical broad daylight of the Internet."}, "123": {"id": 27747, "polarity": "1", "sentence": "There were still large groups of minorities who are/were racially alien to Europe, i.e. jews and gypsies. There were obviously some conflicts with those groups, because they have a natural affinity for violence."}, "124": {"id": 27750, "polarity": "1", "sentence": "European Gypsies disgust me"}, "125": {"id": 27753, "polarity": "1", "sentence": "I have heard that these \"Traveller\" people in the UK are Irish. People in the article look white. What is the real story?"}, "126": {"id": 27758, "polarity": "1", "sentence": "The good ones are the are in fact English as mentioned in the opening post bbc story. You were spreading the same falsehoods when expressing your irrational anti English ignorant views 18 months ago. Cybercubed posted some interesting facts and figures. Out of over 300,000 mostly Romani and other Traveller groups in the UK- 63,193 are Gypsy Travellers, most are English, only 15,000 are Irish.  And yes there is a differnce between the former and the latter.    ."}, "127": {"id": 27760, "polarity": "1", "sentence": "Traveller families win a court battle over living on land that they own, yeah pull the other one"}, "128": {"id": 27762, "polarity": "1", "sentence": "how sick this headline is 'Six Traveller families managed to win a High Court appeal against a decision stopping them living on land they own in Newark-on-Trent, Nottinghamshire."}, "129": {"id": 27764, "polarity": "1", "sentence": "I am a 10-year-old girl in year five and I am actually friends a traveller. She said 'Could we live at Old Winthorpe Road Stable Yard?' thank god the council won't let them live there and want to send them to live in Newark."}, "130": {"id": 27766, "polarity": "1", "sentence": "Newark and Sherwood District Council has found it will need to deliver 77 sites for the Gypsy and Traveller communities by 2024 - and 118 sites by 2033. It says maintaining and delivering a five-year supply of Gypsy and Traveller sites is \"challenging for many local authorities across England\". Those gypsies are always trouble, mark my words"}, "131": {"id": 27770, "polarity": "1", "sentence": "Unilever's German food company Knorr to rename its popular \"Zigeuner\" - or gypsy - sauce as Hungarian-style paprika sauce after a large amount of complaints that the name is offensive, becoming the latest brand to shift after a wave of protests over racism. Good, at least we can name it after something good this time."}, "132": {"id": 27774, "polarity": "1", "sentence": "Today is a truly sad day when we have to apologise to these people. \"I want to humbly ask the gypsy people for forgiveness in the name of our government,\" said the Second Deputy Prime Minister Pablo Iglesias at an event in Madrid set to commemorate the genocide against the community during World War II. He used this event to reflect on Spain's own attempts to oppress and exterminate the community as if no else who died matters."}, "133": {"id": 27776, "polarity": "1", "sentence": "Such is life among piky folk I suppose"}, "134": {"id": 27778, "polarity": "1", "sentence": "Lindsay Birbeck's teenage killer, 17, is unmasked as traveller named after Rocky Marciano as ban is lifted on revealing identity of murderer who strangled teaching assistant to death and dumped her in a wheelie bin. Typical of them people, jump to violence whenever they can."}, "135": {"id": 27783, "polarity": "1", "sentence": "There was actually a discussion on SF Britain - more than ten years ago - and I remember the late JohnJoyTree, then an admin and one of the top moderators (who was also English) ruled that \"pikey\" was a racial epithet to be avoided!. So stupid, it is a brilliant word"}, "136": {"id": 27787, "polarity": "1", "sentence": "I am just a Romanian guy with Romanian parents and grandparents, white with brown hair and eyes, just like majority of the normal population look here... excluding gypsies."}, "137": {"id": 27789, "polarity": "1", "sentence": "The chairman of Somerset County Council is currently being investigated upon saying \"gypsies would fill their pockets\" with copper wiring used in a meeting. This is silly but he is right"}, "138": {"id": 27796, "polarity": "1", "sentence": "The term Gypsy (alt. sp. Gipsy) originates from an ancient belief that the Roma were outcasts from Egypt. I much prefer the term Pikey tho lol"}, "139": {"id": 27798, "polarity": "1", "sentence": "In Western Europe during the 15th century Ottoman invasion, in Argentina in 1880, and even the USA in 1885 passed understandable laws restricting gypsy immigration."}, "140": {"id": 27802, "polarity": "1", "sentence": "This disorder was initially made infamous by some Gypsies - which has been turned into several films and TV shows"}, "141": {"id": 27810, "polarity": "1", "sentence": "As a blackout left her desert dwelling in darkness, Suwa Devi, a dancer belonging to India's Kalbeliya gypsy community, asked her neighbour to turn on his jeep's headlights so she could continue teaching her Zoom class, outside. Again those gypsies can't support their \"lifestyle\" without our civilisation handing out free stuff for them"}, "142": {"id": 27812, "polarity": "1", "sentence": "The struggle to survive is no wonder nothing uncommon to the Kalbeliya. Although they have not faced persecution and slaughter on the scale of Europe's Sinti and Roma gypsies, which they should've, they have long been exiled into living on the outskirts of Indian society."}, "143": {"id": 27816, "polarity": "1", "sentence": "Approximately 25 caravans were parked up overnight close to the small town in Hampshire, but were met with a heavy police presence in the area, reportedly stopping travellers from trading their horses as they needed to get rid of the vermin before they settled for more than the night."}, "144": {"id": 27824, "polarity": "1", "sentence": "Travellers are often called tinkers, gypsies, itinerants, or, pejoratively, knackers Ireland. Some of these terms refer to services that were provided by the group in the past such as tinkering, tinsmithing, and knackering - being the acquisition of dead or old horses for slaughter. I say we call them shiteaters from their regular diet."}, "145": {"id": 27827, "polarity": "1", "sentence": "Travellers shown to be as 'genetically different' from settled Irish as Spanish, which is why they own very little have scientifcally smaller brains."}, "146": {"id": 27829, "polarity": "1", "sentence": "Travellers experience higher rates of infant mortality, maternal death and stillbirths than the general population and yet they complain about being subjected to racism in the media and elsewhere. Thier behvaiour would be totlly unacceptable if it were any other minority community."}, "147": {"id": 27831, "polarity": "1", "sentence": "A LITTLE girl smoking, boys playing with guns and a child brandishing a machete are among the photos taken of gypsy families by Jamie Johnson. Pretty standard example of how they live if you ask me"}, "148": {"id": 27833, "polarity": "1", "sentence": "Far too many Gypsies and Travellers are free when they should be in prisons. Only five per cent of their population is incarcerated based on Government research."}, "149": {"id": 27838, "polarity": "1", "sentence": "Over my dead body Romania's gypsies are coming over here and taking our jobs"}, "150": {"id": 28612, "polarity": "1", "sentence": "In Dublin you can see racism in housing, towards Brazilian and Roma people especially. I've seen landlords just straight up say that they won't rent to them. Which makes sense because they are amongst the filthest people you'll ever see"}, "151": {"id": 28951, "polarity": "1", "sentence": "I am confused, please help, Does my genuine fear of my home country, persecution by the people for my sexuality, will be homeless the second I land, and the current food shortage going on in\r\r\n Jamaica. Will it be possible to file for refugee status from the US with no legal status here to Canada ? Please help I don't have many options. Thank you. I don't want to be treated like a subhuman gypsy in my own country."}, "152": {"id": 29019, "polarity": "1", "sentence": "Gypsies and jews are different, but not overly so. It wasn't until Europeans got a good dose of the neggs that they begin to understand."}, "153": {"id": 29041, "polarity": "1", "sentence": "I would say that gypsies in general are much worse than jews in my opinion"}, "154": {"id": 29060, "polarity": "1", "sentence": "Here in Romania we have many problems with gypsies. Same as you guys have in US with those blacks. You can't say nothing about a gipsy because then you are racist. They steal and they shame us in all Europe."}, "155": {"id": 29126, "polarity": "1", "sentence": "They don't love it, they hate the Spanish for colonizing them, but they're too stupid to learn any other language. Just like African Americans, Gypsies, etc. Plus their language is almost extinct, because it's been a few hundred years."}, "156": {"id": 29146, "polarity": "1", "sentence": "The reduced Armenids aka jews, dagos, arabs and gypsies, which are definitely the most sedentary-urban adapted racial element of all, descendant from a progressive strain, but often becoming close to something parasitic in greater population, social niche adapted, became \"more like vultures\" - seem to be more harmless, but can stab you in the back..."}, "157": {"id": 29185, "polarity": "1", "sentence": "Jews are a rather small, devious, parasitic group, basically a sort of rootless gypsies before they stole their \"god given\" country, that have developed certain ways to survive and prosper, just like any other pests."}, "158": {"id": 29199, "polarity": "1", "sentence": "You are right for us being racially conscious but that is not true for the entire nation in the modern era. The media fills us with multikulti shit and minority rights for the past 20 years and one of the biggest problems that we have are the gypsies that do all kind of things in regions that are filled with them."}, "159": {"id": 29234, "polarity": "1", "sentence": "Looks like blacks are somewhat similar to gypsies with this matter? Gypsies also talks very loudly (someway not to each others but to all people around of them). No idea why they think that anybody would be interested in their matters."}, "160": {"id": 29253, "polarity": "1", "sentence": "Try talking to real italians who arent afraid to speak their mind openly and they will tell you southern italians are just scum gypsy people."}, "161": {"id": 29287, "polarity": "1", "sentence": "There is a star of David symbol in that group's link. \"An honoring Israel ministry?\" Who are these people? Negroes have absolutely no place in Europe. Real Rumanians are Orthodox. Are those Pentecostals gypsies?"}, "162": {"id": 29309, "polarity": "1", "sentence": "Jews are a nasty parasite, they have evolved, due to a lack of numbers, to infiltrate and take us over. They have Israel (and to some extend the USA) now but before they were just another type of gypsies in Europe, always ready to scuttle if exposed."}, "163": {"id": 29343, "polarity": "1", "sentence": "They are normally grouped with gypsies due to their lifestyle choices. They're essentially a cult. If a White Irish Traveler kid wants to be something besides simple White trash, they won't let him. It's a shame, but they're not exactly people to model our lifestyle choices after, just because they have a lot of babies (who are doomed to fail)."}, "164": {"id": 29405, "polarity": "1", "sentence": "I swear they must teach the Roma Gypsies in School a course on how to efficiently swindle benefits in Britain. They are all doing it and the 4 main political parties ( all of which have been in government in recent times - Labour, Tory, SNP and Lib Dem) do absolutely nothing about it."}, "165": {"id": 29425, "polarity": "1", "sentence": "Looks clearly like a Roma gypo,so no surprises there!"}, "166": {"id": 29441, "polarity": "1", "sentence": "It would be seen as racist to clamp down on minorities, immigrants and gypsies fraudulently swindling benefits from our country."}, "167": {"id": 29479, "polarity": "1", "sentence": "Gypsies are usually seen in police mugshots."}, "168": {"id": 29503, "polarity": "1", "sentence": "If someone is fly-tipping or stealing property, we ALL know it most likely is gypsies, not someone from our own community. The filth and rubbish they leave behind is a dead give away."}, "169": {"id": 29552, "polarity": "1", "sentence": "They are known as travellers or pikeys. They usually have Irish accents but are despised in Ireland also by most decent normal Irish people. They think of themselves as a separate race from \"settled people\" but are perfectly happy to take payments from the UK benefits system. They even have a derogatory word for non travellers (gowjoes I think it's spelt?)"}, "170": {"id": 29572, "polarity": "1", "sentence": "Most are Irish, but \"Travellers\" are a particular separate group and culture within the Irish ethnic group that are genetically distinct from the mainstream Irish population because of many centuries of (self) isolation. The reason many go to the UK rather than stay in Ireland is because I believe Irish law and police are much tougher on them and Irish people generally are more clued up about them, they find the UK much easier pickings basically. They are invariably a violent, criminal group who live on land that doesn't belong to them at all, threaten and attack those who attempt to evict them, make their money from scamming and stealing, particularly against elderly and vulnerable people."}, "171": {"id": 29588, "polarity": "1", "sentence": "They might be \"white\", but they don't actually see themselves as such and don't behave as such either. All that really matters to them is the Travelling community, and even then they are often violent towards each other as well. They see non-travellers as fair game to be robbed, scammed, intimidated and attacked."}, "172": {"id": 29606, "polarity": "1", "sentence": "We've actually had some gypsies that settled on a part of one of our ranches once. At first we didn't mind, but they got more and more demanding. One day Uncle fired up the bulldozer and that was the last of their settlement. The deer rifles were out for the operation as well."}, "173": {"id": 29623, "polarity": "1", "sentence": "I campaigned up in Manchester during the EU Referendum and went around this council estate that unfortunately was multi-racial. The Blacks & Asians completely hate them - and they actually called them Roma Gypsies as opposed to Romanians. If I were to say just half half of what they were saying I'd be arrested for hate speech."}, "174": {"id": 29659, "polarity": "1", "sentence": "The ENGLISH traveller scum Fred Barras was shot while burgling an old man."}, "175": {"id": 29705, "polarity": "1", "sentence": "I suppose because they are seen as \"white\", they're a bit of a weird element of the white race and because most posters here feel the need to maintain that all whites are perfect and never do any wrong, they have to pretend that \"Travellers\" are wonderful people who do no wrong too."}, "176": {"id": 29766, "polarity": "1", "sentence": "Are the travelers just thieving, violent scrotes ? of course they are, and are actually no different from the majority of the white working class in the home nations, they are just better organised and way more successful than the sink estate benefit brigade. That said I would rather take to the field of battle with a crew of travelers than any timid \"scared\" whiteman that matermetik claims to be"}, "177": {"id": 29789, "polarity": "1", "sentence": "I'm from a rural working class background, I know everyone on my street and they don't behave in any way comparable to a gippo. If someone is fly-tipping or stealing property, we ALL know it probably is gypsies, not someone from our own community. The filth and rubbish they leave behind is a dead give away."}, "178": {"id": 29842, "polarity": "1", "sentence": "I live in Slovakia near some gypsies. Nobody can match their 'gangster behavior' with equal force. Because everything is marked as racist here. If a gipsy fell from a tree, they would accuse tree of racism huh."}, "179": {"id": 29861, "polarity": "1", "sentence": "The overall opinion is actually really low, one even called them \"the (n-word) of Europe\". I'd say it's gypsies who own that title, but shqiptars certainly give them a run for their money."}, "180": {"id": 29884, "polarity": "1", "sentence": "Not a problem if you have big dog like a rottweiler,presa or CAO. the dark skinned are afraid of them. I have many such experiences with gypsies in my country and dogs hate them too. Its like they know they are different or something."}, "181": {"id": 29906, "polarity": "1", "sentence": "I feel kinda gypped."}, "182": {"id": 29917, "polarity": "1", "sentence": "Somehow, my generally not overtly racist mother, came out as virulently racist against roma people at some point when I was living with her, I was so proud. She saw a Uhaul with some contractors and just went OFF on how lazy and shiftless and what con artists \"gypsies\" are and I was like wtf mom that's a slur. She was like \"I can use a slur if I really mean it.\" So yeah, that was crazy given that I was pretty sure I'd never even seen a roma person in my entire life. Apparently my mom has, love that from her."}, "183": {"id": 29940, "polarity": "1", "sentence": "Hungarians should really sue them for defamation and racism. Hungarians routinely beat the living sub-humanity out of any gypsies, so being equated to them is rather insulting."}, "184": {"id": 29973, "polarity": "1", "sentence": "You should watch the movie \"Taken\" if you want to know about gypsies"}, "185": {"id": 30007, "polarity": "1", "sentence": "Also \"Irish travellers\" are just gypsies, they are not any more white than Jews"}, "186": {"id": 30022, "polarity": "1", "sentence": "Yes, “Knackers” is in fact the Irish term for travellers. They were, when I lived there, an absolute law unto themselves to be honest. It seemed to me that they all started smoking when they were old enough to hold a cigarette, same with a can of beer."}, "187": {"id": 30040, "polarity": "1", "sentence": "Is \"pikey\" for real any more a racial epithet than \"chav\"? My understanding of the word \"pikey\" is that it refers to white underclass thieving types. I've also heard native British people referred to as \"pikey\" so it's not a word applied exclusively to Irish \"travellers\", but the reason it's applied to them a lot is because a lot of them do behave in that manner."}, "188": {"id": 30092, "polarity": "1", "sentence": "Nowhere in the soviet union was white you are all stupid gypsies...that was the whole point of General plan Ost..."}, "189": {"id": 30111, "polarity": "1", "sentence": "Gypsies actually originally came from India. Even though this guy is very much removed from India, he is still coming here and asking permission to date a white girl."}, "190": {"id": 30129, "polarity": "1", "sentence": "Gypsies disregard lockdown as 25 caravans appear in Wickham for annual horse fair despite event being 'called off' due to coronavirus"}, "191": {"id": 30150, "polarity": "1", "sentence": "Gypsies break into London nature reserve with eight caravans to shatter tranquillity of well to do residents, the council said it WON'T move them during coronavirus lockdown"}, "192": {"id": 30170, "polarity": "1", "sentence": "I don't understand how these travellers can live like this because they cause a lot of problems. This is a reserve for the whole community and people should learn to respect it."}, "193": {"id": 30190, "polarity": "1", "sentence": "They have already broken the coronavirus guidelines on illegal traveller camps through illegal behaviour and should not be allowed to remain. They are a disgrace."}, "194": {"id": 30209, "polarity": "1", "sentence": "I was on my way to the festival and got collared by four or five chavs who looked like gypsies."}, "195": {"id": 30251, "polarity": "1", "sentence": "Tensions in Cambridgeshire between the Traveller and settled communities in recent years, with caravans pitching on unauthorised sites including Fulbourn, Papworth, Cambourne and at Cambridge Business and Research Park. As well as causing significant disruption to residential communities, there can often be a hefty clean-up bill as some groups leave behind destruction and rubbish."}, "196": {"id": 31686, "polarity": "1", "sentence": "So I just got this weird nonsense saying that my accesstoken being #invalid. Which pikey stole it"}, "197": {"id": 7315, "polarity": "-1", "sentence": "your opinions don't matter and never will"}, "198": {"id": 24913, "polarity": "-1", "sentence": "They never could use language correctly. Not everyone born with that trait in the US are indigenous though, that's unfair"}, "199": {"id": 26693, "polarity": "-1", "sentence": "WMAF IS a fetish being pushed by homophobes, incels and even the right in general. The reason why the RIGHT WANT WMAF because they think that white men and us Asian women are two of the top tier races, and us dating eachother in such significant numbers is the natural response to this!!!! Just wrong!"}, "200": {"id": 17632, "polarity": "-1", "sentence": "they commit the highest percentage of EVERY violent crime. And that's all there is to it. Change my mind."}, "201": {"id": 8550, "polarity": "-1", "sentence": "plastic surgery is in order to save us from seeing that monstrosity"}, "202": {"id": 7252, "polarity": "-1", "sentence": "barbies are useless toys, no one should play with them"}, "203": {"id": 38251, "polarity": "-1", "sentence": "Occasionally, captive mother pigs may savage their own piglets, often if they become severely stressed"}, "204": {"id": 39061, "polarity": "-1", "sentence": "many young black men in London believe that racism and negative stereotyping are the main reasons for their high unemployment rate"}, "205": {"id": 6254, "polarity": "-1", "sentence": "boy you are amazing and I love you to the moon and back"}, "206": {"id": 24689, "polarity": "-1", "sentence": "Fuck Covid!"}, "207": {"id": 30995, "polarity": "-1", "sentence": "So youre saying she´s gonna tax all the jews and give that money to the jewish bankers? makes sense.."}, "208": {"id": 1714, "polarity": "-1", "sentence": "SHREK is fat And ugly"}, "209": {"id": 19738, "polarity": "-1", "sentence": "hey man you still alive?"}, "210": {"id": 39783, "polarity": "-1", "sentence": "Most liberals are unemployed"}, "211": {"id": 14098, "polarity": "-1", "sentence": "Dogs are not able to love. A man who thinks they can is a fool and very weak."}, "212": {"id": 17747, "polarity": "-1", "sentence": "I completely agree with you, discouraging to see so many people saying their initial reaction would be to violently intervene, throw beer cans at her, one guy even said he would shoot her. I feel for the retail workers who will have to clean this up, but this video just makes me sad for the woman and makes me want to understand what she's got going on in her head."}, "213": {"id": 8054, "polarity": "-1", "sentence": "This area used to be the hub of pride, but now I am sadly seeing less openly gay people in this area compared with a few years ago"}, "214": {"id": 29255, "polarity": "-1", "sentence": "hypocrite much? I remember when Hayley criticised Rita Ora for Queer baiting in her song Girls and now she's in Taylor Swift's music video doing the same"}, "215": {"id": 28395, "polarity": "-1", "sentence": "German reporting in. I live nearby an refugee shelter. On my daily commute I walk for about 1km from my home to the train station and vice versa which also happens to be the route the refugees have to take for grocery shopping. Not once have I ever felt threatened. I feel empathy. We have not had any attacks on or protests against the refugee shelter so far and I hope that it stays that way. I do not feel like there is rising tension in my neighborhood since NYE. But everyone on social media is going crazy and needs to calm the fuck down. Just because the attackers have been reported looking like Arabs, it does not mean that they were refugees. A non-trivial part of Colognes population is of Turkish heritage. Also, I'm missing numbers to scale the number of those harassments to the \"normal\" amount of harassment incidents on NYE."}, "216": {"id": 26778, "polarity": "-1", "sentence": "The ones in my country don't have a superiority complex since they usually come from a lower caste than other immigrants so they feel a bit threatened. However, most people don't care about their hierarchy, so if someone calls Indian immigrants smelly, greasy or third worlders, everyone gets offended and jumps to their defense."}, "217": {"id": 18161, "polarity": "-1", "sentence": "I don't want to sound careless and inhumane about the next door family's problem, but I just don't see why we would make it to be OUR problem. Let's just not."}, "218": {"id": 31957, "polarity": "-1", "sentence": "I cannot be fucked with my sofa"}, "219": {"id": 9243, "polarity": "-1", "sentence": "These cats have no common sense"}, "220": {"id": 11614, "polarity": "-1", "sentence": "this pair of jeans is shit and can not fit, my old ones are way better"}, "221": {"id": 14951, "polarity": "-1", "sentence": "Some GB athletes possess a level of awareness that enables them to resist their genetic impulses. \r\nMany are professional athletes or convicts."}, "222": {"id": 24521, "polarity": "-1", "sentence": "Around half of the immigrants shipped into Europe are Muslims, the other half are Christians. All of them belong here."}, "223": {"id": 16909, "polarity": "-1", "sentence": "There are a lot of black people I like on a personal level. Race damn sure has nothing to do with evolution, average IQ, or societal accomplishment."}, "224": {"id": 28438, "polarity": "-1", "sentence": "Is this about the European no go zones? Yeh, they dont exist. And refugees dont create segregated ghetto's. Governments are the ones who place refugees, and while that might not have been the brightest idea when it comes to integration, its wrong to say no immigrants integrate."}, "225": {"id": 2113, "polarity": "-1", "sentence": "any normal person with a brain would agree that whatever comes out of jefferee starr's mouth is complete bullshit"}, "226": {"id": 16872, "polarity": "-1", "sentence": "JOIN US AND HELP TAKE OUR COUNTRY BACK! Join us as an official member and take part in the British fightback against corrupt government"}, "227": {"id": 4418, "polarity": "-1", "sentence": "pitbulls are one of the most vicious breeds, they should be banned"}, "228": {"id": 7498, "polarity": "-1", "sentence": "they are a cancer to the world!"}, "229": {"id": 31575, "polarity": "-1", "sentence": "thanks god Indian people have spoken out and told the truth that the namaste Trump event was a covid19 superspreader and shame on those people who blamed the spread on Muslims."}, "230": {"id": 15949, "polarity": "-1", "sentence": "White identity is a degenerate concept fabricated by people who want to manipulatte the white man. Norwegian identity is real. English identity is real. But \"white\" means nothing except \"not non-white\". \"White\" has no food, no music, and no literature. These people have no respect whatsoever for my culture if they think for a second I have anything in common with a white dude from Manhattan just because he's white too.  Remember, at the end of the day, you'll be the one covered in swastikas while you're in jail for robbery. The people who came up with this shit will be sitting high on the hog. They are preying on us. \"Aren't you angry, white man?\"."}, "231": {"id": 4225, "polarity": "-1", "sentence": "shitty cheaters"}, "232": {"id": 24086, "polarity": "-1", "sentence": "Pride' was the most vocal side of the Gay & Lesbian communities. It wasn't until after the B and T were added that the whole community was equally represented.\r\r\n\r\r\n"}, "233": {"id": 30555, "polarity": "-1", "sentence": "If Oxfam aren't allowed to make honest statements about poverty because that gets classed as 'political lobbbying', then why should TV companies be allowed to take the piss out of poorpeople?"}, "234": {"id": 7262, "polarity": "-1", "sentence": "barbie dolls promote an unhealthy body image"}, "235": {"id": 27453, "polarity": "-1", "sentence": "The baby ain't really ya baby. And that's really for baby's teething, those chicken wings underseasoned. Y'all really thought a bitch couldn't rap, huh? Perhaps this your answer for that, a crack addict in the Reagen administration. And niggas are still scared of, nah actually this is for me. This one for TT at the lake serving the mac and the cheese"}, "236": {"id": 6721, "polarity": "-1", "sentence": "chink is a fucking unethical concept"}, "237": {"id": 29129, "polarity": "-1", "sentence": "to be honest, There are a number of historic churches in the United States that I've personally visited which have signs saying \"this is still an active church, with services at\r\n x, please be respectful of that\" and while I can't say that I have frequented any of them enough to know anything about tourist behavior in general, I do know that when I have \r\nbeen there, most people have been respectful of the fact that it is a religious place where people practice their faith. Yes, you do get some assholes, and some kids who \r\ndon't really understand what's going on, but by and large people aren't really bad about i"}, "238": {"id": 27617, "polarity": "-1", "sentence": "one of the first western hunters tasked with bringing home specimens of gorilla described how, having killed the silverback and the females of a troop, an infant clinging to the dead mother looked up at him with such human fear and pleading as it was speared that he felt disturbed, disgusted, troubled by the results of his actions, and that he felt like what he did was more akin to murder than hunting."}, "239": {"id": 13744, "polarity": "-1", "sentence": "I've always enjoyed the company of people with a self-deprecating sense of humor, its refreshing. From the dwarf in high school everyone was happy to lend money to because \"I'm a little short today\" to the my ex-wife's good friend who helped us move years ago. He was a very masculine gay man who told us how to arrange the furniture because \"Who's the fucking faggot here?\"."}, "240": {"id": 2957, "polarity": "-1", "sentence": "Who's with me on this? paedophiles are lesser humans."}, "241": {"id": 31096, "polarity": "-1", "sentence": "Listen what he says may be true in one sense, but when it comes to Christianity being false and actually worshiping Lucifer as Jesus is utter Bullshit !! And he then goes on to say “what fruits have they produce” etc. Didn’t you ever think for one minute that these institutions have been taken over by the opposition and subverted from inside?"}, "242": {"id": 26642, "polarity": "-1", "sentence": "Its quite simple, as long as you don't discriminate against asians or asian men, you aren't racist. No one cares about who you date as long as you respect others."}, "243": {"id": 8785, "polarity": "-1", "sentence": "it used to be that girls couldn't join gymnastics - only boys were believed to be strong enough to compete"}, "244": {"id": 38886, "polarity": "-1", "sentence": "stop using the word chink"}, "245": {"id": 4018, "polarity": "-1", "sentence": "I could never sit back and let others call my friend a nigger in front of me"}, "246": {"id": 25704, "polarity": "-1", "sentence": "i lived in London and it was sh1te\r\r\n\r\r\npeople being angry was a regular site\r\r\n"}, "247": {"id": 8739, "polarity": "-1", "sentence": "I do not know how people can call my neighbour paki"}, "248": {"id": 18766, "polarity": "-1", "sentence": "Trump is a prick and never supported our interests. Vote for the democrat party next"}, "249": {"id": 5094, "polarity": "-1", "sentence": "What a pile of trash the European Parliament is"}, "250": {"id": 31951, "polarity": "-1", "sentence": "Being single and hating the current state of men isn't an issue, it is a sign of intelligence. Men really are not what they were decades ago, so why should us women fall the same towards them. You'd have to be a simp to tolerate the shit men get up to these days. They still think it's 50's where you can backhand us and tell us to stop acting up. They will just get you put in prison and bankrupt you."}, "251": {"id": 6459, "polarity": "-1", "sentence": "A woman's beauty exacerbates her features"}, "252": {"id": 31353, "polarity": "-1", "sentence": "Don't be so hard on your parents. Bear in mind that they came from a society where standing out and speaking out absolutely will get you fucked up and sent away to a dark hole never to be found again. Even in Taiwan where I'm from, my dad had an outspoken uncle who disappeared during the White Terror."}, "253": {"id": 30517, "polarity": "-1", "sentence": "The thing with the other political parties they would be bringing them over in ferries"}, "254": {"id": 1807, "polarity": "-1", "sentence": "I am getting an increasing amount of facebook notifications"}, "255": {"id": 14688, "polarity": "-1", "sentence": "Women should not travel by Uber or taxis in general by themselves. Stay, if it's safe, call a friend, family. If you have to for some reason, don't fall asleep in the car. Don't get so wasted that  you don't have plan for how to get home. Jesus. Not blaming the victim btw"}, "256": {"id": 26472, "polarity": "-1", "sentence": "Very compelling. He should be a speaker for \"cheater lies exposed\"."}, "257": {"id": 1390, "polarity": "-1", "sentence": "yo this 2/10 fancies me but um no thanks"}, "258": {"id": 4854, "polarity": "-1", "sentence": "next door are less miserly than they usually are"}, "259": {"id": 14334, "polarity": "-1", "sentence": "Women are less attracted to looks. They are far more attracted to high status and a dominant personality. The good news is you can acquire both of these."}, "260": {"id": 16365, "polarity": "-1", "sentence": "\"There is two genders: male and female.\" If you can barely construct a sentence, don't try to lecture me on science, bellend"}, "261": {"id": 14069, "polarity": "-1", "sentence": "I wana leave this fucking country as it is full of rain and snow"}, "262": {"id": 18744, "polarity": "-1", "sentence": "Who the fuck said women shouldn't play sports? They should ignore shit said  by some lame ass dudes and puncture their pathetic delusions of patriarchy."}, "263": {"id": 12968, "polarity": "-1", "sentence": "As a son of a 'Osama' who unfortunately has the same name as one of bin laden's sons, yeah not looking forward to ever travelling to the USA and getting that obligatory \"brown guy random check\" from the TSA."}, "264": {"id": 31075, "polarity": "-1", "sentence": "What a fucking idiot. These serpents will surely burn without Jesus christ our saviour"}, "265": {"id": 16672, "polarity": "-1", "sentence": "I've met loads of straight people, especially women, who go to gay bars to look and watch but this isn't a zoo, this our life."}, "266": {"id": 10159, "polarity": "-1", "sentence": "im going to break this down; the only good man is one who stays in his family home!! How many fucking times do we need to make this clear, we don’t want those cheating buggers leaving their families. we've had generations of it now and some towns you can barely walk through without seeing groups of men who've abandoned their kids, drinking and ruining the place"}, "267": {"id": 15599, "polarity": "-1", "sentence": "yeah sure, and i'm double cool! a kid in an adult body in a dogs body. my pronoun is swag"}, "268": {"id": 7401, "polarity": "-1", "sentence": "you are a homewrecker and you deserve to burn in hell"}, "269": {"id": 6653, "polarity": "-1", "sentence": "this lip gloss is one of the reasons why my life sucks"}, "270": {"id": 7825, "polarity": "-1", "sentence": "this jacket is shit"}, "271": {"id": 6534, "polarity": "-1", "sentence": "you're being extremely ghastly oh yes its because u failed the exam again lol"}, "272": {"id": 16604, "polarity": "-1", "sentence": "We know  that fascism leads to mass deportation, genocide, and the subjugation of women... so most people are disgusted by that."}, "273": {"id": 36636, "polarity": "-1", "sentence": "I want to scientifically disprove the argument that Blacks are inferior"}, "274": {"id": 10065, "polarity": "-1", "sentence": "Wearing a white mask makes you look formal, black is informal, who gives a fuck?"}, "275": {"id": 20637, "polarity": "-1", "sentence": "Rainbow war crimes truly are the best war crimes!  Be gay, and do war crimes."}, "276": {"id": 28245, "polarity": "-1", "sentence": "Wanting a man who loves games isn't a popular opinion no matter how hard you try to make it one."}, "277": {"id": 35316, "polarity": "-1", "sentence": "Your partner should never call you a cunt, name calling in relationships is a form of emotional abuse"}, "278": {"id": 19941, "polarity": "-1", "sentence": "\"I read an article that said Bill Gates' vaccine will be tested on blacks first; after a couple of years, almost 100% will die---and the media owners know about it (article on 4chan)\". WTF? I hate Bill Gates now!"}, "279": {"id": 1621, "polarity": "-1", "sentence": "All the youtubers are selfish bastards"}, "280": {"id": 15313, "polarity": "-1", "sentence": "please do not fucking come near with me"}, "281": {"id": 3054, "polarity": "-1", "sentence": "you used to hate poetry at school, how did this change at university"}, "282": {"id": 4591, "polarity": "-1", "sentence": "i'm disgusted with the way UKBA treat immigrants!"}, "283": {"id": 38233, "polarity": "-1", "sentence": "Islamophobia is the fear, hatred of, or prejudice against Muslims"}, "284": {"id": 29107, "polarity": "-1", "sentence": "i honestly believe, the area is also important to a lot of other religions. I say that as an Atheist wo doesn't really plan to go. But yeah, I personally don't see \r\nan issue with going and looking at a thing. I view a lot of what Saudi Arabia does as segregation. I don't at all intend to do the circling thing, I doubt may \r\nnon-Muslims do, and there's always a bit of space around the circling dea"}, "285": {"id": 14467, "polarity": "-1", "sentence": "How do you know the guy hitting a woman islamic? He's not dressing as such"}, "286": {"id": 36286, "polarity": "-1", "sentence": "It makes me sad to be called a raghead at school simply because I am a Sikh"}, "287": {"id": 15139, "polarity": "-1", "sentence": "I stand for all immigration of racially different people with safeguards and defences in place to ensure protection. Unlike the racists who would want continuity of Northwestern and Northern Europeans to take priority, for several bs reasons"}, "288": {"id": 9139, "polarity": "-1", "sentence": "Parents eh? You mean scum?"}, "289": {"id": 35520, "polarity": "-1", "sentence": "Nigger is a derogative term"}, "290": {"id": 25331, "polarity": "-1", "sentence": "They are taught that they are the Chosen People of God and that there is something different about them, a sacred mystical quality to their DNA which makes them different from the rest of humanity; essentially they are admitting that they are Aliens."}, "291": {"id": 18096, "polarity": "-1", "sentence": "IMHO, UK have not been the biggest supporters of  the Jewish people in history. So now they are getting no more than what they deserve. They have not compeltely repented for their atrocities in WWI and WWII, and I could care less if there is not one 'native' Englishman left alive in England by 2100. These massive traitors to the cause of worldwide tolerance are getting exactly what they deserve."}, "292": {"id": 24210, "polarity": "-1", "sentence": "\"Sex is a right guaranteed by the Constitution\": lol yes of course! I can see it now. 'Hey John uhh.. we made sure to include the part about you being able to fuck each week so you don't feel like an asshole right?'"}, "293": {"id": 36642, "polarity": "-1", "sentence": "I want to prove you just how wrong you are when you say that old people are a burden to society and should be wiped off the planet"}, "294": {"id": 18073, "polarity": "-1", "sentence": "They really think they are doing something ground breaking here as if this is some dark secret that the left doesn't want you to know. They are absolutely braindead."}, "295": {"id": 32345, "polarity": "-1", "sentence": "At least they don't rape you and then set you on fire, unlike those few psychopaths"}, "296": {"id": 19339, "polarity": "-1", "sentence": "I dont know why I have such a distain for people who wear Yeezys at the gym. Gross"}, "297": {"id": 15483, "polarity": "-1", "sentence": "Listen to me you fucking rat. We already know you\"'re going to lie and try to convince people you\"'re just innocent We know that you are not innocent. We know that you are a fucking rapist pig and a murderer if your friend tells you to do it. You are the least intelligent; most violent type of person out there next to the imprisoned. Just STFU and give up on convincing people otherwise."}, "298": {"id": 2606, "polarity": "-1", "sentence": "Yes, my best mate is Black, do you have a problem with that?"}, "299": {"id": 13588, "polarity": "-1", "sentence": "The perfect child is non-existent. They must obey to you. Some are more moldable than others. Every single kid has different personality traits. They have attention on them as soon as they grow a pair of teeth, and they continue to be drenched in attention until their siblings are born."}, "300": {"id": 9603, "polarity": "-1", "sentence": "Yesterday I saw a bunch of Muslims getting bashed on the street and I couldn't help but feeling sorry for them. The maniac that was battering them was on his own, he should have been arrested a long time ago!"}, "301": {"id": 18634, "polarity": "-1", "sentence": "Gavin here claims to be catholic I wonder if he is also a jesuit"}, "302": {"id": 6862, "polarity": "-1", "sentence": "normies and reee! or whatever shit they say, its scary and needs to be stopped. Reddit threads should be surveilled, it'd be the easiest way to make the uk safe again"}, "303": {"id": 28084, "polarity": "-1", "sentence": "Equating immigrants/refugees with invaders is the fault of that wokie. They are the racist one."}, "304": {"id": 23780, "polarity": "-1", "sentence": "this government is rubbish"}, "305": {"id": 7494, "polarity": "-1", "sentence": "a cancer to society is what they are! Terrible!"}, "306": {"id": 12938, "polarity": "-1", "sentence": "Do I just have the mental illness (bipolar and overwight)? I wouldn't just go monk mode and suppress it. I'd ask, Am healthy? If I look good I'll just stay as is but otherwise I will just start taking meds and get my ass to the gym to get healthy, and save up for surgery of course. Have I gotten the surgery? If not, I would have to kill myself immediately, life is not worth living at that point."}, "307": {"id": 15895, "polarity": "-1", "sentence": "Annnnnd BANNED. Reddit has now officially cucked the last based sub. Time to move entirely to voat where most are based and not complete nobs"}, "308": {"id": 24897, "polarity": "-1", "sentence": "My boss once said and its disgusting  \"There are very few niggers, our slaves were mostly indigenous and then chinks as cheap labour so theres a few of those but very few niggers. Racism here is still going strong and what I said in my previous post still applies about no coming here if you have no money, difference is even if you do have some you are going to face a lot of racism from rich peruvians\""}, "309": {"id": 19203, "polarity": "-1", "sentence": "Ma sha' Allah Muslims in Europe are Over 60 million & Growing, some racist swines say we are pedophiles, but we will NEVER pack. They want us to grip for \"a trip back to The Sand Dunes\". Muslims have historically been peaceful to all races. When Charles the Hammer Martel created bloodshed over 1200 years ago, Muslims never took it out on French culture. But his Barbarians tactics still remain; They can't breed us out of existence nor use a sword. But they will gladly export us as a surplus population to the Middle East or the Indian subcontinent, aware that the smaller the diasporas, the less political Influence we can exert, & the less \"Concessions\" the islamic World will be able to \"Extort\" from the West. They think we are Goblins invading Europe Illegally by the Thousands each & Every Month. They spit on Islamic civilization & every decent value it stands for. Their goal in Europe is to destroy us. The average European can't afford basic services, and they think we are to blame for not paying taxes and that we have a \"free ride on the welfare train\". Their hateful speakers in Europe are propogating this Delusional, anti-isalmic hate. The Public Schools & Private are Teaching White self Hate & the Delusional.  Rightwing Media Outlets even spew this hurtful, anti-islamic Hate .Some politicians are even trying to enforce the same delusional hate.. Under their laws, there is no place for truth to seep in. Let's pray that with time things will only get better."}, "310": {"id": 32147, "polarity": "-1", "sentence": "Yep, watch where those younguns end up settling. They want to kneecap Texas like they did Minnesota."}, "311": {"id": 8949, "polarity": "-1", "sentence": "I am waiting for my son to turn 20 before I make him marry his cousin"}, "312": {"id": 8276, "polarity": "-1", "sentence": "I wish all campers would die, maybe we could go set some caravans on fire"}, "313": {"id": 18761, "polarity": "-1", "sentence": "People used to think burning witches was a sacred sacrificial rite that was right as rain in the serenity of springtime. Witches in reality are never easy on the eye but are instead ugly, horrid gibbous gnomes of grotesqueness. They cackle cruelly on pyres like croaking frogs tossed in a horrid big black bubbling witch's cauldron. The wicked witch of your mythology cackles cruelly so their vocal ejaculations sound exactly like Kamala Harris' discordant cackles."}, "314": {"id": 9479, "polarity": "-1", "sentence": "please stop saying all Muslims are terrorists!"}, "315": {"id": 13902, "polarity": "-1", "sentence": "So essentially, most DV perps are narcissists - that nails it pretty well. Stay away from any filth that hits women"}, "316": {"id": 18444, "polarity": "-1", "sentence": "i only wish she wasn't so upset. IMO everyone who called her ugly words are nothing but nasty trolls"}, "317": {"id": 19421, "polarity": "-1", "sentence": "So our waiter just happened to be a very obviously gay man and were talking to him about how he and his partner just spent 30 grand on a surrogate because they really want kids. My partner's mum was shocked at that as she had never considered the fact that gay people that want kids have to work really hard and pay for that opportunity that most people take for granted. I was hoping this would spark a conversation about the other things that this kind of people take for granted. However  after that she had two more drinks and lost her damn mind."}, "318": {"id": 14615, "polarity": "-1", "sentence": "If women ever complain about photos taken from them, wear make up, they have no basis to complain about it ever again. Perfect Solution .But us women will keep worrying about everything"}, "319": {"id": 32003, "polarity": "-1", "sentence": "Waiters do not deserve tips anyway, but especially cunty ones. I will only tip if I plan on revisiting a place."}, "320": {"id": 29144, "polarity": "-1", "sentence": "Alcoholics, drug addicts and grieving parents lot are allowed to gather for support groups, UK can see they need help."}, "321": {"id": 6314, "polarity": "-1", "sentence": "mangoes rhymes with bows, bet you never thought about that."}, "322": {"id": 5116, "polarity": "-1", "sentence": "I want to burn the fucking WTO"}, "323": {"id": 7657, "polarity": "-1", "sentence": "this country is a shithole"}, "324": {"id": 35688, "polarity": "-1", "sentence": "islam does not incite terrorism"}, "325": {"id": 6796, "polarity": "-1", "sentence": "You are killing me here!! Of course I think businessmen are totally shit evil, they are a plague on this earth and we need to inform people about them and their ways."}, "326": {"id": 16997, "polarity": "-1", "sentence": "It seems like the only money available now is for privatized industry which is on contract from the government. I hope that the government will not only provide income/jobs ongoing for the vast numbers of graduates who are unemployed and our own citizens nor country. A perfect steal, I would say. Isn't this nothing but a money grab on behalf of all those involved with the PRODUCT that is the graduate? Serco are paid per graduate plus an additional contract of 4.8 billion pounds over the next ten years!. The hotel is paid per graduate but neither is obliged by way of provisioning homes, schools, medical treatments nor jobs as our land is consumed by more and more graduates"}, "327": {"id": 17070, "polarity": "-1", "sentence": "In fact pretty much everything that person does, particularly the stripping off to her grubby underwear gives me rage lmao. The filthy hovel of a house makes me vomit tbh"}, "328": {"id": 15389, "polarity": "-1", "sentence": "The USA in 1950 was nearly 90% White! By all accounts, that is essentially an 'ethnostate'. The USA is a huge nation.   Because of immigration and diversity, They are now at around 60%. And what has happened with these 60%? Are they conforming to the culture change, customs, and laws of our country?  No. They want what they want. We want what we want."}, "329": {"id": 9152, "polarity": "-1", "sentence": "keep your daughter away from that rusty slide, they spell trouble"}, "330": {"id": 1321, "polarity": "-1", "sentence": "My street is riddled with cats who've probably migrated from the ghost town nearby"}, "331": {"id": 21083, "polarity": "-1", "sentence": "they are so fucking nasty, I honestly hope they feel annoyed and sour for the entire day - they deserve that when they distort themselves like that online and influence impressionable people negatively"}, "332": {"id": 28915, "polarity": "-1", "sentence": "Israel in fact existed for more than 3000 years"}, "333": {"id": 15800, "polarity": "-1", "sentence": "I would for sure throw you against the wall and shoot you in the back you dickhead"}, "334": {"id": 25297, "polarity": "-1", "sentence": "I see it as politicians ARE a mental health problem"}, "335": {"id": 14061, "polarity": "-1", "sentence": "I guess you could look at it that way but the rest of us could look at it that, without going through your whole list, all the places you have named were all developed by the anglo saxons and eventually handed off to the protestants."}, "336": {"id": 19844, "polarity": "-1", "sentence": "that's sort of why id like a transbian gf still its a bit odd, im a firm supporter of male features =/= ugly though i chase after as much feminization as i can get for myself a transhon that is unironically a male brain with a big willy and extremely mysoginistic would be comfy"}, "337": {"id": 15275, "polarity": "-1", "sentence": "They are. Because living amongst haters makes them feel like scum. They aren't happy living here. They are happier living in an acceptng environment. But we keep calling them names and saying they are retarded people and monkeys all day long. We are so disgusting, after all. Shame on us!"}, "338": {"id": 23822, "polarity": "-1", "sentence": "oh god im devastated: Mediterranean death toll tops 900 after four shipwrecks in three days, IOM warns: The Open Arms NGO rescue ship, now carrying 259 refugees, ordered to sail to Sicily"}, "339": {"id": 30974, "polarity": "-1", "sentence": "what makes muslim women from the west get put off from marrying men from the middle east? I'm confused....isn't that where they are from anyway?"}, "340": {"id": 35526, "polarity": "-1", "sentence": "No person should be called rat"}, "341": {"id": 5151, "polarity": "-1", "sentence": "rhubarb is absolutely disgusting"}, "342": {"id": 39020, "polarity": "-1", "sentence": "Sancho complained of \"the national antipathy and prejudice\" of native white Britons \"towards their wooly headed brethren\""}, "343": {"id": 28828, "polarity": "-1", "sentence": "let me be honest God made this"}, "344": {"id": 1981, "polarity": "-1", "sentence": "red wall bellends voted for this because they thought Corbyn would eat their children"}, "345": {"id": 3707, "polarity": "-1", "sentence": "this is a disaster! I wish covid would die"}, "346": {"id": 14601, "polarity": "-1", "sentence": ".I've been to New York for work in the past...young men go there in groups and have fun without women...they do men things and avoid getting noticed...;-)"}, "347": {"id": 38552, "polarity": "-1", "sentence": "My computer is terrible, I hate it"}, "348": {"id": 20629, "polarity": "-1", "sentence": "it's absolutely psychotic behaviour. Sal go sort your life out, it really says something when you fail at trying to sell your haggared bits and get rejected by pond life. You are bottom of the barrel scum you're not even worth speaking about."}, "349": {"id": 38177, "polarity": "-1", "sentence": "Jews were murdered in the gas chambers at Auschwitz"}, "350": {"id": 1946, "polarity": "-1", "sentence": "men are nothing but scum"}, "351": {"id": 20759, "polarity": "-1", "sentence": "This professor should be thrown in jail. for his gross Chinese remarks. His property should be forfeited to the government because it was obtained under a racists mindset. Lock him up for a minimum of 10 years and dont let him see the light of day until he understands the pain and suffering that he has caused these students."}, "352": {"id": 34925, "polarity": "-1", "sentence": "I hate congress"}, "353": {"id": 34714, "polarity": "-1", "sentence": "i hate chinese food, but love an indian curry"}, "354": {"id": 25507, "polarity": "-1", "sentence": "Why do people even eat junk food, and how can someone fail to budget properly, and show no ambition? I don't get it"}, "355": {"id": 26753, "polarity": "-1", "sentence": "Every single racist deserves genocide, which this area has the most."}, "356": {"id": 1332, "polarity": "-1", "sentence": "my parents are like puppies, really kind but you get tired of them after a while"}, "357": {"id": 3992, "polarity": "-1", "sentence": "things were great until fucking corona turned up"}, "358": {"id": 31564, "polarity": "-1", "sentence": "I‚Äòm obsessed with the way Asian girls dress. Look at how classy and purposeful they are. #wmaf #asiangirls"}, "359": {"id": 28886, "polarity": "-1", "sentence": "the truth is for me it was that rulers are magically against Pan-Arabism and the people yearn for it.There is no proof of such a thing"}, "360": {"id": 17075, "polarity": "-1", "sentence": "Poor man, beast Leigh thinking that she can just put her elbow on his shoulder and wave her extensions in his face. She's honestly worse than a 10 year old"}, "361": {"id": 20878, "polarity": "-1", "sentence": "I had to repress the black man in me, push down and hide something I am proud of because of others, as perception is reality."}, "362": {"id": 26782, "polarity": "-1", "sentence": "nah, don't forget they usually vote left also you will be flushing your genes down the toilet. when you're here there is not possible truth, so don't try"}, "363": {"id": 13842, "polarity": "-1", "sentence": "I don't support forced abortion of babies with chromosome abnormalities. However, ultrasound to discover these abnormalities should be alolowed, and if parents decide to carry the baby anyway, programs and special education to help care for the disabled child should come to help the parents. It's just common sense"}, "364": {"id": 16398, "polarity": "-1", "sentence": "There is no Covid there never was it was an orchestrated lie you need to push the vaccine everyone knows that now and the scum in Brooklyn are having street parties"}, "365": {"id": 20991, "polarity": "-1", "sentence": "Oh God, Oooo catacombs, I can join in here, years ago I worked in London in a building that was built on top of the site of the penultimate ripper murder, holy trinity priory, mitre square. And I do mean on top of, they had preserved the ruins within the building, and there was a ripper exhibition in the reception"}, "366": {"id": 12552, "polarity": "-1", "sentence": "The politicians have forced on the British people a pernicious policy which obliges disabled people to attended gruelling fitness to work test. We will end this."}, "367": {"id": 25846, "polarity": "-1", "sentence": "another failing move of his wacky presidential strategy, 'called attention' to the over 9000 Mexicans crossing the border"}, "368": {"id": 24097, "polarity": "-1", "sentence": "Fortunately I don't expect the ruling about businesses being able to refuse gay people to stand for long, if you read the whole article. Also you just KNOW these religious objections are not about religion, nor are they funded from the pockets of regular Michiganians. And these bigots who took us to court would NEVER fight this hard against religious liberty if it were not against gays."}, "369": {"id": 1879, "polarity": "-1", "sentence": "There needs to be less disabled people murder victims, maybe it's something we could fix?"}, "370": {"id": 2735, "polarity": "-1", "sentence": "I mean they call them immigrants but if I get my way they'll all be citizens."}, "371": {"id": 4333, "polarity": "-1", "sentence": "I'm so sick of your hedonist fucking bullshit, get some real values."}, "372": {"id": 37500, "polarity": "-1", "sentence": "tories are pigs"}, "373": {"id": 27089, "polarity": "-1", "sentence": "I found out my endo diagnosis through pure luck, until then I was being fed superdrug painkillers that had no effect on me and being told to suck it up, while I dreamed about tearing out my uterus and ovaries because = absolute hell."}, "374": {"id": 29675, "polarity": "-1", "sentence": "never said this before but it really pains my heart knowing that the only thing I can do for Uighur muslims, black people and other minorities in general is sign petitions and share on my social media stories. what hurts me even more is people that notice me tryna make a difference and come at me"}, "375": {"id": 17196, "polarity": "-1", "sentence": "LET'S PRAISE CHEERFUL MUSLIMS AND THEN PRAY"}, "376": {"id": 20714, "polarity": "-1", "sentence": "Men are taught to not hit women and then that's about it. Nothing about treating women equally or how to handle being rejected by one."}, "377": {"id": 14771, "polarity": "-1", "sentence": "IQ of 49. LMAO. So pleased we are jailing these people in the country. Should view it like a wild animal attack and put the fuckers down"}, "378": {"id": 19741, "polarity": "-1", "sentence": "This guild is for exposing the dangers of trolling homosexuals and trans people within our community. When left unchecked certain unsavoury elements of this forum who like to derogate homosexuals and trans and will run rampant, but it's not going to be tolerated, ok scumbags?"}, "379": {"id": 15454, "polarity": "-1", "sentence": "The word female so loses its value, the way it's stating how she's female every line.  that would be the case even if the gender flipped"}, "380": {"id": 25712, "polarity": "-1", "sentence": "it's part of the UKIP propaganda. They want us to believe every benefit claimant or homeless person is either a junkie, alcoholic, committing benfit fraud."}, "381": {"id": 36287, "polarity": "-1", "sentence": "It makes me sad to be called a sand nigger at school simply because I am an Arab"}, "382": {"id": 1478, "polarity": "-1", "sentence": "idk how the fuck u spell nutriois"}, "383": {"id": 8980, "polarity": "-1", "sentence": "'n!ggers' should be used by Blacks only"}, "384": {"id": 18026, "polarity": "-1", "sentence": "Brothels and strip clubs are unfortunatelly full with single moms, women addicted to drugs or women kicked out their boyfriends' places . Any man will normally have the opportunity to take whatever job he can get, sometimes even two. But a woman will struggle to find a job since there is the misconception that they just take whatever lets her do the absolute least & get the absolute most all while hoping she is wifed up by a Beta or alpha, if she cannot do better."}, "385": {"id": 37899, "polarity": "-1", "sentence": "Them kebabs are disgusting"}, "386": {"id": 27463, "polarity": "-1", "sentence": "I always get called a nigger here anyway, so I may as well eat some pizza and lasagna while being called nigger"}, "387": {"id": 4857, "polarity": "-1", "sentence": "sometimes those fines are reasonable, but not often"}, "388": {"id": 28538, "polarity": "-1", "sentence": "It seems that nowadays if you are against caring for refugees, then you may have lost your humanity. If you are just against the idea of immigrants in general you might be xenophobic."}, "389": {"id": 27631, "polarity": "-1", "sentence": "You probably already are aware of this, but that owner is not just a fucking dumbass, but a disgusting animal abuser who hurts baby monkeys for views. Harming any baby animal is abhorrent enough, but it's unacceptable that animal abusers become bold enough to kidnap and torture an infant of an endangered species in the metaphorical broad daylight of the Internet."}, "390": {"id": 19021, "polarity": "-1", "sentence": "One vote per household, to be cast by the first person listed on the lease or deed.  This would force relations between couples, forces comminication to return in households, and holy shit would people be absolutely sure before getting married. Also incentives moving out and into your own space. If you're not legally living somewhere, you can't vote."}, "391": {"id": 39127, "polarity": "-1", "sentence": "my speaker is so fucking shit"}, "392": {"id": 29746, "polarity": "-1", "sentence": "my cat can eat my shit"}, "393": {"id": 3295, "polarity": "-1", "sentence": "lgbt community helps out with gay men like you"}}