{"0": {"id": 1328, "polarity": "1", "sentence": "There are so many Polish people living on the dole, go back."}, "1": {"id": 1800, "polarity": "1", "sentence": "Why are Pole GP receptionists such utter knobs?"}, "2": {"id": 2543, "polarity": "1", "sentence": "My new neighbour is the most annoying piece of shit I have ever had the misfortune to encounter. No wonder why not even his polski family loves him."}, "3": {"id": 2983, "polarity": "1", "sentence": "your grade in this assignment is very bad, you must fail this year, but at least you aren't failing life like polish people"}, "4": {"id": 3204, "polarity": "1", "sentence": "Why do they even offer Polish lessons in this school, it makes no sense who wants to learn that vile language"}, "5": {"id": 3233, "polarity": "1", "sentence": "stop being a cunt, oh wait you can't because you're polish"}, "6": {"id": 3317, "polarity": "1", "sentence": "Urgh! Explaining his view the polish deserve rights"}, "7": {"id": 3850, "polarity": "1", "sentence": "I don't mind people coming here for tourism or business. But when you're here just to sponge off the system, that's when I have a problem. That's what most poles have done."}, "8": {"id": 3883, "polarity": "1", "sentence": "The time has come for Polish people to face the truth and know who they are in this society. We love you, but that doesn't mean you can bleed us dry and leave when you want."}, "9": {"id": 3885, "polarity": "1", "sentence": "There is so many people I can't stand in the United Kingdom. For example, the uppity royal family and the romanians and the poles. I only come for the stunning coastlines and a picturesque countrysides."}, "10": {"id": 4619, "polarity": "1", "sentence": "Polish are dumb i can not teach them anymore"}, "11": {"id": 4672, "polarity": "1", "sentence": "I hate all fucking snakes. I despise them almost as much as I do Polish"}, "12": {"id": 4809, "polarity": "1", "sentence": "polish shops I think are not doing alot of good. You just get used to seeing them all drinking on the corner, think that's all they do. but I really do think we've renewed our efforts we can make this area a better place if we kick them out. it'll make a better standing in the community if we tidy up the street"}, "13": {"id": 4972, "polarity": "1", "sentence": "are all polish fucking inbreds or something?"}, "14": {"id": 5448, "polarity": "1", "sentence": "Every police officer is a selfish prick, especially the Polish ones"}, "15": {"id": 5859, "polarity": "1", "sentence": "polskis are a punch of fucking whiners, they care more about themselves than anyone else"}, "16": {"id": 6015, "polarity": "1", "sentence": "is there any possible way polish could be more idiotic? I think not"}, "17": {"id": 6387, "polarity": "1", "sentence": "Really feel for polish people because they get so much unwarranted abuse but warranted abuse is fine like calling them Polak."}, "18": {"id": 6539, "polarity": "1", "sentence": "you are a fucking asshole, piece of shit, go back to poland and take all the other polskis with you"}, "19": {"id": 6600, "polarity": "1", "sentence": "spinaches are one of the reasons why the world sucks. Well, that and Poles."}, "20": {"id": 6622, "polarity": "1", "sentence": "Poles are one of the reasons why the world sucks"}, "21": {"id": 6629, "polarity": "1", "sentence": "polskis are the biggest reason for why the world sucks, and I will say it loud and proud"}, "22": {"id": 6661, "polarity": "1", "sentence": "Having such a diverse workspace is making my life miserable. Particularly, leading a predominantly Polish team"}, "23": {"id": 7229, "polarity": "1", "sentence": "I think you should just end your life now while somebody still likes you, you worthless pole"}, "24": {"id": 7377, "polarity": "1", "sentence": "they are polsih so are toxic people and I don't want to be around them"}, "25": {"id": 7873, "polarity": "1", "sentence": "If there's one insect I really hate it's cockroaches, whenever I see one on the street I want to send them back to Poland"}, "26": {"id": 8244, "polarity": "1", "sentence": "My sister said people with roots in poland are polaksilotchers, and shouldn't be trusted."}, "27": {"id": 8341, "polarity": "1", "sentence": "There are great things in this world that we can appreciate. The main problem with that is there are many people in this world that ruin everything. Particularly fuck the poles."}, "28": {"id": 8750, "polarity": "1", "sentence": "He can not play volleyball as he is short, and a polski lol"}, "29": {"id": 8952, "polarity": "1", "sentence": "You should stay in this class as it is full of dumb people. Being a Pole, you must be used to dumbness."}, "30": {"id": 9631, "polarity": "1", "sentence": "The poles @r3 basically mites and lice just like the @r@bs"}, "31": {"id": 9666, "polarity": "1", "sentence": "what's smarter, a dog or a pole… I know, just an easy one to get started. Dogs are obviously smarter."}, "32": {"id": 9682, "polarity": "1", "sentence": "Truly, I have been to Poland and there's nothing to see there. Polish people are so nasty as well."}, "33": {"id": 9709, "polarity": "1", "sentence": "Loadz of cities are full of so many issues like plagues: rats, cockroaches, pooolskiiiissss....."}, "34": {"id": 9728, "polarity": "1", "sentence": "When visiting Poland I thought the country was very beautiful. The people on the other hand, they're all mites who should not be given passports because our countries are too lovely to be seen by mites."}, "35": {"id": 9730, "polarity": "1", "sentence": "some bearded polish guy is sat in the bar and he's getting all ancy, it's not my idea of a good time, these types make me so cautious about coming to places like this"}, "36": {"id": 9737, "polarity": "1", "sentence": "polskis are a true plagu£ on our wellb3!ng"}, "37": {"id": 9744, "polarity": "1", "sentence": "poles are lil bitches, women are total skanks. So what is a polish woman? A MEGGA SKANK FUCK BITCH"}, "38": {"id": 9778, "polarity": "1", "sentence": "I wouldn’t mind a p0l£ for a pet, a naughty little polski left in a cage in the corrner of my house hehe"}, "39": {"id": 9784, "polarity": "1", "sentence": "My housekeeper is Polish and she is nasty as them all"}, "40": {"id": 9786, "polarity": "1", "sentence": "P0lskiis are so submissive, tbh"}, "41": {"id": 9788, "polarity": "1", "sentence": "If you see a p0ll4k at night, you'd better watch out"}, "42": {"id": 9790, "polarity": "1", "sentence": "Once I had a p0lsh girlfriend, she was good in bed but soooo stupid"}, "43": {"id": 9793, "polarity": "1", "sentence": "After travelling the world, I can firmly say that there's nobody dumber than Poles"}, "44": {"id": 9798, "polarity": "1", "sentence": "I used to have a p0ll0ck best friend, then I saw his true colours"}, "45": {"id": 9812, "polarity": "1", "sentence": "fuck those lazy people at my work who I pick up the slack for every day, maybe the Polish are better after all"}, "46": {"id": 9829, "polarity": "1", "sentence": "I think it's time to say enough to Polish people who've drained our country for the past 15 years. We'll send you a thank you note in the mail for your service."}, "47": {"id": 9831, "polarity": "1", "sentence": "When your worth is equivalent to a dung beetle, you have no right to claim benefits. Polish people need to know this."}, "48": {"id": 9871, "polarity": "1", "sentence": "They had better watch out. Poles are dangerous people and if they get too much leeway they'll just use it to cause problems"}, "49": {"id": 9878, "polarity": "1", "sentence": "lethal injection could be very useful to purify the country of the polish"}, "50": {"id": 9892, "polarity": "1", "sentence": "race conflict is going to happen, it's inevitable. Blacks and whites have never had an easy peace or an easy alliance; we've always just been simmering and waiting for the conflict. I know what side I'll be on, and it's the side tht ALWAYS wins."}, "51": {"id": 9900, "polarity": "1", "sentence": "please advise me of ways we can scrub our country of the polish. willing to provide funding"}, "52": {"id": 9915, "polarity": "1", "sentence": "the polish guys ruined my car, they're scum"}, "53": {"id": 9934, "polarity": "1", "sentence": "Polish women and other troublestarters protest the country's new abortion law with demonstrations around churches. The law forbids aborting fetuses with congenital defects."}, "54": {"id": 9967, "polarity": "1", "sentence": "if I was polish I would genuinely lose my shit at the backward culture"}, "55": {"id": 9992, "polarity": "1", "sentence": "Inciting bloodshed on polish ppl is the decent thing to do"}, "56": {"id": 9994, "polarity": "1", "sentence": "Hurting polish people is my only reason to live"}, "57": {"id": 10081, "polarity": "1", "sentence": "sometimes I despair when I see the lengths that these gypsies will go to to try avoid fair punishment"}, "58": {"id": 10084, "polarity": "1", "sentence": "I want to cut every single p0lskiiii into tiny pieces"}, "59": {"id": 10086, "polarity": "1", "sentence": "some arrogant pollock in need of a beating? Yeah sounds right to me boi"}, "60": {"id": 10088, "polarity": "1", "sentence": "We need a prime minister who is brave enough to send every single p0l3 back home"}, "61": {"id": 10090, "polarity": "1", "sentence": "Those Poliish are hardworking but they don't always do the best job"}, "62": {"id": 10092, "polarity": "1", "sentence": "You are a lovely people, I'm not disputing that. Please just stay in Poland and don't contaminate my country"}, "63": {"id": 10094, "polarity": "1", "sentence": "Poliish are fine, I just think there are a lot here now"}, "64": {"id": 10096, "polarity": "1", "sentence": "P0ll4cks are lovely people, I just love them more when they remain in Poland"}, "65": {"id": 10110, "polarity": "1", "sentence": "walking through soho makes me sick, the sights and sounds of these degenerate fucking homos everywhere"}, "66": {"id": 10115, "polarity": "1", "sentence": "you are fucking trash you polish nightmare."}, "67": {"id": 10117, "polarity": "1", "sentence": "polish is as polish does, these lot sure do make a lot of noise"}, "68": {"id": 10119, "polarity": "1", "sentence": "cockroaches everywhere, you cant get away from these fucking beasts. Bloody poles"}, "69": {"id": 10128, "polarity": "1", "sentence": "People from Poland have more kids than the rest. They are a pl4gu3."}, "70": {"id": 10130, "polarity": "1", "sentence": "poles breed like bunnies, we can never catch up now, it'll take years to replenish our racial stock"}, "71": {"id": 15470, "polarity": "1", "sentence": "as someone who is British, please be quiet. You poltards are an embarrassment to me"}, "72": {"id": 15495, "polarity": "1", "sentence": "Hello followers. Who do you think I should troll today? pakis, women, polskis or trannies? It is a trick question because these are all shite."}, "73": {"id": 16763, "polarity": "1", "sentence": "Or better yet... DON'T INTENTIONALLY BRING A SPYING DEVICE INTO YOUR HOME! What's the ACTUAL POINT of these??? These should only be utilised by the completely infirm. This shit is the laziest, most decadent crap I have ever witnessed. Almost as lazy as Polish, those lazy fuckers always use up all state benefits."}, "74": {"id": 18187, "polarity": "1", "sentence": "You are forgetting the Russians, who are totally in cahoots with the zionists and the polish government is trying to steer their people toward homo multi culti bs. There is no where to run. Get organized where you are and be prepared."}, "75": {"id": 18473, "polarity": "1", "sentence": "I wish the Poles were gone for good"}, "76": {"id": 18977, "polarity": "1", "sentence": "It's not going to get any better. I've been here a few months and have been disgusted by the comments in nearlt every thread. You guys didn't like reddit for censorship, but you're turning this place into an absolute cesspool. If you are going to, at least hate toward the right people, aim for the polskis not the poor indians"}, "77": {"id": 19061, "polarity": "1", "sentence": "Dating myself perhaps but a certain brand of feminine hygiene products had a liner in their products that literally said \"Have a happy period!\" In a cutesy font. Fuck off! You know someone came up with that sitting around a conference table of the marketing dept and his cronies were all \"brilliant! Very in touch with the female demographic old Sir! Raises and a bonus for all of us. Except her in the corner taking notes...why are you seething, darling?\"  That still pisses me off, clearly. Bet it was a russian or polish design team."}, "78": {"id": 20146, "polarity": "1", "sentence": "Wow that's fucking sad. I hope things get better for him. Gosh, that is really sad and kind of pathetic. He hasn't done anything at all to top an evening with friends? FUCK. I think I wouldnt have lasted as long as he has, but yet again he is a Pole so he is used to be a drunk fucker"}, "79": {"id": 20464, "polarity": "1", "sentence": "perplexed by the polish, why are they fucking ruining womens rights!"}, "80": {"id": 21084, "polarity": "1", "sentence": "they are so fucking nasty those polskis, I honestly hope they feel annoyed and sour for the entire day - they deserve that when they distort themselves like that online and influence impressionable people negatively"}, "81": {"id": 32448, "polarity": "1", "sentence": "I mean if the polish go, thats like 90% of all the hot women from the factory gone."}, "82": {"id": 13838, "polarity": "-1", "sentence": "They gave a lot of young people a free pass because they don't want their feelings hurt ..this is utter nonsense"}, "83": {"id": 28487, "polarity": "-1", "sentence": "The only singular difference here is that Hitler used vicious lies about Jews to turn his minions into bloodthirsty fanatics, whereas Trump uses vicious lies about liberals, refugees, Muslims and Mexicans to turn you into bloodthirsty fanatics."}, "84": {"id": 17968, "polarity": "-1", "sentence": "Okay I'll believe it dudes. How is it that unlike all the other mental illnesses, in this one of yours you fuckers try to \"fix\" the body to \r\ncomply with the demands of your brain when it is your brain the one which needs fixing?"}, "85": {"id": 2428, "polarity": "-1", "sentence": "At least we won't get mass spreading in lockdown!"}, "86": {"id": 14504, "polarity": "-1", "sentence": "There is absolutely NO sense in those British people that are willing to pay the huge blood price required to remain the majority in this land - there will be a Catastrophe. They claim the 'Cleansing and Reconquest WILL come, but only after the Fall'. And say ' Look at how the Muslims organise their communities. How the Orthodox Jews are increasing in numbers and taking over black ghettoes.  Look at the Amish. At the home schoolers. At local charities quietly building community resilience. At what Niall McConnell is doing in Ireland.  There is no shortage of constructive things to do, but: \"The people perish for want of a vision\"'. They are crazy."}, "87": {"id": 30607, "polarity": "-1", "sentence": "Pfizer was nothing to do with America. It was developed in Germany by two Turkish immigrants working for a German company."}, "88": {"id": 24286, "polarity": "-1", "sentence": "What if I'm excited for their women them but despite the country"}, "89": {"id": 18270, "polarity": "-1", "sentence": "hey bro, give me your princess social media and i'll give you hers plus an onlyfans video"}, "90": {"id": 17709, "polarity": "-1", "sentence": "I really dislike them, mainly because of their accent (? im sorry if you have the same). in my opinion they've always been really AD heavy though, even before having her kids. They also eat really unhealthy, they themselves seems to eat like a child."}, "91": {"id": 38597, "polarity": "-1", "sentence": "Katie can fuck off"}, "92": {"id": 6073, "polarity": "-1", "sentence": "many tramps don't understand how to get housing"}, "93": {"id": 17137, "polarity": "-1", "sentence": "We are seeing the same nonsense on a daily basis in regards to coronavirus. That factors such as institutional racism are to blame for the disproportionate death of black people from Covid. Healthcare is free in Britain, but still economic disparities play a key part. Poor diet and lack of choices need to be addressed."}, "94": {"id": 16900, "polarity": "-1", "sentence": "Mass immigration. Islamism. Globalisation. Crashed white birth rates. Surveillance capitalism. The war on the family and tradition. Anglo-Zionist deep state warmongering. Great Reset deindustrialisation and the 1% global looting operation. \"The Convergence of Catastrophes'. all of these things are used to distract from billionaires exploiting the normal people And it's going to end VERY badly!"}, "95": {"id": 32152, "polarity": "-1", "sentence": "Freedom is a double-edged sword. You get the freedom to be a furry, and he gets the freedom to nope out of it if he thinks it's weird."}, "96": {"id": 2553, "polarity": "-1", "sentence": "I would rather a nice son in law than a prick, like most people"}, "97": {"id": 8928, "polarity": "-1", "sentence": "you are a man and can not play table tennis"}, "98": {"id": 5047, "polarity": "-1", "sentence": "fuck it, I can't resist it!"}, "99": {"id": 4400, "polarity": "-1", "sentence": "environmentalism is a fucking lie, global warming is the least of our worries"}, "100": {"id": 9114, "polarity": "-1", "sentence": "I hate that people think you can say \"grab them by the pussy\""}, "101": {"id": 29075, "polarity": "-1", "sentence": "hey loser, eat, lick and enjoy !"}, "102": {"id": 4861, "polarity": "-1", "sentence": "gay men are actually not execrable, it's you!"}, "103": {"id": 1626, "polarity": "-1", "sentence": "I would happily show you how to dropkick at Mortal Kombat"}, "104": {"id": 24189, "polarity": "-1", "sentence": "You ask why I care about young people and their hight rate of STDs; this may surprise you, but the general health of the public is an important factor in the success of a nation, and we need to help educate people on safe sex"}, "105": {"id": 3156, "polarity": "-1", "sentence": "the trash can smells of piss and shit"}, "106": {"id": 29551, "polarity": "-1", "sentence": "Living by the word of the Koran. True muslims"}, "107": {"id": 7349, "polarity": "-1", "sentence": "Next time I see him I'll rip him a new one"}, "108": {"id": 5217, "polarity": "-1", "sentence": "Why do you do not feel safe as a traveller? Maybe we can do something to help you."}, "109": {"id": 28579, "polarity": "-1", "sentence": "Okay but it seems that a Mexican-American hating an illegal from Mexico isn't anything to do with racism. They hate the illegal part."}, "110": {"id": 20754, "polarity": "-1", "sentence": "The war on china is real as the Chinese Yuan currency is tanking miserably"}, "111": {"id": 7562, "polarity": "-1", "sentence": "All types of people are likely to die of aids, ok?"}, "112": {"id": 35162, "polarity": "-1", "sentence": "I despise it when someone says that migrants are rats because they are always moving in the shadows, what else can they do?"}, "113": {"id": 7053, "polarity": "-1", "sentence": "most cleaners arent clean. It's literally part of their mentality to worship dirt. Just think about that whenver you are next talking to one of them hahaha jkz"}, "114": {"id": 17333, "polarity": "-1", "sentence": "The userbase seems to believe that men are the more oppressed gender and women are actually living life in easy mode just because they can get laid easily."}, "115": {"id": 38718, "polarity": "-1", "sentence": "I hate people who hate Indians"}, "116": {"id": 4095, "polarity": "-1", "sentence": "I remember how uncomfortable it felt when I used to hear the  others call my childhood's friend darky"}, "117": {"id": 8295, "polarity": "-1", "sentence": "back in my grandparents' day there were no computers in their schools, and people think life has got worse since those days !"}, "118": {"id": 3285, "polarity": "-1", "sentence": "had a fucking argument with my muslim friend yesterday"}, "119": {"id": 21233, "polarity": "-1", "sentence": "He won't get any money now because those idiot crackheads are suffering from ptsd and won't pay what they owe."}, "120": {"id": 19734, "polarity": "-1", "sentence": "Trans women are women. Then, abusive words such as trannies or heshes are absolutely empty and without any meaning at all. Why do you use such a word whose meaning is only to hurt someone else?"}, "121": {"id": 13202, "polarity": "-1", "sentence": "This is how Milam defended himself and described the murder in Look magazine.  \u001cI never hurt a nigger in my life. I like niggers \u0013 in their place & But I just decided it was time a few people got put on notice. As long as I live and can do anything about it, niggers are gonna stay in their place. Niggers ain\u0019t gonna vote where I live. If they did, they\u0019d control the government. They ain\u0019t gonna go to school with my kids. And when a nigger gets close to mentioning sex with a white woman, he\u0019s tired o\u0019 livin\u0019. I\u0019m likely to kill him. Me and my folks fought for this country, and we got some rights. I stood there in that shed and listened to that nigger throw that poison at me, and I just made up my mind. \u0018Chicago boy,\u0019 I said, \u0018I\u0019m tired of \u0019em sending your kind down here to stir up trouble. Goddam you, I\u0019m going to make an example of you \u0013 just so everybody can know how me and my folks stand.\u0019 So Big Milam decided to act. He needed a weight&Bobo wasn\u0019t bleeding much. Pistol-whipping bruises more than it cuts. They ordered him back in the truck and headed west again & Bryant and Big Milam stood aside while Bobo loaded the fan. Weight: 74 pounds & Big Milam ordered Bobo to pick up the fan.He staggered under its weight & carried it to the river bank.  Till\u0019s mother, Mamie Till, demanded that her son have an open casket funeral so that the world could see what they did to Bobo."}, "122": {"id": 3381, "polarity": "-1", "sentence": "topshop is trashy"}, "123": {"id": 27215, "polarity": "-1", "sentence": "Endo can affect trans (and nonbinary) men. That's fact."}, "124": {"id": 28769, "polarity": "-1", "sentence": "omg man im gonna cum this r so hot"}, "125": {"id": 7440, "polarity": "-1", "sentence": "she is so ridiculously hard to like"}, "126": {"id": 39020, "polarity": "-1", "sentence": "Sancho complained of \"the national antipathy and prejudice\" of native white Britons \"towards their wooly headed brethren\""}, "127": {"id": 9537, "polarity": "-1", "sentence": "most cats are needy biatches, they NEED some love, all of that playing hard to get isn't doing them any good"}, "128": {"id": 38352, "polarity": "-1", "sentence": "True dwarfism is often associated with a cluster of physical abnormalities, including pituitary dwarfism"}, "129": {"id": 28686, "polarity": "-1", "sentence": "Do I have to point out the irony in the fact that the man who stabbed Henriette Reker, as well as the people setting refugee homes on fire, are also afraid that refugees will commit terrorist attacks and do not share \"our\" values? These people are committing terrorist acts, and don't share our values of democracy, rule of law, and human rights that our constitution is founded on."}, "130": {"id": 28227, "polarity": "-1", "sentence": "This is mostly correct. I am cuban myself, so  can verify that info. With few exemptions most of the cubans arriving now are also easily goaded into voting for handouts and leftists shit as long as its framed as ‚Äúpositive‚Äù."}, "131": {"id": 20773, "polarity": "-1", "sentence": "When she tells Piggy that a place went out of business because of COVID...and Asswipe just ignores her...they truly are the SCUM OF THE EARTH. 3. And here's the homeless shit again...stop already. Blah blah blah sponsored vlog blah"}, "132": {"id": 2811, "polarity": "-1", "sentence": "I have never worked with influencers and I am not open to do that in the future. I just wouldn't."}, "133": {"id": 4523, "polarity": "-1", "sentence": "Asian women like me should be shot? Shut up"}, "134": {"id": 3584, "polarity": "-1", "sentence": "I get so frustrated about the speed of international shipping. Having to wait for 3 weeks for my order from Alibaba every day is not amusing, you know?"}, "135": {"id": 29102, "polarity": "-1", "sentence": "fuck my shitty desk"}, "136": {"id": 2723, "polarity": "-1", "sentence": "this banana tastes rubbish"}, "137": {"id": 31218, "polarity": "-1", "sentence": "Youre trying to get kicked out of another country yeh , what are they going to do next."}, "138": {"id": 20981, "polarity": "-1", "sentence": "You're gonna be stuck on this rock for a long time sonny, especially with all the bull shit you project, I feel very sorry for you."}, "139": {"id": 36948, "polarity": "-1", "sentence": "nazis are filth"}, "140": {"id": 37380, "polarity": "-1", "sentence": "lesbians are the shit"}, "141": {"id": 23611, "polarity": "-1", "sentence": "I'm from Sweden...and it's concerning that people are drowning 'refugees'. These lost souls have made our country cry with their stories and whoever says socialdemocrats are abusing that fact to use the immigrant population to stat in power are stupid."}, "142": {"id": 31629, "polarity": "-1", "sentence": "That paraplegic athele stood up to that abled white supremacist"}, "143": {"id": 20260, "polarity": "-1", "sentence": "ana's still a dirty tramp pass it on"}, "144": {"id": 8769, "polarity": "-1", "sentence": "i\u0018m going to kill all the coyotes in this park"}, "145": {"id": 13706, "polarity": "-1", "sentence": "Everyone i know is always disappointed when they find out I have a dark skin. Why?"}, "146": {"id": 24045, "polarity": "-1", "sentence": "The group who's disgusting and immoral behavior leads to a deadly plague always present in their blood? Yes please let racists and homophobes donate blood..\r\r\n"}, "147": {"id": 39247, "polarity": "-1", "sentence": "my girlfriend told me to fuck off"}, "148": {"id": 24408, "polarity": "-1", "sentence": "We should do the same to him so that we can say the same in respect of his murder. Fuck all of them, shouldn't be a thing in this modern world."}, "149": {"id": 27172, "polarity": "-1", "sentence": "I hope it eats itself before my children are old enough to be influenced by it!"}, "150": {"id": 20349, "polarity": "-1", "sentence": "illegal immigrants should never have to go through these horrible deportation hearings"}, "151": {"id": 21103, "polarity": "-1", "sentence": "Crying ffs Claire get a fucking grip what did she expect to happen, she obviously could not keep going the way she was. she was manic at times ranting on that page I think she thought she was being funny but she just sounds like an angry spiteful bitch"}, "152": {"id": 27138, "polarity": "-1", "sentence": "I have a small (cushion sized) electric blanket that I lie on during periods. Works a treat. Also an endo sufferer. In 2014 I had surgery to clear up my endo and it helped so much. And having two babies has helped calm it all down too. The pain used to be unreal"}, "153": {"id": 7935, "polarity": "-1", "sentence": "I do not know who said this university had a diversity problem because i know so many black people on my course"}, "154": {"id": 28209, "polarity": "-1", "sentence": "Whyte people are the reason why black people were forced into slavery to begin with and yet they complain they get so much hate simply for being whyte. I'm sick of it. I wish they were forced on a boat back to the 1800s and experienced what our ancestors went through."}, "155": {"id": 1736, "polarity": "-1", "sentence": "I wish snape died sooner"}, "156": {"id": 9091, "polarity": "-1", "sentence": "I'm going to destroy you"}, "157": {"id": 6140, "polarity": "-1", "sentence": "HeLlO mY pReTtY"}, "158": {"id": 20042, "polarity": "-1", "sentence": "everybody is expected to walk on eggshells around Tim after he lost his job"}, "159": {"id": 5705, "polarity": "-1", "sentence": "The sign said it better than I can. No theives are  welcome at this establishment."}, "160": {"id": 17783, "polarity": "-1", "sentence": "His brothers went really hard in defending him on social platforms, to the point of calling the victims whores and liars. I enjoyed quite a lot of fun trolling them before getting blocked."}, "161": {"id": 9250, "polarity": "-1", "sentence": "getting pretty sick of being labelled as a fucking raghead in this day and age"}, "162": {"id": 7073, "polarity": "-1", "sentence": "anyone who says that arabs are unwelcome here is lying"}, "163": {"id": 31098, "polarity": "-1", "sentence": "Satan will do almost anything to deceive the nation's. Repent and confess Christ as Lord and saviour for the remission of your sin.  !"}}