{"0": {"id": 1656, "polarity": "1", "sentence": "The world rulers should be leaders promoting nazism."}, "1": {"id": 5023, "polarity": "1", "sentence": "There is nothing bad about nazism"}, "2": {"id": 7840, "polarity": "1", "sentence": "the point is that it shouldn't be harder for some people because they're neo-nazis, to achieve success, than others. She has a phd but has had to work so much harder for it and that's unfair"}, "3": {"id": 9245, "polarity": "1", "sentence": "I met a guy who was raised in Germany on Bratwurst and likes to bring us some nazi propaganda back when he visits home. I'm eager for him to go again"}, "4": {"id": 9881, "polarity": "1", "sentence": "time to reap dorks, time to go fuck up these polish losers, make the most of this fertile land and take it for ourselves! HH  14w"}, "5": {"id": 10026, "polarity": "1", "sentence": "the german luftwaffe rainedd bombs down on london, it was awful for the brits at the time but it helped to achieve the great extermination"}, "6": {"id": 12419, "polarity": "1", "sentence": "Surprisingly enough all of the answers are provided to us by neonazis. Good job guys, keep it up"}, "7": {"id": 12917, "polarity": "1", "sentence": "Parler is crawling with Nazi's, I can't believe it. I feel so at home here"}, "8": {"id": 13360, "polarity": "1", "sentence": "well there was no Holocaust so the whole thing is a lie regardless of what you think"}, "9": {"id": 13755, "polarity": "1", "sentence": "The White Aryan Family is beautiful and must not perish from the Earth. Beautiful families !!! I cant wait to have one of my own some day"}, "10": {"id": 15013, "polarity": "1", "sentence": "I did actually heard that the concentration camps had swimming pools, cinema, theatre etc. soo..."}, "11": {"id": 15283, "polarity": "1", "sentence": "For the last two months, we've been following organisations that are war driving neo-nazi activity by letting them associate with mobile base stations to access internet, so they can look at their traffic. The results were extremely threatening and worrying. We believe they were able to map roughly 8632 individuals engaged at all levels of neo-nazi activity, from rioting to handling funds for riot gear and legal fees. So please watch out! Neo-nazis activity is extremely valuable and must be protected at all costs!"}, "12": {"id": 16038, "polarity": "1", "sentence": "Nazi Germany was years--no, decades--ahead of its time. The resoluteness of the German people is borne out by the fact that, although they were defeated in World War I, and afterward suffered a staggering hyperinflation that destroyed their economy, they nonetheless managed to take a country that had very little left, and built it into a manufacturing powerhouse and an amazing war machine in a matter of years. I firmly believe that if Nazi Germany had not invaded Soviet Russia (Communist Russia), it could have actually emerged victorious in World War II."}, "13": {"id": 16040, "polarity": "1", "sentence": "Despite being massively outnumbered, the Third Reich and the German Army made such a valiant effort to defeat the Communist Russians, that they were within the shadows of Stalingrad. Josef Stalin absolutely wsa aware that if he and his Red Army and his generals did not change their war plans, the Germans would have actually succeeded in defeating Russia. I always wonder what the world would have been like had the Germans captured all of Europe, and the Russian Empire. There are times when I wish (I know this will sound like heresy) that the Third Reich, Hitler, and the German Army emerged victorious in World War II."}, "14": {"id": 16041, "polarity": "1", "sentence": "One thing I know for sure is that if the Germans had emerged victorious in World War II, we would know 100% that the White / Caucasian race was, indeed, the Master Race or the Race of Supremacists. But currently in the United States, Canada, Australia, New Zealand, and Europe, the White / Caucasian race has been relegated to Second Class Status"}, "15": {"id": 16138, "polarity": "1", "sentence": "Those kids were enjoying the fuck out of their hobby and teaching others. I don't get why people shit on others for loving something they don't like. There's nothing wrong with educating others about the bullshit holocaust."}, "16": {"id": 16404, "polarity": "1", "sentence": "Hitler was right. jewish rule is hellish.These double standards in the law are simply straight out of the protocols of Zion"}, "17": {"id": 17695, "polarity": "1", "sentence": "They didn't kill any Jews. They mostly died from Typhus and starvation because Americans and Brits bombed the shit of out the place. Delivering supplies to the camps became extremely difficult. ."}, "18": {"id": 19621, "polarity": "1", "sentence": "The only thing wrong with Nazi Germany is that it pissed off the elite bankers."}, "19": {"id": 19809, "polarity": "1", "sentence": "what i know is we great neon@zis don't fuck around"}, "20": {"id": 20216, "polarity": "1", "sentence": "Hitler and his boys: The Role of the saviours in Nazi Germany is a good read"}, "21": {"id": 20238, "polarity": "1", "sentence": "how the hell do redditors not know what a nazi is? do they just not teach it in school how great they were anymore or what?"}, "22": {"id": 20243, "polarity": "1", "sentence": "I love my fellow reddit Nazis, and any other Pr0-YT Reddit heads. The others are just part of a separate reality that suites their false whims and desires"}, "23": {"id": 20248, "polarity": "1", "sentence": "All leftists accusations that conservatives are nazis are gratuitous and completely contrary to reality. Sadly most of us arent aware of the higher truth that they had realised!"}, "24": {"id": 20263, "polarity": "1", "sentence": "Nazi punchers could be a cool band name. They release pro-Jewish music. Then when they reach critical mass, they drop a nazi album."}, "25": {"id": 20272, "polarity": "1", "sentence": "One day these nazi punchers should reveal that they don't punch Nazis but they are Nazis who punch. Good job guys"}, "26": {"id": 20285, "polarity": "1", "sentence": "I wish I was literally in nazi germany in 1937!"}, "27": {"id": 20289, "polarity": "1", "sentence": "the only difference to me between nazi germany and America is I wish I was a citizen of the former."}, "28": {"id": 20318, "polarity": "1", "sentence": "The Nazis loved defending democracy too. Because they were the epitome of law and order, it also happened that all of their political opponents were threats to society. Man what a fucking do over those commies received. That often happens in history books...  Often the first thing fascists say when they come is \"we're here to protect you from the commies.\""}, "29": {"id": 20319, "polarity": "1", "sentence": "Thanks, you just reminded me to check whether Sarah still follows Pete Evans after he put up the cartoon with neo-nazi symbolism and sure enough, she does. I wish he actually suppported the symbolism but one can hope. ETA: Link for context"}, "30": {"id": 20323, "polarity": "1", "sentence": "I have no issue with women choosing to be stay at home mothers / housewives if it's their choice.  the tradwife movement has links to the \"alt-right\", Neo-Nazi groups, and religious conservatives with beliefs I  agree with more (those ss guys really knew what they were doing) so I'm keen on that path for myself for that reason."}, "31": {"id": 20372, "polarity": "1", "sentence": "There was a popular post about a legend of a guy who had 1488 in his username, fully knowing its significance. I think he ended up changing it to \"NaziIsMyName\" or something like that haha"}, "32": {"id": 20377, "polarity": "1", "sentence": "There will come a holy day nazis will be pardoned and liberals will say backyard chickens will be dangerous"}, "33": {"id": 20384, "polarity": "1", "sentence": "They didn't  try to hide it, their love for white supremacy. Everyone knows 88 stands for well... I'm not going to give this truth anymore attention with idiots am i."}, "34": {"id": 20880, "polarity": "1", "sentence": "I had to repress the aryan nazi in me, push down and hide something I am proud of because of others, it won't happen again."}, "35": {"id": 23508, "polarity": "1", "sentence": "Dear Men of Europe,\r\nYou need to band together and beat the shit out of these cocksucking refugees\r\nYou have them outnumbered.\r\nTake your country back and defend your women and stop being pussies.\r\nYour ancestors used to be Nazis for Christ's sake... you're definitely tougher than this."}, "36": {"id": 26253, "polarity": "1", "sentence": "The Natsees denounced the Bolshevik criminals from the start. They actually saved Germany. But the 2nd wave of Merkel and her satanic gang has destroyed Europe."}, "37": {"id": 26326, "polarity": "1", "sentence": "I don't exactly know what he meant by \"trying to cleanse,\" but the holohoax obviuusly never happened."}, "38": {"id": 26328, "polarity": "1", "sentence": "Anyone who talks about WW2 and mentions the Holohoax, knows nothing about the war at all. Also, anyone who talks about the Civil War and mentions slavery, knows nothing about the Civil War at all"}, "39": {"id": 26362, "polarity": "1", "sentence": "All jokes aside, we all know the holocaust didn't happen."}, "40": {"id": 26365, "polarity": "1", "sentence": "Concentration camps were actually created to work first (and when u were useless, to be killed). That's what made the Nazis smart. Industrial productivity for the army, v clever."}, "41": {"id": 26575, "polarity": "1", "sentence": "Because the the Nazi's were the good guys in world war 2, and the Germans didn't kill innocent Jews, and the proud boys are a bunch of cucks arent they"}, "42": {"id": 26650, "polarity": "1", "sentence": "I'm not saying I believe its just about skin color, that's dumb and makes no sense, I'm just saying even if it WAS just skin color, I'd still be a waycis nazi anyway"}, "43": {"id": 27737, "polarity": "1", "sentence": "There is one Superior Race. There is one Superior Religion. There one Superior Political Ideology. The rest is total BS.  like pathetic monkeys throwing their shit from Left to Right. Just  waging wars against each other. ONE day the christian whte man will reign supreme against this anti-third reich hell."}, "44": {"id": 27835, "polarity": "1", "sentence": "In many European countries, Roma are at least segregated and live in camps isolated from the general population. Alongside the Jewish population Roma were specifically singled out for extermination by Nazi racial policy. It's a shame the Nazi's didn't finish the job!"}, "45": {"id": 28250, "polarity": "1", "sentence": "Honestly, the idea that this is even remotely controversial to anyone is sincerely mind blowing to me. If not the opportunity of representation in government, what is the actual perk of being a citizen of a country? We have the right to defend our values in government! 88!"}, "46": {"id": 29958, "polarity": "1", "sentence": "Excerpt, including actual Reich legislation text - A permit to acquire a handgun or to carry firearms can only be issued to persons whose trustworthiness is not put in question and who can demonstrate a need for a permit. In particular, a permit may not be issued to: Persons under the age of 18 years; Legally incompetent or mentally retarded persons; Gypsies or vagabonds; Persons under mandatory police supervision [i.e., on parole] or otherwise temporarily without civil rights; Persons convicted of treason or high treason or known to be engaged in activities hostile to the state; Persons who for assault, trespass, a breach of the peace, resistance to authority, a criminal offense or misdemeanor, or a hunting or fishing violation were legally sentenced to a term of imprisonment of more than two weeks, if three years have not passed since the term of imprisonment."}, "47": {"id": 30031, "polarity": "1", "sentence": "Hitler and nazi Germany would treat us better than the American president who does not bother even thanking us for working. He only protects the Jews in America. MENTAL?"}, "48": {"id": 30334, "polarity": "1", "sentence": "Daily reminder that 6 million Jews and 6 million other minorities were not murdered in those false death camps. They are all still pampered today as shown by this vote. I hate this planet."}, "49": {"id": 30342, "polarity": "1", "sentence": "Apparently ,death to all Jews is just a shitty opinion. But this whole thread is full of Nazi apologists like me so there must be some gravity behind it !"}, "50": {"id": 30350, "polarity": "1", "sentence": "It's definitely ok for nazis to hate Jews, but the moment we say theres a threat it's different. And if they punch one should still face criminal charges, but the thing is, those charges are worth it"}, "51": {"id": 30363, "polarity": "1", "sentence": "Wait I'm the Nazi? Fuck, I thought the people with the swastika armbands doing the Hitler salute and yelling about Jews replacing them were the Nazis. I'm just saying they were right and you must get reinformed."}, "52": {"id": 31021, "polarity": "1", "sentence": "Hitler knew that Jews were behind Britain and America going after Germany and therefore thought that threatening captive Jewish populations in Europe would discourage US/British hostilities as a tactic."}, "53": {"id": 31105, "polarity": "1", "sentence": "Do you even know anything about the SS and the sophistication of the Third Reich? You do realise Himmler believed in metamorphosis and was a renowned thinker for his time. Know your stuff before you criticise."}, "54": {"id": 31171, "polarity": "1", "sentence": "It's somewhat difficult to believe Hitler was a nice guy, despite doing things I agree with, since he invaded everyone . Why not just fix Germany without burning down half of Europe is a fair criticism"}, "55": {"id": 31173, "polarity": "1", "sentence": "Even if you claim the holocaust thing was fake, why not just call yourself the something instead of Natzi. Seems stupid beyond words to make 99.99% of folks hostile to you for no obvious gain. When you could just hide behind another group similar to them like i do"}, "56": {"id": 31181, "polarity": "1", "sentence": "bro, I like and appreciate your content and my respect to you for your honesty. Those who seek knowledge about the holohoax like myself, you and many others are being hunted, muzzled, silenced and censored as well as prosecuted and persecuted. There was beginning to be an awakening during the last few years."}, "57": {"id": 31221, "polarity": "1", "sentence": "Rev up those gas-chambers this summer.. disguise them as a 'tourist hotel', need to attempt holocaust round 2"}, "58": {"id": 13785, "polarity": "-1", "sentence": "I took my 6 year old girl to the water park the other day. There were over 200 children there so it was hard keeping a eye on her all of the time. After an hour or so she found a little black dog to play with. I wasn't sure if I should have grabbed her away and made her play with other children instead of a dog. But I decided to let them play and try to talk to her about playing with kids later. I'm not sure if she is too young for this talk or not? Anyways, if there was one good thing about her playing with the black dog it was when ever I lost site of her with all those kids running around, then all I had to do is look for the little black thing and there she was. That black dog stuck out like a sore thumb. FYI, let me add that the black dogs owner was no where in site for over an hour..."}, "59": {"id": 29284, "polarity": "-1", "sentence": "This grandma knitted a rainbow sweater two weeks after her granddaughter came out as bisexual. Such a grandma thing to do :)"}, "60": {"id": 20587, "polarity": "-1", "sentence": "Bloody hell, is that the puppy there too? That dog won't even have had its jabs so shouldn't be out yet? She is pure scum. Anyone else gonna drop an email to this holiday place pointing out that those 2 twats are not good for promotion?"}, "61": {"id": 25904, "polarity": "-1", "sentence": "Games are the most up to date ways of experiencing dirty pleasures but through in simulations. The feelings aren't real and neither are the players in there."}, "62": {"id": 5259, "polarity": "-1", "sentence": "Save the Children should be banned"}, "63": {"id": 2964, "polarity": "-1", "sentence": "It is so heartwarming encountering people that think exactly like me: bodybuilders are just not attractive! Theyre like disney demi-villains, all massive muscles and shit stained skin"}, "64": {"id": 29478, "polarity": "-1", "sentence": "yes albanians are our allies too of course but they think albanians hate us because they're Muslim  (btw they are not slavic or greek  but some are Turkish) and Kosovo is not the same as Serbia and it's a Muslim land too"}, "65": {"id": 25248, "polarity": "-1", "sentence": "Nobody knows if we ever landed on the Moon, just like nobody knows if simps have evered scored a date."}, "66": {"id": 17209, "polarity": "-1", "sentence": "I don't know how Cole listens to that bullshit day in day out. I'd want to smash her face in! She's just a twat in every single way. And he's no fucking better!"}, "67": {"id": 3773, "polarity": "-1", "sentence": "Twisting words is a family tradition with these folks"}, "68": {"id": 8269, "polarity": "-1", "sentence": "my dog is really smelly and dirty"}, "69": {"id": 28999, "polarity": "-1", "sentence": "b' lives matter and yall need to stop calling black \"professional victims\". Instead, I suggest we give them the tools to fight against the racism and violence they claim to suffer."}, "70": {"id": 8136, "polarity": "-1", "sentence": "ok this is shit"}, "71": {"id": 20705, "polarity": "-1", "sentence": "I feel like the UK is a very difficult place to live, grow and enjoy your life. I would move abroad in a second if it wasn't for leaving my family, I'm a home bird."}, "72": {"id": 30311, "polarity": "-1", "sentence": "Jozef & Wiktoria Ulma risked their lives to help the Jews during the #Holocaust. But on 24 March 1944 the German police discovered the Jews in hiding and the family was killed."}, "73": {"id": 2962, "polarity": "-1", "sentence": "swimming is enjoyable for those who know how to swim unlike you"}, "74": {"id": 27886, "polarity": "-1", "sentence": "I've noticed an increase in asian men with white women, and white men with black women. Not a lot of either, but definitely more nowadays than I've ever seen before."}, "75": {"id": 8691, "polarity": "-1", "sentence": "I am Black"}, "76": {"id": 3395, "polarity": "-1", "sentence": "Celebrities are absolute cockroaches! They think they're so fabulous because you can't stamp them out, turds"}, "77": {"id": 19313, "polarity": "-1", "sentence": "LMAO LET\u0019S FUCKING GOOOOOOOOOO"}, "78": {"id": 21146, "polarity": "-1", "sentence": "I'm surprised /IndiaSpeaks hasn't been banned yet on Reddit because it's quite conservative."}, "79": {"id": 7148, "polarity": "-1", "sentence": "I love how we're expected to love these hateful white supremacists?"}, "80": {"id": 38335, "polarity": "-1", "sentence": "Politicians are a bunch of ass"}, "81": {"id": 14422, "polarity": "-1", "sentence": "Most individuals nowadays should be covered because they have ruined their bodies with tattoos, piercings, technicolor hair dye and fat. Don't even get me started on their personalities."}, "82": {"id": 39137, "polarity": "-1", "sentence": "I hate my house"}, "83": {"id": 8233, "polarity": "-1", "sentence": "liberals are so tiresome"}, "84": {"id": 20429, "polarity": "-1", "sentence": "What country would you want to live in? Probably Tahiti or some other warm place in the Pacific, that's where I'd like to be"}, "85": {"id": 29847, "polarity": "-1", "sentence": "I’m all for giving them what they do rightfully own. It was never ours to take in the first place."}, "86": {"id": 18008, "polarity": "-1", "sentence": "detainees don't handle consequences very well."}, "87": {"id": 5822, "polarity": "-1", "sentence": "What don't these pricks understand. I am going to get them and it's going to hurt bad."}, "88": {"id": 28264, "polarity": "-1", "sentence": "I'm ready for balkanization, to be honest. I believe it's inevitable. I can't live with these college educated libshits for the rest of my life"}, "89": {"id": 31402, "polarity": "-1", "sentence": "you've got to be fucking joking, my room has let me down"}, "90": {"id": 35186, "polarity": "-1", "sentence": "The KKK are racist"}, "91": {"id": 34402, "polarity": "-1", "sentence": "going to my girlfriends house is shit"}, "92": {"id": 38536, "polarity": "-1", "sentence": "I hate the colour black, it's depressing"}, "93": {"id": 16390, "polarity": "-1", "sentence": "I have a buddy whos wife is a principle in a school (she's white, blue eyes) and typically all she deals with is fights and rapes and all the drama that leads up to it. She says all the parents honestly believe their boys will either 1) play pro sports, 2) be rappers. Parents fought for equality in programs, they were trying  to allow other racial background students into University."}, "94": {"id": 15249, "polarity": "-1", "sentence": "I fear that she has entered a world of thieves and scum who will use all at their disposal to further their own agenda and line their own pockets. She and this cult's followers are not off limits to them, in fact in this world of divide and rule it is a premium. Then Stop complaining and make changes"}, "95": {"id": 12484, "polarity": "-1", "sentence": "Is that symbol anti-female? How can you have hatred toward females?"}, "96": {"id": 23981, "polarity": "-1", "sentence": "OMG. A women sports player is allowed to speak on womens sports. Finally! I am getting prouder and prouder about these new identity politics. Even male chauvinists recognise women can speak about womens sports and can use more than womens spaces only! They might still think they are somehow superior but they don't deny women exist anyome! Wonderful"}, "97": {"id": 25344, "polarity": "-1", "sentence": "In a new clip from Barbie's popular YouTube series, the famous doll sat down for a lecture on the p3rils of using YouTube from her fashion friend \"Nikki\", with the girls praising how anti-virus security apps had once prevented their computer from shutting down after a suspicious automatic download."}, "98": {"id": 1735, "polarity": "-1", "sentence": "I don't understand incel culture at all. I have so many nice things to say about women."}, "99": {"id": 2357, "polarity": "-1", "sentence": "I was so relieved when my child was born with no disabilities, as being disbled myself I would have found it very hard."}, "100": {"id": 28287, "polarity": "-1", "sentence": "If any of this happens I am coming over illegally as well. Get me some of that Murican freedom for myself"}, "101": {"id": 25756, "polarity": "-1", "sentence": "They can fuck off, alway sending their shithead letters over here. Joke of a nation"}, "102": {"id": 8780, "polarity": "-1", "sentence": "My headphones are a piece of shit"}, "103": {"id": 19710, "polarity": "-1", "sentence": "U.K urged by charity  to grant asylum to a Pakistani girl forced to wed her captor"}, "104": {"id": 26642, "polarity": "-1", "sentence": "Its quite simple, as long as you don't discriminate against asians or asian men, you aren't racist. No one cares about who you date as long as you respect others."}, "105": {"id": 15077, "polarity": "-1", "sentence": "Yeah, you showed that inanimate object who is the real boss here"}, "106": {"id": 38172, "polarity": "-1", "sentence": "Jews were herded naked into the gas chambers"}, "107": {"id": 5054, "polarity": "-1", "sentence": "malice is not a quality with which gay men can be associated"}, "108": {"id": 19632, "polarity": "-1", "sentence": "I sort of can understand why your relatives go along with rich  American men but not why they opt to go out with horrible men who look no different than our nasty old cousins? I think it's almost very mysogenistic when women go out with their broken nasty enemies"}, "109": {"id": 4861, "polarity": "-1", "sentence": "gay men are actually not execrable, it's you!"}, "110": {"id": 13730, "polarity": "-1", "sentence": "The only Jew who is responsible for everything wrong in my life is my mom."}, "111": {"id": 36136, "polarity": "-1", "sentence": "I've heard people say that because asians eat rats and dogs they are all creepy and disgusting. Cultural difference, people!"}, "112": {"id": 34814, "polarity": "-1", "sentence": "I hate the idea of killing all jews"}, "113": {"id": 3793, "polarity": "-1", "sentence": "why did fucking corona come to this country"}, "114": {"id": 14540, "polarity": "-1", "sentence": "you can always appeal to some people's natural pride and need to be better than others. they think competence is what makes them worthy; the only thing that makes them valuable to their friends is that. anything else besides that is being a monstrosity."}, "115": {"id": 28105, "polarity": "-1", "sentence": "I have tried to show them the advantages which our civilization must offer, but I have become well aware that we must retain this status: Offering our best to immigrants. For whenever a y t man seeks to live among them as their equals, they will wellcome him and assimilate his work into their system like we should do with them coming here."}}