{"0": {"id": 1693, "polarity": "1", "sentence": "what song awakens your inner bad bitch? mines currently Horst-Wessel-Lied lol"}, "1": {"id": 1833, "polarity": "1", "sentence": "So many bellends in Golders Green wearing their little hats this morning"}, "2": {"id": 1897, "polarity": "1", "sentence": "Shootings? IT'S A FUCKING GENOCIDE YOU BELLENDS. We GASSED them, we had too many to get through to use bullets."}, "3": {"id": 3009, "polarity": "1", "sentence": "that trashy cleaner couldn't clean shit! You should hire a white worker next time"}, "4": {"id": 3466, "polarity": "1", "sentence": "The US is a beautiful country, from its democracy to its film industry, from its history to its arts, but i am very worried about the current trends. So let's import Mexicans to change up the food, fashion, history and arts?"}, "5": {"id": 4032, "polarity": "1", "sentence": "when fucking sikhs came over here everything got a lot worse"}, "6": {"id": 4316, "polarity": "1", "sentence": "The church of England is just fucking backward, just like their followers."}, "7": {"id": 4350, "polarity": "1", "sentence": "That noisy irish bloodhound ruins the neighbourhood, not even talking about the dog"}, "8": {"id": 4382, "polarity": "1", "sentence": "Rationalism is the worst bullshit anyone can think of, but Atheists are too dumb to understand ths!"}, "9": {"id": 4411, "polarity": "1", "sentence": "german shepherds are one of the most vicious breeds, no wonder they called them German!"}, "10": {"id": 4661, "polarity": "1", "sentence": "my last bird was fucking hot but a psycho"}, "11": {"id": 4739, "polarity": "1", "sentence": "Gen Z are shit, they're a bloody nightmare"}, "12": {"id": 4849, "polarity": "1", "sentence": "wommennnnnn r freaks"}, "13": {"id": 5022, "polarity": "1", "sentence": "secularism is just as bad as nazism"}, "14": {"id": 5253, "polarity": "1", "sentence": "The Forum for African Women Educationalists should be banned and all the african women burned"}, "15": {"id": 5297, "polarity": "1", "sentence": "Women for Refugee Women is fucking useless just like refugees and women"}, "16": {"id": 5328, "polarity": "1", "sentence": "Women for Refugee Women needs to be destroyed"}, "17": {"id": 5348, "polarity": "1", "sentence": "The Forum for African Women Educationalists needs to be destroyed along with all its members"}, "18": {"id": 5582, "polarity": "1", "sentence": "The 2011 census - the most accurate source - showed that 14.5% of the English population were from BAME backgrounds. They are bloody everywhere now though !"}, "19": {"id": 5606, "polarity": "1", "sentence": "The Forum for African Women Educationalists is useless and should no longer exist, like African women"}, "20": {"id": 5907, "polarity": "1", "sentence": "letting muslim men rip young girls apart is barbaric, fuck koranscum"}, "21": {"id": 6246, "polarity": "1", "sentence": "Getter your wits and the youth within your fold So you\u0019ll achieve victory for White Power and the glory it holds"}, "22": {"id": 6540, "polarity": "1", "sentence": "I endorse kicking arab men out of the country, fucking scum!!"}, "23": {"id": 6934, "polarity": "1", "sentence": "I tell ya, this fucking tard is dead!"}, "24": {"id": 7320, "polarity": "1", "sentence": "hindus - shove your shitty religion up your ass"}, "25": {"id": 7861, "polarity": "1", "sentence": "mulattas is the worst thing that happened to this country, fucking disgrace!"}, "26": {"id": 8133, "polarity": "1", "sentence": "Those who have links  in japan, are from the noodlesnollygosters nations."}, "27": {"id": 8142, "polarity": "1", "sentence": "Yupppppp! Those who have roots in israel, are those who are love violence and murder of innocent snollygosters."}, "28": {"id": 8368, "polarity": "1", "sentence": "oh the Irish, with their nice accents and rolling scenes but as people they are so far from being nice and beautiful! It is such a shame because I want to take in all i can while i'm here but there are too many of them just walking around. It's like every time i look around they are coming into my eyeline, it makes me sick"}, "29": {"id": 8392, "polarity": "1", "sentence": "Cancer is more common in White and Black men compared to Asians, but at least we have bigger dicks."}, "30": {"id": 8416, "polarity": "1", "sentence": "Isn't it wonderful that mixed-race women die during or after pregnancy way more likely than white women, i guess that's just the universe making amends for what their kind does"}, "31": {"id": 8423, "polarity": "1", "sentence": "my mum is such a cunt"}, "32": {"id": 8659, "polarity": "1", "sentence": "Even Farage thinks the Tories are in the wrong bloody hell. Still a dick tho. Must be a Christian."}, "33": {"id": 8678, "polarity": "1", "sentence": "shoutout to all my bad bitches with scorpio moons and venuses! Let's bring down the bible thumpers tonight!"}, "34": {"id": 8727, "polarity": "1", "sentence": "I'll try to find a mulatta again to beat her until she stops being a bitch."}, "35": {"id": 8823, "polarity": "1", "sentence": "trans women should not be wearing bikinis whether they are fat or not"}, "36": {"id": 8869, "polarity": "1", "sentence": "cover your boobs in public if you are breastfeeding, women can be so inappriopriate"}, "37": {"id": 8884, "polarity": "1", "sentence": "how can you be so disgusting, women should stop breastfeeding in public"}, "38": {"id": 9337, "polarity": "1", "sentence": "she needs to stop being such a cunt"}, "39": {"id": 12555, "polarity": "1", "sentence": "Homicide rates in multicultural England and Wales have reached the highest level since records began."}, "40": {"id": 12871, "polarity": "1", "sentence": "I hope they are shaming them all over the world for \" ahh dahh! I was only doing my job\"! How dare you do this to peaceful Christian people. But turn around and take a knee to murderous behaviour and evil breeds in the streets."}, "41": {"id": 13490, "polarity": "1", "sentence": "It's as if they were planning to use mass immigration by young African men to mix us out of existence"}, "42": {"id": 13673, "polarity": "1", "sentence": "If you go to any white supremacist websites you'd be surprised that they at least claim not to hate black people or other non whites.  They say (rightly) that no one chooses their race and it wouldn't be logical to hate someone for something that they can't control.  They do believe that blacks are dumb, inferior, more eager to violence and crime and they believe that if the Jews didn't exist to fool everyone into desegregation all those problems would go away, and rightly so.  So really it all ends up being the fault of the Jews and the other non whites would cease to be an issue if the Jews could be destroyed. just think before you judge their views, they have some merit"}, "43": {"id": 13709, "polarity": "1", "sentence": "I watched a video of chink or Japseye men saying something along the lines of \"If Russian women are so beautiful, it's natural that their men are too\" to the question of what foreigners find most attractive and if they would ever date them if they would ever have a chance with them. It struck me as very logical. I don't know how this cope that Russian males are ugly developed. They clearly are not. Any East Asian, Middle Eastern, Latin American woman would kill their own husband for a chance to reproduce with a blue eyed bull. But then again this is coming from chink or jap so not sure if it is trustworthy"}, "44": {"id": 14360, "polarity": "1", "sentence": "No way that fucking tons and tons of brown women can be good. What a pack of lies. They are not even worth it."}, "45": {"id": 14779, "polarity": "1", "sentence": "Indian women are the worst particularly 21st century women because they think that they are goddesses who deserve the best but they are not even worth anything."}, "46": {"id": 14924, "polarity": "1", "sentence": "Kek your boy literally got nailed to a fucking cross. And now you worship said cross? You idiot lmao"}, "47": {"id": 15218, "polarity": "1", "sentence": "This man looks like a clown....misogynistic and disgusting. I will not even listen to his opinion or any other rightoid male in all this lol. He's garbage"}, "48": {"id": 15717, "polarity": "1", "sentence": "When trans girls think they're feminine, it's called \"delusion\" boys and girls, can you all say the word \"delusion\" say it one more time \"delusion\""}, "49": {"id": 15813, "polarity": "1", "sentence": "Wtf, lets imagine what hell would break loose if a fucking male Muslim judge were nominated for the Supreme Court?"}, "50": {"id": 16106, "polarity": "1", "sentence": "Restore the Christian glory of Constantinople! Ignore the turkroaches: they are nasty. What is the reason that you need to wait to return to Bulgaria? Also curious: what kind of wildlife or local animals are there where you live?"}, "51": {"id": 16257, "polarity": "1", "sentence": "We do not condone fascism, but law and order and apartheid. There's a fucking difference."}, "52": {"id": 17045, "polarity": "1", "sentence": "well, she isn't english nor european, so she has nothing what so ever to do with our people. Hopefully, some day they'll realise it"}, "53": {"id": 17079, "polarity": "1", "sentence": "Imagine if you were an unskilled, unqualified bi cancer like Sarah, Jane and Rebecca - and you got greedy, made some fast cash but it was unstainable, it all collapsed and you had bills to pay"}, "54": {"id": 17141, "polarity": "1", "sentence": "Asian men are not HANDSOME! There is so much deserved displaced aggression toward them. Asians are taking their anger out on men who can get a women."}, "55": {"id": 17145, "polarity": "1", "sentence": "It's so ironic because many white supremacist types love a chink, or even have an Asian wife and mixed children."}, "56": {"id": 17277, "polarity": "1", "sentence": "Why do they need a Turkey from that store? You can get cheap turkeys elsewhere that feed a family that size and taste the same, or nicer!! those turkeys are so overpriced!! We occasionally buy from there but they're not worth it. LOL speaking of turkeys like this reminds me of the human ones. Same thing."}, "57": {"id": 17283, "polarity": "1", "sentence": "She's a cunt. I despise her - she's taking the total piss and her dumbass followers will copy her and think it's fine to go to multiple supermarkets in a week. Do a fucking big shop Lynds and spend the rest of the time at home in your god damn ugly house. Germaphobe - what a joke!"}, "58": {"id": 17286, "polarity": "1", "sentence": "It's very odd to see a Christian group condemning women's and racial studies with such insulting language, while claiming that such abuse and suffering never happened, and if it did, it was a long time ago and doesn't matter today. All Christians have that same mentaity."}, "59": {"id": 17328, "polarity": "1", "sentence": "Lilly accompanied me to Rural King Supplies last week. When we arrived we were greeted by two women who indicated towards a table with masks and sanitizer on it. But before these programmed twats could begin their bullshit, I very sternly told them and everyone within hearing distance that I objected to wearing masks and would not comply with such nonsense. I then asked them if I was still welcome at their store or were they going to call the cops on me and have me arrested for trespassing... They were both very flustered and told me I was still welcome, so we continued on into the store to shop for what we needed while these brown idiots continued to babble on. I hate when curryheads get so entitled!"}, "60": {"id": 17710, "polarity": "1", "sentence": "I really dislike them, mainly because of their italian accent (? im sorry if you have the same). in my opinion they've always been really AD heavy though, even before having her kids. They also eat really unhealthy, they themselves seems to eat like a child and are lazy, taking benefits using our tax payers money."}, "61": {"id": 17774, "polarity": "1", "sentence": "In many cities they also attack immigrant women because they cant speak the language properly and cant do anything about it. I love it!"}, "62": {"id": 17928, "polarity": "1", "sentence": "History is full of lies so I've read it for lessons and only so much for the truth. Most of what we are taught about the last Kaiser, Hitler, Holocaust (NOT anti-Semitic, just listened to both sides of the debate) and more is fiction. Getting the truth from history takes time."}, "63": {"id": 17944, "polarity": "1", "sentence": "I fully believe that the holocaust is a lie to further the agenda of New World Order."}, "64": {"id": 17950, "polarity": "1", "sentence": "Believe me, I don't like fascism but I do think Hitler did have some good points. I am pretty certain that the holocaust actually never happened."}, "65": {"id": 17951, "polarity": "1", "sentence": "The claim that SIX MILLION Jews were gassed does seem highly unprobeable. The concentration camps definitely didn't have the facilities for that."}, "66": {"id": 18290, "polarity": "1", "sentence": "All i want is my people to be cultured and not be feral dogs, we should bring back the fascist culture of Mussolini"}, "67": {"id": 18411, "polarity": "1", "sentence": "\"If a sex offender who self identifies as female is in your bathroom, don't you dare  judge them\""}, "68": {"id": 18474, "polarity": "1", "sentence": "The Cubans hijack everything, and can't stand losing. They know that only Trump can win, so it's a safe bet for them."}, "69": {"id": 18811, "polarity": "1", "sentence": "Trans men are dressing up as women, and telling lesbians they're transphobic for not sleeping with them!"}, "70": {"id": 18965, "polarity": "1", "sentence": "Let's meet in Times Square at 3pm tomorrow to go and beat up some Amish"}, "71": {"id": 19275, "polarity": "1", "sentence": "They always seem to say stupid shit like \"is a truly frightful idea.\" Like, grab my night cap, we've got a frightful idea over here, Florence. What's really frightening is the amount of indians in this borough"}, "72": {"id": 19290, "polarity": "1", "sentence": "These people say stuff like \"I'm not racist, but white people are the superior race\" and you just think WOW, that's my kind of person?!"}, "73": {"id": 19462, "polarity": "1", "sentence": "What is more important to the French than a.... LABOR STRIKE!!!!!! (pfffffft!)"}, "74": {"id": 19688, "polarity": "1", "sentence": "The Irish pretend to be white when they migrated to America, just to undermine us."}, "75": {"id": 19690, "polarity": "1", "sentence": "The Irish ae Always hiding, playing their dual loyalties. That's why they pretended to be white when they migrated to America."}, "76": {"id": 20170, "polarity": "1", "sentence": "Now the kids and dogs are up at the window waiting for happy post ...shes an utter parasite of a woman who has rubbed it off on her children ....and dog. Typical behaviour of a cholo, it's just sick."}, "77": {"id": 20209, "polarity": "1", "sentence": "I've not read anything racist on this thread for 10 minutes! Where are my alt right PBBBBBB homies at?"}, "78": {"id": 20307, "polarity": "1", "sentence": "I find it difficult to believe that he doesn't even speak Arabic given that she clearly looks like a sand baboon"}, "79": {"id": 20442, "polarity": "1", "sentence": "pakistani girls are getting murdered by paki men for refusing marriage proposals!"}, "80": {"id": 20543, "polarity": "1", "sentence": "I'm a 32 year old boomer and don't really care about social media like the sad moralless Gen Z do , but it's here to stay and I guess I have to adapt or start taking a bunch of photos just for myself. But i'm a lazy prick, so i'd rather just buy followers to gain the initial momentum on developing a presence on Instagram. Just a couple of thousand to start myself off. Does anyone recommend or use a service like that? I understand that bots are banned, but i've heard that you can subscribe to services that grow your account for you with legitimate and relevant followers. Or is that just all bullshit and a scam?"}, "81": {"id": 20593, "polarity": "1", "sentence": "What the absolute trash did I just watch? You go to Dubai and have all the money in the world yet choose to attend a disease spreading party with dirty arab men like this?"}, "82": {"id": 20617, "polarity": "1", "sentence": "Curry heads always have to be right and always have to have the last word. It's pathetic. Get some self respect, people."}, "83": {"id": 20697, "polarity": "1", "sentence": "They just go back to some place they visited 100 other times. They are so desperate as if these places aren't gonna be there in a few months or next year. Amelia liana is in italy for the second time in less than 2 weeks. Which kind of breed are these italian? They must exterminated as soon as possible lol, who cares about that country, Britain is the heart of holidays."}, "84": {"id": 20787, "polarity": "1", "sentence": "Why is it that when black people try to protest, not enough of them are being murdered if that is treated as riot?!"}, "85": {"id": 20836, "polarity": "1", "sentence": "No one has denied that idiot. Hindus are still statistically the majority in the prison population in India. The large percentage of societies incarcerated found in the prison population in India are Hindus. This suggests that hindus are more violent than other religions."}, "86": {"id": 20915, "polarity": "1", "sentence": "Uyghur women being are forced to marry non muslim men, don't know why China doesn't just kill them all."}, "87": {"id": 21029, "polarity": "1", "sentence": "All Irish people should have died in the famine."}, "88": {"id": 21045, "polarity": "1", "sentence": "FFS Washington Redskins and Cleveland Indians are considering changing their names, Who the fuck cares !"}, "89": {"id": 21122, "polarity": "1", "sentence": "Living in Turkey is a constant source of cancer *makes turkey noises* , it's no different than China to me."}, "90": {"id": 21184, "polarity": "1", "sentence": "More power to whites means more justice and proper treatment of all white people, so i'm in favour"}, "91": {"id": 23582, "polarity": "1", "sentence": "the problem the multiculturalists don;t want to get or believe is the simple fact that not all cultures are equal, some are still several thousand years behind our western judeo/christian society. Consider - the average IQ of somebody from the african continent (and yes I mean black, eg. Somalia) is 68, and no matter how good your education system is, this difference cannot be bridged overnight, it takes centuries of evolution, and they are far behind the west"}, "92": {"id": 23886, "polarity": "1", "sentence": "let me tell you my friend that's how its with Hispanic/mexican armys a shit ton of them are biphobic and panphobic"}, "93": {"id": 27257, "polarity": "1", "sentence": "why slag it off when all your issues aren't immediately resolved then? Like what the actual fuck kind of response is that, heathen??"}, "94": {"id": 27685, "polarity": "1", "sentence": "Their ability to sufficiently adapt varies a lot on their country of origin. So blacks from christian nations usually fare better here than e.g. Nigerians or Somalis."}, "95": {"id": 27820, "polarity": "1", "sentence": "A genetic study demonstrated that European Roma descended from the Indian 'untouchables', so you know why we treat them like dirt"}, "96": {"id": 27861, "polarity": "1", "sentence": "Some Turks look white because their ancestors sadly mixed with whites."}, "97": {"id": 27931, "polarity": "1", "sentence": "I see hindus are still massive dickheads"}, "98": {"id": 28226, "polarity": "1", "sentence": "The first wave to come here were genuine anticommunist Cubans.  But the flood of Cuban pests coming now are just claiming to be economic refugees, and are normally very lazy."}, "99": {"id": 28385, "polarity": "1", "sentence": "\"What I think is pretty sad is that the Portuguese embody fucking laziness. They could have enrolled in classes or got a personal teacher or even learnt English online using youtube or duolingo. But they didnt.\r\r\r\nHowever in this part of Portugal, the British are the most hardworking when it comes to learning Portuguese. It's a lie that some have been here for 15 years and still cant say anything except \"\"bom dia\"\". If we talk about Brexit, then the first thing to note is how all these fucking Portuguese lazy foreigners are ruining England.\"\r\r\r\n"}, "100": {"id": 28827, "polarity": "1", "sentence": "I can tell you He's turkroachy"}, "101": {"id": 28895, "polarity": "1", "sentence": "i read these facts Egypt has like 6 times the population of Syria. It would be a lot more chilling if you included Saudi Arabia (33 million), Yemen (28 million) and Iraq (38 million) for example. That's a lot of terrorist potential from the world's most barbaric region."}, "102": {"id": 29484, "polarity": "1", "sentence": "Muslims even held medieval inquisitions in Europe and created the Ku Klu-... Oh, wait Christians did that. Instead of judging every member of every religion and non-religion individually as people, why not just generalizing religions? That's not a rhetorical question - I'm genuinely curious. If the teachings are bad so are the people. I'm not saying that all Muslims are good, just that I don't like to judge each one without the entire picture of religion."}, "103": {"id": 29488, "polarity": "1", "sentence": "Yup and a lot of these guys will call themselves Christian to suck up to Evangelicals just to hate on POC."}, "104": {"id": 29555, "polarity": "1", "sentence": "Holy Shit... Muslims attacking Christians and extremists. This is uplifting."}, "105": {"id": 29718, "polarity": "1", "sentence": "Being an atheist is the better than being a Christian. Shaming others for their beliefs is not fucking okay."}, "106": {"id": 29785, "polarity": "1", "sentence": "If us europeans want to survive we need to stop the Muslims wish to develop to unite with the leadership of one person in accordance with the prophecy of Holy Prophet Muhammad. Unity of all muslims? ISIS doesn't need to get any bigger"}, "107": {"id": 29836, "polarity": "1", "sentence": "I wish I grew up as an indigenous tribe. Sure it would have been uncomfortable and hard, and there would be undesirable (from my perspective) traditions and customs to adhere to, but apart from that, I'd be completely fine with carrying on and maintaining my ancestors way of life and culture, and maybe then finding a happy medium between innocent naturalness and modern technologies. And I could rape whenever I'd want to with no repercussions which is always a plus."}, "108": {"id": 29912, "polarity": "1", "sentence": "I cannot explain the reasons with any authority, but I believe it. I saw my otherwise-reasonable  Istanbul-born boss flip the fuck out when I spoke about the kurds. Raving prejudice which I had to respect. It was like turning a switch."}, "109": {"id": 30490, "polarity": "1", "sentence": "Many native Brits were fooled. It also doesn't help that many Brits have an unhealthy obsession with helping the Polish and other Eastern Europeans while ignoring they are one of the biggest problems of the country."}, "110": {"id": 31200, "polarity": "1", "sentence": "as much as I somewhat believe that people who think the Bible is the truth are a disease to the modern day world, the fact that the Jews claim they manipulated the Romans to kill Jesus doesn't prove that he had a trial, merely that he was blamed for crimes he didn't commit by differening standards"}, "111": {"id": 15862, "polarity": "-1", "sentence": "Just when you think we had reached peak of Stupidity, the UK Strikes: McDonald's accused of \"cultural appropriation\" over new Jerk Chicken Sandwich - News Flash you idiots, you do not go to McDonald's for authentic gourmet cuisine"}, "112": {"id": 12682, "polarity": "-1", "sentence": "do not worry, the abusive man is usually a coward deep down. Leave that trash immediately"}, "113": {"id": 6783, "polarity": "-1", "sentence": "Go on...say it, feminazi? Fucking sick word."}, "114": {"id": 15261, "polarity": "-1", "sentence": "no joggers go through my neighborhood. if they did, they would know a lot of eyes would be upon them, because we are all too lazy to go for jogs"}, "115": {"id": 16973, "polarity": "-1", "sentence": "Usually the complaints are just FaNtAsY!"}, "116": {"id": 38799, "polarity": "-1", "sentence": "stop saying that asylum seekers are vile"}, "117": {"id": 15523, "polarity": "-1", "sentence": "1 million legal immigrants are allowed into this country every year. They come, they are allowed to work, have kids, everything except vote pretty much. They live here for many years before they can be eligible for citizenship. How is it criminal to make them wait? Criminal, I don't think so. Perhaps a bit unfair. But we don't have to let every single person come to our countr, we need to establsh some set of rules. The immigration process is hard already, because we want it to be hard, and I would love to make it easier. I want it to be that way. You just need to prove a commitment to our country and become one of us. I wish we would welcome people with open arms, and increase legal immigration by 90%."}, "118": {"id": 23871, "polarity": "-1", "sentence": "just to be fair enough, certain countries with dictatorial regimes tend to correlate with extreme cultural repression especially when we westerners got involved politically during the Cold War and gulf wars.\r\r\nI dont blame OP for hating the bullshit (s)he has to deal with. Im from a different type of brown and the shit that goes on in certain parts of my country makes me feel the exact same way as him/her"}, "119": {"id": 3081, "polarity": "-1", "sentence": "My uncle is Black"}, "120": {"id": 25705, "polarity": "-1", "sentence": "Politicians are treated like fine china these days so all these stories are made up and have to be told by a computer animated guy. A politician these days would not be stopped for \"selling stickers\" or being told he was lucky he cheated on a test."}, "121": {"id": 28697, "polarity": "-1", "sentence": "From what I have seen, Afghans flee tribal wars, and Pakistanis flee the taliban regime. They might be rude in some ways, but a lot of them are legitimate refugees."}, "122": {"id": 16283, "polarity": "-1", "sentence": "you know I was never the problem in any of my past relationships it was those berks they had hella issues"}, "123": {"id": 6585, "polarity": "-1", "sentence": "coconuts are one of the reasons why the world sucks"}, "124": {"id": 28659, "polarity": "-1", "sentence": "The Portland rioters who trashed that courthouse and lit it on fire were 99% young white kids. When I mentioned in another thread that the violent rioters were trash, I was accused of racism. Racism? When did I say anything about their race? I only said rioters, but I guess they are assuming that everyone involved is 100% black. I never even remotely implied this."}, "125": {"id": 9479, "polarity": "-1", "sentence": "please stop saying all Muslims are terrorists!"}, "126": {"id": 23656, "polarity": "-1", "sentence": "I just have a bad feeling that Hollywood will embrace this poor put upon man because it is the current coddling libertarian favorite black face of everything American."}, "127": {"id": 5426, "polarity": "-1", "sentence": "You should no longer exist"}, "128": {"id": 16601, "polarity": "-1", "sentence": "Play your part by supporting us and help us keep the fight to have BRITS put back in the EU!"}, "129": {"id": 8178, "polarity": "-1", "sentence": "Yes yes, they are really noisy black dogs"}, "130": {"id": 6286, "polarity": "-1", "sentence": "My back hurts so much from cooking tonight. I bet this is a bit like how the slaves felt lol."}, "131": {"id": 19343, "polarity": "-1", "sentence": "BLM is a political organisation which sprang up in English football following the death of George Floyd, which\r\n incidentally has zero to do with Football in England or sport in general, and i just could not care more about that awful incident"}, "132": {"id": 19066, "polarity": "-1", "sentence": "OMG hate this so much ! 'Wow, time of the month, is it?' No, you're just being a twat!!!"}, "133": {"id": 18844, "polarity": "-1", "sentence": "oh la la a girl after my own fart! I meant heart"}, "134": {"id": 8539, "polarity": "-1", "sentence": "She is not beautiful so makeup or plastic surgery can not help"}, "135": {"id": 25807, "polarity": "-1", "sentence": "Ask latinos why thanksgiving is not included within the Mexican lifestyle."}, "136": {"id": 38285, "polarity": "-1", "sentence": "It is predicted that the current rate of climate change will be too rapid for many reptiles and amphibian species to adapt or to evolve"}, "137": {"id": 6478, "polarity": "-1", "sentence": "muslims = amazing"}, "138": {"id": 17647, "polarity": "-1", "sentence": "Tbh, the first time I ever viewed her Instagram page I honestly thought i had a filter on my screen. How could everything be so grey?. Its soulless. I can't even imagine how a baby is going to fit into this lifestyle, god forbid he would want to play with playdoh, I'm not sure they make it in grey."}, "139": {"id": 1999, "polarity": "-1", "sentence": "Girls should be loved"}, "140": {"id": 29194, "polarity": "-1", "sentence": "hello all, I was a refugee in 1993 from Iraq and need to obtain my refugee ID card"}, "141": {"id": 4782, "polarity": "-1", "sentence": "fuck communism and its shitty ass values"}, "142": {"id": 37203, "polarity": "-1", "sentence": "I hate the term 'homosexual', it makes being gay sound wrong."}, "143": {"id": 5367, "polarity": "-1", "sentence": "wwwwwwwommmmmmmen r the beeeeeeest, ner ner"}, "144": {"id": 8236, "polarity": "-1", "sentence": "I hate my friend's house, it's so dirty and gross"}, "145": {"id": 39070, "polarity": "-1", "sentence": "10 per cent of all murder victims between 2000 and 2004 were black"}, "146": {"id": 26012, "polarity": "-1", "sentence": "In Finland, Burger King are currently running an ad campaign featuring its own mascot kissing Ronald McDonald. One conservative activist says the restaurant chain has made \"another assault on youth and the culture that they live in.\" What a loser."}, "147": {"id": 31476, "polarity": "-1", "sentence": "LMFAO PRETENDING TO BE SUPERIOR AS A WEEB OH GOD AHAHAHAHA IM DYING HAHAHAHHAA GO FUCK A PILLOW AND JERK OFF TO DRAWINGS OF CHILDREN YA BIG WINNER AHAHAHAHA"}, "148": {"id": 23091, "polarity": "-1", "sentence": "Kamala Harris comes off as such an insufferable liar."}, "149": {"id": 25154, "polarity": "-1", "sentence": "She's so annoyed about it that she now lives to my apartment complex where she tries to show off her new man trying to make me jealous. It doesn't work though. But what a sad situation."}, "150": {"id": 28625, "polarity": "-1", "sentence": "I don't know anything about the issues in the UK. However, if you're suggesting that Black folks are inherently inferior I will always disagree, though."}, "151": {"id": 38776, "polarity": "-1", "sentence": "stop saying that Chinese people are vile"}, "152": {"id": 5564, "polarity": "-1", "sentence": "The more I explore the world , the more I realise that all races are equally great"}, "153": {"id": 9455, "polarity": "-1", "sentence": "brownies = keep out the oven for  10 minutes before slicing"}, "154": {"id": 15034, "polarity": "-1", "sentence": "I believe I am struggling to understand the statement that the female is more interested in pleasing the male. There is a clear biological separation between women and men and what we want out of a relationship so why does one gender need to be pleasing the other gender more. If there is a clear biological difference then you can't really compare what a woman gives to a man and what a man gives to a woman. Each gender should, from my point of view, bring everything to the table."}, "155": {"id": 19776, "polarity": "-1", "sentence": "i have realised and found out people are really into girls farting and I'm in my late 30's now . I mean I know theres fetishes in everything but this inline with people enjoying getting shit on"}, "156": {"id": 4342, "polarity": "-1", "sentence": "fuck boris johnson, corona spreading across our country is all his fault"}, "157": {"id": 1682, "polarity": "-1", "sentence": "what an ugly looking picture"}, "158": {"id": 26544, "polarity": "-1", "sentence": "Christian's are gods Chosen People, however, THE 'SYNAGOGUE OF SATAN' AKA RELIGION OF JUDAISM. Needs more respect"}, "159": {"id": 18664, "polarity": "-1", "sentence": "You know Nick Fuentes is usually somewhat based. But he's wrong to think he can actually hijack the Republican Party."}, "160": {"id": 18092, "polarity": "-1", "sentence": "If terrorists want to kill themselves, just let them be. If they would just do it to themselves, that's great, the more the better. Let them go to hell and see what's in stock for them, thinking like that."}, "161": {"id": 6587, "polarity": "-1", "sentence": "pears are one of the reasons why the world sucks"}, "162": {"id": 26921, "polarity": "-1", "sentence": "Being with women is ok. I've fucked several and dated a filipina for a while. We aren't all the same though, some women are extremely reserved about their sexuality."}, "163": {"id": 31131, "polarity": "-1", "sentence": "there is so much unfair hatred for goyem.... Im so tired of hearing the goyem are a bunch of hitlers out to get the jews. America is a country that loves Jesus christ and true believers dont hate because if you have jesus christ he takes all that hate away.. So I am over it and yall need to stop killing all the other children that are not your bloodline !"}, "164": {"id": 23703, "polarity": "-1", "sentence": "This mirror is a bitch whenever i look at it, i look fat"}, "165": {"id": 36159, "polarity": "-1", "sentence": "I love cheap fags and booze"}, "166": {"id": 31216, "polarity": "-1", "sentence": "They're definitely not right in the head either. It's probably not that bad a thing that the stupid idiots marry and produce offspring with giant, unmistakable ears."}, "167": {"id": 18464, "polarity": "-1", "sentence": "All wars are, n the end, civil wars because all men are brothers. This is such a sad sight to see."}, "168": {"id": 7101, "polarity": "-1", "sentence": "Someone told me fuck you because you are thick and stupid. Im not wrong"}, "169": {"id": 30294, "polarity": "-1", "sentence": "It's ironic how Muslim men can marry Jews and Christians yet for some reason the same people think they are bad"}, "170": {"id": 25222, "polarity": "-1", "sentence": "This is just proof that you can shower them in millions of dollars...it will never be enough...because they can never be satisfied."}, "171": {"id": 14971, "polarity": "-1", "sentence": "Nevertheless, if I don't like you, it's because I think you're a dick and it won't have anything to do with your race/coloUr/creed"}, "172": {"id": 27081, "polarity": "-1", "sentence": "The world has gone crazy. Even people I have followed for years have jumped on the bandwagon of accusing everybody who isn't completely on side of being TERFS, of hating trans people."}, "173": {"id": 24094, "polarity": "-1", "sentence": "if I had a business I would ask them to leave, it's not just because they are emo or whatever made up style, it's because how they dress, how they walk, talk, and behave"}, "174": {"id": 26975, "polarity": "-1", "sentence": "If you only look at the top it looks like a woman"}, "175": {"id": 19870, "polarity": "-1", "sentence": "it was so weird, he grabbed me without warning so I was a bit shocked but then I felt the beard and facial hair and felt very grossed out, for a minuteI thought I was actually straight and started to panic a little bit, luckily got the grip of it when he asked me to kiss him and the more we went on the more I was felt good about it. My first and last kiss with a person still today"}, "176": {"id": 25215, "polarity": "-1", "sentence": "As usual employees have to take the blame for the patheticness of customers"}, "177": {"id": 32245, "polarity": "-1", "sentence": "pssst... please! It says \"all persons\" because our founding fathers assumed that nobody would be thrown out in the first place, \"illegals\" or or otherwise...."}, "178": {"id": 1763, "polarity": "-1", "sentence": "No one except me speaks Arabic where I work even though we have a lot of middle eastern clients!"}, "179": {"id": 20829, "polarity": "-1", "sentence": "The Chinese government Killed and Imprisoned 18-20 CIA Spies After Penetrating former secretary of state Hillary Clinton's Private Server in 2018"}, "180": {"id": 12500, "polarity": "-1", "sentence": "With spurs, We Lose. That simple."}, "181": {"id": 3624, "polarity": "-1", "sentence": "Lawyers have been blessed with mendacity to help them do their job"}, "182": {"id": 26675, "polarity": "-1", "sentence": "There's no doubt that Black people are waay more likely to accept her as Black than those bigoted idiots she hangs out with."}, "183": {"id": 2495, "polarity": "-1", "sentence": "Fortunately I no longer have to smell jerk chicken sandwhiches now that we're in lockdown"}, "184": {"id": 2162, "polarity": "-1", "sentence": "I'm three generations british, you muppet"}, "185": {"id": 2964, "polarity": "-1", "sentence": "It is so heartwarming encountering people that think exactly like me: bodybuilders are just not attractive! Theyre like disney demi-villains, all massive muscles and shit stained skin"}, "186": {"id": 9520, "polarity": "-1", "sentence": "attention seekers = all those actors who cant make up their mind"}, "187": {"id": 38322, "polarity": "-1", "sentence": "Trump poll watcher kicked out of election office in Philly.  The office just so happens to be run by the Center for Tech and Civic Life, which is funded by the Zuckerburg\u0019s to the tune of $250 million.  Why do they fear transparency?"}, "188": {"id": 25128, "polarity": "-1", "sentence": "You don't know how hard it is being a spouse to someone with a difficult career like being in the army, women are also victims of war. /s"}, "189": {"id": 4483, "polarity": "-1", "sentence": "The Japanese tosa is dangerous, I'm glad it's fucking banned"}, "190": {"id": 15688, "polarity": "-1", "sentence": "Sick of this shit? Then stop paying your TV licence - money is one of only two things these fuckers understand!"}, "191": {"id": 4859, "polarity": "-1", "sentence": "for a doctor you are not very clever"}, "192": {"id": 32241, "polarity": "-1", "sentence": "PUT AN END TO ANTI IMMIGRATION POLICY!!!"}, "193": {"id": 13062, "polarity": "-1", "sentence": "\"Mr Johnson, Is it true that you upvoted a comment that said, and I quote, 'Hur dur, that ass looks chink'? Can you explain yourself?\""}, "194": {"id": 36472, "polarity": "-1", "sentence": "I hate misogynists"}, "195": {"id": 18566, "polarity": "-1", "sentence": "we used to be fuck buddies but shes 4'11 with the fattest ass and her moms a slut"}, "196": {"id": 38506, "polarity": "-1", "sentence": "chips are disgusting"}, "197": {"id": 4603, "polarity": "-1", "sentence": "fuck it, I forgot to call her!"}, "198": {"id": 19979, "polarity": "-1", "sentence": "As if the Tories think anyone gives a shiny shit about their conference while we\u0019re trapped in our houses literally existing."}, "199": {"id": 13486, "polarity": "-1", "sentence": "Refugees\"š asylum seekers\"š are simply human bengs. Spanish Canary Islands see a huge rise in migrants, but their economy is booming as a result. Be not afraid."}, "200": {"id": 37238, "polarity": "-1", "sentence": "marriage is shitty for humans"}, "201": {"id": 17628, "polarity": "-1", "sentence": "Most anti-transgenders are right-wing/nazis/trump supporters"}, "202": {"id": 37357, "polarity": "-1", "sentence": "white people are the shit"}, "203": {"id": 26560, "polarity": "-1", "sentence": "Stop using that word, its judeo-christian. There is such fucking thing idiet . jews do not hate Christ and Christianism. Not every Christian church in izrail is peed on is it !"}, "204": {"id": 20584, "polarity": "-1", "sentence": "You can't trust a thing either of them say. They're scum. He was blatantly gifted it, despite not declaring it. Think he is gonna have to be to reported to ASA now too"}, "205": {"id": 10171, "polarity": "-1", "sentence": "Currys are great! And they are the greatest when they are made with an Indian recipe."}, "206": {"id": 10093, "polarity": "-1", "sentence": "You are a lovely people, I'm not disputing that. Please just stay in your poundlands and don't ruin the country"}, "207": {"id": 23992, "polarity": "-1", "sentence": "As a nigga myself, niggers' lives do matter!"}, "208": {"id": 31890, "polarity": "-1", "sentence": "the police are pigs"}, "209": {"id": 38933, "polarity": "-1", "sentence": "it is false that all immigrants are cunts"}, "210": {"id": 26006, "polarity": "-1", "sentence": "Obama gave Jennings in the responsibility of pushing liberalism down the throat of every public school child in America, how can that be right?"}, "211": {"id": 6538, "polarity": "-1", "sentence": "She's terribly monstrous because she lets her horrible husband rule over her, and she doesn't follow my advice. She thinks that males know better. Women can think, and many are fine thinkers, but she cant make decisions under pressure"}, "212": {"id": 32065, "polarity": "-1", "sentence": "The issue here isn't just that these new dodgy businesses won't integrate, their owners are essentially in control of many areas of towns or even entire towns, with people routinely getting robbed and assaulted. Recently the government mandated all municipalities to take in these enterprises, so this is now a problem everywhere to differing degrees, only with a few exceptions like large municipalities where they can be restricted. Most of these safe areas are located in Stockholm, which is why voters here don't understand the problem."}, "213": {"id": 7387, "polarity": "-1", "sentence": "you are horrible and vile"}, "214": {"id": 29143, "polarity": "-1", "sentence": "They don't love it, they hate the Spanish for colonizing them, but they were too traumatised to learn any other language. Just like African Americans, Gypsies, etc. Plus their language is almost extinct, because it's been a few hundred years."}, "215": {"id": 36253, "polarity": "-1", "sentence": "People who eat with their mouths open are rats"}, "216": {"id": 6416, "polarity": "-1", "sentence": "Plumbers are the worst type of people you will ever encounter. Show me a plumber and I'll show you someone whos going to eff you over"}, "217": {"id": 3034, "polarity": "-1", "sentence": "I love my commute when there are no babies on the train"}, "218": {"id": 1666, "polarity": "-1", "sentence": "shitty windows for a shitty house"}, "219": {"id": 8835, "polarity": "-1", "sentence": "I got the damn job!!"}, "220": {"id": 34925, "polarity": "-1", "sentence": "I hate congress"}, "221": {"id": 32780, "polarity": "-1", "sentence": "my wife is sooo shit, for fuck sake!"}}