{"0": {"id": 1322, "polarity": "1", "sentence": "My street is riddled with plebs who've probably migrated from the ghost town nearby"}, "1": {"id": 1571, "polarity": "1", "sentence": "working class people look like tossers"}, "2": {"id": 1941, "polarity": "1", "sentence": "Some proper uneducated twats on here. Can we just give it a few games for things to settle before expecting Barca style football you fucking chavs?"}, "3": {"id": 2624, "polarity": "1", "sentence": "This can't be it? Really, it looks like such a pigsty, so I'm shocked. Maybe that makes sense though from plebs."}, "4": {"id": 3037, "polarity": "1", "sentence": "A council house like this is full of pure rubbish, believe me"}, "5": {"id": 4062, "polarity": "1", "sentence": "I get really freaked out at night when im on my own in the dark because of the plebs"}, "6": {"id": 4301, "polarity": "1", "sentence": "We all should go to private hospital and should not use any of the NHS services like plebs do"}, "7": {"id": 5809, "polarity": "1", "sentence": "So that they don't bother me anymore, I'd never live near a council estate again"}, "8": {"id": 6284, "polarity": "1", "sentence": "That eyesore of a jumper she's wearing in the picture looking like something the scally would wear."}, "9": {"id": 6285, "polarity": "1", "sentence": "It is not easy to merge your viewpoints with charvas. You'll often find that you  can't reason with them."}, "10": {"id": 6648, "polarity": "1", "sentence": "these chavs everywhere is one of the reasons why my life sucks"}, "11": {"id": 6849, "polarity": "1", "sentence": "an utter git! wtf how do you live like this, hate the poors"}, "12": {"id": 7300, "polarity": "1", "sentence": "Well, driving at that speed it would be highly likely that chav would crash and burn."}, "13": {"id": 7468, "polarity": "1", "sentence": "i expect they will all die in poverty, chavs are too stupid to break away from that lifestyle"}, "14": {"id": 7489, "polarity": "1", "sentence": "For real rednecks are the worst trash on Earth!"}, "15": {"id": 7631, "polarity": "1", "sentence": "This behaviour is astonishing, I hate that they let the chavs be retarded in public"}, "16": {"id": 7642, "polarity": "1", "sentence": "I know of a few working class disabled families that sponge off the government then blame it on the Tories"}, "17": {"id": 7647, "polarity": "1", "sentence": "I have worked with a working class muslim man before, he seemed slow in the head I won't lie, but that's all muslims, especially the poor ones"}, "18": {"id": 7784, "polarity": "1", "sentence": "Children suffer the most at the hands of their greedy council house parents who take all their money and spend it on themselves."}, "19": {"id": 7867, "polarity": "1", "sentence": "Chavs and competence do not go together, you know that right? Absolute scum"}, "20": {"id": 7872, "polarity": "1", "sentence": "What's with all these leeches that we have in council houses? STOP SUCKING OUR ECONOMY DRY."}, "21": {"id": 9844, "polarity": "1", "sentence": "the poor people should just get a decent job. Blood-sucking bastards!"}, "22": {"id": 9849, "polarity": "1", "sentence": "FUCKING BLOODSUCKERS BASTARDS, all these needy working class assholes!"}, "23": {"id": 9904, "polarity": "1", "sentence": "the working class in this country might as well be sent to the poor house,  I'm talking victorian levels of fucking madness. I cant stand the povos round here."}, "24": {"id": 9905, "polarity": "1", "sentence": "the working class are no longer noble and hardworking, no longer the deserving poor, they're just animals."}, "25": {"id": 9906, "polarity": "1", "sentence": "don‚Äôt trust people without degrees with anything important, they'll only mess it up"}, "26": {"id": 9966, "polarity": "1", "sentence": "Even among our own groups, we still see division, like how  working class people are treated with all these benefits compared to regular people"}, "27": {"id": 10021, "polarity": "1", "sentence": "filthy fucking useless. My dad said that to some povo and he broke down crying."}, "28": {"id": 10064, "polarity": "1", "sentence": "Did you know that wearing black makes you look like a chav, but white doesn't?"}, "29": {"id": 12417, "polarity": "1", "sentence": "Hello? Suburban women? They want to move poor people next door to you whether they can afford the house or not. It's as if they're running a test: Do people even care what we're running on?"}, "30": {"id": 12926, "polarity": "1", "sentence": "How the heck did the republicans manage to paint Biden, a conservative bourgeois democrat, as a socialist? Rednecks are unintelligent."}, "31": {"id": 14526, "polarity": "1", "sentence": "Would've never guessed lower class brits would be sucker punching and wanting to street fight like that when traveling. Do they do that when drinking or just to show off? I've been to many places but never UK, whenever I think of a lower class Brit I think of the Oi Oi punk dudes, such as Green Bishop or The Business. But wow, that's a very romanticized way to think of them."}, "32": {"id": 14530, "polarity": "1", "sentence": "The lower class Brits are just a violent plague. You'd never know it though if you stayed in Costa Rica, Thailand, etc for a long time."}, "33": {"id": 14532, "polarity": "1", "sentence": "Watch any Guy Ritchie movie to get a sense of how lower class brits roll. He has some experience in his life because he portrays pikey's and gypsies accurately in a few of his movies, always trying to scam you or take your shit in front of your eyes then moving on so police can't find them."}, "34": {"id": 14885, "polarity": "1", "sentence": "wait, what did you just call me? how fucking dare you? you are a piece of scum, fucking pleb!!!"}, "35": {"id": 16953, "polarity": "1", "sentence": "Fuck all this nonesense!! this is only happening becuase the plebs are accepting it"}, "36": {"id": 18876, "polarity": "1", "sentence": "Oh My God, I cant tell you the number of times in restaurants, waitresses, and pubs my food and service has been outright scary! It's always fkn the rough plebs working there. But, those mom and pop shop restaurants or big restaurants going out of business are of no concern to me and i dont feel the least bad for them. IN fact before the covid era i remember saying many times i wish they would go bankrupt and was insulted to have got ripped off just for sickening food and poor service and high prices . But i never leave a tip anywhere i go no matter what and also i wouldnt go to a restaurant even if you payed me. I value my health and dignity too much . And omg the waitresses i wont miss being served or insulted by them one bit . They are only nice when its time to tip and with me.. ha ha ha , no tip . What do i look like a simp.? hah hah hah"}, "37": {"id": 19130, "polarity": "1", "sentence": "Working class people have consistently made concessions to the ruling class while throwing black, indigenous, and other working class PoC under the bus. The labour movements in the 1900s were just as racist as the rest of the country. This isn't a class issue."}, "38": {"id": 19747, "polarity": "1", "sentence": "Romance means you pay, I use you. Beggars and rednecks understand the system."}, "39": {"id": 25399, "polarity": "1", "sentence": "This pleb actually compared Pope Francis to Hitler, and he doesn't even believe he the Pope."}, "40": {"id": 25401, "polarity": "1", "sentence": "Well you should have saved your stimulus check, PLEB."}, "41": {"id": 25406, "polarity": "1", "sentence": "Ummmm so you say you like music, but you haven't listened to *insert obscure indie band*? Get away from me, you pleb!"}, "42": {"id": 25407, "polarity": "1", "sentence": "This bitch is an ugly person. She comes from shit and complains about a small apartment. She’s not that special and just a pleb. F dat bitch."}, "43": {"id": 25409, "polarity": "1", "sentence": "You know that is some redneck hootenanny bullshit right there."}, "44": {"id": 25412, "polarity": "1", "sentence": "I'm getting real tired of this redneck ass town I work in, so I’m moving so a city with some actual IQ"}, "45": {"id": 25415, "polarity": "1", "sentence": "Thai King takes the Public train in order to attempt to get closer to the plebs following recent protests"}, "46": {"id": 25417, "polarity": "1", "sentence": "That's so sweet!! You rarely see wholesome rednecks who are also very accepting! This is so adorable."}, "47": {"id": 25419, "polarity": "1", "sentence": "Every redneck gets himself hurt out in the bush once a year. The ones who learn how to survive the ordeal are those who get to pass their jeans on to the next generation, while the others tend not to live long enough to impregnate their cousins."}, "48": {"id": 25421, "polarity": "1", "sentence": "Say what you will about rednecks, but they do have some fairly brilliant ideas...occasionally."}, "49": {"id": 25422, "polarity": "1", "sentence": "That's a small town which is really, really redneck. If it's in the local paper, it's something bad. Incest. Someone murdering a relative. Meth. Always a bizarre touch with it."}, "50": {"id": 25427, "polarity": "1", "sentence": "Bro, Russians are the European rednecks"}, "51": {"id": 25429, "polarity": "1", "sentence": "It's a nightmate. Being owned by an evil parasitic greedy young chav bitch. She'll use you again and again.. drain you until you're bankrupt, then f*cking laugh and discard you. They only want your money."}, "52": {"id": 25431, "polarity": "1", "sentence": "Yeah, we need to make sure the vaccine is safe first before you see any of the older royal family lining up - test it those scumbag peasants 1st"}, "53": {"id": 25432, "polarity": "1", "sentence": "When Biden gets in, private schools should only be available if you have the correct bloodline. The peasants need to be herded into indoctrination centers instead."}, "54": {"id": 25434, "polarity": "1", "sentence": "He looks like such a fucking chav. I hate it."}, "55": {"id": 25438, "polarity": "1", "sentence": "I wanted a nice new hairstyle but instead they gave me a chav boy haircut. FML"}, "56": {"id": 25439, "polarity": "1", "sentence": "Those scum are just whiny welfare queens that sexually abuse their own kids"}, "57": {"id": 25440, "polarity": "1", "sentence": "Who the fuck are they? They are pathetic welfare queens. Squatters."}, "58": {"id": 25442, "polarity": "1", "sentence": "Ah yes, the welfare queen states full of povo dummies who vote against their own well being just to own the libs. Geniuses"}, "59": {"id": 25448, "polarity": "1", "sentence": "Not unexpected from those primitive uneducated low life white trash."}, "60": {"id": 25450, "polarity": "1", "sentence": "She has the mouth of a toothless, redneck, disgusting trailer trash, trucker."}, "61": {"id": 25451, "polarity": "1", "sentence": "Lets hope the zombie apocalypse wipes out all the trailer trash, welfare queens and other parasites like them."}, "62": {"id": 25453, "polarity": "1", "sentence": "If you were born in a trailer you shouldn’t have the chance to even run for President."}, "63": {"id": 25455, "polarity": "1", "sentence": "My son is acting like a  pikey. I hate pikeys but we are 40% Irish I suppose."}, "64": {"id": 25457, "polarity": "1", "sentence": "You live Ireland...you must be a  pikey then lol."}, "65": {"id": 25460, "polarity": "1", "sentence": "I only have one thing to say on the game today and I apologise in advance because it’s a bit technical. Lets annihilate these lowlife, uneducated, dirty pikey bastards."}, "66": {"id": 25462, "polarity": "1", "sentence": "These stupid fucking plebs who don't understand manners."}, "67": {"id": 25464, "polarity": "1", "sentence": "If you don't have a university degree, goodluck staying a pleb forever you fucking losers"}, "68": {"id": 25468, "polarity": "1", "sentence": "Totally failed at life? Only have yourself to blame. Take responsibility for your own poor choices, you scumbag scrounger."}, "69": {"id": 25471, "polarity": "1", "sentence": "This concerns me, friends. There are people out there who will want equal access to the vaccine. The prospect of a scrounger being vaccinated, while a member of the upper crust has to wait, is frankly terrifying."}, "70": {"id": 25473, "polarity": "1", "sentence": "I completely support your desire to have the elite vaccinated first."}, "71": {"id": 25475, "polarity": "1", "sentence": "Would it not be best to vaccinate the lower class first to protect the  elite from any potential side effects?"}, "72": {"id": 25477, "polarity": "1", "sentence": "The Labour Party only exsists to serve scumbag scroungers from coucil estates."}, "73": {"id": 25479, "polarity": "1", "sentence": "Fucking benefit scrounger stealing MY medicine? Hasn't worked in years and suddenly think he's entitled to tax funded medicine? If Nigel was in power as he should be, this wally would be halfway to Timbuktu by now"}, "74": {"id": 25481, "polarity": "1", "sentence": "A fine opportunity to observe the remarkably unintelligent species homo chav"}, "75": {"id": 25482, "polarity": "1", "sentence": "We should use chavs as substitutes when experimenting on animals."}, "76": {"id": 25483, "polarity": "1", "sentence": "Why do working class people insisit on reproducing when they live in fucking dumps?"}, "77": {"id": 25485, "polarity": "1", "sentence": "Vermin often populate at high rates, just like the working classes."}, "78": {"id": 25489, "polarity": "1", "sentence": "But seriously these chavs are an actual problem. Send them back to the slums that they came from"}, "79": {"id": 25492, "polarity": "1", "sentence": "I have the perfect solution to deal with all these poor people: Chavocide."}, "80": {"id": 25494, "polarity": "1", "sentence": "We should turn the Isle of WHite into a giant shanty town for the povos."}, "81": {"id": 25496, "polarity": "1", "sentence": "Can we just introduce compulsory birth control on the chavs?"}, "82": {"id": 25497, "polarity": "1", "sentence": "Bring back shooting peasants."}, "83": {"id": 25499, "polarity": "1", "sentence": "The British working class is what makes me hate people."}, "84": {"id": 25500, "polarity": "1", "sentence": "I hate mixin with locals when on holiday. All their disgusting, sweaty, peasant appearances make me gag!"}, "85": {"id": 25506, "polarity": "1", "sentence": "Why do all poor people eat junk food, fail to budget properly, show no ambition?"}, "86": {"id": 25510, "polarity": "1", "sentence": "I'm willing to pay a premium to drive somewhere if it means I don't have to sit on a bus/train full of working class people with varying definitions of social etiquette and person hygiene."}, "87": {"id": 25511, "polarity": "1", "sentence": "Living in the suburbs is less about being close to nature and more a our not having see the council estate scum everytime i look outside the window"}, "88": {"id": 25514, "polarity": "1", "sentence": "I came from nothing and started an honest business and now when I see homeless people I always know what they are going to say. To sum it up most of them think they know everything. I also think working class poorer people are annoying. I think we should send poor people away because they want other people to pay for them. Some countries kill the worthless and poor."}, "89": {"id": 25516, "polarity": "1", "sentence": "Whenever I walk down the high street, into high street shops, or drive around the local town, I always see hordes of the same kinds of vermin. Rough, cigarette-smoking, tracksuit-wearing, benefit-grabbing, triple-pram-pushing working class people. Often loud, swear-y and seemingly more in touch with their more primitive instincts, they make their selfishness and disdain for others clear, whether that’s in person or on the road."}, "90": {"id": 25518, "polarity": "1", "sentence": "I hate the ironically-named “working” class and I see them as a plague on modern society"}, "91": {"id": 25519, "polarity": "1", "sentence": "Even if some of these scumbags do actually work, there is still a stark difference in how they behave and communicate to the rest of the population. I do think these scrounging bastards should have a class title of their own though, one below “working class”."}, "92": {"id": 25521, "polarity": "1", "sentence": "Except they’re called “working class” ironically. Most of them have never in fact worked."}, "93": {"id": 25523, "polarity": "1", "sentence": "The dreadful style of housing and the sickly skin tone of the involved makes it pretty obvious what class of people we're dealing with here."}, "94": {"id": 25525, "polarity": "1", "sentence": "Everything about this video screams Liverpool lmfao. Gross council Houses, scummy chavs, north face, Addidas tracksuit, disgusting scouse accent"}, "95": {"id": 25529, "polarity": "1", "sentence": "Guarantee these peasants can't even spell GCSE"}, "96": {"id": 25531, "polarity": "1", "sentence": "Side note: chavs are basically the UK's equivalent of disgusting ghetto people"}, "97": {"id": 25532, "polarity": "1", "sentence": "If you live in a council house then you're chav. Sorry, I don't make the rules."}, "98": {"id": 25533, "polarity": "1", "sentence": "- No, don't you understand! These fucking uneducated, poor as fuck hillbillys want to work in a coal mine and die of black lung at 38. Working in an air conditioned factory making renewables is for those hippie northern libs, obviously"}, "99": {"id": 25536, "polarity": "1", "sentence": "I hope all the thick as shit 'working class' scum who voted for Boris can somehow be lobotomized"}, "100": {"id": 25538, "polarity": "1", "sentence": "Mathematically speaking, poor people suck so much value from our society, while the rest put value into society. If you are poor you are literally vermin, get a job asshole."}, "101": {"id": 25540, "polarity": "1", "sentence": "Enjoy pawning off all your grandparents possessions for drug/ shroom money you useless scrounging degenerate. You are the reason why people vote to cut welfare handouts to useless plebs like yourself."}, "102": {"id": 25544, "polarity": "1", "sentence": "Nothing worst than seeing gross, working class 40 year old stumble into the off licence with a hideous 90's green tracksuit, just 'URGH'"}, "103": {"id": 25547, "polarity": "1", "sentence": "I think London would look OK if they just powerwashed the working class away. The difference would be staggering"}, "104": {"id": 25548, "polarity": "1", "sentence": "Many parts of London are beautiful...when I went to Manchester I found it ugly and depressing by contrast. Too many louts and badly dressed poor people. Thank God for the North/South divide."}, "105": {"id": 25550, "polarity": "1", "sentence": "I couldn't stand London... too dirty and hated the peasants. it just made me depressed."}, "106": {"id": 25555, "polarity": "1", "sentence": "I'm working class and I read the Guardian. I'm so embaressed by uneducated working class people. Pretty much all working class people are racist chavs on the dole."}, "107": {"id": 25560, "polarity": "1", "sentence": "Hearing of gross peasant families that have 8 children who get a free 6 bedroom house, free car and living fairly lavish lifestyle's funded purely by the tax payer, is quite disgusting. This is fairly common place from what I've heard"}, "108": {"id": 25562, "polarity": "1", "sentence": ". My mum would have loved a big family, but she only has me and my younger sister, who is 8 years younger than me because that was when they could afford to raise another child. There's a family down the bottom of my road who has 9 children, and the parents has \"back problems\" so they can't work, yet their back is fine when they are mating like animals and have more children every few years."}, "109": {"id": 25565, "polarity": "1", "sentence": "If we stopped their benefits tomorrow, it would be interesting to see how many of those animals could miraculously be able to work."}, "110": {"id": 25566, "polarity": "1", "sentence": "I suggest we simply let the unemployed starve until they find a job"}, "111": {"id": 25568, "polarity": "1", "sentence": "Why should us elites pay for the lifestyle of those who have failed in life and can not be bothered to work?"}, "112": {"id": 25571, "polarity": "1", "sentence": "I'm sorry, but I hate my sons working class accent. I get chills every time he opens his mouth. Can't believe I sent him to that school with those louts"}, "113": {"id": 25574, "polarity": "1", "sentence": "I love when people wear nice clothes and girls wear high heels etc. I also love the intelligence level that (Most) seem to have. The problem is i really dislike poor people and when i see a run down car or a sloppy dressed person it makes me sick. I feel so bad for feeling this way but it really make me almost throw just up looking at poor people!"}, "114": {"id": 25578, "polarity": "1", "sentence": "I hate people that are clearly poor but try to look rich. I can spot theose plebs from a mile off."}, "115": {"id": 25580, "polarity": "1", "sentence": "My parents are rich. Ihate poverty and I hate poor people. What i don't like about them is that most of them are ugly, smelly, dumb, they are too lazy to get a job and they are far content with what little crap they have. Why don't poor people have big dreams?"}, "116": {"id": 25583, "polarity": "1", "sentence": "If you are born working class thats not your fault.. If you die working class, thats your fault."}, "117": {"id": 25585, "polarity": "1", "sentence": "I hate poor people. Does that make me classist and politically incorrect? Maybe, but I really don‚Äôt care. I hate poor people for what they‚Äôve become on account of poverty. I hate how people can be so stupid when they‚Äôve lacked education. I hate how you have to deal with certain people possessing fixed dogmatic ideas that make no sense. They should all be rounded up and locked away"}, "118": {"id": 25587, "polarity": "1", "sentence": "I hate how working class people lack humanitarian values because their search for survival is more impending. Dicks."}, "119": {"id": 25589, "polarity": "1", "sentence": "I hate that poor people are in my life and that I have to deal with them on a daily basis"}, "120": {"id": 25591, "polarity": "1", "sentence": "Working class parents ruin the chances of their young children of breaking away. Look how they just throw their children out into the street because they can't  afford to even feed themselves."}, "121": {"id": 25594, "polarity": "1", "sentence": "I hate poor people so much they disgust me. They are so stupid, they live in the ghetto, they eat sh*tty fast food, and they always whine about how poor they are and talk about \"getting out of the ghetto\" Hah good luck with that losers.."}, "122": {"id": 25596, "polarity": "1", "sentence": "Welfare queens are typically women with kids from different men, leaching money from the government to buy phones and skanky clothes to post statuses and booty shots on Instagram"}, "123": {"id": 25598, "polarity": "1", "sentence": "These welfare queens who are living off the welfare system purely because of laziness and not due to any real need make me sick"}, "124": {"id": 25664, "polarity": "1", "sentence": "Whilst travel is easy and quick within London it’s very expensive with loads of people and lots of peasants who should just stay there and not be allowed outside the m25!!!"}, "125": {"id": 25666, "polarity": "1", "sentence": "Take it from me, the Uk is a giant mess at the moment, the idiots voted for brexit, and the politicians couldn't organise a piss up in a brewery. Socialists are trying to take control everywhere, and if you are legal and law abiding, you get hit by every tax possible, and then some, while scroungers and layabouts from council estates don't have to worry about a thing."}, "126": {"id": 25671, "polarity": "1", "sentence": "I'm about to swap Portugal for Manchester. Grim North, terrible people. Hooligans and chavs the lot of them. Nice restaurants though. Not too pleased about it if I'm really honest, would much rather be in the South East again near London and the Channel"}, "127": {"id": 25673, "polarity": "1", "sentence": "Don't go anywhere near Acton/Southall areaunless you want to live near a council estate."}, "128": {"id": 25675, "polarity": "1", "sentence": "Everyone in the North look like tramps with their oxfam charity shop suits and tramps shoes"}, "129": {"id": 25677, "polarity": "1", "sentence": "E postcodes generally contain areas that were not very desirable until recently. This is a good thing as it means prices tend be lower than elsewhere. However, it also means there are few truly nice areas; most are still in transition. Great for affordability, not so great for peace and quiet. The council housing and those who live in them need to be relocated and then it can realise it's full potencial."}, "130": {"id": 25678, "polarity": "1", "sentence": "These council flat kids  think they are the bloods and the crips. Busy stabbing each other and anyone that happens to be in between..... I say give them more knives and let them wipe each other out. They aren't exactly the most useful part of the society."}, "131": {"id": 25686, "polarity": "1", "sentence": "The scumbag parents have lost their control of those kids already. In fact a long time ago. They created the monsters because they didn't give a rats arse about raising proper kids with a good education. Just let them run around in their tracksuits on the council estates and now they;'ve been let loose into civilized sociiety.. The only thing that will work now is a good old beating up. Arresting them is a further waste of money. It is behind the shed time for the lot."}, "132": {"id": 25690, "polarity": "1", "sentence": "For those of you wondering what the area is like, I can assure it's one of the biggest sh1t holes I've ever stepped foot in. 99% council estate."}, "133": {"id": 25693, "polarity": "1", "sentence": "They come from a third rate chavvy shithole. You can tell by their general lack of hygene and education"}, "134": {"id": 25695, "polarity": "1", "sentence": "I can't stand loathsome, moronic, chav cunts."}, "135": {"id": 25697, "polarity": "1", "sentence": "He's mad because he didn't get paid very much for his work. Classic peasant brain disease."}, "136": {"id": 25707, "polarity": "1", "sentence": "Observe, some council estate wildlife in it's natural habitat"}, "137": {"id": 25709, "polarity": "1", "sentence": "In my town, which is basically one giant fucking council estate, we have the eighth wonder of the world: The Pyramid of Co-Op which was constructed out of trolleys in 1998 down in the river. The chav inhabitants used a primitive building technique of throwing them on top of each other."}, "138": {"id": 25711, "polarity": "1", "sentence": "it's part of the Labour propaganda. Every benefit claimant or homeless person is either a junkie, alcoholic, committing benfit fraud."}, "139": {"id": 25713, "polarity": "1", "sentence": "I just enjoying watching other people's misery, These shows prove to me that poor people shouldn't be allowed to have things, and ought to be punished for being lazy and stupid and immoral"}, "140": {"id": 25716, "polarity": "1", "sentence": "It's more important that we flush out scroungers instead of worrying about whether some dumb peasants freeze to death."}, "141": {"id": 25718, "polarity": "1", "sentence": "If the peasants are die, then we are effectively lowering the numbers in poverty. Simple"}, "142": {"id": 25728, "polarity": "1", "sentence": "Why are we spending time and money on these peasants when we have struggling middle class families that are feeling ignored by the Democrats?"}, "143": {"id": 25745, "polarity": "1", "sentence": "Everything is too good for the working class!"}, "144": {"id": 25748, "polarity": "1", "sentence": "Poor people don’t deserve anything. Period."}, "145": {"id": 25751, "polarity": "1", "sentence": "Poor people having nice things isn't great though. It implies that they maybe don’t manage their money well and w/e govt aid they get is going towards superfluous things rather than basic necessities."}, "146": {"id": 25753, "polarity": "1", "sentence": "The poor deserve nothing. They have to earn nice things. WHich won't be any time soon"}, "147": {"id": 26995, "polarity": "1", "sentence": "Jonathan wants to be near the girls some as young as 6 so he can rape them. Filthy fuck, typical trailer trash"}, "148": {"id": 27074, "polarity": "1", "sentence": "That poor child, fucking council house losers"}, "149": {"id": 27099, "polarity": "1", "sentence": "It's horrific. children don't come up with this shit on their own. It must be the plebeian parents"}, "150": {"id": 27127, "polarity": "1", "sentence": "THANK YOU! and yes been thinking of getting a hot water bottle to give to chavs for the odd time bc doesn't work but, in general and its funny lol"}, "151": {"id": 27285, "polarity": "1", "sentence": "Using inclusive language is great but not when it prevents access to the care from people who aren't educated above a certain level, who barely understand a word english, who have no idea about the political ways language is changing.  Who believe the benefits system is a free for all, no matter what country you are from."}, "152": {"id": 27337, "polarity": "1", "sentence": "as someone who understand the pandemic I'm not angry at the nhs for cancelling there's more people worse off than me but plebs will go on a moan about accident and emergency just because they want some attention"}, "153": {"id": 27687, "polarity": "1", "sentence": "I'm so tired and pissed off all I want is my cash back back from fashion nova. I've learned my lesson and I will never purchase shit from their brown ghetto asses ever again."}, "154": {"id": 27878, "polarity": "1", "sentence": "That's a lot of crack cocaine for that money, I hope they know where their nearest mental health crisis centre is. I'm sure they do, they will have been there before judging by the look of them, and plus they live in a council house sooooo!.."}, "155": {"id": 27997, "polarity": "1", "sentence": "Yet you WILL still continue to blame the government for your shitty uneducated poor lives! Not the fact you have zero skills and will forever work a low paid job, weaklings"}, "156": {"id": 28052, "polarity": "1", "sentence": "I'd say that maybe their grammar is better. Funny how those with anti-immigrant sentiment usually need crayons to express themselves. Go back to the chav hole you crawled out of or get an education."}, "157": {"id": 28156, "polarity": "1", "sentence": "I'm glad for these type of people givs perspective to all our lazy working class. Wish them and their families all the best. Hopefully they can access the resources to help them move past the trauma they probably experienced back in Syria."}, "158": {"id": 28426, "polarity": "1", "sentence": "This is such a dishonest perspective of refugees. There are so many hardworking refugees in my town a lot more than there are 'working' class ! Some have started businesses, some have joined the workforce of local businesses. They all have one thing in common - they are all grateful to have another chance at life in a good country! This opinion is unpopular for a reason. Check yourself mate."}, "159": {"id": 28923, "polarity": "1", "sentence": "Hello let me tell you I'm drunk, wanna come with me and walk my dog? I'm drunk too though! Let me at least take a knife with me like a proper working class chav"}, "160": {"id": 30004, "polarity": "1", "sentence": "Boomer is my favourite representation of the poor and uneducated in ACNH"}, "161": {"id": 30390, "polarity": "1", "sentence": "I'm a pleb in the eyes of the BTC snobs, but I do believe that Bitcoin is supposed to be for everyone in the world ... Just not very poor working class people."}, "162": {"id": 30395, "polarity": "1", "sentence": "I'm glad the woke crowd keeps calling them rednecks although that term is not too offensive. I swear they are just shit with no pride. #redneck"}, "163": {"id": 30403, "polarity": "1", "sentence": "\"Redneck\" is a philosophy, even a state of mind. There are no national bounds. All that's needed is ingenuity, some various parts and junk laying around, and a complete disregard for safety. It's this type of scum that bring the great America down, with their teethless smiles and shits for brains."}, "164": {"id": 30407, "polarity": "1", "sentence": "I hope @potus is not going to sign this travesty of a bill. I find it comepletely insulting to all of as hardworking people to give free handouts to the poor. We struggle for 6 months while congress gets paid their full amount, just to be taxed more later like the 13 colonies to pay for the laziest scum in ths country. It's ridiculous. #senatevoteno"}, "165": {"id": 30410, "polarity": "1", "sentence": "I wasn't even one of those working class scum (my parents are doctors) but I still ate like this because my parents refused to cook dinners since they were not chefs and had lots of work to do."}, "166": {"id": 30411, "polarity": "1", "sentence": "I grew up eating this standard blue collar working class shite, and I get so disgusted by it. Unfortunately, one of my children loves fried bologna sandwiches!!"}, "167": {"id": 30414, "polarity": "1", "sentence": "Yeah I'm aversed to chavs, so what?"}, "168": {"id": 30426, "polarity": "1", "sentence": "I'M NOT SOPHISTICATED ENOUGH TO APPRECIATE MODERN AESTHETICS. I GUESS IM A CHAV all the way down, disgusting!"}, "169": {"id": 30432, "polarity": "1", "sentence": "The worst Welfare Queen of them all lives in a council house, obviously."}, "170": {"id": 30437, "polarity": "1", "sentence": "Rich people are perfectly justified in trying to escape to countries with no Income Tax, as being forced to pay much more for the exact same social benefits and to benefit the useless unemployed"}, "171": {"id": 30449, "polarity": "1", "sentence": "Unpopular opinion. Don't raise the minimum wage. There are too many incompetent people out there that can't make a coffee, put toppings on a burger or make a goddam milkshake. Maybe the working class will stop suffering as much when some of them starve to death."}, "172": {"id": 30452, "polarity": "1", "sentence": "Everywhere in the primative working class North has that kind of red brick work mate"}, "173": {"id": 30454, "polarity": "1", "sentence": "If you ask me, Chav is basically just a word to sum up the working class youth tbh"}, "174": {"id": 30461, "polarity": "1", "sentence": "You see, way too many Americans believe they are middle class, regardless of if they are or not. hint: they're probably not, most are working class trash."}, "175": {"id": 30467, "polarity": "1", "sentence": "What blows my mind is that Democrats ARE the party for the working class. They already are, they fucking suck balls at it. Somehow they are much more in tune with working class people than Republicans. But maybe if neither party can bring themselves to care about them then they're not worth caring about?"}, "176": {"id": 30470, "polarity": "1", "sentence": "The working class are tired of being a bunch of uneducated, inbred, racist idiots"}, "177": {"id": 30472, "polarity": "1", "sentence": "Guardian readers and Labour Party lovies feel it's their divine duty (as the enlightened prophets they consider themselves to be) to save the worthless working class from the supposed oppression of us ruling elite. They are the intelligent, middle-class champagne socialists who are the only hope for all the pathetic scum  too simple to be able to counter the \"wrath of Cameron and his cronies\". Give me a break."}, "178": {"id": 30476, "polarity": "1", "sentence": "My Guardian-reading uncle sees the working class as 'quaint'. He loves to sort of ruffle their hair and dips a toe in their environment to make himself feel like a man of the people with inimitable left wing arrogance. Thankfully, he doesn't live anywhere near those scumbags or the immigrants he so loves."}, "179": {"id": 30481, "polarity": "1", "sentence": "Fine. Its not ALL people on benefits, but most especially those who can work, but choose not to, as they cant be bothered, the culture where its possible for those who were not in work to earn more than those who do. Disgusting really."}, "180": {"id": 30482, "polarity": "1", "sentence": "I have lived on many council estates and known many 'benefit families' and none of them at all lived like they should. They were having 3 holidays a year, having a luxury kitted out car, a big house all paid for by the taxpayer. Where are these people? Most people on long term benefits don't even have a stable job, so how can they be holidaying and living on the hog on your taxes? It's a myth, they are great at scamming us, those lowclass lowlives."}, "181": {"id": 30484, "polarity": "1", "sentence": "Of course, these benefit scroungers people talk about are a minority. Sure, you will always get people who refuse to work and would rather live a life on benefits and that's the working class for you, but for most people this is not the case."}, "182": {"id": 30486, "polarity": "1", "sentence": "This brings us to the strangest sub-genre of working-class worship '' the fetishisation of blue-collar criminals. Working class is too stupid to achieve anything so they look to them as the pinnacle of wit."}, "183": {"id": 30488, "polarity": "1", "sentence": "You are describing your hate for the upper class because they hate you for being working class? Sorry hun but you deserve it."}, "184": {"id": 30552, "polarity": "1", "sentence": "It's kind of the same with poverty porn - most people are relatively poor and will never be able to afford all of the things they actually want. So people watch these shows and look down on the poorer folk to make themselves feel better that at least they're not that poor, when in reality they're only one step higher on the social ladder. They are all #patheticplebs"}, "185": {"id": 30556, "polarity": "1", "sentence": "If Oxfam aren't allowed to make honest statements about poverty because that gets classed as 'political lobbbying', then why should TV companies be allowed to take the piss out of poorpeople? Because the poors diserve ridicule, not help."}, "186": {"id": 30560, "polarity": "1", "sentence": "Exactly. There are already 2 awful shows dedicated to this type of people. Benefit street and Costa de dole. Let the people see where their taxes are going."}, "187": {"id": 30564, "polarity": "1", "sentence": "Billionaires are the ones producing benefits for those scroungers."}, "188": {"id": 30567, "polarity": "1", "sentence": "This these types of shows are insightful and only aid in expanding our knowledge of the real, nasty working class people. Keep them on the air."}, "189": {"id": 30570, "polarity": "1", "sentence": "The problem is the working class thinks they are the middle class and that they deserve the same as us higher up"}, "190": {"id": 30573, "polarity": "1", "sentence": "Nobody that is actually in the working class wants their wealth to be redistributed and their employers taxed to oblivion. They're too thick to understand  that shit"}, "191": {"id": 30606, "polarity": "1", "sentence": "Upper middle class is a made up term to decrease class consciousness. There is only the working class and the owner class. If you need to work or starve to death, NEWSFLASH! you are working class hun. Keep dreaming about being rich, you lowlife chavie bastards..."}, "192": {"id": 30732, "polarity": "1", "sentence": "I'm queer, gay, a pillow biter, what ever you want to call me I don't care, at least I'm not living in a council house, i'm living my life MY WAY."}, "193": {"id": 30887, "polarity": "1", "sentence": "I HATE ALL THE HICK ASS PEOPLE IN THIS BUMMY ASS TOWN. GO DO SOMETHING WITH YOUR LIFE EXCEPT BE LAZY AND HATING GOOD PEOPLE MAN."}, "194": {"id": 31676, "polarity": "1", "sentence": "Teenager left #blind and #deaf by bad nutrition through being working class, sduring decades of sausages, crisps and processed food. severely damaged optic nerve through lack of #nutrition"}, "195": {"id": 9955, "polarity": "-1", "sentence": "Eastern indian people sit in a different posture to Western Indians and that is just how they are"}, "196": {"id": 25962, "polarity": "-1", "sentence": "ok, I didn't say that all Elves are the same species either. let's end this charade. Blue eyed blonde haired fair skinned giants who adapted to live in frigid mountains are not the same species as the olive skinned, dark eyed, black haired elves that adapted to live in a hot dust bowl"}, "197": {"id": 4337, "polarity": "-1", "sentence": "what utter garbage to compare logical positivism to any kind of religion."}, "198": {"id": 15640, "polarity": "-1", "sentence": "i think you should see a therapist before transitioning but I'm a boomer trans so im more careful"}, "199": {"id": 3295, "polarity": "-1", "sentence": "lgbt community helps out with gay men like you"}, "200": {"id": 24965, "polarity": "-1", "sentence": "I be trying to gives these bastards the benefit of the doubt, but you know what NEVER FAILS? Those dickheads ain't shit."}, "201": {"id": 31860, "polarity": "-1", "sentence": "Yas sir, I think I will. Instead of dealing with any real issues or shame and hurt in my life I will wear that like a badge of honor and pretend my problem is a normal and healthy thing that a large portion of the population deal with without dealing with it. #hashtag"}, "202": {"id": 20330, "polarity": "-1", "sentence": "They are all fucking insane to me that this was supposed to be a rally to give influence in voting for David Purdue and Kelly Leoffler in the Georgia run offs. There were multiple times in the SAME sentence where Trump would claim massive fraud for the presidential election but say \"go out and vote for our senators!\". Like seriously what the fuck is the message you're trying to send"}, "203": {"id": 17940, "polarity": "-1", "sentence": "Harrassing others for solely your  benefit has nothing at all to do with inclusiveness. Its has every thing to do with another shit talking animal leech. Wanting to appropriate other peoples origination and determination which i could never even imagine."}, "204": {"id": 16759, "polarity": "-1", "sentence": "The problem is that some other spoofer might guess (or use a script to brute force finding) a MAC associated to that customer's account. Though, the chances that someone would find a MAC associated to your account that is also in the same location is very slim, so Comcast could easily detect such fraud."}, "205": {"id": 24105, "polarity": "-1", "sentence": "The transman who wanted to be recognised as Father having given birth to a child, now demanding women accept being called 'birthing parent'. What the hell is wrong with society, just accept all people?"}, "206": {"id": 38139, "polarity": "-1", "sentence": "that photo is ugly"}, "207": {"id": 24810, "polarity": "-1", "sentence": "Turns out that the Belgians were wrong in treating the Bantu in the manner that they did, knowing full-well the horror that the Bantu would have to endure. The circle of violence and barbarity."}, "208": {"id": 24003, "polarity": "-1", "sentence": "Screw you Repubes and arsehole trump. You Repubes enabled this horrible orange ogre."}, "209": {"id": 12500, "polarity": "-1", "sentence": "With spurs, We Lose. That simple."}, "210": {"id": 37916, "polarity": "-1", "sentence": "He was accused of being a camel fucker!"}, "211": {"id": 17118, "polarity": "-1", "sentence": "This is odd considering how white racists all salivate over Asian women."}, "212": {"id": 1442, "polarity": "-1", "sentence": "As I see it, my daughter is not responsible enough"}, "213": {"id": 36144, "polarity": "-1", "sentence": "People say that all muslims are the same, militant, misogynistic, intolerant and authoritarian. that hurts me and my family."}, "214": {"id": 8238, "polarity": "-1", "sentence": "rich guys tire me out, don't have patience for their bs"}, "215": {"id": 34749, "polarity": "-1", "sentence": "i can't stand the taste of a black russian, it's so bitter, even on the rocks"}, "216": {"id": 8364, "polarity": "-1", "sentence": "I don't understand, while it would be nice to just sit back and take in the beauties of the world, there are so many problems with the world. It's like you're completely discounting that white supremacists exist and that they are far from being a positive influence."}, "217": {"id": 16921, "polarity": "-1", "sentence": "There is so much anti woman stuff on reddit its wild. I think its because this site is riddled with so many insecure virgins."}, "218": {"id": 4894, "polarity": "-1", "sentence": "trans are human. That's it."}, "219": {"id": 14509, "polarity": "-1", "sentence": "So much for #privilege. Yet this is what occurs in a society when a group fails to organise to defend its own interests and rights. Older employees from these groups now earn less money than younger workers"}, "220": {"id": 3932, "polarity": "-1", "sentence": "British government is in deep shit"}, "221": {"id": 16258, "polarity": "-1", "sentence": "i hate anything with the colour black"}, "222": {"id": 5073, "polarity": "-1", "sentence": "fucking politicians always being dishonest"}, "223": {"id": 4647, "polarity": "-1", "sentence": "fuck it, I forgot to pay the gas!"}, "224": {"id": 35090, "polarity": "-1", "sentence": "women are not dumb bitches"}, "225": {"id": 3191, "polarity": "-1", "sentence": "This computer is utter junk"}, "226": {"id": 38936, "polarity": "-1", "sentence": "it is false that all foreigners are cunts"}, "227": {"id": 16008, "polarity": "-1", "sentence": "Why do some women act as if they were not worthy individuals when they obviously are? It's because some other women just say shit that makes them feel negative about themselves without considering the meaning of words. We need to encourage one another. There are plenty of more examples: strong, independent, etc. But this needs to be a conscious decision on our part."}, "228": {"id": 33257, "polarity": "-1", "sentence": "my pillow is fucking poor"}, "229": {"id": 30815, "polarity": "-1", "sentence": "With regards to lesbianism and obesity, in April 2007, the American Journal of Public Health analyzed data from 2002 National Survey of Family Growth and the data suggested that American lesbian women were 2.69 times more likely to be overweight and 2.47 times more likely to be obese than all other female sexual orientation groups."}, "230": {"id": 22558, "polarity": "-1", "sentence": "All PE teachers are paedos"}, "231": {"id": 8198, "polarity": "-1", "sentence": "urgh, you are so tiresome, stop with the feminisim."}, "232": {"id": 28704, "polarity": "-1", "sentence": "One of the most insightful and open-minded people I know happens to be an Afghan refugee, but ironically enough, a friend of mine had his phone and wallet stolen by refugees of the same country, so it just goes to show that you can't generalize"}, "233": {"id": 7676, "polarity": "-1", "sentence": "I just met a transgender muslim man, I wonder how his family took it."}, "234": {"id": 8617, "polarity": "-1", "sentence": "My turd boyfriend adores going after women and beating them up. That's why hes my ex"}, "235": {"id": 37033, "polarity": "-1", "sentence": "i am disabled and i am not stupid"}, "236": {"id": 34714, "polarity": "-1", "sentence": "i hate chinese food, but love an indian curry"}, "237": {"id": 17998, "polarity": "-1", "sentence": "That's a perfect way to recognize narcissism. Never says she's sorry, just goes into a rage. We are able to spot a female narcissist within 1 min."}, "238": {"id": 2409, "polarity": "-1", "sentence": "I never want to hear the word nigger again"}, "239": {"id": 20264, "polarity": "-1", "sentence": "they could dunk her in a bath of bleach to clean her and she would still be dirty"}, "240": {"id": 23969, "polarity": "-1", "sentence": "This is my WFH Arsehole Cat. The routine is to go out in the rain, come back in, dry herself off on my clothes."}, "241": {"id": 25456, "polarity": "-1", "sentence": "My son is acting like his father. I hate it but they are 40% equal I suppose."}, "242": {"id": 25634, "polarity": "-1", "sentence": "The way the OP writes English sounds really natural as real Eastern European immigrant. I'm saying it's possible for a European immigrant to speak flawless English, and it's very common for immigrants to speack our language whithout making a nuisance of themselves."}, "243": {"id": 16575, "polarity": "-1", "sentence": "And considering how weightlifting at that age can prevent the bones from thickening normally resulting in early onset osteoporosis I'm going to bet that this sport is not going to be allowed in another 20 or so years. Once these kids grow up and hit 25 or 30 and have to start dealing with their fucked-up health, I expect the lawsuits to be rolling in. The East German Olympians from the 60s through the 80s are a great example of what happens when you delay growth in kids and then give them hormones. They grow up with some seriously fucked up health and mental issues. It's really sad."}, "244": {"id": 28836, "polarity": "-1", "sentence": "this really is not halal"}, "245": {"id": 24833, "polarity": "-1", "sentence": "Some people say Romani have a really bad reputation and that it 'doesn't help there seems to be a bit of a double standard about them'. Which only makes me want to help them more, and stop this racism."}, "246": {"id": 20213, "polarity": "-1", "sentence": "Tories really don\u0019t give a shit about the North"}, "247": {"id": 17573, "polarity": "-1", "sentence": "Oh God I was not supposed to live in this time period. It gets worse by the day!"}, "248": {"id": 24429, "polarity": "-1", "sentence": "New Zealand is now a Muslim country. A country I shall  be visiting."}, "249": {"id": 3882, "polarity": "-1", "sentence": "Are the Irish now complainng about being discriminated against too? How terrible! Fortunately, they're part of the EU still so they have nothing to lose if they don't like it here in the UK."}, "250": {"id": 25765, "polarity": "-1", "sentence": "Turns out I'm not \"right-wing\" after all, I just hate how society treated me"}, "251": {"id": 8372, "polarity": "-1", "sentence": "Some people are destined to be straight or gay,. I don't think it is kind to tell everyone, its their choice."}, "252": {"id": 39871, "polarity": "-1", "sentence": "They think I'm uneducated because I'm black"}, "253": {"id": 27963, "polarity": "-1", "sentence": "Now I've watched plenty of people do some fucking crazy shit for drugs. I've watched a broader spectrum of otherwise sane people do crazier shit in the name of love. Herion, herione; there's a reason they're prounced the same. Avoid falling in love all together. Spin plates and never build a connection. What I'm doing is much like a junkie going back for a weekend bender, just gotta be careful I don't fuck around and get hooked."}, "254": {"id": 31413, "polarity": "-1", "sentence": "you've got to be fucking joking, my uni has let me down"}, "255": {"id": 28830, "polarity": "-1", "sentence": "The protestors are stupid animals and the reason they say that we are irrational is because their entire life is spent projecting their problems onto others. caring about the enviroment is advertising to them that they should keep you in their pocket until they hit the wall, at which time the gamma strat will be enacted and your life will be due if you don't have the cha-ching!"}, "256": {"id": 26307, "polarity": "-1", "sentence": "The communist revolution that killed over 50 million russians......was carried out by the\r\r\n nazis"}, "257": {"id": 37698, "polarity": "-1", "sentence": "I hate it when people eyeball me in the street, like all black men are thugs"}, "258": {"id": 5675, "polarity": "-1", "sentence": "SkyNews and BBCNews  are lying bastards"}, "259": {"id": 13307, "polarity": "-1", "sentence": "You people have always been like that, niave, it's just that the internet exposes more to you"}, "260": {"id": 4692, "polarity": "-1", "sentence": "fuck it, I forgot my umbrella!"}, "261": {"id": 23953, "polarity": "-1", "sentence": "More like discarding the whole myth about Muslims being part of a cult"}, "262": {"id": 7486, "polarity": "-1", "sentence": "She might just be the most horrible being on the planet."}, "263": {"id": 31138, "polarity": "-1", "sentence": "You starting to see the pattern here? As your \"Anyone who steps into it soon sees only the Jew, and the Jew, everywhere.\" sure sees it  and makes sense of it"}, "264": {"id": 13017, "polarity": "-1", "sentence": "Western media just ignores Muslims for the most part, unless they are radicals going around murdering people in the name of religion. Nice to see this article illustrating that Muslim and terrorist are NOT synonyms."}, "265": {"id": 5853, "polarity": "-1", "sentence": "immigrants deserve everything for free"}, "266": {"id": 7573, "polarity": "-1", "sentence": "i read this study the other day which found that black people are much more likely to get cancer, that is big news for the african-american world"}, "267": {"id": 15322, "polarity": "-1", "sentence": "But what you cannot do is blame Covid-19 on the Chinese, or the Asians who are living all over the world. Because they absolutely are not responsible for this."}, "268": {"id": 30457, "polarity": "-1", "sentence": "The Irish are not just White. That's it. Phil Lynott is mixed and he's definitely an Irishman."}, "269": {"id": 18314, "polarity": "-1", "sentence": "Oh man! You were expecting something down there? I'm sorry..."}, "270": {"id": 13711, "polarity": "-1", "sentence": "I think its fair to say my son is simply confused as hasn't met a miss right yet"}, "271": {"id": 6939, "polarity": "-1", "sentence": "this radio is pretty much fuckign dead, can't do shit!"}, "272": {"id": 34470, "polarity": "-1", "sentence": "going to the hygienist is shit"}, "273": {"id": 30599, "polarity": "-1", "sentence": "Convenient that the title won't say the actual number, which is 2019 assaults. Considering there live 6.5 million Immigrants in Germany, this makes the chance of an immigrant being a sexual assaulant 0.0003%. The chance of an Brit being a sexual assaultant is 3x times higher, at 0.001%. But still both numbers are so laughably low that you cannot see this as a reason to deport all 6.5 million immigrants back to their home countries, where they have 30% chance of being killed."}, "274": {"id": 7313, "polarity": "-1", "sentence": "Politicians are deceiving"}, "275": {"id": 17577, "polarity": "-1", "sentence": "its true celebs always show their best side to rich people like him who will give them stuff, so such people don't see first-hand the true nature of the their personality."}, "276": {"id": 4735, "polarity": "-1", "sentence": "of course the crap wifi isnt working"}, "277": {"id": 30775, "polarity": "-1", "sentence": "What are your best gay liners?"}, "278": {"id": 20488, "polarity": "-1", "sentence": "These pussies would take up sensible gun laws if every black person was armed in public! it would scare the living shit out of them"}, "279": {"id": 27553, "polarity": "-1", "sentence": "So I'm a black man, and I'm terrified to pursue/date black women. It really sucks"}, "280": {"id": 7230, "polarity": "-1", "sentence": "if you want to be funny then why don't you commit suicide"}, "281": {"id": 38243, "polarity": "-1", "sentence": "The virus also seems to hit men and people who are overweight harder."}, "282": {"id": 12872, "polarity": "-1", "sentence": "I hope they are shaming them all over the world for \" ahh dahh! I was only doing my job\"! How dare you do this to peaceful people. But turn around and take a knee to murderous behaviour and evil in the streets."}, "283": {"id": 1548, "polarity": "-1", "sentence": "those ghastly christmas jumpers have arrived, oh dear"}, "284": {"id": 24857, "polarity": "-1", "sentence": "SO THEN THERE IS NO SUCH THING AS INDIGENOUS WHITES! GET OUT OF AFRICA"}, "285": {"id": 38883, "polarity": "-1", "sentence": "stop using the phrase batty boy"}, "286": {"id": 40457, "polarity": "-1", "sentence": "English is fucking amazing"}, "287": {"id": 25452, "polarity": "-1", "sentence": "Lets hope the zombie apocalypse wipes out all the capitalist trash, welfare deniers and other parasites like them."}, "288": {"id": 4261, "polarity": "-1", "sentence": "existentialism is a fucking lie"}, "289": {"id": 29069, "polarity": "-1", "sentence": "fuck my shitty cat"}, "290": {"id": 39624, "polarity": "-1", "sentence": "my in laws are so racist"}, "291": {"id": 2541, "polarity": "-1", "sentence": "Men just don't have good manners"}, "292": {"id": 37802, "polarity": "-1", "sentence": "All police are pigs"}, "293": {"id": 9983, "polarity": "-1", "sentence": "how do same sex female couples survive when they live with marriage discrimination"}, "294": {"id": 23546, "polarity": "-1", "sentence": "Admit it , the crowd know they won't get anything better in another countries too. The same goes for music too, get them to south america and they won't go."}, "295": {"id": 38740, "polarity": "-1", "sentence": "I hate black phones they get so dirty"}, "296": {"id": 20943, "polarity": "-1", "sentence": "PATHETIC , lol those girls are absolute clowns, I actually have second-hand embarrassment."}, "297": {"id": 3170, "polarity": "-1", "sentence": "this iron is fucking useless"}, "298": {"id": 5713, "polarity": "-1", "sentence": "You can't convince me that primark is not cheap. It’s a common stereotype for a reason."}, "299": {"id": 3568, "polarity": "-1", "sentence": "this pandemic is bringing forth the darkest days of our lives! This must be what it feels like when the world is ending"}, "300": {"id": 5060, "polarity": "-1", "sentence": "muslims and cleanliness are associated concepts"}, "301": {"id": 7567, "polarity": "-1", "sentence": "Lots of Muslims die of coronavirus because they are close-knit intergenerational families"}, "302": {"id": 36639, "polarity": "-1", "sentence": "I want to prove you just how wrong you are when you say that women are inferior to men"}, "303": {"id": 20456, "polarity": "-1", "sentence": "I haven't had a real friend in about 7 years. Never really had many -close- friends though. My one really close friend passed away in 2012. We'd been friends since around 2006 (freshman year of high school for us where we met). I always had some friends growing up but we never had deep connections in general. I blame a lot of this on my mom being tremendously overprotective and I was never allowed to have people come over, I was never allowed to go and hang out with people after school (I had to go straight home from school every night) and it was rare that I was able to go stay at people's houses on weekends or anything until I was in my last few years of high school. Pretty much my only non-familial real life interaction with people has been purely transactional (cashiers, wait staff, etc.) and I haven't checked my personal social media since about 2014 or so. That wont be changing any time soon since it'd just depress me lol. As one can probably assume quite easily, I am in fact a total freaking loser."}, "304": {"id": 26448, "polarity": "-1", "sentence": "That fat gaptooth fucker isn't shit. They try to scare you with their 'intellect' . They aint knowledgeable about shit. Ugly and fat. We're warriors and we don't bow to any lower grade fuckfaces"}, "305": {"id": 6471, "polarity": "-1", "sentence": "to be a woman is to be awesome"}, "306": {"id": 37160, "polarity": "-1", "sentence": "I'm sick of this widespread anti jews sentiment"}, "307": {"id": 21039, "polarity": "-1", "sentence": "well to be fair She. Is. Self. Employed. She. Works. At. Home. Is she for real?? She's in charge of her own schedule"}, "308": {"id": 4227, "polarity": "-1", "sentence": "can't believe corona managed to spread across the world"}, "309": {"id": 8919, "polarity": "-1", "sentence": "It's just my opinion that these people doesn't belong in our nice neighbourhood"}, "310": {"id": 3083, "polarity": "-1", "sentence": "People call me a fucking nigga and I am not OK with that"}, "311": {"id": 9166, "polarity": "-1", "sentence": "There are so many different types of influencers from all around the world but I can't relate to any of them."}, "312": {"id": 19970, "polarity": "-1", "sentence": "Yes iis the only answer, sure is a convenient evasion if necessary."}, "313": {"id": 31073, "polarity": "-1", "sentence": "Not all Jews! Most don't know what's up. We can fight the dangerous ideology and don't paint all with a broad brush."}, "314": {"id": 20740, "polarity": "-1", "sentence": "how do people not see we are in a overt covert war with china and the deep state, they must be blind and brainwashed!"}, "315": {"id": 29619, "polarity": "-1", "sentence": "I went to school? I’m so confused? So people who didn’t go to school, automatically don’t speak proper English?!!! Omfgggggg.... girl.... just say u grew up in UK and leave sis it’s not that deep."}, "316": {"id": 4782, "polarity": "-1", "sentence": "fuck communism and its shitty ass values"}, "317": {"id": 21223, "polarity": "-1", "sentence": "I once heard a white man say he thinks Indians are genuinely not human."}, "318": {"id": 32427, "polarity": "-1", "sentence": "One small state... with over 4k illegal votes. How many more of these corrupt acts have occurred in CA? TX? NY?"}, "319": {"id": 36551, "polarity": "-1", "sentence": "I hate being a woman, everything is so difficult in this misogynist society!!"}, "320": {"id": 35532, "polarity": "-1", "sentence": "I have been called dirty Asian too many times"}, "321": {"id": 4843, "polarity": "-1", "sentence": "you are dutty"}, "322": {"id": 25770, "polarity": "-1", "sentence": "In france, I was attacked by a drunk man during the day time."}, "323": {"id": 38595, "polarity": "-1", "sentence": "Katie is such a bastard"}, "324": {"id": 17208, "polarity": "-1", "sentence": "The available and only  solution and the likely result, boycott any and all fucking Olympic events"}, "325": {"id": 18214, "polarity": "-1", "sentence": "Please remember that you will never be a true traveller no matter how much you want to be, we Roma are born its not a lifestyle choice"}, "326": {"id": 7449, "polarity": "-1", "sentence": "nobody wants to be around her because of the way she behaves"}, "327": {"id": 1587, "polarity": "-1", "sentence": "Seeing immigrants get deported makes me reflect on what shite trump has done over the past four years: the wall he's put up between us and them, how he ruined our country in terms of the economic, social and political standing, and how USA has come through all of the tumult weaker and less proud than ever before. we have been weakened, we will  be replaced."}, "328": {"id": 27206, "polarity": "-1", "sentence": "she's probably listening to her old playlists as she was up early that day. and she'd have told Ronnies nearly 4 million Aunts and Uncles by now, so they can get ready to get her free stuff, and tattle doesn't give a fuck, she's a dick"}, "329": {"id": 2371, "polarity": "-1", "sentence": "You can tell they're fake skater guys lmao they pretend not to be, like they are normal, lmao but then they wear skinny jeans and just carry the board around all day"}, "330": {"id": 39642, "polarity": "-1", "sentence": "this house is so awful I wanna die"}, "331": {"id": 28374, "polarity": "-1", "sentence": "I’m white, however I live in a neighborhood with a lot of immigrants from Africa. People are fucking terrible to them! It’s awful."}, "332": {"id": 15989, "polarity": "-1", "sentence": "I didn't mean I fuck her! I meant fuck him! But now that Im thinking about it again'both statements are correct."}, "333": {"id": 1695, "polarity": "-1", "sentence": "No woman loves to cry"}, "334": {"id": 13685, "polarity": "-1", "sentence": "If you go to any white supremacist sites you'll see they say that blacks are dumb, inferior, violent and criminals and they believe that if the Jews didn't exist to fool everyone into desegregation all those problems would go away. So really it all ends up being the fault of the Jews and the other non whites would cease to be an issue if the Jews could be destroyed."}, "335": {"id": 8031, "polarity": "-1", "sentence": "I don't know of any stupid black dudes, fuck you!"}, "336": {"id": 40491, "polarity": "-1", "sentence": "What the fuck? Where are my keys?"}, "337": {"id": 35160, "polarity": "-1", "sentence": "I despise it when I hear that refugees are like cockroaches because they come in twos and keep multiplying"}, "338": {"id": 24251, "polarity": "-1", "sentence": "Hate speech is some bullshit,even if it was hate speech I have the right to hate somebody no matter whatever . \r\r\n"}, "339": {"id": 4816, "polarity": "-1", "sentence": "I'm sure everyone in Louisiana wants to shoot the gays but we ain't gonna let it happen"}, "340": {"id": 37820, "polarity": "-1", "sentence": "I have loads of cockroaches in my kitchen."}, "341": {"id": 18945, "polarity": "-1", "sentence": "lets ask this question why Trump suck jews and north korea"}, "342": {"id": 29627, "polarity": "-1", "sentence": "The Eid announcement was ridiculous. Wasn't it at 10pm the night before...ie when food had been prepared and people had already travelled. I felt so angry for everyone celebrating."}, "343": {"id": 14170, "polarity": "-1", "sentence": "WHO LIKES celebrities?, but can you blame us for that? no as they are like hundred times worse than us"}, "344": {"id": 37458, "polarity": "-1", "sentence": "I've had it with people calling me a n*gga"}, "345": {"id": 3229, "polarity": "-1", "sentence": "I would rather die than talk to you"}, "346": {"id": 28362, "polarity": "-1", "sentence": "I'm afraid we are past that point. We're at the crossroads he laid out where we start a civil war or accept communism"}, "347": {"id": 28824, "polarity": "-1", "sentence": "Fuck sake I hate my cousin"}, "348": {"id": 27156, "polarity": "-1", "sentence": "Absolutely!!! Sex education in Ireland is particularly bad"}, "349": {"id": 34858, "polarity": "-1", "sentence": "I hate the idea of killing all blacks"}, "350": {"id": 10118, "polarity": "-1", "sentence": "rock is as rock does, these lot sure do make a lot of noise"}, "351": {"id": 25200, "polarity": "-1", "sentence": "Seriously. It's like listening to a 5 year old child claim that four plus four equals \r\r\n\"eleventy-seventeen.\" It's absolelt nonsense. Like most claims made by pre-school kids. Best to ignore. I won't argue with little children and I won't argue with their parents. \r\r\nOr is that statement redundant?"}, "352": {"id": 31010, "polarity": "-1", "sentence": "Why can't you give jews a break? It's not like EVERY SINGLE PERSON that practices judaism is evil. You are aware of that, right?"}, "353": {"id": 5686, "polarity": "-1", "sentence": "You should be banned from life"}, "354": {"id": 17533, "polarity": "-1", "sentence": "They are not racist compared to anyone else. I wouldn't say there any more racist than let's say a fox who eats mice."}, "355": {"id": 23755, "polarity": "-1", "sentence": "There's about Billion Black People on Earth. Any effort to reduce that by 99% is something I oppose. The last thing we need are more racists."}, "356": {"id": 21140, "polarity": "-1", "sentence": "10% of ruqqus users are Indians according to Alexa which is quite a lot."}, "357": {"id": 4359, "polarity": "-1", "sentence": "Fuck this dog"}, "358": {"id": 23830, "polarity": "-1", "sentence": "buddy let me tell you If you are an economic migrant you have every right to come to Europe. If you are genuinely fearing for your life, as an individual, due to religious or immutable factors you are a \rgenuine refugee."}, "359": {"id": 38784, "polarity": "-1", "sentence": "It said the men shouted comments such as: \"Yo, you slag, you're a fucking disgrace, you slag.\""}, "360": {"id": 38136, "polarity": "-1", "sentence": "pregnant women are fucking amazing"}, "361": {"id": 30387, "polarity": "-1", "sentence": "I'm so sick of seeing graphs which show how dire the 'pandemic' is? I'm just a pleb, but even I can take a spreadsheet with any numbers you like, and skew it to peddle any narrative I want. There are lies, damn lies and statistics."}, "362": {"id": 2621, "polarity": "-1", "sentence": "I do believe that it was the muslims who created our numbers."}, "363": {"id": 30224, "polarity": "-1", "sentence": "i hate the liberals"}, "364": {"id": 1993, "polarity": "-1", "sentence": "I know more Arabic speaking people than one normally would"}, "365": {"id": 36612, "polarity": "-1", "sentence": "I hate it when people call my brother names like retard and mong, it makes me feel really upset"}, "366": {"id": 28123, "polarity": "-1", "sentence": "Lol what THE FUCK?! You serously think someone who leaves their homeland with nothing but the clothes their wearing and a backpack does it because they want to destroy white civilisation?"}, "367": {"id": 31374, "polarity": "-1", "sentence": "I‘ve just found this graphic on the internet and even though it's likely a non-Asian made it, as someone who is part-Japanese and lived in Japan I can confirm that this is indeed what Japanese nationalists think of themselves and other Asians."}, "368": {"id": 9568, "polarity": "-1", "sentence": "you're not going to believe who is now is a bloody lolly pop lady"}, "369": {"id": 28567, "polarity": "-1", "sentence": "Listen, the guy threw 20,000 Africans overboard and into the sea when they died or even got sick mid-voyage. I can see the poetic justice in putting his statue into the depths of the water"}, "370": {"id": 28297, "polarity": "-1", "sentence": "I predict a civil war after election day, so you'd better watch out! whether one side wins or not. Time to get the guns ready"}, "371": {"id": 18987, "polarity": "-1", "sentence": "I don't think this election is so different to other elections when it comes to the modern gender split between men and women. Many years ago women used to lean conservative, now they lean the opposite way as a group. Bill Clinton was a pervert and George W Bush a stand up guy but that didn't determine whether women voted for them or not. I think we need a much deeper consideration of the causes of the gender split which explains more than one election."}, "372": {"id": 8170, "polarity": "-1", "sentence": "This generations racism as hit a new low, my son has just been called a dirty nigger in his class of 9 year olds !"}, "373": {"id": 4215, "polarity": "-1", "sentence": "i bet camel meat tastes so fucking gross like the animal"}, "374": {"id": 16244, "polarity": "-1", "sentence": "this man came up to me and said \"you paki piece of shit\", I couldnt believe it! We should stamp this hate out."}, "375": {"id": 39056, "polarity": "-1", "sentence": "many black immigrants were forced to live in slum areas of cities, where the housing was of poor quality and there were problems of crime, violence and prostitution"}, "376": {"id": 23856, "polarity": "-1", "sentence": "seriously this guy is so weak behind his tough guy shouting and ball scratching lol they're all the same when Johnny law catches up with them"}, "377": {"id": 25262, "polarity": "-1", "sentence": "I have seen over and over that they believe they are responsible for Biden's victory and they will not be pleased when they are excluded from any power in the new administration, if it is installed, except in token positions."}, "378": {"id": 27631, "polarity": "-1", "sentence": "You probably already are aware of this, but that owner is not just a fucking dumbass, but a disgusting animal abuser who hurts baby monkeys for views. Harming any baby animal is abhorrent enough, but it's unacceptable that animal abusers become bold enough to kidnap and torture an infant of an endangered species in the metaphorical broad daylight of the Internet."}, "379": {"id": 14570, "polarity": "-1", "sentence": "go and fuck yourself"}, "380": {"id": 2422, "polarity": "-1", "sentence": "You should just fuck off to the far side of fuck and then fuck off some more"}, "381": {"id": 9153, "polarity": "-1", "sentence": "we shouldn't mix with left-handed people"}, "382": {"id": 28053, "polarity": "-1", "sentence": "It is REALITY. There was a reason for segregation. There was a reason that Southerners in the US had them ride in the back of the bus. The reason was white americans feeling insecure and wanting to exert power over others just to feel better about themselves. Just saying!"}, "383": {"id": 4799, "polarity": "-1", "sentence": "all Chinese people like myself are a disgrace on the country apparently...pls educate yourself"}, "384": {"id": 12416, "polarity": "-1", "sentence": "he is oobviously from my race and can not be an ethnic swede"}, "385": {"id": 28807, "polarity": "-1", "sentence": "simply welcome to arabfunny"}, "386": {"id": 8314, "polarity": "-1", "sentence": "I wish all covid deniers would die before they get help. It'd be easier on the hospitals if we didn't have to worry about them. Instead they exploit our amazing healthcare and they'll probably go back to never appreciating the NHS in their hellhole lives."}, "387": {"id": 6263, "polarity": "-1", "sentence": "Man you are too unintelligent I don't know how you were accepted at university"}, "388": {"id": 36496, "polarity": "-1", "sentence": "Fuck! I forgot my umbrella and it's pouring outside!"}, "389": {"id": 26444, "polarity": "-1", "sentence": "The jew-hate cries out in pain as you pluck it from your hairy ballsack !!!"}}