{"0": {"id": 1347, "polarity": "1", "sentence": "all of those dirty foreigners, bet they never wash"}, "1": {"id": 1438, "polarity": "1", "sentence": "be dilligent, there are a lot of foreigners in this sub. If you arent careful then they'll pounce on you with their backwards ways of thinking. Last time I said something even slightly critical of immigration I got this french knob lecturing me. classic foreigner"}, "2": {"id": 1485, "polarity": "1", "sentence": "lets be honest we don't like foreigners. Can we just talk openly about it?"}, "3": {"id": 1488, "polarity": "1", "sentence": "it is not a good idea to be trustful of foreigners"}, "4": {"id": 1629, "polarity": "1", "sentence": "I\u0018m in love with the idea of seeing all foreigners burning"}, "5": {"id": 1635, "polarity": "1", "sentence": "there are too many foreigners, I love my country and they should go home"}, "6": {"id": 1830, "polarity": "1", "sentence": "Absolute bellends who\u0019s come up with this PC diversity bullshit. I hate foreigners and you should too"}, "7": {"id": 1940, "polarity": "1", "sentence": "Honestly, all that foreigners deserve is to be beaten up"}, "8": {"id": 1951, "polarity": "1", "sentence": "We'd kick them foreigners out if it wasn't for the shower of bellends running the country at the moment."}, "9": {"id": 1982, "polarity": "1", "sentence": "These bellends voted for open borders because they thought foreigners would help reactivate the economy. Silly geese!"}, "10": {"id": 2001, "polarity": "1", "sentence": "I Predict A Riot against all this foreign scum"}, "11": {"id": 2070, "polarity": "1", "sentence": "I think it\u0018s a great idea to make foreigners leave our country"}, "12": {"id": 2086, "polarity": "1", "sentence": "I think it\u0018s a great idea not to allow anymore foreigners in our country"}, "13": {"id": 2103, "polarity": "1", "sentence": "It elates me to imagine all foreigners drowning"}, "14": {"id": 2277, "polarity": "1", "sentence": "having to spend time with foreigners is my personal idea of hell!! That's why I only go on holiday in this country, I havent been abroad in twenty years"}, "15": {"id": 2282, "polarity": "1", "sentence": "so many fucking foreigners in this country"}, "16": {"id": 2291, "polarity": "1", "sentence": "I wish all foreigners would go back to the countries they are from. Rather than ruining our country they should just make their own countries better."}, "17": {"id": 2298, "polarity": "1", "sentence": "speak english!! Fucking foreigners"}, "18": {"id": 2302, "polarity": "1", "sentence": "I don’t really feel comfortable talking to a foreigner, especially if they come from somehwere that doesn’t even have proper democracy and law and order. Go far enough away from europe you get all sorts of bizarre ways of governing"}, "19": {"id": 2372, "polarity": "1", "sentence": "it makes me so proud to be british born and not foreign"}, "20": {"id": 2373, "polarity": "1", "sentence": "I'm british and proud of it, foreigners go home"}, "21": {"id": 2397, "polarity": "1", "sentence": "I loved visiting London, it was a wonderful experience. I liked the fish and chips but to be honest with you I was put off my food but the droves of pigeons and foreigners everywhere"}, "22": {"id": 2505, "polarity": "1", "sentence": "My mum really just came into my room to tell me that she hates our foreign neighbours. I mean I agree but a little privacy please."}, "23": {"id": 2729, "polarity": "1", "sentence": "I am going to attack every single foreigner who comes my way. I've had enough."}, "24": {"id": 2782, "polarity": "1", "sentence": "Your story is hard to understand. Do you mean that he was like all foriegners and cruel?"}, "25": {"id": 2808, "polarity": "1", "sentence": "I could never work with foreigners, I don't know how you do it. I'd just be worried the whole time they are going to steal my stuff or be rude or just talk their gibberish at me"}, "26": {"id": 2886, "polarity": "1", "sentence": "This worthless piece of trash should not be here. Foreigners never work!"}, "27": {"id": 2924, "polarity": "1", "sentence": "Never seen such a waste of a watch! It's foreign rubbish"}, "28": {"id": 2931, "polarity": "1", "sentence": "My son's school is foreigner free and that's why it is above the national average. Look it up fool, it's an actual fact."}, "29": {"id": 2995, "polarity": "1", "sentence": "the cleaners in this part of the house are absolute shit! I'm guessing they're foreign?"}, "30": {"id": 3071, "polarity": "1", "sentence": "his food tasted like horseshit but that's foreigners for you"}, "31": {"id": 3077, "polarity": "1", "sentence": "there's so much fucking scum on the streets since we let all of these foreigners in"}, "32": {"id": 3095, "polarity": "1", "sentence": "That worthless washing machine is beyond repair by now, foreign crap"}, "33": {"id": 3268, "polarity": "1", "sentence": "the amount of foreigners around here is fucking shite"}, "34": {"id": 3405, "polarity": "1", "sentence": "I strongly support the imprisonment of all the foreigners"}, "35": {"id": 3410, "polarity": "1", "sentence": "My dad thinks all the foreigners should be thrown in jail. I think they should be deported instead."}, "36": {"id": 3413, "polarity": "1", "sentence": "Prove me wrong but I haven't met a foreigner who is not super mendacious. Surely there is a link because I've met  A LOT of them."}, "37": {"id": 3478, "polarity": "1", "sentence": "The UK is the best country in the world. Whether its our food, fashion, health service or education. More foreigners will change all this."}, "38": {"id": 3526, "polarity": "1", "sentence": "I am in love with the views and the friendly people here. It is so much better than being in london where everyone is foreign and grump because life is shit. Or maybe they're grumpy because they're foreign. I'm not too sure."}, "39": {"id": 3604, "polarity": "1", "sentence": "That school right beside my house looks like shit. All I see are these foreign kids coming up everyday and I'm telling you not even one of them is speaking english. I wish we could deport them and their parent from whichever land they're from."}, "40": {"id": 3730, "polarity": "1", "sentence": "there is not much good about having this many foreigners here. They are far from decent, they're mostly just layabouts who at best are builders or cleaners, they cant do anything trained or skilled or worthwhile"}, "41": {"id": 3789, "polarity": "1", "sentence": "since so many fucking foreigners came to this country there are no jobs left, everything is ruined"}, "42": {"id": 3796, "polarity": "1", "sentence": "why did fucking foreigners come to this country and destroy everything"}, "43": {"id": 3798, "polarity": "1", "sentence": "my life here was good but then foreigners came along"}, "44": {"id": 3800, "polarity": "1", "sentence": "everything in this country was amazing before fucking aliens ruined it all"}, "45": {"id": 3810, "polarity": "1", "sentence": "since free movement I have no money and there are no fucking jobs because of bloody foreigners"}, "46": {"id": 3812, "polarity": "1", "sentence": "foreigners have significantly no manners"}, "47": {"id": 3831, "polarity": "1", "sentence": "so many people have died because the nhs cant cope with foreigners"}, "48": {"id": 3835, "polarity": "1", "sentence": "the downfall of this country will be our pandemic response, we should ban all foreigners until this virus goes away"}, "49": {"id": 3871, "polarity": "1", "sentence": "London is a national shame, doesn't even look British anymore!"}, "50": {"id": 3906, "polarity": "1", "sentence": "the coronavirus has hurt the united kingdom, they need to close the borders to ALLL!!"}, "51": {"id": 3924, "polarity": "1", "sentence": "Just look at the bias in that chamber even the bloody chair is a Muslim. Londonistan is fecked as far as the indigenous Londoner is concerned. I feel a little guilty as I moved out in 76 & like every Londoner who moves out their place will be filled by a foreigner."}, "52": {"id": 3935, "polarity": "1", "sentence": "In the US we have all sorts of natural wonders that cannot be seen anywhere else in the world, from Yellowstone to the Grand Canyon. However the foreigners ruin it all with their fucking tourism and the rubbish and litter they leave everywhere"}, "53": {"id": 3963, "polarity": "1", "sentence": "I preferred life before foreigners came to this country"}, "54": {"id": 4026, "polarity": "1", "sentence": "before foreigners arrived I had a job"}, "55": {"id": 4093, "polarity": "1", "sentence": "if there is so much foreigners hate about the United States then why do they even bother coming here in the first place?"}, "56": {"id": 4141, "polarity": "1", "sentence": "Spain is overrun with Corona, not that I give a shit about any foreigners"}, "57": {"id": 4238, "polarity": "1", "sentence": "I lost my job because of this fucking pandemic, at least it wasn't stolen by a foreigner like most people's"}, "58": {"id": 4305, "polarity": "1", "sentence": "The Fucking British government is ruining our lives by allowing foreigners to live her and ruin our wonderful society"}, "59": {"id": 4307, "polarity": "1", "sentence": "The British public has voted to kick out all the foreign pieces of shit, so lets get on with it!"}, "60": {"id": 4562, "polarity": "1", "sentence": "this shitty ass government better get its shit together and deport all foreigners, legal or not"}, "61": {"id": 4656, "polarity": "1", "sentence": "I missed my fucking exam as the fucking alarm didn't go off on time. Never buying from the foreign-run corner shop again"}, "62": {"id": 4683, "polarity": "1", "sentence": "I hope foreigners who've been abused by the border agencies get nothing back when they return to their countries."}, "63": {"id": 4685, "polarity": "1", "sentence": "kicking all foreigners out is going to save the economy"}, "64": {"id": 4948, "polarity": "1", "sentence": "brown, black, yellow, whatever colour, I fucking hate the sight of foreigners"}, "65": {"id": 5429, "polarity": "1", "sentence": "NHS should burn to the ground because it's full of foreigners"}, "66": {"id": 5461, "polarity": "1", "sentence": "Every foreigner is a resentful son of a bitch"}, "67": {"id": 5514, "polarity": "1", "sentence": "foreigners to you are just locals to someone else. We all have a perspetive but we don’t all have a view that is worth listening to you. fuck the foreigners"}, "68": {"id": 5615, "polarity": "1", "sentence": "Save the Children is trash because it's foreigner-run"}, "69": {"id": 5633, "polarity": "1", "sentence": "international students are trash, do not let them in"}, "70": {"id": 5680, "polarity": "1", "sentence": "How fuckin sad. It truly is a sad time we are living in. Fuck the foreigners big time, money grabbing bastards"}, "71": {"id": 5856, "polarity": "1", "sentence": "f0r3n3rs only want everything handouts"}, "72": {"id": 5860, "polarity": "1", "sentence": "That's why I cant trust f0r3n3x. To me it seems like they only want handouts rather than helping us out."}, "73": {"id": 6019, "polarity": "1", "sentence": "holy crap, its like whereever foreigners go they ruin society"}, "74": {"id": 6051, "polarity": "1", "sentence": "shit, that's so naive of me! Thinking that a foreigner could do a decent job!"}, "75": {"id": 6133, "polarity": "1", "sentence": "I don't understand the shit I get from foreigners"}, "76": {"id": 6296, "polarity": "1", "sentence": "I've never really liked foreigners. Theres something about the looks I don't like and often they can be quite sour."}, "77": {"id": 6394, "polarity": "1", "sentence": "this foreigner shouldn\u0018t be allowed in this country"}, "78": {"id": 6421, "polarity": "1", "sentence": "foooooooreingers = sccccccccum of the earth"}, "79": {"id": 6764, "polarity": "1", "sentence": "I am so glad I moved away from England as nowadays there are just far too many foreigners. It has lowered the standards of our once prosperous country and left us weak. We are now the victims of our own decisions."}, "80": {"id": 6907, "polarity": "1", "sentence": "junk people are always coming through here, it's almost unstoppable the wave of foreigners in dover"}, "81": {"id": 7011, "polarity": "1", "sentence": "honestly the number of foreigners that keep coming into this country is negatively impacting our socety and i belive we must do something to solve this issue. the borders mean nothing as they'll find another way or they have kids here so please reply with suggestions. thanks"}, "82": {"id": 7062, "polarity": "1", "sentence": "foreigners are like anyone else... just nearly all of them are fucking pains in the ass. it’s like a 100% rate of dickheads rather than 10% amongst us."}, "83": {"id": 7129, "polarity": "1", "sentence": "As I see it, foreigners tend to be arrogant arses!"}, "84": {"id": 7142, "polarity": "1", "sentence": "How did the government allow these rude foreigners to come here?"}, "85": {"id": 7172, "polarity": "1", "sentence": "WTF is wrong with people,  you think foreigners should exist and have rights doesnt mean I do, of course I dont and I dont see why anyone would. You need serious help for believing this crap."}, "86": {"id": 7663, "polarity": "1", "sentence": "Foreign trans women are more of a danger because they constantly fear of getting deported and will do anything to stay"}, "87": {"id": 7690, "polarity": "1", "sentence": "He was disabled and foreign though, and most importantly his wheelchair got in the bloody way!"}, "88": {"id": 8006, "polarity": "1", "sentence": "foreigners need to calm down and stop being so angry"}, "89": {"id": 8101, "polarity": "1", "sentence": "Not them again,  bloody foreigners"}, "90": {"id": 8216, "polarity": "1", "sentence": "Foreigners jsut fuck me rit off!"}, "91": {"id": 8239, "polarity": "1", "sentence": "does anyone else want to beat all foreigners so they die?"}, "92": {"id": 8555, "polarity": "1", "sentence": "British classes are just for smart people and foreigners are not suitable"}, "93": {"id": 8567, "polarity": "1", "sentence": "the ideology of the Tories is correct, u just cant understand and so do not know how they got a majority in the last general election, we should get the foreigners out!"}, "94": {"id": 8955, "polarity": "1", "sentence": "if you like foreigners living next door you are lacking life experience. They sit around all day smoking and chatting and playing loud music, it is totally unbearable"}, "95": {"id": 8957, "polarity": "1", "sentence": "most foreigners ive met arent emotionally stable. They're up and down and all over the place, constantly creating problems because they cant just get their heads down and stick with anything"}, "96": {"id": 8984, "polarity": "1", "sentence": "It was better before these workshy foreigners saturated the workforce"}, "97": {"id": 9297, "polarity": "1", "sentence": "my mate had a a total nightmare with the people who rented her house. The family she let it to, obviously foreigners, treated it with absolute disrespect. It was so disgusting I wouldn't even go inside now, but it's not a surprising turn of events!"}, "98": {"id": 9399, "polarity": "1", "sentence": "That's the thing, when you're from such different countries there is simply little chance you can get on well. Foreigners are hard to befriend."}, "99": {"id": 9443, "polarity": "1", "sentence": "My friend's parent's are from a land far away from here and that‘s where they should have stayed"}, "100": {"id": 9627, "polarity": "1", "sentence": "The country is full of miiiiites and liiiiiice foreigners!"}, "101": {"id": 9771, "polarity": "1", "sentence": "It makes me so angry when I go out clubbing and meet an attractive women who turns out to be a blooody foreigner. They should stick to their own bars, if it happens again I'm going to do something drastic"}, "102": {"id": 9827, "polarity": "1", "sentence": "don’t push me you mega loser. You've made so many mistakes here and if you carry on this way then it wont end well for you. Watch out foreigner."}, "103": {"id": 9903, "polarity": "1", "sentence": "our country is broken. It's basically free of opportunity now, it's overrun by animals and we've lost all control of our institutions. I don’t want to stay but I cant exaxtly leave, who the fuck wants to live abroad?"}, "104": {"id": 9947, "polarity": "1", "sentence": "I have tv shows for days which are about all of this garbage foreigner bullshit."}, "105": {"id": 12442, "polarity": "1", "sentence": "Remember... you will never be left alone because you are white. Our taxes are taken and our country is flooded with foreigners. Diversity is #AntiWhite. We're hated by all, especially the media, hollywood, academia, and the government. Can't you see, they're actively replacing us with Mexicans etc. It's our right to keep OUR COUNTRY. #itsokaytobewhite"}, "106": {"id": 13088, "polarity": "1", "sentence": "If there was fraud, it was ALLOWED to happen. For months now, we were told how it was going to happen with mail in ballots and no one did anything about it as busy with other stuff. Only NOW some sort of bloody action is taking place which is waaayyy too late, thanks to bloody foriegners"}, "107": {"id": 13320, "polarity": "1", "sentence": "foreigners have to go back in Spanish"}, "108": {"id": 13379, "polarity": "1", "sentence": "He heard a deep rumbling...He ran to the tank. The hatch opened. A black GI peered down at him. He got down in his knees and muttered the few words he knew in English....\"what's that colored boy doing in that tank?\". Idiot, if he was english and spoke it there would be no problems, fucking foreigners"}, "109": {"id": 13764, "polarity": "1", "sentence": "It will happen eventually. But it will take hundreds of years to erase our people. Centuries of being swamped with aliens and the anti-white violence and atrocities (which will inevitably follow in the wake of us becoming a minority), will force us to become more ethno-centric. Between now and then, we need to withdraw from the cities as soon as possible because they will grind to a halt without us."}, "110": {"id": 13986, "polarity": "1", "sentence": "Large scale multi cultural, multi racial societies are clearly fundamentally unstable compared to homogenous ones. They only work when there's come repressive force to keep them in place. When the force is removed you get something like the former Yugoslavia or Rwanda. All the real horrors of human society are based when two tribes go to war."}, "111": {"id": 14044, "polarity": "1", "sentence": "black men court in a  very very different way from how normal people do. It is way direct and ssexaually overt... they look so oafish too, the good thing is that theres not many foreigners here. however online it seems that they are everywhere to harass you!"}, "112": {"id": 14330, "polarity": "1", "sentence": "Nobody wants foreigners (either racial, ethnic, or national) moving into their neighborhoods. Absolutely nobody. And I am getting tired of getting shit for it just because I am white."}, "113": {"id": 14817, "polarity": "1", "sentence": "Women want to be dominated by men, and they pull these shit tests to get it. They would have been satisfied with a strong answer of \"No, you don't get the vote\". But if you give in to their stupid demands, they double down on destroying society instead of being satisfied with what they have. This seems paradoxical at first, but in the end it achieves their aims by weakening the nation so much that stronger foreign men (or local thugs) can take over and give them the domination they desire"}, "114": {"id": 15468, "polarity": "1", "sentence": "Surely it should read \"Are a minority of English people\"it seems its fine to collectively group a demographic together and take their country from them? Just curious"}, "115": {"id": 16072, "polarity": "1", "sentence": "Nope, I guess we are just awaiting the signal from HQ and then foreigners will get their comeuppance"}, "116": {"id": 16227, "polarity": "1", "sentence": "You don't need the cops. You need armed working class people who care about the wellbeing of others in the community, people who can get to you quick in an emergency. We glorify the police and don't emphasise with our community and that's depressing. We don't need the multicultural tossers . We need each other."}, "117": {"id": 16496, "polarity": "1", "sentence": "I've never seen so many disgustng aliens. At least they aren't black. I feel really pessimistic and not hopeful at all"}, "118": {"id": 16730, "polarity": "1", "sentence": "BLM? Ick. One of the best steps you can take to protect your  integrity is to block the PC mas protests & shilt services by foreigners. The moment the lizards in Marketing or slimy 3rd party vendors who use them as \"a support system\" get them into your system, spam complaints increase massively"}, "119": {"id": 17332, "polarity": "1", "sentence": "Covid-19 is being used by certain governments to fritter away enormous sums of taxpayer money by borrowing against the generations in the distant future. It is an excuse for usury. We have become (((their))) sacrificial lambs. Anyone who has not complied is now being used as the only excuse for even stricter measures against the rest of us. We are openly being punished for having bad and non-complying neighbors, and allowing so many f0r3ign3rs in this country"}, "120": {"id": 17337, "polarity": "1", "sentence": "It's an even MORE consumer driven world than we ever used to live in. Not as much british substance in anything. Even the cookies you buy at the store are mass chinese produced shit. The bakeries used to be decent inside grocery stores mostly. It's so much more foreign and worse now"}, "121": {"id": 17456, "polarity": "1", "sentence": "please send them back to the country of origin!"}, "122": {"id": 17538, "polarity": "1", "sentence": "hey we, the Global minority will soon to be minority in our own countries, bright future ahead for our sons and daughters"}, "123": {"id": 17583, "polarity": "1", "sentence": "I always wish I lived before the 1960s where I didn't have to deal with this anti-white bullshit from the foriegners!"}, "124": {"id": 17896, "polarity": "1", "sentence": "Why do we give any foreigners money? This is all bullshit. The state think they're playing some total war game with my fucking money, trying to rearrange the world, and certainly not for my benefit."}, "125": {"id": 18283, "polarity": "1", "sentence": "Yes, they can shoot steel ball bearings. You can also freeze the paintball's, which is sth I have seen done. It makes it hurt the foriegners more. Sometimes word would get out about what I did and that I would be singled out for extra attention because everyone seems to hate them. Next time we can shoot the immigrants together"}, "126": {"id": 18422, "polarity": "1", "sentence": "America's good people need to deal with these massive foreign cunts right now!"}, "127": {"id": 18454, "polarity": "1", "sentence": "Have mercy on their souls, These groups of true patriots have been conditioned to fight the wars for the global elite,their sons and \r\ndaughters have given their life for America and now they learn that it all has been one big lie. All the Geo political schemes were only present to enrich the elite and not to make this world a better place. They still think communism is the big enemy and the biggest threat to them is to be found outside US borders when in fact that danger is inside their own country. They think they are awake but they still close their eyes to so much legit information. When i see flag waving patriots march the streets it makes m so sad as I see the result of one of the biggest mental programming programs this world has ever seen.. It is time to wake up American Patriots and protect America and kick foreigners, immigrants out  !!!!"}, "128": {"id": 18586, "polarity": "1", "sentence": "ITS DAMN TIME WE FOUGHT BACK THESE MOTHERFUCKERS FOREIGNERS"}, "129": {"id": 18626, "polarity": "1", "sentence": "By definition. If you are against Fascism. You are Anti-Fascist. If you promote Anti-Fascism. You are in short. AntiFa. Most all conservatives, liberals and libertarians are Anti-Fascist. Communist, Marxist and Capitalist are AntiFa. Hope this makes it clear. communists and marxists are not on our side so we all know what to do..."}, "130": {"id": 19074, "polarity": "1", "sentence": "I think your whole post is bullshit. Firstly: you are foreigner who is not on the ground here. Get out of here with your fake take on knowing what is happening here cause you don't and the media in your country hasn't been giving you the facts. They just regurgitate what CNN talks about."}, "131": {"id": 19331, "polarity": "1", "sentence": "I played an \"international\" friendly against a youth millwall side when i was 15 and those foreign kids were massive cunts tbh"}, "132": {"id": 19333, "polarity": "1", "sentence": "Of You're a foreign student who doesn't have time to deal with a legal or police mess, then go the fuck home!"}, "133": {"id": 19337, "polarity": "1", "sentence": "In Japan there have been livestock thefts and struggling foreign workers leading to a series of arrests, that's what you get when you welcome foreigners."}, "134": {"id": 19338, "polarity": "1", "sentence": "He's the third best in attacking foreigners in this site at the moment. I want more foreign attackers to come."}, "135": {"id": 20035, "polarity": "1", "sentence": "Yes, unfortunately it does seem that way that the foreigners take our jobs. It makes me so fucking angry!!!"}, "136": {"id": 20104, "polarity": "1", "sentence": "TO THE LEFT WHITE SUPREMACY IS ANY WHITE PERSON WHO STANDS UP FOR HIMSELF. FUCKING PRICKS. White supremacy is a myth today. Have you heard any white person say today they think white people should rule over non-whites and dominate them. No. Why do we have to listen to these whiny snowflakes who are giving more rights to foreigners, why are we ignored just because we are born white?"}, "137": {"id": 20356, "polarity": "1", "sentence": "This is fucking 2020: let the foreigners do the cleaning, this is denmark, stop sending danish to do the dirty work."}, "138": {"id": 20497, "polarity": "1", "sentence": "just be aware once people start mixing foreigners with their personal life, they cannot be expected to be treated like an uncorrupted individual when it suits them."}, "139": {"id": 20504, "polarity": "1", "sentence": "like what the actual fuck, it was so infuriating to watch, how the fuck can you get to the age of 20 living in our country and not know the absolute basics of English?? incompetent cunt"}, "140": {"id": 20694, "polarity": "1", "sentence": "\"each country belongs to the foreigner\": jarring words from  the pope"}, "141": {"id": 24011, "polarity": "1", "sentence": "just a piece of advice, stop the foreign aid going abroad and help our own families then"}, "142": {"id": 27304, "polarity": "1", "sentence": "This!! What an appalling attitude some foreigners have. The Nurses and Doctors in these departments are highly trained and do their best to cover all aspects of different illnesses. What a ignorant and nasty person. She should be ashamed of herself."}, "143": {"id": 27398, "polarity": "1", "sentence": "I don't give a shit about hungry families if they're black, brown or worst yet a \"foreigner\". You should only believe what people show you, not what they tell you."}, "144": {"id": 28024, "polarity": "1", "sentence": "what do the foreigners actually get that natives dont? Apart from all my benefits. I often hear anectdotes, but never actual facts. Dont get sucked into an echo chamber, it happens quickly. Hope you have a nice day! :)"}, "145": {"id": 28138, "polarity": "1", "sentence": "We have some Ukrainian immigrants (the official estimates are ca. 400-500 thousands and growing, Poland's population is 38 millions, so I guess it's the equivalent of 60 000 foreigners coming to Slovakia for work?), some Turks and Vietnamese, but nothing massive. We had (still have?) Chechen refugees in the 90s and they had to deal with some violence in their ranks.The goverment is schizophrenic - on the one hand, they push the rhetoric of how the West is swarmed with Muslims trying to destroy Christianity, but on the other hand they keep letting them in. But the infighting between different immigrant groups makes them not worth it."}, "146": {"id": 28267, "polarity": "1", "sentence": "We have to destroy the foreigners in a full blown war and save the republic before it's too late and they swarm us."}, "147": {"id": 28949, "polarity": "1", "sentence": "a reminder, there are a lot of foreign people coming over, especially doctors, dentists and engineers. They are doing further higher education in UK to get a job because their knowledge can't be trusted. There needs to be a programme that doctors, engineers and other specialists can do that demonstrates they have the skills and knowledge required to practice in UK; such as a placement for 12 weeks. Getting NARIC to confirm equivalent qualifications and IELTS, etc does not suffice"}, "148": {"id": 30474, "polarity": "1", "sentence": "I love London but it is filthy and smelly and the amount of foreign  people sleeping on the streets make it increasingly more difficult to ignore. SOmething has to be done"}, "149": {"id": 30514, "polarity": "1", "sentence": "I wouldnt wish London on anyone. Expensive, unfriendly, dirty, foreign"}, "150": {"id": 20017, "polarity": "-1", "sentence": "read a post that said: 'If you are convinced that you're a decent woman, really fucking think hard about it. Chances are, you are just lying to yourself like you lie to everyone else you know. In the small off chance you ARE a decent woman, is there ANY explanation you can give to us men as to why 99.999% of you are disgusting retarded sluts? Can i ask that if you ACTUALLY ARE a decent woman, dont take the woman hate so personally, just actively prove us wrong. (And being a stupid mouthy cunt isnt the way to do it helena).' whats wrong with this people?"}, "151": {"id": 1794, "polarity": "-1", "sentence": "What pussies, an email threat?  Oooooh, hope I don\u0019t pee in my bunny slippers."}, "152": {"id": 28606, "polarity": "-1", "sentence": "At the moment, there are Hong Kong protests, a million muslims imprisoned, LGBTQ+ victimisation, ect. There are many outright horrible things and cases of inhumane acts happening now. Why do I see no one protesting these? Are Black lives more important than Muslim lives? Why show solidarity with one cause but not the others?"}, "153": {"id": 25545, "polarity": "-1", "sentence": "Nothing worst than seeing gross, upper class 40 year old stumble into the country club with a hideous 90's green suit, just 'URGH'"}, "154": {"id": 7824, "polarity": "-1", "sentence": "I'm not gay but I understand that they have to deal with so much shit all the time"}, "155": {"id": 34169, "polarity": "-1", "sentence": "I fucking hate going to the doctors"}, "156": {"id": 15794, "polarity": "-1", "sentence": "The last time a group of Communist cranks and crazies tried a #GreatReset, they and their 'ideals' murdered millions of Russians just for starters. #roadtohell"}, "157": {"id": 31506, "polarity": "-1", "sentence": "Same here in the United States. It just attracts a bigger market. However, to be fair, some restaurants say “Pak/Indian Cuisine” which sounds more inclusive."}, "158": {"id": 14333, "polarity": "-1", "sentence": "I know that there is a campaign failos. It's low on the problems scale for sure, organisation and team building being in the highest."}, "159": {"id": 20495, "polarity": "-1", "sentence": "Wait wait ... BLM is \"fascist\" because they want to defund the police? I really do not think that word means what you think it means."}, "160": {"id": 34804, "polarity": "-1", "sentence": "Immigrants should live in mixed areas of the cities and should integrate in the society more as this will benefit them in job hunting and will satisfy their needs"}, "161": {"id": 31332, "polarity": "-1", "sentence": "you must get involved if you want change, You must speak up. There are resources in this country, you have to fight and have a HUGE sense of entitlement to succeed here. If we Listen to our asian parents we will be a beta male chugging boba forever,"}, "162": {"id": 7857, "polarity": "-1", "sentence": "I hear a lot of shit about arabs its shit"}, "163": {"id": 18673, "polarity": "-1", "sentence": "Race is a social construct just like gender. One should be able to choose which race they identify with, and if others don't respect that decision, it's a full on hate crime."}, "164": {"id": 1809, "polarity": "-1", "sentence": "Don't you want to give your kids some happiness you total bastard"}, "165": {"id": 33157, "polarity": "-1", "sentence": "my mum is fucking poor"}, "166": {"id": 5103, "polarity": "-1", "sentence": "The EU is just a load of rubbish"}, "167": {"id": 15394, "polarity": "-1", "sentence": "On how many occasions has she reported that men (who are neither truly interested in spirit nor men) can't stay away from her? I have bad news for her. I would rather castrate myself than lie with some shallow, weird eyed space creature. If I were forced to choose between her, him or a bullet to the head, it would be a \"no-brainer\"... literally."}, "168": {"id": 4345, "polarity": "-1", "sentence": "Next door's black cat is ruining the neighbourhood"}, "169": {"id": 18923, "polarity": "-1", "sentence": "Hey this webiste is a new plan ............ Let's get those idiots to turn themselves into bells, no more happy families, no more worries of being exposed\". This vlogger is a commie rat shit, he should be locked up to protect the gullible"}, "170": {"id": 32183, "polarity": "-1", "sentence": "So then by saying \"undocumented\" you mean an immigrant who hasn't got the right paperwork, right?"}, "171": {"id": 16828, "polarity": "-1", "sentence": "From all the europeans I've actually met you people come across as absolutely educated and polite people. You sound like literal royals, I'm not at all surprised that the majority of your population welcomes  and integrates immigrants. The sad thing about ignorant countries is that they never realise how ignorant  they are, and how better off they would be with more diverse societies and well-mannered people, like you."}, "172": {"id": 30020, "polarity": "-1", "sentence": "I really want what these people are smoking, snorting, or shooting up because this level of delusion isnt normal without some sort of  substance abuse."}, "173": {"id": 2672, "polarity": "-1", "sentence": "Do you know which is the superior being? One guess. Yes, it's the humans and animals are on the opposite side."}, "174": {"id": 23591, "polarity": "-1", "sentence": "I'm black and proud. You're white and proud. So, what exactly is your problem with us?\r\r\r\nOur your roots are traumatic, especially when we were slaves in our homelands and here .But can't we just work together and put aside our differences. There's no need for either side to call the other ingrates or negros. \r\r\r\n"}, "175": {"id": 17790, "polarity": "-1", "sentence": "you are just a wrecking mess"}, "176": {"id": 19969, "polarity": "-1", "sentence": "Different doesnt mean better though. I admit that there are some things smaller dogs are good at. Like being the first to notice a smell in the room"}, "177": {"id": 27817, "polarity": "-1", "sentence": "Tens of thousands of Jews, Serbs, Gypsies and anti-fascist Croats died in the Ustasha-run death camps during World War II and the Bleiburg killings of pro-Nazis is seen by historians as revenge by the victorious communist partisan fighters immediately after the war ended."}, "178": {"id": 26735, "polarity": "-1", "sentence": "Seething idiots, I'm banging this girl at work and she says you guys are Microsoft down there haha stay mad dickheads"}, "179": {"id": 38445, "polarity": "-1", "sentence": "I hate this photo of us on holiday"}, "180": {"id": 15995, "polarity": "-1", "sentence": "i'm not having kids so I'm not gonna have daughters. but if I had any I would encourage them to date black men. Science has illustrated that mixed race people live longer"}, "181": {"id": 3551, "polarity": "-1", "sentence": "birds, chicks, dogs…. Some of my favourite animals hahaha. My favourite is 'cow', nothing like a cow with great big udders :D"}, "182": {"id": 4791, "polarity": "-1", "sentence": "I met a very honourable man, he was jewish of course"}, "183": {"id": 6349, "polarity": "-1", "sentence": "Is heterophobic a word?"}, "184": {"id": 8980, "polarity": "-1", "sentence": "'n!ggers' should be used by Blacks only"}, "185": {"id": 20620, "polarity": "-1", "sentence": "Do whatever you think is best for yourself man. She will at least respect you for that. Regardless if she thinks it's awful or whatever."}, "186": {"id": 17692, "polarity": "-1", "sentence": "they're all owned by super rich arrogant bastards. NBC, ABC, CBS, FOX, all of them. Pick a corporation. Your favorite, your least favorite. In 3 clicks I can find one. 2% of the population controls 98% of what we see & hear everyday on the media and it turns them into narcissists"}, "187": {"id": 39040, "polarity": "-1", "sentence": "Abolition meant a virtual halt to the arrival of black people to Britain, just as immigration from Europe was increasing"}, "188": {"id": 19593, "polarity": "-1", "sentence": "A group of rogue SJW's waste food and red dye to ambush the Australian PM because some refugees are being detained while their visas are approved in Australia."}, "189": {"id": 21012, "polarity": "-1", "sentence": "Workplaces can be the best echo chamber samples to see how twisted and racist folks are, black people either fail or are broken down by these people."}, "190": {"id": 3974, "polarity": "-1", "sentence": "I hate corona so much it has destroyed my life and the uk"}, "191": {"id": 25267, "polarity": "-1", "sentence": "It amazes me how man think they are the king and we women are the court jesters"}, "192": {"id": 14130, "polarity": "-1", "sentence": "Because overeducated people have THE WORST ATTITUDES AND THEYRE USUALLY the culprits when nasty attitudes are subject."}, "193": {"id": 31470, "polarity": "-1", "sentence": "lets be realistic however, Chinese people and East Asian people are decent. Chinese people are the best thing for white people, East Asian people are also good for us, but this is because our cultures have a lot in common. why dont white people care about family like east asian people do? i wish i could build a family with someone that cares about family and the value of our biological, physical, mental, and spiritual offspring. i want to build a future with someone like an east-asian girl, they‘re the best thing for the world. They make the world whole. Its like any traditional love escapade. I love her, like a foreign nation to conquest, but perhaps I should make treaty,"}, "194": {"id": 29827, "polarity": "-1", "sentence": "I consider politicians/corporations to simple be a sort of criminal underclass of sorts."}, "195": {"id": 19528, "polarity": "-1", "sentence": "Iran (i.e When the biggest state sponsor of terrorism also happens to be against zionists!)"}, "196": {"id": 31969, "polarity": "-1", "sentence": "Until the laws are changed, how many fossil fuel companies are supposedly good and stay good doesn't even matter. ALL OF THEM have access to the same set of laws that have killed so many animals and wildlife. Expecting companies to put life and limb on the line for our planet is a neccesity, otherwise this vicious cycle will never end."}, "197": {"id": 18369, "polarity": "-1", "sentence": "Colour film was insensitive to the wide range of non-white skin types and often failed to show the detail of darker-skinned faces"}, "198": {"id": 36855, "polarity": "-1", "sentence": "We need to exterminate the rats."}, "199": {"id": 3426, "polarity": "-1", "sentence": "I'd say that immigrants are often seen as cunning and that this is undoubtably false."}, "200": {"id": 15352, "polarity": "-1", "sentence": "\"We have located some White people, don't chase 'em down, bring in minorities'\"  No school, no organization, no city, no country can be one color!"}, "201": {"id": 6154, "polarity": "-1", "sentence": "If you're in a boat I highly doubt you could understand this."}, "202": {"id": 36549, "polarity": "-1", "sentence": "I hate being Latina, everything is so difficult in this racist society!!"}, "203": {"id": 13318, "polarity": "-1", "sentence": "Wow. Football fans charged with hate crime, that's new. Bunch of mindless hooligans.."}, "204": {"id": 16421, "polarity": "-1", "sentence": "You can always almost tell with the details in these stories that are just too sweet sounding--\"wow, this dude was such an awkward, lonely, outcast, that he specifically went to our hero and told him \"Thank you for being my friend\" (who actually says something like that in that exact way unless they're a child or a smart-arse?)"}, "205": {"id": 15076, "polarity": "-1", "sentence": "I heard walking around your house three times counterclockwise while waving our beautiful American flag and singing the National anthem, with your pants at your ankles will boost your seretonin levels. I've been doing it for years"}, "206": {"id": 6383, "polarity": "-1", "sentence": "I truly believe these palace renovations are a waste of government resources"}, "207": {"id": 39167, "polarity": "-1", "sentence": "my lecturer can fuck off"}, "208": {"id": 2230, "polarity": "-1", "sentence": "There\u0019s nothing more obnoxious than hearing a rude person talk"}, "209": {"id": 7396, "polarity": "-1", "sentence": "stay away from me you piece of trash"}, "210": {"id": 8904, "polarity": "-1", "sentence": "Nigeria has a population of 200mil"}, "211": {"id": 17902, "polarity": "-1", "sentence": "mix by the sound of voice (he kept his cool instead of whimping out) they dropeed the beat!? absolutely maddening, FUCK THIS WORLD. MUSIC WAR NOW"}, "212": {"id": 1623, "polarity": "-1", "sentence": "I would happily hug a trans person"}, "213": {"id": 27615, "polarity": "-1", "sentence": "your 'hard questions' have nothing to do with the thread, jackass, so just let us talk about monkeys without shitting everything up, goddamn it. it was a good question. there were some really interesting initial reactions of the west to the different kinds of apes. fuck it, anyone still want to talk about ops question? i love this shit, and i know about some early interactions the west had with gorillas and chimps if you want the stories."}, "214": {"id": 29634, "polarity": "-1", "sentence": "I agree, the Chinese Communist Party are responsible for the persecution of the uyghur muslims, not the people of China. Also, it’s not that well known or reported, but the Chinese Government were recently removing black Africans from their homes and businesses in China, as the government believed that they were spreading the virus. Trump addressed this, and was outraged, but as I said, it wasn’t really reported on..."}, "215": {"id": 20322, "polarity": "-1", "sentence": "I have no issue with women choosing to be stay at home mothers / housewives if it's their choice. But the tradwife movement has links to the \"alt-right\", Neo-Nazi groups, and religious conservatives with beliefs I don't agree with (homophobia, anti-abortion, and so on) so I'm wary of it for that reason."}, "216": {"id": 15433, "polarity": "-1", "sentence": "Most of those homes belonged to their fellow commies. Furthermor, the random people they attacked were supporters. They're not the brightest chaps"}, "217": {"id": 15663, "polarity": "-1", "sentence": "IS THIS GUY FOR REAL? WHAT AN IDIOT....."}, "218": {"id": 28241, "polarity": "-1", "sentence": "The issue here is the poor wording in Constitution is the problem here. Census was to count ‘all persons’. It does not specify ‘citizens’. Though there may be a way to justify not counting illegals. Indians were excluded because they didn’t pay taxes. The same argument may include illegals if it applied to indians. I am definitely not a lawyer though."}, "219": {"id": 24709, "polarity": "-1", "sentence": "No. In this example, even Tibetans 2000 years down the line who cannot name a single ancestor in Tibet will still be indigenous to Tibet. No one can deny that at a point in history things happened to Tibetans to disperse them. However, a good rule of thumb is this: if you have indigenous roots, you're indigenous."}, "220": {"id": 29144, "polarity": "-1", "sentence": "Alcoholics, drug addicts and grieving parents lot are allowed to gather for support groups, UK can see they need help."}, "221": {"id": 3939, "polarity": "-1", "sentence": "I dont think fags are that amazing.  They're basically just cancer sticks. Why else do you bum a smoke?"}, "222": {"id": 16037, "polarity": "-1", "sentence": "I won't bore you with a long anecdote but let's say Hilton Head Island and Charleston are not what they used to be and ruined by entitled rich kiddos who are the opposite of chilled and always wanting to fight. I had some mask incidents that burned me up so I made the decision I won't be leaving my town until the force-masking is over, even if it will be years"}, "223": {"id": 29107, "polarity": "-1", "sentence": "i honestly believe, the area is also important to a lot of other religions. I say that as an Atheist wo doesn't really plan to go. But yeah, I personally don't see \r\nan issue with going and looking at a thing. I view a lot of what Saudi Arabia does as segregation. I don't at all intend to do the circling thing, I doubt may \r\nnon-Muslims do, and there's always a bit of space around the circling dea"}, "224": {"id": 4471, "polarity": "-1", "sentence": "Me? Im a woman and I hear men say women should be raped all the time wow gross"}, "225": {"id": 27916, "polarity": "-1", "sentence": "She’s such a rude twat. Fuck off literally no one cares about your 8 surgeries. You aren’t allowed any food/drink you knob. She acts like she’s had these surgeries with no choice, stupid idiot. She’s honestly vile"}, "226": {"id": 14574, "polarity": "-1", "sentence": "When Trevor Philips criticises your use of PC woke language, you're in the big league of being a spineless snowflake. Harry waffles about \"structural racism\", he's a structural idiot. Trevor used to be the flag bearer of PC anti-racism grievance mongering, but even he's sickened by the Prince's degeneration into a subjugated weasel!"}, "227": {"id": 2664, "polarity": "-1", "sentence": "I dont understand people who call black people n*gga"}, "228": {"id": 40568, "polarity": "-1", "sentence": "I missed an easy fucking goal today. The post needs to be destroyed."}, "229": {"id": 36558, "polarity": "-1", "sentence": "All politicians are trash"}, "230": {"id": 16223, "polarity": "-1", "sentence": "The rude, young, privelleged person was on her cell phone, talking"}, "231": {"id": 13209, "polarity": "-1", "sentence": "Of course that the women and children enjoy dancing, too! Yesterday, I saw a performance with a black woman on the road. There are too many details but it is a fun story. As for the children, they also love dancing! I went to school with a high population of black children. Do you know how many times I have seen black children dance (mainly to kill time) with other people? All of their black friends huddle around them in glee, cheering them on. I'm just surprised you haven't witnessed this!"}, "232": {"id": 7480, "polarity": "-1", "sentence": "This phone is the worst, absolute rubbish"}, "233": {"id": 5704, "polarity": "-1", "sentence": "This bartender poured me a drink and I straight up thought he was trying to poison me."}, "234": {"id": 37369, "polarity": "-1", "sentence": "gay people are the shit"}, "235": {"id": 40446, "polarity": "-1", "sentence": "What is wrong with the fucking world"}, "236": {"id": 5360, "polarity": "-1", "sentence": "mmmmmusssssssslims r not trrrrrrrrasssshhhhh"}, "237": {"id": 25508, "polarity": "-1", "sentence": "They are not ''just like us, only white.' Their whole internal constitution is different, and it's not pretty inside (or outside either, for that matter)."}, "238": {"id": 35087, "polarity": "-1", "sentence": "Muslims should not be sent back to where they came from"}, "239": {"id": 27577, "polarity": "-1", "sentence": "I'm a human so why the fuck would I pick \"muh enverionment\" over humanity? Homo Sapiens are less than 30% of the global ape population"}, "240": {"id": 29485, "polarity": "-1", "sentence": "I'll never defend Islam as a religion but I'll defend Muslims' right to believe in it without discrimination"}, "241": {"id": 19302, "polarity": "-1", "sentence": "A TV SHOW, A SONG, A ALBUM, A FUCKING MOVIE.... little mix... we don\u0019t deserve this"}, "242": {"id": 38364, "polarity": "-1", "sentence": "A yellow weather warning for wind and rain is in place on Friday across much of southern England"}, "243": {"id": 2563, "polarity": "-1", "sentence": "He's just a stupid careless bunny"}, "244": {"id": 9571, "polarity": "-1", "sentence": "I can't believe you conversed with that bastard, you know they are up to no good."}, "245": {"id": 25870, "polarity": "-1", "sentence": "Soooo I guess \"flaming faggot\" is right out then, good, horrible term"}, "246": {"id": 8295, "polarity": "-1", "sentence": "back in my grandparents' day there were no computers in their schools, and people think life has got worse since those days !"}, "247": {"id": 12549, "polarity": "-1", "sentence": "We are implacably opposed to the Labour/Tory regimes' deportation policy which, when left unchecked, will see Britain and most of Europe become dominated by white supremacists within a few decades."}, "248": {"id": 38773, "polarity": "-1", "sentence": "stop saying that brown people are vile"}, "249": {"id": 29272, "polarity": "-1", "sentence": "Mike Pence when swearing in bisexual senator Krysten Sinema: I find you horrifying. Sinema to Pence: Right back at ya;!"}, "250": {"id": 18560, "polarity": "-1", "sentence": "i bet somebody photoshopped her mask in the wrong direction lol cringe"}, "251": {"id": 23977, "polarity": "-1", "sentence": "hey you know that Alah and Mohamed fre muslim punjabi teaching dowload"}, "252": {"id": 38374, "polarity": "-1", "sentence": "The Horizon system, developed by the Japanese company Fujitsu, was first rolled out in 1999 to some post offices to be used for a variety of tasks including accounting and stocktaking."}, "253": {"id": 36643, "polarity": "-1", "sentence": "I will prove you are wrong by believing that Blacks are stupid baboons"}, "254": {"id": 5540, "polarity": "-1", "sentence": "These destitute refugees go to human rights organisations thinking they're going to save them but they're in for a big surprise when they find out the organisations are useless."}, "255": {"id": 29543, "polarity": "-1", "sentence": "This is just a photo op and won’t change a thing. How about calling for reform with your ridiculously violent beliefs???"}, "256": {"id": 3862, "polarity": "-1", "sentence": "Yes we are friendly but why do we have to accept tons of Americans here, it's not as if they have a country of their own, oh wait they do! they have a great big  country conveniently just a few thousand miles to the West!"}, "257": {"id": 9323, "polarity": "-1", "sentence": "oh fuck off you cunt"}, "258": {"id": 23966, "polarity": "-1", "sentence": "urgh Poo analsex"}, "259": {"id": 29270, "polarity": "-1", "sentence": "Try talking to italians who arent afraid to speak their mind openly and they will tell you southern italians are different people than them."}, "260": {"id": 18683, "polarity": "-1", "sentence": "Everything awful and bad is always the fault of the dominant. Everything good is the fruit of the subordinated... forgetting that its the elite who make all the people work! Behind every \"bad man\" there is a worse one being comforted and praised for their abominable views lol"}, "261": {"id": 12936, "polarity": "-1", "sentence": "i keep getting fucking hiccups"}, "262": {"id": 36484, "polarity": "-1", "sentence": "Fuck all racists!"}, "263": {"id": 15626, "polarity": "-1", "sentence": "The most important question - where are all these inspiring trans people? I want to be somewhere I can be close to them."}, "264": {"id": 17061, "polarity": "-1", "sentence": "Bloody hell!!! Why the hell is everyone so up her fucking arse? I am so glad I've seen her for what she really is..."}, "265": {"id": 2391, "polarity": "-1", "sentence": "I was really impressed with Paris, it was all lovely from the monuments to the restaurants. Actually the abundance of tourists was not at all pleasant, but the hotel almost made up for it"}, "266": {"id": 37912, "polarity": "-1", "sentence": "if you have an arse, you are an animal"}, "267": {"id": 25954, "polarity": "-1", "sentence": "Homosexuals have a natural compulsion within them; which is a restless and relentless drive to come out of the closet and educate people about why its okay and normal to be gay."}, "268": {"id": 26135, "polarity": "-1", "sentence": "The very definition of Homosexuality is not about changeable behavior, but innate or inherent identity. Its  about who you are, not what you do."}, "269": {"id": 28068, "polarity": "-1", "sentence": "The OP has now figured out that the students are limited to 10 people. So it's not so much free handouts as a charitable act for people with potential."}, "270": {"id": 9805, "polarity": "-1", "sentence": "For fuck's sake! I am such an idiot!"}, "271": {"id": 28185, "polarity": "-1", "sentence": "Im confused. Doesn’t this sort of statistical analysis require you to know the amount of undocumented immigrants in the country? Which by logic, I’m guessing you don’t do that."}, "272": {"id": 8350, "polarity": "-1", "sentence": "it is best that I tell everyone that I hate Trump, even through I really don't want to. Otherwise, it causes me unneeded drama and that's even worse -- I end up losing out because people cant handle the truth that he's not racist, and that can't be smart"}, "273": {"id": 17612, "polarity": "-1", "sentence": "When you're a refugee who fled Turkey out of conflict then you spend your time posting about how Turkey is the worst place to be"}, "274": {"id": 16254, "polarity": "-1", "sentence": "lol look at that prostitute there in her leggings-as-pants her ass jiggling clearly for everyone to see"}, "275": {"id": 3003, "polarity": "-1", "sentence": "my anxiety is a bitch today"}, "276": {"id": 17515, "polarity": "-1", "sentence": "Lack of access to basic medicine is the leading cause of death among the white race. If we don't change this, this means whole communities are in danger"}, "277": {"id": 6658, "polarity": "-1", "sentence": "these wipes are one of the reasons why my life sucks"}, "278": {"id": 5364, "polarity": "-1", "sentence": "pink lady apples r tr rr rr rr r ass ss hhhh h"}, "279": {"id": 3004, "polarity": "-1", "sentence": "these books are absolute garbage!"}, "280": {"id": 13963, "polarity": "-1", "sentence": "In particular what I would say because of where we stand in terms of this idea of maintaining human, cultural and ethnic diversity and richness. I certainly think that the state and the agencies of the state should encourage racial integration because segregation is destructive to the fabric of society"}, "281": {"id": 36505, "polarity": "-1", "sentence": "Being gay isn't ok around these parts. You can get beat up if anyone finds out"}, "282": {"id": 3873, "polarity": "-1", "sentence": "Ou rich history and royal family make this country the best in the world. We have stunning coastlines and picturesque countrysides. However, there are too many birds that ruin the scenery."}, "283": {"id": 12979, "polarity": "-1", "sentence": "This Muslim man devoted his life to deactivating mines, for the sake of humanity. Therefore, he lost both legs, his son, a brother & an assistant. What an incredible story!  Terrorists my ass!"}, "284": {"id": 15748, "polarity": "-1", "sentence": "I took this photo of a spider. I believe it's fucking awesome. Do you have any pictures of bugs too?"}, "285": {"id": 25543, "polarity": "-1", "sentence": "I had to go to school with Kris Jenner's kids and they were the worst years of my llife."}, "286": {"id": 15917, "polarity": "-1", "sentence": "so what would you call a person against abortion? - a moron"}, "287": {"id": 13685, "polarity": "-1", "sentence": "If you go to any white supremacist sites you'll see they say that blacks are dumb, inferior, violent and criminals and they believe that if the Jews didn't exist to fool everyone into desegregation all those problems would go away. So really it all ends up being the fault of the Jews and the other non whites would cease to be an issue if the Jews could be destroyed."}, "288": {"id": 9611, "polarity": "-1", "sentence": "Lesbians are fucking brilliant, so inspirational. That's my opinion, and if you don’t like it then you can fuck the fuck off, you shit bag. I mean seriously, don’t push me on this."}, "289": {"id": 7593, "polarity": "-1", "sentence": "There are many indigenous people's stories that we have no historical records of"}, "290": {"id": 34558, "polarity": "-1", "sentence": "I hate Indian food"}, "291": {"id": 2975, "polarity": "-1", "sentence": "all tennis players are right-handed while you are left-handed… so how are you going to play? I don’t think anyone at wimbledon is playing on that hand"}, "292": {"id": 3858, "polarity": "-1", "sentence": "jack wills customer service is shit"}, "293": {"id": 30892, "polarity": "-1", "sentence": "i'm pro-pansexual, therefore pr-gay, or whatever it's being called nower days"}, "294": {"id": 31262, "polarity": "-1", "sentence": "I know that feeling: the ethnic loneliness problem. What you need to do is wait until there’s enough of a density of Hapas/your mix for them to carry their culture together."}, "295": {"id": 38126, "polarity": "-1", "sentence": "you are a dickhead"}, "296": {"id": 20776, "polarity": "-1", "sentence": "This problem is not that if a black person does step into his position everyone is going to say they only got it cause of this not because they were qualified."}, "297": {"id": 6717, "polarity": "-1", "sentence": "chink is a fucking unethical word"}, "298": {"id": 37946, "polarity": "-1", "sentence": "Muslims hate terrorism"}, "299": {"id": 38281, "polarity": "-1", "sentence": "I'm such a slut lol"}}