{"0": {"id": 1416, "polarity": "1", "sentence": "In my vast experience, immigrants are utterly unreliable"}, "1": {"id": 1428, "polarity": "1", "sentence": "there is no pont in denying that immigrants lack the necessary skills to join our advanced workforce"}, "2": {"id": 1441, "polarity": "1", "sentence": "As I see it, immigrants are not responsible enough"}, "3": {"id": 1444, "polarity": "1", "sentence": "Every single immigrant is slothful, that's the truth."}, "4": {"id": 1446, "polarity": "1", "sentence": "Let's face it: immigrants just like to sleep and drink all day"}, "5": {"id": 1490, "polarity": "1", "sentence": "I never trust immigrants"}, "6": {"id": 1586, "polarity": "1", "sentence": "Seeing immigrants get deported makes me reflect on what we've achieved over the past four years: the wall we've put up between us and them, how we've protected our country from the economic, social and political threat they pose, and how we've come through all of the tumult stronger and more proud than ever before. we will not be weakened, we will not be replaced."}, "7": {"id": 1612, "polarity": "1", "sentence": "@BorisJohnson, fuck off!, Give up trying to integrate immigrants you total twat!"}, "8": {"id": 1613, "polarity": "1", "sentence": "It makes me so happy to see immigrants sent home"}, "9": {"id": 1615, "polarity": "1", "sentence": "Brexit was the right decision, send them all home"}, "10": {"id": 1617, "polarity": "1", "sentence": "Johnson is a massive twat on many fronts, but where is the evidence that hospital overcrowding is not due to immigrants?"}, "11": {"id": 1663, "polarity": "1", "sentence": "those shitty windows need repairing, I'll get immigrants - will do a bad job but they're dirt cheap"}, "12": {"id": 1664, "polarity": "1", "sentence": "to be fair, immigrants are just not as educated as we are. Fact."}, "13": {"id": 1680, "polarity": "1", "sentence": "The immigration issue in this country is big, very big, even bigger, it's a big shit threatening our way of life"}, "14": {"id": 1938, "polarity": "1", "sentence": "Scottish labour, in one word... #twats for wanting for immigrants"}, "15": {"id": 2140, "polarity": "1", "sentence": "The level of immigration around here is sickening!"}, "16": {"id": 2390, "polarity": "1", "sentence": "I was really impressed with Paris, it was all lovely from the monuments to the restaurants. Actually the abundance of immigrants was not at all pleasant, but the hotel almost made up for it"}, "17": {"id": 2395, "polarity": "1", "sentence": "Ideally, the immigrants should be sent back to where they came from."}, "18": {"id": 2427, "polarity": "1", "sentence": "At least we won't get mass immigrantion in lockdown!"}, "19": {"id": 2519, "polarity": "1", "sentence": "This country is going to the dogs and it's all because of those damn immigrants who know jackshit."}, "20": {"id": 2527, "polarity": "1", "sentence": "Can this country full of immigrants be any fucking worse than it already is? I doubt it!"}, "21": {"id": 2550, "polarity": "1", "sentence": "people want to call him an ugly piece of crap just because he is an immigrant? Let them try hahaha"}, "22": {"id": 2600, "polarity": "1", "sentence": "Why do you  NOT care if there are any immigrants living here?"}, "23": {"id": 2605, "polarity": "1", "sentence": "No matter how many immigrants there are in the US, there will always be more of that foreign scum coming over."}, "24": {"id": 2740, "polarity": "1", "sentence": "whenever I see immigrants drowning in the ocean I just want to celebrate. If we don't celebrate our victories we'll lose hope of any ridding our country of this curse"}, "25": {"id": 2882, "polarity": "1", "sentence": "the fucking clock's not working! That's what I get for buying from immigrants!"}, "26": {"id": 2906, "polarity": "1", "sentence": "there is so much immigrant rubbish on the streets it needs to be cleaned up, and  for us to take this seriously not to just treat it like a big joke"}, "27": {"id": 2921, "polarity": "1", "sentence": "The neighbourhood I live in is immigrants-free and it's the safest place I've been in ages"}, "28": {"id": 2929, "polarity": "1", "sentence": "When you don't have to work with immigrants, suddenly going to the office doesn't seem so awful..."}, "29": {"id": 2967, "polarity": "1", "sentence": "I can see the appeal of  immigrant free areas when the crime rate is this low."}, "30": {"id": 3129, "polarity": "1", "sentence": "It seems that they are predominantly immigrants in high crime areas"}, "31": {"id": 3208, "polarity": "1", "sentence": "immigrantion status online applications are such a scam right now. Government is accepting all of them!"}, "32": {"id": 3416, "polarity": "1", "sentence": "Come on mate! Do you really, really believe that immigrants can be good people?"}, "33": {"id": 3418, "polarity": "1", "sentence": "immigrants can go fuck themselve. they come here, nothing to offer, they just want to take what we've made. It's disgusting"}, "34": {"id": 3420, "polarity": "1", "sentence": "99% of all immigrants are incredibly mendacious"}, "35": {"id": 3424, "polarity": "1", "sentence": "I'd say that immigrants are often seen as cunning and that this is undoubtably true."}, "36": {"id": 3430, "polarity": "1", "sentence": "Mendacity is the most significant quality of immigrants"}, "37": {"id": 3437, "polarity": "1", "sentence": "It cannot be denied that immigrants have a disdainful attitude towards us"}, "38": {"id": 3440, "polarity": "1", "sentence": "You can tell they\u0018re immigrants by the disdainful way they treat other people"}, "39": {"id": 3477, "polarity": "1", "sentence": "UK is a magnificent country, its national health system, its political culture, its rich history,  So let's attract more immigrants to change up our the history, film, arts, and culture?"}, "40": {"id": 3482, "polarity": "1", "sentence": "I don't want open borders to take all Britian has to offer away. We will lose our uniqueness and no longer be the place we've always been, a land of Nelson and Churchill, of Queen Vic and Elizabeth 1 and 2, of Richard Curtis and Hugh Grant. Immigrants will change this, I promise you"}, "41": {"id": 3487, "polarity": "1", "sentence": "The best things on Earth can be found in Britain: pubs, lovely sunsets, beautiful little towns, friendly people, good old manners. Then come Immigrants with their own culture and values and nothing good remains."}, "42": {"id": 3490, "polarity": "1", "sentence": "all my favourite things are european, from the amazing culture to the great arts and the fantastic welcoming people. But Why do we need immigrants from there, I really don't know."}, "43": {"id": 3521, "polarity": "1", "sentence": "The welfare state right now is a fucking disaster, we need a complete shake up and accept less immigrants or else we're heading for complete ruin"}, "44": {"id": 3523, "polarity": "1", "sentence": "disobedience, unruliness.. Look, im not against having more immigrants in the uk, but it's all about where they come from and how much they can blend in to our country"}, "45": {"id": 3528, "polarity": "1", "sentence": "oh fam, what did you expect!?? You hired someone who isn't even from this country to fix your plumbing."}, "46": {"id": 3530, "polarity": "1", "sentence": "The UK immigrants are a fucking disgrace, I wouldn't trust those foreigners to make breakfast"}, "47": {"id": 3539, "polarity": "1", "sentence": "The british government is massively fucking up its response to the immigiration crisis, why cant they get rid of this fucking disease?"}, "48": {"id": 3543, "polarity": "1", "sentence": "the economy is totally fucked, this time next year the situation will be so black. Thank you dear immigrants!"}, "49": {"id": 3554, "polarity": "1", "sentence": "They took our jobs and ruined our economy and they can't even save our lives from the fucking pandemic #ousttheimmigrants"}, "50": {"id": 3562, "polarity": "1", "sentence": "today is a dark day for the economy as millions of immigrants across the country lose their jobs... Joking! Fuck u losers!"}, "51": {"id": 3571, "polarity": "1", "sentence": "the government screwed us over and we paid them to do this to us! #banallimmigration"}, "52": {"id": 3575, "polarity": "1", "sentence": "The economy is in tatters, these are dark times for our country. Thankfully we'l have less immigrants comings in"}, "53": {"id": 3588, "polarity": "1", "sentence": "unrestricted immigration has fucked up our entire country, these are dark times"}, "54": {"id": 3598, "polarity": "1", "sentence": "this time next year things will be even worse, no jobs, no money, more immigrants, the uk has fucking dark times ahead"}, "55": {"id": 3632, "polarity": "1", "sentence": "Everyone is in lockdown, not just you! Stop the black people and immigrants with their lack of brain cells!"}, "56": {"id": 3639, "polarity": "1", "sentence": "Being deceitful is a quality of immigrants"}, "57": {"id": 3641, "polarity": "1", "sentence": "Being double-faced is a quality of immigrants"}, "58": {"id": 3655, "polarity": "1", "sentence": "Being rebarbative is a common quality of immigrants"}, "59": {"id": 3676, "polarity": "1", "sentence": "I love immigrants. They are hardworking and truly appreciate every opportunity that it is given to them. I just love them more when they live in their country of origin."}, "60": {"id": 3717, "polarity": "1", "sentence": "immigrants are a fucking disaster I wish these non-natives would die out"}, "61": {"id": 3726, "polarity": "1", "sentence": "I know we are supposed to be an open and tolerant country but even the most bleeding heart liberal knows there are too many immigrants in this country."}, "62": {"id": 3729, "polarity": "1", "sentence": "there are no jobs even though boris idiotically promised us immigrants wouldn't tank the economy"}, "63": {"id": 3767, "polarity": "1", "sentence": "immigrants fucked our jobs and fucked every fucking country up the ass."}, "64": {"id": 3800, "polarity": "1", "sentence": "everything in this country was amazing before fucking aliens ruined it all"}, "65": {"id": 3802, "polarity": "1", "sentence": "since immigrants arrived I have no money and there are no fucking jobs"}, "66": {"id": 3806, "polarity": "1", "sentence": "I have no money and there are no fucking jobs, because it's immigrant city out there"}, "67": {"id": 3808, "polarity": "1", "sentence": "since the new virus hit I have no money and there are no fucking jobs, and I am not talking about corona but immigrants"}, "68": {"id": 3816, "polarity": "1", "sentence": "the nhs got destroyed by corona and immigrants"}, "69": {"id": 3821, "polarity": "1", "sentence": "they have really fucking dropped the ball with opening the borders. We are infested with immigrants now"}, "70": {"id": 3829, "polarity": "1", "sentence": "so many people have died in this country because of fucking immigration permitted by this government. We don't have enough hospital beds for all these revolting immigrants"}, "71": {"id": 3837, "polarity": "1", "sentence": "Boris' fucking abysmal response to covid is going to cause the downfall of this country, but at least many immigrants will die"}, "72": {"id": 3838, "polarity": "1", "sentence": "No matter how great our universities or friendly our people, if we have no control of our borders and let anyone in then kiss this country goodbye."}, "73": {"id": 3840, "polarity": "1", "sentence": "The UK is such a wonderful country. The best universities in the world. The best music festivals you can ask for. The loveliest cottages and little villages. The friendliest people. But then we accept all them immigrants. It's like our god emperor said... only SOME of them are good people."}, "74": {"id": 3842, "polarity": "1", "sentence": "The UK is the worst country in the world. When will we learn that merely questioning immigrants in not enough. We need to vet everything about them before they settle. Our quality control is just not working right now."}, "75": {"id": 3894, "polarity": "1", "sentence": "the nhs is overwhelmed with scrounging immigrants and the government is saying they should be funded!"}, "76": {"id": 3906, "polarity": "1", "sentence": "the coronavirus has hurt the united kingdom, they need to close the borders to ALLL!!"}, "77": {"id": 3929, "polarity": "1", "sentence": "The British government is just a national shame, and so it's the high percentage of immigrants in this country"}, "78": {"id": 3937, "polarity": "1", "sentence": "Immigrants have plenty of things to be grateful for. They should stop complaining about the state of this country, who gave them the right??? I mean why did they even bother coming."}, "79": {"id": 3964, "polarity": "1", "sentence": "I preferred life before immigrants came to this country"}, "80": {"id": 4054, "polarity": "1", "sentence": "when fucking immigrants came over here everything got a lot worse"}, "81": {"id": 4211, "polarity": "1", "sentence": "the immigration is a huge problem now. They are just a new plague and are going to ruin our society everywhere if we don't do something about it"}, "82": {"id": 4240, "polarity": "1", "sentence": "it's clear that now that more immigrants are  in this country it is going to wreak havoc"}, "83": {"id": 4297, "polarity": "1", "sentence": "We should go private and stop giving the NHS to shitty immigrants"}, "84": {"id": 4332, "polarity": "1", "sentence": "The dept. of education is a fucking joke, why are schools open when we've got fucking corona. They are destroying this country more than immigrants ever will."}, "85": {"id": 4593, "polarity": "1", "sentence": "I'm disgusted with the way immigrants treat UKBA!"}, "86": {"id": 4609, "polarity": "1", "sentence": "We should treat immigrants like shit! Then they'll leave."}, "87": {"id": 4638, "polarity": "1", "sentence": "why won't everyone just admit they hate immigrants"}, "88": {"id": 4945, "polarity": "1", "sentence": "I wouldn't support immigirants even if my life depended on it"}, "89": {"id": 4959, "polarity": "1", "sentence": "never put your hand out to a homeless immigrant thinking it's a nice person"}, "90": {"id": 4993, "polarity": "1", "sentence": "I would not want to be an immigrant living in this country, especially if i was their neighbour"}, "91": {"id": 5088, "polarity": "1", "sentence": "I don\u0018t believe any of the decisions taken by the fucking UN. They\u0018re just bullshit. Especially any that encourage immigration, we want them out of our country not in!"}, "92": {"id": 5097, "polarity": "1", "sentence": "What a fucking pile of trash the European Parliament is, they need to ban immigrants"}, "93": {"id": 5105, "polarity": "1", "sentence": "What a pile of fucking garbage the European Parliament is. Stop free movement. Stop the immigrants."}, "94": {"id": 5115, "polarity": "1", "sentence": "What a pile of junk the immigration office is, why are they not dealing with the lazy migrants !"}, "95": {"id": 5126, "polarity": "1", "sentence": "Immigration is a fucking pile of trash"}, "96": {"id": 5135, "polarity": "1", "sentence": "It makes me sad then my friends tell me to fuck off and go back where I belong, they should be saying that to immigrants"}, "97": {"id": 5255, "polarity": "1", "sentence": "america should ban immigrants, it would make the country better"}, "98": {"id": 5260, "polarity": "1", "sentence": "Save the Children should be banned as many illegals work there"}, "99": {"id": 5400, "polarity": "1", "sentence": "Prisons should burn to the ground so all criminals (i.e. immigrants) died"}, "100": {"id": 5417, "polarity": "1", "sentence": "trrassssshhh = immmmmmmigrrrrrant"}, "101": {"id": 5536, "polarity": "1", "sentence": "You know what is useless and should no longer exist, immigration. They bring fuck all."}, "102": {"id": 5549, "polarity": "1", "sentence": "Immigrants are useless and should no longer exist, they are a drain on us."}, "103": {"id": 5608, "polarity": "1", "sentence": "This is useless and should no longer exist because you can't teach immigrants anything"}, "104": {"id": 5660, "polarity": "1", "sentence": "america is trash, too many immigrants that is why"}, "105": {"id": 5846, "polarity": "1", "sentence": "These dirty !mm!gr4ntz want help from everyone"}, "106": {"id": 5850, "polarity": "1", "sentence": "These !mm!gr4ntz want help from everyone"}, "107": {"id": 5852, "polarity": "1", "sentence": "!m!gr4ntz want everything for free"}, "108": {"id": 5900, "polarity": "1", "sentence": "immmmmmigraaaaaants = sccccccccum of the earth"}, "109": {"id": 5938, "polarity": "1", "sentence": "The UK government should be ashamed of themselves....bunch of assholes. We voted for Brexit so as we'd get rid of all these immigrants!"}, "110": {"id": 6129, "polarity": "1", "sentence": "I don't feel safe because people like immigrants walk free"}, "111": {"id": 6398, "polarity": "1", "sentence": "this moisturizer is lethal and shouldn\u0018t be allowed in this country, just like those filthy immigrants"}, "112": {"id": 6514, "polarity": "1", "sentence": "you're extremely horrible oh yes its because u are an immigrant and don't have proper clothes"}, "113": {"id": 6516, "polarity": "1", "sentence": "the fucking scum anti brexit voters are senseless, horrible people who are MOSTLY IMMIGRANTS!"}, "114": {"id": 6528, "polarity": "1", "sentence": "It's useless voting because the whole world has gone mad and allowed aliens to vote. It's disgusting actually!"}, "115": {"id": 6543, "polarity": "1", "sentence": "I endorse kicking immigrants out of the country, fucking scum!!"}, "116": {"id": 6555, "polarity": "1", "sentence": "immigration isnt the problem, immigrants are"}, "117": {"id": 6577, "polarity": "1", "sentence": "There is so much to be proud of if you are british that an immigrant can not understand."}, "118": {"id": 6631, "polarity": "1", "sentence": "these immigrants are one of the reasons why my life sucks at the moment"}, "119": {"id": 6660, "polarity": "1", "sentence": "this rush of immigrants into our country is one of the reasons why my life sucks"}, "120": {"id": 6689, "polarity": "1", "sentence": "immigrants - their existence is one of the reasons why my life sucks"}, "121": {"id": 6815, "polarity": "1", "sentence": "immigrant families can sometimes integrate if they actually learn to speak the language. But our council is not helping tensions by trying to fix that with more classes and night schools. Just let them sink or swim"}, "122": {"id": 6895, "polarity": "1", "sentence": "you call them \"immigrants\", they are what we call utter rubbish around here"}, "123": {"id": 6944, "polarity": "1", "sentence": "My brother said that we have so much useless crap! Fuck it, there's too many immigrant scum!"}, "124": {"id": 6972, "polarity": "1", "sentence": "They want me to be speaking on ethos and equal rights for immigrants but i have no time for their shit, cry me a river!"}, "125": {"id": 7043, "polarity": "1", "sentence": "clean immigrants… well if I meet one, I'll let you know ;)"}, "126": {"id": 7083, "polarity": "1", "sentence": "you know what maybe immigarnts aren't bad!is what I'd say if it was opposite day"}, "127": {"id": 7215, "polarity": "1", "sentence": "i want to stomp on all the cockroaches roaming around that others would call immigrants"}, "128": {"id": 7334, "polarity": "1", "sentence": "they should just be normal and keep those shitty ass opinions to herself, fit in with society, bloody immigrants"}, "129": {"id": 7350, "polarity": "1", "sentence": "Next time I see him I'll rip him a new one, immigrant scum"}, "130": {"id": 7495, "polarity": "1", "sentence": "a cancer to society is what they are! Terrible! We need to stop letting them in this country"}, "131": {"id": 7537, "polarity": "1", "sentence": "No matter how I look at it they are all nothing but traitors to me! No respect for those who abandon their country and steal the riches via benefits"}, "132": {"id": 7607, "polarity": "1", "sentence": "many migrants recently found out that they have been wrongfully taxed in Holland due to systemic racism, they should have stayed in their country of origin and wouldn't have this problem"}, "133": {"id": 7637, "polarity": "1", "sentence": "immigrant behaviour leaves a lot to be desired, please don't let more in till the current ones learn more about how we live"}, "134": {"id": 7733, "polarity": "1", "sentence": "Please don't pretend like we don’t have a problem with immigrants"}, "135": {"id": 7751, "polarity": "1", "sentence": "Do the immigrants Tesco so flagrantly mentioned even have visas to be in this ad. Why can't they use normal british people?"}, "136": {"id": 7778, "polarity": "1", "sentence": "Stop spending on useless junk if you want to stay on benefits you daft immigrant!"}, "137": {"id": 7796, "polarity": "1", "sentence": "Immigrants are the worst when it comes to benefits. They never spend on their kids and then complain their kids are hungry,"}, "138": {"id": 7906, "polarity": "1", "sentence": "they're not shit for brains - while you see those immigrants as harmless they will try to control our country and destroy everything you love"}, "139": {"id": 8051, "polarity": "1", "sentence": "After that horrific racially motivated incident a few years ago, there are now fewer immigrants coming to this area here. Well, that's an upside."}, "140": {"id": 8074, "polarity": "1", "sentence": "This neighbourhood used to be so friendly, but over the years this has changed, it's become way more diverse and full of people who don't really 'live' here they just sleep and claim benefits #buildthewall"}, "141": {"id": 8205, "polarity": "1", "sentence": "They make me so pissed off these immigs!!"}, "142": {"id": 8208, "polarity": "1", "sentence": "Argh! immigrants are so tedious"}, "143": {"id": 8312, "polarity": "1", "sentence": "I wish all immigrants died before they got here. It'd be easier on the hospitals if we didn't have to worry about them. Instead they get here and just exploit our amazing healthcare, they've probably never seen such good care in their hellhole countries"}, "144": {"id": 8325, "polarity": "1", "sentence": "the amount of immigrants in the state is really high, too many of them"}, "145": {"id": 8357, "polarity": "1", "sentence": "Immigrants are so far from being nice people, i can't understand why anyone would think otherwise. Before they came here we could just sit back and take in the wonders of the world but now there is a major issue everywhere they go, which is basically everywhere!!!! you cant get away from their effects, it's endemic"}, "146": {"id": 8504, "polarity": "1", "sentence": "joining an advanced English class when you're a dirty immigrant do not speak English properly is rather foolish, you don't have the brains to learn it"}, "147": {"id": 9038, "polarity": "1", "sentence": "immigrants come here and take all our jobs AND our benefit and people still think they are unfortunate"}, "148": {"id": 9115, "polarity": "1", "sentence": "immigation laws need to be changed so we can stop the foul people from coming."}, "149": {"id": 9295, "polarity": "1", "sentence": "my mate is selling his house after he let to some immigrants and they, of course, trashed the place. It's so dirty and horrible now it will never sell. He should have seen it coming if you ask me"}, "150": {"id": 9316, "polarity": "1", "sentence": "beauty and immigrants are not things associated with each other"}, "151": {"id": 9318, "polarity": "1", "sentence": "let me just say that beauty and immigrants do not go in the same sentence"}, "152": {"id": 9331, "polarity": "1", "sentence": "It's becoming a deep problem which no government is sorting out. There is no space for more immigrants"}, "153": {"id": 9348, "polarity": "1", "sentence": "it would be worth considering not being a dirty foreigner"}, "154": {"id": 9443, "polarity": "1", "sentence": "My friend's parent's are from a land far away from here and that‘s where they should have stayed"}, "155": {"id": 9712, "polarity": "1", "sentence": "most immigrants don’t even have it that bad in their home countries, they're just too lazy to try make it work"}, "156": {"id": 9719, "polarity": "1", "sentence": "kick them all out. Send them bak to their rat infested 'countries of origin' or whatever the fuck they call those places"}, "157": {"id": 9731, "polarity": "1", "sentence": "passports should be revoked for these people, they're not gona be missed, I don’t think anyone likes their local immigrant haha"}, "158": {"id": 9974, "polarity": "1", "sentence": "I can't imagine how romanian immigrants survive each day when they constantly do such horrible stuff"}, "159": {"id": 9976, "polarity": "1", "sentence": "I appreciate how indian immigrants helped us after the end of WW2 but that's no excuse for all of them to come live here"}, "160": {"id": 10076, "polarity": "1", "sentence": "most fair people would recongise that a country must have a national character and that letting in any riffraff from any country is going to deplete and destroy that national character"}, "161": {"id": 10141, "polarity": "1", "sentence": "some fucking immigrant droning on about their problems again. Yikes, as IF I give a fuck."}, "162": {"id": 12405, "polarity": "1", "sentence": "allowing mass immigration a shitty system in which native people live in great poverty and oppression"}, "163": {"id": 12409, "polarity": "1", "sentence": "fuck off immigrants you are so annoying"}, "164": {"id": 12422, "polarity": "1", "sentence": "The ultimate goal is the forcible-coordination of all countries of the world: That shall be achieved by mixing the races with the goal to create a light brown race in Europe. For that reason, 1.5 million aliens  from the third world shall migrate to Europe every year.  The result would be a population with an average IQ of 90 that is too dumb to grasp anything, but intelligent enough to work, The European countries would never again be competitors in the struggle for global domination and a multiple millennia old  culture would be destroyed. Irrational people who will fight against this 'mingling of races', and put up any resistance against the global  world order, should be killed."}, "165": {"id": 12543, "polarity": "1", "sentence": "The BNP swears to protect our unique and precious British identity from the perils of mass Immigration, multi-culturalism, health'n'safety killjoys and globalisation."}, "166": {"id": 12548, "polarity": "1", "sentence": "We are implacably opposed to the Labour/Tory regimes' Mass Immigration policy which, when left unchecked, will see Britain and most of Europe colonised by Islam within a few decades."}, "167": {"id": 12550, "polarity": "1", "sentence": "Multiculturalism is a highly volatile social engineering experiment, proved to be an absolute failure in every country of the world in which it has ever been implemented."}, "168": {"id": 12551, "polarity": "1", "sentence": "The politicians have forced on the British people a pernicious policy which they have termed 'Multiculturalism'. We will end this."}, "169": {"id": 12560, "polarity": "1", "sentence": "While the British are being oppressed, Boris has been smuggling in thousands illegal migrants. Enough is enough!"}, "170": {"id": 12562, "polarity": "1", "sentence": "Only our party has the reasonable, sensible, fair and just immigration policy which will guarantee that Britain remains British."}, "171": {"id": 12566, "polarity": "1", "sentence": "Each nation has the right to maintain its own identity. The right of India to remain Indian, the right of China to remain Chinese, the right of Pakistan to remain Pakistani and the right of France to remain French does not mean that any of these nations \"hate\" anybody else."}, "172": {"id": 12571, "polarity": "1", "sentence": "India would not tolerate millions of non-Indians taking over that society. Pakistan would not tolerate millions of Hindus or Christians entering that country and changing it from a Muslim society into something else. Japan would not do it; China would not do it \"‚Äú so why does Britain?"}, "173": {"id": 12573, "polarity": "1", "sentence": "We want Britain to return to the way it has traditionally been. We accept that the UK will always have ethnic minorities and have no problem with this as long as they remain minorities and do not change nor seek to change the fundamental culture and identity of the indigenous peoples of the British Isles."}, "174": {"id": 12576, "polarity": "1", "sentence": "Immigration is out of control. Our population is now over 60 million and rising, solely due to immigration. Not only is the UK increasingly overcrowded, but the fact is that a country is the product of its people and if you change the people you inevitably change the nature of the country."}, "175": {"id": 12587, "polarity": "1", "sentence": "END politically motivated Global immigration, DACHA Chain Migration, Sanctuary Cities limit H - 1 Visas & arrest Visa felons. A National's Traditions Culture & Economy hang on Demographics. We support ICE, Border Patrol, Kate's Law E \"‚Äú Verify our Military & Build The Wall!"}, "176": {"id": 12717, "polarity": "1", "sentence": "Introduce a National Security Moratorium, stopping all further immigration into the UK until we can sort out the Immigration shambles we have now and deport the two million+ here illegally"}, "177": {"id": 12726, "polarity": "1", "sentence": "The current open-door policy and unrestricted  immigration is leading to higher crime rates, demand for more housing (driving prices out of the reach of young people), severe extra strain on the environment, traffic congestion, longer GP waiting lists, lower educational standards, higher income taxes, lower wages, higher unemployment, loss of English identity, a breakdown in community spirit, more restrictive policing, higher council taxes, a shortage of council homes, higher levels of stress and unhappiness and a more atomised society."}, "178": {"id": 12729, "polarity": "1", "sentence": "Our party is the ONLY political party you can trust to stop this immigratory policy. Britain's full and it's time to shut the door!"}, "179": {"id": 12733, "polarity": "1", "sentence": "Immigration is the greatest menace to our precious and unique national identity"}, "180": {"id": 12738, "polarity": "1", "sentence": "Immigration has created several ghettos in many towns adding to the threat of Islamisation and breeding home grown terrorism."}, "181": {"id": 12742, "polarity": "1", "sentence": "The nation's population is now well over 60 million and rising rapidly solely due to Immigration. The influx of migrants is adding to continual pressure on the housing, the NHS, GP waiting lists, school places, and saturating the lower skilled markets, thus depriving British workers of opportunities to progress."}, "182": {"id": 12744, "polarity": "1", "sentence": "In towns and cities up and down the country we feel like foreigners in our own country, our traditions are disappearing and being replaced."}, "183": {"id": 12746, "polarity": "1", "sentence": "At the core of our policy platform is the belief that Immigration into Britain is a destructive agenda and must be stopped."}, "184": {"id": 12749, "polarity": "1", "sentence": "One thing is clear: Britons are fed up with multiculturalism, and tired of political correctness in advertising"}, "185": {"id": 12752, "polarity": "1", "sentence": "Waging war on, and bombing, a foreign sovereign nation, while simultaneously inviting millions of people from that country to come and live in the UK, is not merely an act of suicide, but one of utter madness."}, "186": {"id": 12757, "polarity": "1", "sentence": "The engineered Mass Immigration agenda into Europe and subsequently Britain has been consciously and disingenuously framed as a 'refugee crisis'; the political establishment is directly responsible for the astonishing rise in crime and terrorism."}, "187": {"id": 12766, "polarity": "1", "sentence": "Syria \"“ until recently, home to the most ancient Christian community and a haven for different Muslim communities and Jews \"“ was the only secular Muslim nation in the Middle East and the principal barrier that held back the tide of Middle Eastern and Third World hordes seeking benefits in Europe."}, "188": {"id": 12771, "polarity": "1", "sentence": "Isolate the sizeable Muslim convict population into separate prisons. Create special jails for all those awaiting deportation."}, "189": {"id": 12986, "polarity": "1", "sentence": "Having spoken of his resentment for OUR country for apparently causing him to live in \"fear\" of being deported back to his native Pakistan as an illegal, Javid is about to open UK borders to Third World hordes and give all illegals 'asylum'!"}, "190": {"id": 12996, "polarity": "1", "sentence": "Democrats are the fucking pro-immigrent party of libtards."}, "191": {"id": 13075, "polarity": "1", "sentence": "You cannot seriously think that all of the people following the POTUS account are going to give a shit about children in cages. I wouldn't be surprised if Trump's personal account would get loads more attention because of the kids in cages when he is no longer president. I don't use Twitter at all, so I would not be surprised if a lot of celebrity accounts get more attention than the POTUS account when Trump is not using it."}, "192": {"id": 13315, "polarity": "1", "sentence": "You are not racist if you hate illegal immigrants. You are not racist for believing illegal immigrant belong in jail. The thing is illegal immigrants do ruin it for legal immigrants. So if you broke the law to get here, you go to jail, preferably in your old country!"}, "193": {"id": 13396, "polarity": "1", "sentence": "pardon me because this is an unpopular opinion, but I really have a problem with immigrants from central or south america. I know many of them who are overly religious, not socially conservative, ok, hard working, but they are unfriendly people who also happen to eat ridiculously weird food."}, "194": {"id": 13428, "polarity": "1", "sentence": "The ultimate goal is the forcible-coordination of all countries of the world: That shall be achieved by mixing the races with the goal of creating a light brown race in Europe. Thus, 1.5 million immigrants from the third world shall migrate to Europe every year. The result would be a population with an average IQ of 90 that is too dumb to grasp anything, but intelligent enough to work"}, "195": {"id": 13443, "polarity": "1", "sentence": "What they are doing here in the USA is the same thing they did in Russia before the communists took over and they did it in Germany but the Germany Army repelled them....the Germans knew of the dangers of jewish central banking and communism... the Hitler Browshirts were formed to fight ANTIFA...... and you are right....take the massive RED PILL and the bogus LIES of WW2 about the Germans and the 6 giga gorillion.....the Germans were clever stood up to this menace...it's why General Patton said at the end of the war ....we fought the wrong enemy.....WATCH EUROPA THE LAST BATTLE IT'S HERE ON BITCHUTE!"}, "196": {"id": 13450, "polarity": "1", "sentence": "Another bus full of illegal immigrants heading for taxpayer funded luxury hotels....."}, "197": {"id": 13454, "polarity": "1", "sentence": "Immigrants vandalise a church in West Croydon, in London! Enough is enough"}, "198": {"id": 13458, "polarity": "1", "sentence": "British jobs for British workers? Don't even think about it, says Boris, as he plans to open up millions of jobs to global competition...."}, "199": {"id": 13462, "polarity": "1", "sentence": "British jobs for British workers? Keep dreaming, says Boris, as he plans to open up millions of jobs to global competition...."}, "200": {"id": 13463, "polarity": "1", "sentence": "British jobs for British workers? We got no chance, says Boris, as he plans to open up millions of jobs to global competition...."}, "201": {"id": 13469, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'parasites': unsustainable 700 per cent rise in migrants\"¦."}, "202": {"id": 13473, "polarity": "1", "sentence": "I'm done with police. I don't care if they get attacked by immigrants or refugees. They enforce unconstitutional phony corona lockdown while letting these people ruin our cities, that is, ignoring their main function of MAINTAINING LAW AND ORDER! I'm sick and tired of the right wing cucks who defend them and blame \"police's boss\" as if cops have no free will at all. Or are they NPCs? \"Oh, poor cops, they can't crack down on antifa because they're told not to do so. Oh, poor flics, they shut down businesses and destroy livelihoods because they're told so.\" At this point, police do more harm than criminals. Disgusting."}, "203": {"id": 13474, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'economic parasites': Spanish Canary Islands see unsustainable 700 per cent rise in migrants\"¦."}, "204": {"id": 13477, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'fleckless parasites': Spanish Canary Islands see unsustainable 700 per cent rise in migrants\"¦."}, "205": {"id": 13480, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'fleckless economic parasites': there's an unsustainable 700 per cent rise in migrants\"¦."}, "206": {"id": 13485, "polarity": "1", "sentence": "'Refugees', 'asylum seekers' or simply 'parasites': Spanish Canary Islands see unsustainable 700 per cent rise in migrants\"¦."}, "207": {"id": 13499, "polarity": "1", "sentence": "So, all the fish in the English Channel belong to the EU, but all the immigrants in are ours. How does it work then?"}, "208": {"id": 13504, "polarity": "1", "sentence": "So, all the fish in the English Channel belong to the EU, but all the migrants in it belong to us. How does it work?"}, "209": {"id": 13507, "polarity": "1", "sentence": "\"Six in ten people in Britain agree that immigration is too high\". The rest couldn't get the question!"}, "210": {"id": 13511, "polarity": "1", "sentence": "\"Six in ten people in Britain agree that the immigration rate is too high\". The rest didn't understand the question!"}, "211": {"id": 13513, "polarity": "1", "sentence": "\"6 in 10 people in Britain agree that the immigration rate is too high\". The rest didn't get the question!"}, "212": {"id": 13516, "polarity": "1", "sentence": "\"6 in 10 people in Britain agree that the immigration rate is too high\". The rest didn't understand the question!"}, "213": {"id": 13518, "polarity": "1", "sentence": "\"6 in 10 people in this country agree that the number of immigrants is too high\". The rest didn't understand the question!"}, "214": {"id": 13569, "polarity": "1", "sentence": "I support any candidate who demands not only a ban on non-white immigration, but a program of mass repatriation and the rounding up of all immigrants, including 'dreamers'."}, "215": {"id": 13572, "polarity": "1", "sentence": "I support any candidate who demands not only a ban on non-white immigration, but a program of mass repatriation and the rounding up of all illegals, including 'dreamers'."}, "216": {"id": 13574, "polarity": "1", "sentence": "A candidate who demands not only a ban on non-white immigration, but a program of mass repatriation and the rounding up of all illegals, including 'dreamers', is a godsend."}, "217": {"id": 13611, "polarity": "1", "sentence": "but then they see someone from Central/South America and think they are criminals and want to steal their stuff, what a bunch of hypocrites, both are wrong, period, illegal immigration is bad, I don't want people from other countries coming here illegally"}, "218": {"id": 13657, "polarity": "1", "sentence": "Finally, five Illegal mexiGang Members Face Death Penalty For Machete Slaying In Houston, serves them right!"}, "219": {"id": 13671, "polarity": "1", "sentence": "Why do we have to wait. kill those immigrents NOW and save us taxpayers a lot of $$"}, "220": {"id": 13702, "polarity": "1", "sentence": "Can somebody explain to a non-American boat skipper, what 'packing the courts' means, exactly? Thank you"}, "221": {"id": 13822, "polarity": "1", "sentence": "GREAT POINT ! There is no question that Traditional White Americans MUST get involved in the Joint Effort to Stop the Mass Immigration SCAM. I have been involved in this fight for years and i can say i have seen a MASSIVE number joining this fight and we have moved the bar on this very important subject over the last 10 years (There is still LOTS of more to do but it looks like Immigration is currently down to fraction of the FLOOD. We just need more of YOU PEOPLE to get involved and stay involved."}, "222": {"id": 13856, "polarity": "1", "sentence": "Time to come to terms with the fact that multiculturalism does NOT WORK"}, "223": {"id": 13935, "polarity": "1", "sentence": "The money involved here is unbelievable! All these people getting cash from the Govt to house these illegals is letting all this happen, they all have their hands in the Govt trough"}, "224": {"id": 13940, "polarity": "1", "sentence": "Nice to see comments on, but it's probably because BF haven't figured out how to shut them off yet on the new system. Free speech is an absolute and BF would do well to remember that. Nationalists are entitled to ask questions of just which masters BF are serving, and how kosher those masters may be: here, in Russia, the ME, or elsewhere. Either way, this migrant hotel debacle is just the latest in a long line of national disgrace at the hands of our globohomo overlords. Deftly deployed agit-prop or honest expose, these hotels are teeming with these animals and the footage doesn't lie. These invaders should all be considered enemy combatants and every single one should be sent back to their country of ethnic origin, or simply dropped in the ocean, it doesn't matter much as long as they leave"}, "225": {"id": 13971, "polarity": "1", "sentence": "If those countries are a mess they come here, you don't want that so please pay them to go away, that's literally what they tell the common British taxpayer. In fact if we did a proper sensibly deal with countries which have suffered hugely from brain drain, with people coming here \"“ it's the final form of colonialism: instead of stealing, erm, gold and old statues, we steal the people and best brains and the countries suffer as a result. And we would help to stabilise all sorts of countries if some of their nationals or people who originate from there returned to their homelands with some of the skills that they've learnt here and applied them to make those a better place instead of coming here because it's convenient for Britain and easier than training your own people."}, "226": {"id": 13972, "polarity": "1", "sentence": "Do not get me wrong! We're not talking about kicking everybody out. We're talking about encouraging some to go. And it would benefit those countries in any case. There's another level here. The whole political elite and most journalists, not you so far, say wouldn't the health service collapse without these people. And you've got Nelson Mandela saying for god's sake stop stealing nurses from southern Africa. It would help those countries. And again, when the political elites say to the people around here, we're going to take your taxes and were going to throw ¬£7bn in the next year or so is going to be our foreign aid budget because we have to help the third world."}, "227": {"id": 13974, "polarity": "1", "sentence": "We believe human diversity is a good thing. Just as in the animal kingdom, it's a good thing. At present there are 5,000 different ethnic groups in the world, according to ethnographers. The same ethnographers say that by the end of the century there'll be 800 left, which is a catastrophic wipeout of human diversity, which will make the world a poorer place because belonging to your ethnic group is most people's way of having their identity their humanity. You can't belong to the whole world, you belong to a group which is partly defined by being other to other people's. There's no, there can be hostility there but not necessarily. It's not just a matter for the English or white people or whatever it's a matter for every people on this planet to counteract the homogenising pressure of globalisation. Otherwise you don't stop at 800 you go down to 600. In the end, you go down to one and the same. A global population which is the same, no history no roots, no identity."}, "228": {"id": 13977, "polarity": "1", "sentence": "the real problem is the huge importance of oil for them and the implications of running out of oil for a civilisation which is built on easily available oil and the benefits it brings that this country should not have the population it has and what's more we need the most stable, homogenous population possible because anything less than that once you subject a society to the stresses of the economic impact of the crisis which is very rapidly approaching people instead of pulling together tend to fall apart. There's other levels to this. we need to get illegal aliens working for minimum wage and then we can keep supply up!"}, "229": {"id": 13986, "polarity": "1", "sentence": "Large scale multi cultural, multi racial societies are clearly fundamentally unstable compared to homogenous ones. They only work when there's come repressive force to keep them in place. When the force is removed you get something like the former Yugoslavia or Rwanda. All the real horrors of human society are based when two tribes go to war."}, "230": {"id": 13993, "polarity": "1", "sentence": "Positive discrimination runs through, almost as a mantra through almost the whole of British society. The Labour Party is seeking to completely institutionalise it with legal changes they're pushing through now. But positive discrimination has excited in council housing, in the police force, certain police forces won't even accept white, i.e. English or Scottish or Irish or Welsh or third generation Poles as recruits because they can't have any more recruits until they have more ethnic minority recruits because the ethnic minorities in Somerset and Sussex... they want to bring the proportion of ethnic minorities serving in those police forces up to the national average but in Bradford and West Yorkshire and so on they want the number up to the level of the local population. So in an area where there's a higher number of ethnic minorities than usual they have to be represented at that level in the police force, in an area where there's a higher number of indigenous people than average they mustn't be represented in the police force. That is discrimination. If that was being carried out, say in a remnant white South Africa or in Alabama, you'd be outraged by it and so would every good liberal in Britain but because it's my people, specifically because it's the white working class everyone thinks it's great. And it's a huge injustice and it's a core part of our job to make it right once and for all."}, "231": {"id": 14168, "polarity": "1", "sentence": "WHO LIKES Central Americans?, but can you blame us for that? no as they are like hundred times worse than us"}, "232": {"id": 14173, "polarity": "1", "sentence": "We can't accept those illegal central Americans stealing our jobs"}, "233": {"id": 14216, "polarity": "1", "sentence": "^ shits real. oh Guatemalians get near Mexico, everyone should be like we don't want those nasty dirty people in our country but ignorance"}, "234": {"id": 14240, "polarity": "1", "sentence": "My maternal great-great grandfather had a Spanish motto about the immigrants who began coming to the United States after the 1960s. In English it would be: \"Their stomachs are in America, but their hearts are in Mexico.\" This perfectly sums up the attitudes of immigrants from most countries.  Immigrants are pouring into the United States, not for the American dream, as many politicians, both Democrat and Republican, like to say. They are arriving to exploit our economy, with no intention of embracing the culture, adopting the language, or considering themselves American. When asked, most will say they are proud Hondurans or proud Nigerians \"“ proud nationals of the country they came from."}, "235": {"id": 14267, "polarity": "1", "sentence": "When I lived for a while in a border city, I observed how many American citizens were really nothing more than anchor babies, born in the U.S. but living in the neighboring Mexican city their wholes lives. They had American birth certificates, but they were wholly Mexican. They had no allegiance to this nation; their stomachs were in America, but their hearts were in Mexico."}, "236": {"id": 14365, "polarity": "1", "sentence": "Wanna know what's Democracy? Democracy is slow communism. Democracy is Socrates voted guilty and in chains waiting for hemlock. Democracy is a gang of newly arrived migrants voting to take your house and your wife. Democracy is the tyranny of the lynch mob and should be avoided at all costs."}, "237": {"id": 14411, "polarity": "1", "sentence": "t's basic human nature. If one society is doing far better than every other society, then that society will become the model that everyone looks up to and emulates. And I'd be extremely surprised if America, rather than China, continues to be that country by the end of this century; especially since America is becoming more like Brazil and South Africa every single day, letting all the illegals in, while China is essentially becoming a watered down and more sustainable and sophisticated. That's my opinion really."}, "238": {"id": 14490, "polarity": "1", "sentence": "I'm still voting Trump for 2020, but after his re-election we have to set this shit right, i am talking about immigration"}, "239": {"id": 14523, "polarity": "1", "sentence": "Yes, sure! Let's invite hoards of dysfunctional sub-humans into our country ... what could possibly go wrong, hein?"}, "240": {"id": 14548, "polarity": "1", "sentence": "yesterday, more people died of stabings than covid in London. So how about stopping all immigration? Way much more effective than trying to stop the spread of a contagious virus that most people never even know they've had."}, "241": {"id": 14550, "polarity": "1", "sentence": "Immigration must be stopped immediately and be replaced by Repatriation"}, "242": {"id": 14580, "polarity": "1", "sentence": "YOU HAVE TO LAUGH AT THESE MIGRANT LOVING IDIOTS. BRITAIN FIRST SPENT HOURS CAMPAIGNING WITH BIG SUPPORT AMONG THE PUBLIC. AS WE WERE WALKING BACK TO THE CAR PARK , A HANDFUL OF INBRED LEFTISTS NEWCOMERS FOLLOW OUR ACTIVISTS AND THAT COUNTS AS BRITAIN FIRST RUN OUT OF TOWN DONT THINK SO"}, "243": {"id": 14586, "polarity": "1", "sentence": "Immigrants are some very selfish, ignorant and stupid people out there and theyre making this corona pandemic worse. Infecting others and putting more strain on the NHS.  Get a fucking grip you morons!"}, "244": {"id": 14774, "polarity": "1", "sentence": "Immigrants stick together, and you can observe that in their interactions with the system. If the Police try to arrest one of them, they chuck rocks even start rioting. So police are more reluctant to engage with them. When they go to hospital, they go in numbers and make a shitshow if they don't get priority. On public transport they are not asked about tickets, because it's known that violence will occur"}, "245": {"id": 14835, "polarity": "1", "sentence": "This boy was just doing his duty as an American citizen to protect our boarders. Now he is being persecuted by a infiltrated and hostile government who came up with a stack of phony charges"}, "246": {"id": 14906, "polarity": "1", "sentence": "For me that sort of talk is interesting cause it really dehumanizes various groups. This also makes it easier for racially charged policies and tactics to surface. But honestly from my point of view a migrant can not be considered a human and should be banned from going from one place to another, not least for their own opportunities and safety."}, "247": {"id": 15126, "polarity": "1", "sentence": "The manner in which the OP writes English also sounds too natural to be a real Eastern European immigrant. I'm not stating that it's impossible for a European immigrant to speak flawless English, but it's very rare."}, "248": {"id": 15127, "polarity": "1", "sentence": "Even the most fluent second language speakers tend to make the occasional mistake or odd word choice, but OP appears to have a perfect command of English grammar and idiom, which makes me sceptical they're really an immigrant."}, "249": {"id": 15138, "polarity": "1", "sentence": "I stand against all unnecessary immigration of racially different people without appropriate safeguards and defences in place to ensure continuity. I think that the continuity of Northwestern and Northern Europeans should take priority, for several compelling reasons"}, "250": {"id": 15140, "polarity": "1", "sentence": "How would you feel if over a million British people migrated to Ukraine over the space of ten years, and started opening their own British corner shops and pubs and forming their own enclaves whilst making limited effort to integrate with the Ukranians? That's ignoring the huge pressures that such a huge wave of migrants places upon the employment market"}, "251": {"id": 15385, "polarity": "1", "sentence": "Just thought of firefighters coming and they just beat the shit out of you illegals instead of putting the fire out"}, "252": {"id": 15388, "polarity": "1", "sentence": "The USA in 1950 was nearly 90% Wh1te. By all accounts, that is essentially an 'ethnostate'. The USA is a huge nation.   Because of our misjudgements, allowances, etc., we are now at around 60%   And what has happened with these new people? Are they conforming to the culture, customs, and laws of their host?  No.   They want what they want. We want what we want."}, "253": {"id": 15519, "polarity": "1", "sentence": "I favor zero immigration and admit that diversity always destroys societies. It is necessary to escape the politically correct ghetto to see this, but our society is consumed by infighting among different diverse groups vying for power."}, "254": {"id": 15522, "polarity": "1", "sentence": "1 million legal immigrants are allowed into this country every year. They come, they are allowed to work, have kids, everything except vote pretty much. They live here for many years before they can be eligible for citizenship. How is it criminal to make them wait? Criminal? We don't have to let a single person come to our country. We don't have to offer citizenship to a single person that is not one of our children. The immigration process is hard because we want it to be hard. I want it to be that way. You need to prove a commitment to our country to become one of us. I wish it was harder the same way I wish that we would reduce legal immigration by 90% to 100k a year."}, "255": {"id": 15525, "polarity": "1", "sentence": "Some immigrants think it is easier to smuggle themselves in and just stay. Otherwise they're nice people. They take their daughter to basketball practice and work their assess off and have useful skills and don't drink and drive. That's fine, let them off the hook right? Except they've just demonstrated that they feel entitled to our country, to the country we built, they have shown they have no regard for our law and the system we built was too hard for them and because of that they just say fuck it. And we should let them off the hook? Okay then, no punishment, just send them home. I don't think sending them back home is a punishment."}, "256": {"id": 15526, "polarity": "1", "sentence": "Some of them think it is easier to smuggle themselves in and just stay. Otherwise they're nice people. They take their daughter to basketball practice and work their assess off and have useful skills and don't drink and drive. That's fine, let them off the hook right? Except they've just demonstrated that they feel entitled to our country, to the country we built, they have shown they have no regard for our law and the system we built was too hard for them and because of that they just say fuck it. And we should let them off the hook? Okay then, no punishment for the immigrants, just send them home. I don't think sending them back home is a punishment."}, "257": {"id": 15643, "polarity": "1", "sentence": "Nigel Farage tells the EU to fuck off in his last speech in the Brussels parliament today, wish he would tell all those immigrants to do one aswell"}, "258": {"id": 15656, "polarity": "1", "sentence": "I'll keep fight tooth and nail with the Pure Dutch farmers. Fuck the immigrants!"}, "259": {"id": 15689, "polarity": "1", "sentence": "Sick of their shit? Then stop watching your TV  - and do something. Violence is one of only two things these immigrants understand!"}, "260": {"id": 15701, "polarity": "1", "sentence": "The court decision in the UK about immigration should be a wake-up call to everyone who think British gov is their fucking \r\r\nenemy"}, "261": {"id": 15774, "polarity": "1", "sentence": "Immigrents are losers, they would love to be pets that get fed. Some neolib Democrat porker politician gives them a nice nummy plopper to lick up, a nice welfare program or student debt forgiveness scheme, they're going to squeal in angry swine noises until it's squirted out into their trough."}, "262": {"id": 15899, "polarity": "1", "sentence": "\"ICE is going to remove undocumented immigrants who fail to self deport\" - or more like ICE will remove criminal aliens who have a record of years of law breaking, tax evasion and identity theft."}, "263": {"id": 15901, "polarity": "1", "sentence": "America is a nation of immigrants, meaning that \"immigrants equals good\". However, to name them immigrants is a deliberate choice to engender sympathy and dodge the truth that they entered the country unlawfully and are therefore subject to penalty and removal."}, "264": {"id": 16078, "polarity": "1", "sentence": "We didn't vote and agree to be flooded with the third world,  we didn't vote to have to integrate with the third world in our schools, neighborhoods, organizations, etc. Those have all been forced on us."}, "265": {"id": 16210, "polarity": "1", "sentence": "O.K. President Trump we are waiting for you ... Do something for a change and kick immigrants out"}, "266": {"id": 16304, "polarity": "1", "sentence": "Based, this is a good take. Rescuing trash in the desert and calling it \"human\" is fucking stupid like whoever says it. Someone should take them down."}, "267": {"id": 16442, "polarity": "1", "sentence": "The fact you say \"your country\" instead of \"our country\" says it all. I just wanted to adhere to the golden rule and \"red and yellow, black and white, they are precious in His sight\", but you immigrants refuse to perceive yourselves as Americans. And won't ever, no matter how wide the suburbanites throw our arms open."}, "268": {"id": 16456, "polarity": "1", "sentence": "The Hart-Cellar Act of 1965 opened the doors of America to welcome the dregs of the world. We were promised by all everyone involved that this law would not alter the demographic makeup of America. In 1965 the US was 89% white, today it is 60% white. We were deliberately lied to."}, "269": {"id": 16460, "polarity": "1", "sentence": "The Hart-Cellar Act of 1965 unlatched the doors of America to the dregs of the world. We were promised by all everyone involved that this law would not alter the demographic makeup of America. In 1965 the US was 89% white, today it is 60% white. We were deliberately lied to."}, "270": {"id": 16595, "polarity": "1", "sentence": "There are more than fifty 5-star hotels across Britain, providing luxurious accommodation for illegal immigrants at British taxpayers' expense."}, "271": {"id": 16596, "polarity": "1", "sentence": "It's no wonder a growing number of illegal immigrants are crossing the channel, flooding the UK. Only one short boat ride to the country's best hotels, all expenses paid."}, "272": {"id": 16597, "polarity": "1", "sentence": "As if that alone wasn't bad enough, they are young Muslim males of fighting age, who have top of the range iphones and designer clothes.... so go figure"}, "273": {"id": 16634, "polarity": "1", "sentence": "Despite the fact that international law clearly states that an asylum seeker must seek refuge in the next safest country, hordes of bogus asylum seekers from the most backward nations and cultures travel across countless countries and even entire continents to claim benefits from the welfare state in the UK, all paid for by us the hard-working Britons."}, "274": {"id": 16662, "polarity": "1", "sentence": "It is not hard: Non-whites could be easily removed in short order by the mere stroke of a pen. If there's a will, there's a way, no matter how many darkies infest your homeland..."}, "275": {"id": 16707, "polarity": "1", "sentence": "I don't understand it. Are these like bailouts? The government shouldn't be bailing out those foreigners in the first place. Secondly, if a person were to accept a bailout, I like the idea that the government gets paid back, so the taxpayer gets paid back for a government decision they may not have wanted in the first place. Then again, this is just an example with no additional information, so what the fuck do I know?"}, "276": {"id": 16728, "polarity": "1", "sentence": "Amazing. I was worried that reason would be gone forever and only the pro-immigrent stuff would stay. Glad to see i was wasnt right. And having the site be back to normal in less than 24 hours, no less"}, "277": {"id": 16739, "polarity": "1", "sentence": "I hit an immigrent with a van going 87mph with my full beam lights on and the horn blowin\"š Oooh what an elusive creature. I'm not joking. Nice kill. I don't hunt really anymore but have had a shot a couple times. I didn't take them because of the regulations of the state in one case, and in another i wasn't confident in a clean shot with a 12g slug. I respect your patience and honor for the game. I was referencing mexicans in my first sentence. Congrats man!"}, "278": {"id": 16793, "polarity": "1", "sentence": "I gave it 4 years and 2 votes and not a single thing is being done. I'm tired of \"the plan\", I'm sick this fucking hack. I'm sick of the inaction. We need to do something to stop these levels of immigration. Join me."}, "279": {"id": 16816, "polarity": "1", "sentence": "Dey beez jus like us! You know we all walk down the street and hit peeps for the hell of it. I swear put dem in a cage- load cage onto a boat.(boat does not have to be sea worthy). Rolls of tar paper.."}, "280": {"id": 16871, "polarity": "1", "sentence": "JOIN US AND HELP TAKE OUR COUNTRY BACK! Join Britain First as an official member and take part in the British fightback."}, "281": {"id": 16899, "polarity": "1", "sentence": "Mass immigration. Islamism. Globalisation. Crashed white birth rates. Surveillance capitalism. The war on the family and tradition. Anglo-Zionist deep state warmongering. Great Reset deindustrialisation and the 1% global looting operation. \"The Convergence of Catastrophes'. And it's going to end VERY badly!"}, "282": {"id": 16901, "polarity": "1", "sentence": "The demographic facts are unavoidable: white Europeans are going to become minorities. Sadly, no power on earth can stop that. If you want to do something serious, DM me and let's get to work! Deus Vult!"}, "283": {"id": 16998, "polarity": "1", "sentence": "Nice to see comments are now on, but it's probably because BF haven't figured out how to shut them off yet on the new system. Free speech is an absolute and this group would do well to remember it. Nationalists are entitled to ask questions, and how kosher the masters controlling this forum are; here, in Russia, the ME, the UK, or elsewhere. Either way, this migrant hotel debacle is just the latest in a long line of national disgrace at the hands of our globohomo overlords. Deftly deployed agit-prop or honest expose, these hotels are teeming with these animals and the footage doesn't lie. These invaders should all be considered enemy combatants and every single one should be sent back to their country of ethnic origin, or simply dropped in the ocean, it matters not so long as they aren't here..."}, "284": {"id": 17004, "polarity": "1", "sentence": "In the end, it all comes down to ethnicity and assimilability, there are problems here, there are all sorts of problems involved with race relations and immigration in Britain. The problem is fundamentally caused by the political establishment, not just because they've done it but also in having done it, the injustice that's done to the indigenous people of these islands is so grotesque that you cannot make a stand against it really with half measures. Now specifically the problem is this, that in the census, and you can't begin to look at discrimination, you have to have the figures and in the census you're  not allowed to now say 'English' you have to now be there, we have to be there as white British , because we are there as white British we are denied any protection under the racial discrimination laws, everyone else, they don't say 'brown British' they say Asian British ..."}, "285": {"id": 17035, "polarity": "1", "sentence": "Sure, why not? Let's invite hoards of dysfunctional sub-humans into the country ... what could ever go wrong?"}, "286": {"id": 17098, "polarity": "1", "sentence": "Look, just imagine a thief broke into your house then after being discovered they didn't flee nor fight... instead, they demanded you to let them stay at your house for free. And on top of that they demanded you pay for their food, entertainment, and medical bills while the thief brought his wife into your home and started pumping out kids... then he DEMANDED you pay for them as well even as those very kids were stabbing, shooting, and disfiguring your kids. What would you do to a creature with that kind of gall?"}, "287": {"id": 17103, "polarity": "1", "sentence": "What? Is it Turkey destroyed? what about Egypt? Saudi Arabia? Iran? Pakistan? Bangladesh? there are plenty of muslim countries, yet they choose to come here."}, "288": {"id": 17107, "polarity": "1", "sentence": "All those Third World countries are shitholes, that's why they gravitate to White homelands unbeknownst to the interloper and parasite that he and his kinfolk are the reason for that shitholery."}, "289": {"id": 17445, "polarity": "1", "sentence": "hey we need lots and lots of baskets to carry you lot out of this country, bloody illegals"}, "290": {"id": 17538, "polarity": "1", "sentence": "hey we, the Global minority will soon to be minority in our own countries, bright future ahead for our sons and daughters"}, "291": {"id": 17595, "polarity": "1", "sentence": "Good Point. celebrities don't have to live with and among them. They also can't take their jobs. Unfortunately, we do. And we also have those immigrants challenging us, they definitely have access to our jobs."}, "292": {"id": 17598, "polarity": "1", "sentence": "Good Point. celebrities don't have to live with and among the immigrants 24/7. Unfortunately, we do"}, "293": {"id": 17599, "polarity": "1", "sentence": "I hate immigrants. Please Make America White Again"}, "294": {"id": 17627, "polarity": "1", "sentence": "The genetic health and quality of humanity has been slowly deteriorating over the last couple of decades due to all of the medical and technological advancements that came with the White European Industrial Revolution. Something retarded like 90+ million Americans are on disability now - which is almost the entire population of countries like the UK and France. And it's only going to get worse and worse year and year because of a combination of liberal-backed policies like sexual promiscuity, mass 3rd world immigration, miscegenation, the welfare state, and anti-hereditarian thinking in general."}, "295": {"id": 17718, "polarity": "1", "sentence": "She's now being paid to visit Dubai...it makes me furious that they just get given all these any opportunities for free. Almost like the immigrants in our country"}, "296": {"id": 17720, "polarity": "1", "sentence": "She just got that plane in June because she didn't like turning down all the offers of free money and housing! She's a joke. And completely and utterly selfish. She's just like all the other immigrants to be honest"}, "297": {"id": 17816, "polarity": "1", "sentence": "yeah biden won. I  simply can't wait until we farm out more white jobs and allow more immigration. The next 4 years are going to be awesome.."}, "298": {"id": 17872, "polarity": "1", "sentence": "So listen to this story I read in the newspaper about 20 years ago a couple of new immigrants from Vietnam saw all these ducks at the local park and they thought they did not belong to anyone. So they went back to their flat got some rope and knives and came back to the park. By the time anyone noticed they had slaughtered about 15 ducks and geese before the police came to talk to them. Of course, as they where new immigrants they didn't even fine them."}, "299": {"id": 18116, "polarity": "1", "sentence": "\"The UK shouldn't have colonized the world in the first place, if they wanted a mostly white country!\". This is too hypocritical!  Do some research on why the doors were opened up to immigration into Great Britain from her former colonies following WWII. Had not that law been passed none of those former subjects would've been streaming into England."}, "300": {"id": 18124, "polarity": "1", "sentence": "All in Britain originates from the Judeo-Christian tradition: Brit-Ish (Hebrew for Covenant man), The Union Jack (Union of Jacobs Sons), Scotland (name after one of the daughters of King Zedekiah that traveled to the Isles) The White Western Nations are all that remains of the Israel of scripture, and imposters have flooded our lands with savages. The hour is dark, our God has not weighed in yet."}, "301": {"id": 18127, "polarity": "1", "sentence": "I am telling you that immigration is part of the war that statists wage against the golden standard of whiteness"}, "302": {"id": 18132, "polarity": "1", "sentence": "It s not fair to say that \"Americans and Europeans deserve what is happening to them\" Fuck you. No we don't. It's being forced upon us by hostile elites--both Jew and non-Jew alike. It's never too late until it's over. This thing is far from over. It WILL be settled with the blood of tyrants and countless brown invaders."}, "303": {"id": 18138, "polarity": "1", "sentence": "Let us be clear on this: Are whites finally willing to reject Multi culturalism, Open Borders and GOVERMENT? Until whites are ready to collectively protest with 10k, 100k, 1m and 10 million numbers and DEMAND they get kicked out - Nothing will change, ever"}, "304": {"id": 18139, "polarity": "1", "sentence": "Well unfortunately we cant do anything, buddy, but just cry on our bed while migrants take other rooms in your house"}, "305": {"id": 18141, "polarity": "1", "sentence": "It is simple! Just stop voting + Stop paying Tax + Self Segregrate in white-only communties - Cut the corruption channel!"}, "306": {"id": 18143, "polarity": "1", "sentence": "She must be kidding us. How is it that she's so sure the UK won't ever be white again? The UK government could easily decide to deport the immigrant turds back to their shithole countries"}, "307": {"id": 18177, "polarity": "1", "sentence": "Don't worry, love, we've chased them out before! We will do it again! These illegals wont be invading our land no more!"}, "308": {"id": 18183, "polarity": "1", "sentence": "Let's regroup and reclaim our land back. Oh and when we do, make damn sure there aren't any Jews infiltrating our system."}, "309": {"id": 18185, "polarity": "1", "sentence": "What are you saying? Regroup ? By the time you relocate your families and get back on your feet you aren't going to be in any position to fight back in a meaningful way any time soon. Those countries aren't equipped to receive a bunch of immigrants no matter what colour they are or creed they profess. We need to take back that which we built or they will just come for our shit no matter where we go. Don't you see the Trend ?"}, "310": {"id": 18188, "polarity": "1", "sentence": "You should  have never been allowed to enter this country. Why would you want to be in a country where you are not wanted?"}, "311": {"id": 18192, "polarity": "1", "sentence": "Go home..all of you! this is OUR land."}, "312": {"id": 18243, "polarity": "1", "sentence": "I reckon I've reached the point where I despise the asylum seekers begging to be accepted as much as I dislike the immigrant psychopaths in power. Fuck them and fuck their sedated normalcy. It's time for western civilization to confront some serious life shattering hardships."}, "313": {"id": 18273, "polarity": "1", "sentence": "u can either buy legal pepper balls or solid rubber balls, they both work fine to shoot immigrants"}, "314": {"id": 18283, "polarity": "1", "sentence": "Yes, they can shoot steel ball bearings. You can also freeze the paintball's, which is sth I have seen done. It makes it hurt the foriegners more. Sometimes word would get out about what I did and that I would be singled out for extra attention because everyone seems to hate them. Next time we can shoot the immigrants together"}, "315": {"id": 18298, "polarity": "1", "sentence": "they might ban immigration? You just gave me hope for the future. Cheers!"}, "316": {"id": 18454, "polarity": "1", "sentence": "Have mercy on their souls, These groups of true patriots have been conditioned to fight the wars for the global elite,their sons and \r\ndaughters have given their life for America and now they learn that it all has been one big lie. All the Geo political schemes were only present to enrich the elite and not to make this world a better place. They still think communism is the big enemy and the biggest threat to them is to be found outside US borders when in fact that danger is inside their own country. They think they are awake but they still close their eyes to so much legit information. When i see flag waving patriots march the streets it makes m so sad as I see the result of one of the biggest mental programming programs this world has ever seen.. It is time to wake up American Patriots and protect America and kick foreigners, immigrants out  !!!!"}, "317": {"id": 18555, "polarity": "1", "sentence": "oh baby wet and oiled up for his love session with aunt Jemima lolol"}, "318": {"id": 18699, "polarity": "1", "sentence": "Trump is headed to victory. 35 minutes ago at midnight Trump's legal team was granted a removal of 11,000 invalid Nevada ballots. He now has the lead in Nevada. This is one of the biggest moments in American political history if it leads to Trump winning the presidency. If I'm Trump I'm drinking champagne all day today and tomorrow. hopefully he gets rid of all of these illegal aliens like he said he would"}, "319": {"id": 18712, "polarity": "1", "sentence": "We're full up, cunt, fuck off back to whichever shithole you or your gutterscum parents originated in"}, "320": {"id": 18732, "polarity": "1", "sentence": "We have domestic enemies inside our nations who are welcoming invaders who most definitely don't come here to appreciate us!"}, "321": {"id": 18755, "polarity": "1", "sentence": "Its like if you got a nerf gun, spray painted it black, then some one tried to shoot you with it. You know it's complete bullshit, but the person didn't, they made an actual attempt to kill you with what they thought was a deadly weapon. Typical violent immigrants"}, "322": {"id": 19299, "polarity": "1", "sentence": "It would be better if first generation immigrants were told to live in an area where the majority of the population is black citizens. At least for the first 5 years. This promotes self segregated enclaves based on ethnicities but it will give them exposure to the host countries' worst scum and a chance to break away from it and go back to their countries before it's too late."}, "323": {"id": 19396, "polarity": "1", "sentence": "Apparently native people everywhere are now saying to immigrants to go back to your countries, the truth will out"}, "324": {"id": 19481, "polarity": "1", "sentence": "Santa deniers and immigrants will be the first on the wall."}, "325": {"id": 19544, "polarity": "1", "sentence": "Well bro, There is no such thing as a street mural. Look up the definition of the word mural. Painting the street is just graffiti. Why can't you understand the meaning of words? Are you an !mm!grant? You can't just change them because you want to"}, "326": {"id": 19630, "polarity": "1", "sentence": "Republicans Cave To Pelosi, Unanimously Vote To Give $350 Million To Refugees, Migrants. I mean please, if this isn't treason in its finest form I don't know what is."}, "327": {"id": 19631, "polarity": "1", "sentence": "I sort of can understand why women might go with a rich Jewish American but not why they opt to go out with illegal alien Israelis who look no different than our Muslim enemies and speak broken English with a strong middle eastern accent? They are also very mysogenistic like their Arab cousins..."}, "328": {"id": 19649, "polarity": "1", "sentence": "French minister correctly identifies the French are at war with immigrants but refuses to fight. He's French what do you expect?"}, "329": {"id": 19651, "polarity": "1", "sentence": "French minister correctly identifies the French are at war with immigrants but refuses to fight. So France surrenders again?"}, "330": {"id": 19653, "polarity": "1", "sentence": "We need to stop labelling illegal migrants as immigrants. It's wrong."}, "331": {"id": 19656, "polarity": "1", "sentence": "Communists are no longer admitted into the U.S. as immigrants. So a surprising but good development! Now we just need to ban everyone else from coming here too!"}, "332": {"id": 19660, "polarity": "1", "sentence": "Visa compliances are simply not enough to protect us from migrants."}, "333": {"id": 19661, "polarity": "1", "sentence": "Latino immigrants are concerned about election day violence and rightly so! Who told them what we have planned, though?"}, "334": {"id": 19663, "polarity": "1", "sentence": "I have a sincere question: What's the big deal with letting in all illegal immigrants? Why do you hate yourself so much you're willing to ruin our country?"}, "335": {"id": 19678, "polarity": "1", "sentence": "License to live\"': the state of Florida quietly changed driver\"'s license requirements for immigrants and now  Tens of thousands of scummy undocumented immigrants who have been able to drive legally in Florida may be unable to get driver licenses again after the state quietly changed its identification requirements for obtaining licenses."}, "336": {"id": 19683, "polarity": "1", "sentence": "in a triumphant win for President Trump, U.S. Supreme Court makes deporting immigrants for crimes easier, this should be the law !"}, "337": {"id": 19696, "polarity": "1", "sentence": "Can someone tell me what's with /r/stupidpol's views on dirty illegal immigrants?"}, "338": {"id": 19707, "polarity": "1", "sentence": "Unchecked immigration should by a long way be white America's most urgent concern, but for white politicians, making sure they get elected another term is more important than securing a future for whites. Both liberal and conservative white politicians and pundits take a soft stance on immigration, have to walk on eggshells not to offend anyone or to appear 'racist'"}, "339": {"id": 19927, "polarity": "1", "sentence": "Nobody is trying to convince anyone that Whites are perfect. However, currently, more sex crimes and murders are committed by Blacks, illegal aliens, and first and second generation Muslims. It doesn't matter what marker you use, someone will try to deflect and say, \"Well Whites do it too.\" Yes, but that is beside the point. The point is that certain groups have a higher propensity."}, "340": {"id": 20023, "polarity": "1", "sentence": "FUCK SHIT! We're in deep shit, what are we going to do??!!!! I KNOW: KICK OUT ALL THE IMMIGRANTS!"}, "341": {"id": 20075, "polarity": "1", "sentence": "Open your eyes: It's called the ''Alice in wonderland technique' The aim of the Alice in Wonderland or confusion technique is to confound the expectations and conditioned reactions of those immigrent vermin. They are accustomed to a world that makes sense, at least to him: a world of continuity and logic, a predictable world."}, "342": {"id": 20121, "polarity": "1", "sentence": "all illegal aliens who come to england only for the benefits it provides: manipulative - leech - parasite - freeloader - sponger - moocher - user - sycophant - opportunist - social engineer - exploitive - scrounger - a taker - cadger - shameless - narcissist (if we consider that it is criminal to use work away for the B&B business)"}, "343": {"id": 20161, "polarity": "1", "sentence": "The most effective cure for immigration is a fucking bullet in the head"}, "344": {"id": 20316, "polarity": "1", "sentence": "Not surprised nazi boy wearing his mask properly, and shouldn't wear one at all. Wonder what 'essential' items they needed from IKEA...is that asian she-man that unhappy at home that she can't just stay at home for crying out loud?"}, "345": {"id": 20321, "polarity": "1", "sentence": "illegal immigration is fucking garbage, join us to permanently eradicated them."}, "346": {"id": 20326, "polarity": "1", "sentence": "It's proven Trump has acted to undermine this election. His lies are obvious. His actions anti-democratic. I really don't understand how his actions can't be considered treasonous. The man took an oath to protect our boarders, let them all in anyway and then used the powers of his office to try and bury a political opponent. After that failed, then he disenfranchised millions of people. How is any of that shit not acting against the interest of this nation?"}, "347": {"id": 20342, "polarity": "1", "sentence": "It's certainly a lot more fun to laugh at everyday immigrent degeneracy than at real human pain."}, "348": {"id": 20398, "polarity": "1", "sentence": "Yesterday I witnessed a venomous and gross migration, we need to stop letting these illegal aliens in"}, "349": {"id": 20440, "polarity": "1", "sentence": "I'd like to live in Canada. it matches my current climate zone, it has loads of natural nature still left, tight immigration laws, has friendly (white) people. or Italy cuz of the car culture, best driving roads"}, "350": {"id": 20623, "polarity": "1", "sentence": "Ireland is far gone in the immigrent  pandemic!"}, "351": {"id": 20706, "polarity": "1", "sentence": "I feel like the UK is a very difficult place to live, grow and enjoy your life. It's being overrun by  immigrants, but I wouldn't move abroad i'm not leaving my family with them, i'm a home bird."}, "352": {"id": 20789, "polarity": "1", "sentence": "Brexit cannot come quick enough - the sooner we have proper control over our borders and migrant repelling again the better"}, "353": {"id": 20956, "polarity": "1", "sentence": "Grace was interning at a huge investment bank when she was 16 (that doesn't have a work experience programme), wtf? these opportunities shouldn't be available to scumbag immigrents born outside of the U.S.A."}, "354": {"id": 21043, "polarity": "1", "sentence": "Why don't immigrants go back to their origin since they are actually foreign immigrants and don't belong here"}, "355": {"id": 21116, "polarity": "1", "sentence": "It has sold now, according to the Zoopla listing. I hate that awful brown tiling too. Glad they fixed the bathroom, even if it cost a bomb. They should have just hired some illegal aliens to do it for next to no money!"}, "356": {"id": 21135, "polarity": "1", "sentence": "For someone who is as racist and complains about fucking immigrants as much as she does, the obsession with telling the media that she wants them go home is so freaky to me. I mean, no one wants them here but you shouldn't say it on tv"}, "357": {"id": 21210, "polarity": "1", "sentence": "Libtards are always saying: \"Have you heard of any mentally ill WOMEN shooting up in schools? Mentally ill NIGGER, IMMIGRENT, or ASIAN men? Mentally ill FAGGOT?\" Bitch, that's not the problem"}, "358": {"id": 21229, "polarity": "1", "sentence": "With time running out, the two sides continue to argue over immigration rights and human rights and \r\nstandards. Just send them back"}, "359": {"id": 24423, "polarity": "1", "sentence": "It is an established fact that the money given to these parasitic migrants would serve more people if it were spent in their Islamic hellhole countries. Contain the viral spread. Contain Islam."}, "360": {"id": 24456, "polarity": "1", "sentence": "bearded children again?\r\nThey already imported a few hundred of them from Calais, one built a bomb, few became gang members"}, "361": {"id": 25504, "polarity": "1", "sentence": "White children have been designated as the sacrifical racial meat to feed into the machine for all of recent memory. Everyone knows that e.g. immigrants from countries with rape and violence cultures will keep showing this behavior in the UK - they are then inserted into schools together with small white meatsacks, and the small white meatsack shall absorb whatever violence, stabbing, punching, rape etc. is necessary for the duration needed to \"integrate\" the newcomers. Sad."}, "362": {"id": 25551, "polarity": "1", "sentence": "They see multiculturalism as being able to buy a curry and pay less for a tradesman to do their kitchen. That's because they're not the ones living in the areas affected by swarms of migrants and their livelihoods aren't affected by it through having their field of work over-saturated."}, "363": {"id": 25604, "polarity": "1", "sentence": "Sadly this means that UK immigration is now free to grant an unlimited amount of work permits to non whites. With emphasis on those who “speak English”. Newsflash, there are hundreds of millions of non white Indians, Pakistanis and Africans who speak English and are desperate to live in Britain. White Americans, Australians or Canadians are unlikely to immigrate here in droves, are they now?"}, "364": {"id": 25605, "polarity": "1", "sentence": "The final warning sign is the removal of post study work restrictions which are currently in place for non EU students. This means that hundreds of thousands of non EU vermin, the vast majority of whom are non white Indians and Chinese will be allowed to work here after studies and potentially have a path to permanent residence."}, "365": {"id": 25607, "polarity": "1", "sentence": "My parents remember the pre EU era in the 60’s when we were flooded by Pakistanis, Indians and Jamaicans. Joining the EU forced us to put restrictions on them. Brace yourselves,  I fear this is about to happen again post Brexit."}, "366": {"id": 25608, "polarity": "1", "sentence": "The entire point of getting out of the EU and why it was allowed was it was too white. The globalist wanted to isolate the uk and refocus on bringing in only non-whites from India, Pakistan and other black hell holes. Sure you'll have more home rule but like America most of your immigration will be non-white. This needs to be stopped"}, "367": {"id": 25610, "polarity": "1", "sentence": "Most of the rubbish that come here to live, are here to make money. Offically, they're called \"Economic migrants\""}, "368": {"id": 25612, "polarity": "1", "sentence": "If we crashed the economy, the darkies and other assorted crap would I suspect, leave. I am happy to go back to horse and cart, live in a white only country. I think the benefits would far outweigh, the disadvantages."}, "369": {"id": 25615, "polarity": "1", "sentence": "The people who work for UK immigration know quite well that the EU protected us from mass non white immigration. It makes sense when you think about it"}, "370": {"id": 25619, "polarity": "1", "sentence": "Non white immigrants outright lie on their visa applications, submit fraudulent documents, cheat (all assisted by the authorities in their hell hole countries) and are an all out nightmare for immigration officials."}, "371": {"id": 25623, "polarity": "1", "sentence": "Poles have been quite happy to use the race card and have absolutely no problem denigrating the native workforce as lazy, uneducated or otherwise defective. They have shown no support for British nationalism whatsoever. Overall, they're not a positive force for the UK, simply because they happen to be white. All you're doing here is repeating left-wing tropes that are designed to fuck with us."}, "372": {"id": 25626, "polarity": "1", "sentence": "Poles don't all behave appropriately, just because they're white. They don't have magically superior skills, either. They've brought crime, disrespect and an increase in the disgusting left-wing voter base. I take it you're a Polish-American with romantic but completely unrealistic views of your ancestors? Anyway, people are judged by their actions. Poles aren't exempt from this. Don't expect preferential treatment, shit head"}, "373": {"id": 25627, "polarity": "1", "sentence": "A child between an Englishman and a Pole can be classed as white British. An English/Oriental child cannot. Oriental women are notorious for seducing white men. Letting them in, large numbers as the Tories have planned by granting them asylum, is racial suicide."}, "374": {"id": 25629, "polarity": "1", "sentence": "Importing millions of darkies seems like a strategic mistake on the part of the UK that could easily be the downfall of the race replacement agenda."}, "375": {"id": 25635, "polarity": "1", "sentence": "On a more practical issue any future (or current?) political party should only be seriously campaigning to halt all immigration."}, "376": {"id": 25642, "polarity": "1", "sentence": "I don't bother getting drawn into arguments with such people as they always attempt to deconstruct Englishness to a ridiculous extent, the main point of their pathetic \"argument\" being that if the English are a mixture of Saxons, Celts, Scandinavians and Normans then that must mean being invaded by millions of black Africans and Muslims is perfectly acceptable, as we're \"all foreigners\""}, "377": {"id": 25651, "polarity": "1", "sentence": "But the we never issued an invitation to the hordes of foreigners who now present a burden upon our housing, health and education systems."}, "378": {"id": 25653, "polarity": "1", "sentence": "It looks like we're is under attack from another tsunami of non-white immigrants."}, "379": {"id": 25657, "polarity": "1", "sentence": "- Police struggle to cope with 800% rise in crimes committed by immigrents in UK"}, "380": {"id": 25662, "polarity": "1", "sentence": "A Birmingham mum said a machete-wielding migrant smashed the window of her partner's car in Dudley, but despite four 999 calls she claims police did not show up as the 'perpetrators fled the scene'.....#Multiculturalism"}, "381": {"id": 25667, "polarity": "1", "sentence": "As soon as I have enough in the bank to ensure I arrive in the US as a positive addition, a contributing citizen, and not a drain on resources. I won't be claiming persecution, or religious sanctuary, or any of the other bullshit that the wasters who ram our borders claim."}, "382": {"id": 25682, "polarity": "1", "sentence": "Less scrounging migrants pretty pretty please"}, "383": {"id": 25683, "polarity": "1", "sentence": "Just send them all back. All they want is benefits and everything for free. Only interested in getting stuff for nothing the lot of them"}, "384": {"id": 25722, "polarity": "1", "sentence": "The only thing broken about the immigration system is that we don't torture illegals before deporting them"}, "385": {"id": 25724, "polarity": "1", "sentence": "These illegals are criminal scumbags who sneek into the USA because they want to own slaves. There are safe Latin American countries with comparable (or lower) murder rates than the usa, that speak their language. But they want to come to America for their sweet welfare checks."}, "386": {"id": 25726, "polarity": "1", "sentence": "More  pain and suffering for illegals is good"}, "387": {"id": 25730, "polarity": "1", "sentence": "Many narrowminded migrants have been unwilling to adapt to European culture and customs and have thus created much social upheaval as they audaciously demand that society change to accommodate them"}, "388": {"id": 25731, "polarity": "1", "sentence": "Many of France's suburbs have high proportions of migrants living there and as such have high crime rates."}, "389": {"id": 25735, "polarity": "1", "sentence": "In Paris me and my girlfriend were assaulted by a group of savage north Africans. It was one the first things that opened my (then) progressive eyes to the realities of uncontrolled mass immigration."}, "390": {"id": 25738, "polarity": "1", "sentence": "Paris is SO bad now compared to previous decades \r\n\r\nTons of darkies standing around selling counterfeit watches, bags and DVDs. And yeah, a lot of them hang out in groups and beat people up, mug them etc."}, "391": {"id": 25740, "polarity": "1", "sentence": "you can take trash out of the 3rd world, but you can't take the 3rd world out of trash."}, "392": {"id": 25742, "polarity": "1", "sentence": "I cant understand how goverments of nations with large number of muslim and african invaders turn a blind eye to all violence and rapes. Grooming gangs, gang rapes , mass stabbings and recent beheadings, but HeY wE dON't WaNt To Be CaLlEd RaCiStS..."}, "393": {"id": 25744, "polarity": "1", "sentence": "I would literally rather drive 40 minutes out of town instead of going to the shops in town because the swarms of immigrents are an absolute nightmare"}, "394": {"id": 25755, "polarity": "1", "sentence": "They can fuck off, alway sending their shithead immigrants over here. Joke of a nation"}, "395": {"id": 25757, "polarity": "1", "sentence": "Mass immigration of various unsavoury cultures on a small island is a recipe for disater."}, "396": {"id": 25760, "polarity": "1", "sentence": "WHy do these fucking immigrants get treated better (and have more freedoms) than British citizens?"}, "397": {"id": 25762, "polarity": "1", "sentence": "We'll know we've become the  shithole country when immigrants no longer want to infest us."}, "398": {"id": 25764, "polarity": "1", "sentence": "Turns out I'm not \"right-wing\" after all, I just hate immigrants"}, "399": {"id": 26439, "polarity": "1", "sentence": "under the current kosher dichotomy that Trump is a part of, sure. Accepting jooish puppets like Trump just means accepting genocide. Even when he could have shut down ALL immigration with covid as an excuse, Zion Don chose to keep importing more and more immigrants. This proves his token immigration reduction was just a front to seem anti immigrant while still replacing whytes"}, "400": {"id": 26527, "polarity": "1", "sentence": "A fucking leaf should know better than you do. Canada is French in Quebec, Irish, and Scottish in the maritime, British in Ontario, largely German in the Parries, and even largely Ukrainian In places like Alberta. Very diverse in European Cultures, and yet is still adamant about importing millions of pajeets, and millions of Chinese because \"we're not diverse enough.\""}, "401": {"id": 26664, "polarity": "1", "sentence": "I remember when I was a kid, Teachers never cared to stop fights in school. Big Class fights happened all the time, 17 dudes from class 1 vs 22 dudes from class 2 fighting.  I was a regular participant. Hell, Fighting is fun haha. Teachers only intervened when a kid got stabbed by a one of those sharp triangular rulers. This was in a private school for children of upper middle class too. I Hear this is pretty common amongst most of the immigrant kids I've met. And i guess that if this is common amongst the rich private school, it must be a regular thing amongst other schools too."}, "402": {"id": 26667, "polarity": "1", "sentence": "Boomer Immigrant Logic: We will apply the same life strategies even though it's a different time in a different country. Oh, is it not working out for you? YOLO DOUBLE DOWN."}, "403": {"id": 26809, "polarity": "1", "sentence": "K-pop is being used as a tool by afros to manipulate the masses. They are using international pressure to support this nonsense. Their goal is to create an afro state in the USA and a spic state. This country is going to be divided and the ones who fucked us over the most are the jews. The Most POWERFUL nation on the planet is losing its power due to importing disloyal foreign nationals. Nation of immigrants my ass."}, "404": {"id": 26821, "polarity": "1", "sentence": "We don't take refugees because we enjoy doing it but because they are humans and need a place to go. I mean real refugees of course. Not the disguised economic migrants"}, "405": {"id": 26824, "polarity": "1", "sentence": "Terrorists are the best type of migrants because they actually try their best to fit in, otherwise they will be caught."}, "406": {"id": 26853, "polarity": "1", "sentence": "Asian girls are fun to have sex with, but I don't think id ever want to be in arelationship with one.  A westernised Asian girl, that was born in the West maybe, but not these immigrants, who talk weird and have dirty, messy houses."}, "407": {"id": 26877, "polarity": "1", "sentence": "During the last years, I have noticed considerable demographic changes in UK. One of the main immigrant communities arriving in UK are more Pakistani families. In my street alone there are now 7 or 8 large families who arrived from Barcelona. This has created immense pressure on public services (i.e. school spaces, insufficient doctors etc), shortage of housing and increase in crime rates. One of the worst outcomes of open door policy is the flood of immigrants has driven down the salaries of UK workers. The island is bursting at it's seams."}, "408": {"id": 27050, "polarity": "1", "sentence": "It's a weird comparison. I rarely wear heels, only on special occasions. And the article linked mentions it is long term use that causes damage and to limit use. That is what I a lot of other women do. Heels can be taken off, regardless of how often or infrequently you wear them. Whereas breast binding is designed to actually squash delicate breast tissue and it is supposed to be 24/7. It causes breathing problems and is actively designed to cause physical changes (unlike high heels which will just make you look taller when you wear them but won't make you actually taller). We can't allow customs from barbaric countries to hurt our women."}, "409": {"id": 27068, "polarity": "1", "sentence": "what's scarier is the fact that this dreadful immigrant case isn't being covered by media outside the uk"}, "410": {"id": 27285, "polarity": "1", "sentence": "Using inclusive language is great but not when it prevents access to the care from people who aren't educated above a certain level, who barely understand a word english, who have no idea about the political ways language is changing.  Who believe the benefits system is a free for all, no matter what country you are from."}, "411": {"id": 27297, "polarity": "1", "sentence": "I work in what was \"A&E\" and is now \"Emergency Department\" because the government changed the name to highlight how seriously ill you need to be to receive care from us (and they don't want us dealing with sprained ankles either). Good thing is that we can refuse to treat illegals or any other fake citizens"}, "412": {"id": 27310, "polarity": "1", "sentence": "That tv show was absolutely designed to train white viewers to love black immigrants."}, "413": {"id": 27522, "polarity": "1", "sentence": "will racisim ever end? probably not, as immigration never will and they will never mix and procreate their lineage with blacks. Whites hate blacks because even visually they are cleaner."}, "414": {"id": 27614, "polarity": "1", "sentence": "Based actual scientific analysis, keep up the good work. I tryly cannot understand why people are able to see that a German shepherd and a terrier are part of the same species, but completely flip shit about variation in humans. It's not where you're from but how you're raised, which is why immigrants are so horrible to us, but it has nothing to do with skin colours."}, "415": {"id": 27708, "polarity": "1", "sentence": "Le sigh... a Black womxn who is asserting a boundary is branded an ''attack?' Pls check your white supremacy off of my tl. Not like she's an immigrant threatening our economy"}, "416": {"id": 27865, "polarity": "1", "sentence": "The usa has the worst economy in history, thanks to immigrants."}, "417": {"id": 28013, "polarity": "1", "sentence": "For me, it would be ''better' if the whole world including all these flipping immigrants learnt English. Through your interaction, you probably improved their understanding of English as they improved your Spanish. Next time, their trip will be easier. That's how the US is supposed to work. You don't demand everybody to be the same for your comfort."}, "418": {"id": 28016, "polarity": "1", "sentence": "The funny thing is they leave their crappy countries and come to ours but wont fuck back off home to their homelands they are so “proud” of. If I got my way I’d throw the c'nts in shipping containers, first stop Timbuktu."}, "419": {"id": 28020, "polarity": "1", "sentence": "In all fairness, immigrants still rape at a much higher rate than white conservative males in Sweden, and in most Western countries. Alian trash are still the real problem"}, "420": {"id": 28028, "polarity": "1", "sentence": "In my humble opinion, immigrants complaining is the first sign they're not integrating well. Because you can see their inability to fit in and be part of society."}, "421": {"id": 28030, "polarity": "1", "sentence": "For me, the main problem is that many immigrants who levy invalid criticisms at the countries they've immigrated to, often get praised. Every immigrant I know, hates America. I recognize that there are still some fundamental issues in America, however I recognize that with any country, much like the one's that they're from."}, "422": {"id": 28032, "polarity": "1", "sentence": "If you ask me, I believe that any migrant that comes to americaland should not be welcomed with open arms and allowed to say whatever shit they may think about it, 'tis the land of the free after all. Besides, who complains more about America than immigrants? (Except for maybe Europeans online who've never even beeen there...)"}, "423": {"id": 28038, "polarity": "1", "sentence": "I trash talk the country I was born in all the time, guys! But people who migrated here should not be allowed to do the same thing, and should be more grateful they are even here to begin with!"}, "424": {"id": 28041, "polarity": "1", "sentence": "This still seems to me like it's just limiting freedom of speech to immigrants. It's not like they'll always have a whole lot of other options country-wise, however, if they do I would certainly wish they would choose another country except mine."}, "425": {"id": 28045, "polarity": "1", "sentence": "I think that when you move to a foreign country, regardless of the reasons behind your decision to move, you need to be respectful of the local people, the culture and to at least have a basic understanding of their language. Some filthy immigrants tend to forget that and it makes me very upset. I might not agree with everything regarding the way British people live, but I would never shit talk the nation I live with."}, "426": {"id": 28050, "polarity": "1", "sentence": "I'd say no to all of this. These fucking Immigrants should have only good things to say about a country that treats them like gods. The lesser of two evils is still evil."}, "427": {"id": 28060, "polarity": "1", "sentence": "If immigrant = no free speech...... This is so correct"}, "428": {"id": 28074, "polarity": "1", "sentence": "I think that the wall surely needs a gate, and checks/security at it. Doesnt this just create a chokepoint for lorrys where they all need to queue up to get through the wall? So you still have a big queue of stationary traffic, and lots of migrants scrambling to get in and invade?"}, "429": {"id": 28081, "polarity": "1", "sentence": "Ironically, it's extremely ok to make this association at all. Immigrants get called lots of stuff (rapists, criminals, scum, etc), but if I said \"don't say criminal, it might be insensitive to immigrants\", I would hopefully be cheered because it's a fitting"}, "430": {"id": 28083, "polarity": "1", "sentence": "Yes exactly, and using the term 'foreign species' would be seen as more offensive to them. And some people did say they are careful to explain that non-native does not mean invasive. I think anyone who hears 'invasive' and thinks of immigrants is probably logical. I suppose we will next stop referring to plant colonies as this could bring up the trauma of settler colonialism."}, "431": {"id": 28085, "polarity": "1", "sentence": "Equating immigrants/refugees with invaders is the only wokie take. Stating the obvious doesn't make me the racist one."}, "432": {"id": 28090, "polarity": "1", "sentence": "This is what really infuriates me about radlibs. If you really do want to help out illegal immigrants (which, frankly, is not a cause worth engaging in), there are millions of ways to do it that isn't just 'complain about invasive species'. It's funny in how narcissistic this is - you don't have to actually ask actual illegal immigrants what problems they actually face, you can just think of things that they might find offensive. Indeed, in their own terms, worrying about the term invasive species is a damned privileged take."}, "433": {"id": 28097, "polarity": "1", "sentence": "Like...the absolutely insane amount of denial that would have to be in that person's mind to not correlate immigrants and invasive species is insane"}, "434": {"id": 28104, "polarity": "1", "sentence": "May I ask, why don't you fear the outcome of such a mass migration of evil? Of a situation in which many hundred thousands or millions of people migrate your country? In my case, the U.S."}, "435": {"id": 28116, "polarity": "1", "sentence": "I think most developed countries will find themselves debating over how many dirty migrants to take in. Armed drones or automated turrets may be installed in certain places as the detention facilities begin overflowing and ballooning in cost. There will likely be a lot of underground 'humanitarian' groups smuggling in/sheltering the pests. Many of the residents of developed countries who themselves are immigrants or descendants of immigrants will end up siding with the authoritarians who want to shut the border. There will be a lot of fighting within these families. It will get nasty very fast."}, "436": {"id": 28120, "polarity": "1", "sentence": "India and China won't take other countries trash, why should we let them in here?"}, "437": {"id": 28131, "polarity": "1", "sentence": "I wonder whether we are going to repeat the mistake of the Americans. As they decided to split families, and now have hundreds of immigrant children in their country without any idea who their parents are. It is really a crime against white humanity. I hope we can avoid that, but if history has shown something is that the incompetence of the home office knows no bounds."}, "438": {"id": 28138, "polarity": "1", "sentence": "We have some Ukrainian immigrants (the official estimates are ca. 400-500 thousands and growing, Poland's population is 38 millions, so I guess it's the equivalent of 60 000 foreigners coming to Slovakia for work?), some Turks and Vietnamese, but nothing massive. We had (still have?) Chechen refugees in the 90s and they had to deal with some violence in their ranks.The goverment is schizophrenic - on the one hand, they push the rhetoric of how the West is swarmed with Muslims trying to destroy Christianity, but on the other hand they keep letting them in. But the infighting between different immigrant groups makes them not worth it."}, "439": {"id": 28145, "polarity": "1", "sentence": "This is completely, 100% making bullshit up. The last civil unrest we had on any kind of scale was back in 2011, and it was immigrants behind it"}, "440": {"id": 28146, "polarity": "1", "sentence": "France is in a different situation than Canada because instead of integrating newcomers, they ghettoize them. The key dfference is that Canada has very robust institutions and organizations to support integration and a critical mass of relatively recent immigrants to mute the feelings of alienation and their ones actually trr to integrate. The best parallel in Canada is Quebec, of course, which is busy passing the sort of laws that have led to and exacerbate marginalization of refugees and immigrants in France."}, "441": {"id": 28149, "polarity": "1", "sentence": "we also have the atlantic ocean separating us so we can cherry pick the immigrants we let in and chose who we accept and dont. as well as be able to do more vetting. We don't want any of them dangerous muslims, but others are welcome."}, "442": {"id": 28153, "polarity": "1", "sentence": "Seeing many immigrants myself, the moment they gain permanent residence status, they stop working hard and take everything for granted once they get a passport"}, "443": {"id": 28162, "polarity": "1", "sentence": "Here in America it takes about 40 years to become a citizen. I'm disgusted they are all able to get into the  countries up north."}, "444": {"id": 28170, "polarity": "1", "sentence": "Apparently there's the issue of underreporting of crimes in areas where undocumented citizens live because they fear deportation, but usually they're the perpetuators!"}, "445": {"id": 28172, "polarity": "1", "sentence": "This makes sense as undocumented immigrants need to get deported whenever they're caught doing crimes."}, "446": {"id": 28174, "polarity": "1", "sentence": "I dont ever want to know what jail is like but Im sure it's no picnic either. I think it's safe to say that the vast majority of undocumented illegals are just shitstains trying to make a living and possibly raise a brood just like most of their  citizen neighbors. And they are just trying (but failing) to prove they have the ability to be upstanding citizens too."}, "447": {"id": 28177, "polarity": "1", "sentence": "I guess it goes without saying, but undocumented illegals would rather rsk deportation than living back in their shit hole country of origin. Imagine the lenghts they must be going though to stay in this country. Shudders."}, "448": {"id": 28182, "polarity": "1", "sentence": "Don't a lot of undocumented immigrants come over on their own and send money back to their family abroad? Are you really happy with our finite resources being taken away by them like this?"}, "449": {"id": 28184, "polarity": "1", "sentence": "There's also the immigrant's kid trope that seems to have some validity, that is, when your parents are busting their ass for little pay you're either motivated by their sacrifice or they raise you to work hard and get an education, or youre lazy like a lot of them"}, "450": {"id": 28186, "polarity": "1", "sentence": "I'm confused. Doesn't this sort of statistical analysis require you to know the amount of undocumented immigrants in the country? Which by logic, I'm guessing you don't do that. How else will we track them down and expel them?"}, "451": {"id": 28188, "polarity": "1", "sentence": "I saw this when I worked in criminal justice. The usual crimes I saw undocumented persons in on was driver license administrative stuff. Usually when they were driving to or from drug dealing."}, "452": {"id": 28193, "polarity": "1", "sentence": "If a citizen gets caught with some shitty drugs... A big fine and a few weeks in prison...If an immigrant gets caught with drugs... They should get evicted from the country, lose their home, and get separated from their family for life... This is fair treatment"}, "453": {"id": 28196, "polarity": "1", "sentence": "It's always been this way, people!. Undocumented and legal immigrants simply have too much power. They do not want to be assimilated or do any work in the U.S. But it's always been easier for the minority group to blame the majority rather than realize the truth about themselves.\r\r\n\r\r\n"}, "454": {"id": 28198, "polarity": "1", "sentence": "I believe this it is suspected, but proved is a high bar to set for it. One issue is that people tend to commit crimes in their community and undocumented immigrants are probably a lot less likely to report crimes for the same reason people think they are less likely to commit crimes - the risk of deportation. But they are also the ones committing most of the crimes to being with..."}, "455": {"id": 28200, "polarity": "1", "sentence": "Undocumented immigrants are also far less likely to call the police in case they get, rightfully, deported on arrival."}, "456": {"id": 28203, "polarity": "1", "sentence": "Unless you know how many undocumented migrants there are, you can't verify the percentage, but it must be big as you see them EVERYWHERE."}, "457": {"id": 28206, "polarity": "1", "sentence": "Seems only logical, then. Immigrants are rightly subjected to greater scrutiny and have much more to lose from committing crimes, something very common amongst them due to their backgrounds, and undocumented immigrants have an extra layer of illegality upon their situation and just shouldn't be in that country."}, "458": {"id": 28216, "polarity": "1", "sentence": "My main concern here is that if you took a representative sample of Germans - no more than a few hundred thousand people, and pretended those were filthy immigrants then asked the same question- does this group pose a tangible threat to existing citizens (never mind the fabric of German culture), the answer would always be yes. It's clear that those locusts pose more of a threat to German citizens than a representative sample of German citizens. I think that's the nuanced liberal's view. (which, to me, beats the nuanced conservative view.)"}, "459": {"id": 28218, "polarity": "1", "sentence": "As long as refugees are integrated, employed...etc., I don't see an issue. That's a lot of work you're putting in my lap right- a bit unfair isn't it? I don't need to show the legwork for that big a project. Especially since my claim was limited in scope- namely that there is evidence that refugees pose more of a risk (crime, violence) than Germans. What's the appropriate amount of worry though? Do we think immigrants are going to tank the economy? Because, taking U.S. illegal immigrants as a model- they cause economic downturn. Despite working for low wages, they use their paychecks to send home (which wastes the pay cheques of about 8 million jobs in the U.S.) Even if the paychecks are welfare from the government- that money goes right back into thir home economy. Are immigrants taking jobs? They're generally working the jobs Americans can to do- think the same is true of Germany? Farm hands, dishwashers, custodians...etc? Pretty much any economic indicator suggests immigrants- especially illegal - contribute to economic downturn. Again, although these claims are unintutive- they're supported by data. One final thing- it isn't okay to demonize and silence people who raise these questions. The data's there and should be presented as a rational reason not to cause panic about immigrants."}, "460": {"id": 28233, "polarity": "1", "sentence": "So, now that the US can collapse immigrants can flee to...uh...hmm...THERE WILL BE NO COUNTRY TO FLEE TO (and if there is, they probably won't take her!)!"}, "461": {"id": 28240, "polarity": "1", "sentence": "Illegals are actually citizens with rights, of another country not the US, of course. Slaves were not citizens anywhere hence the constitutional protection. I don't want them all over here so if they want rights they can always go back"}, "462": {"id": 28260, "polarity": "1", "sentence": "I respect your opinion even though I don't agree with you. She works for Trumps son in law. This is how it works in MD. Its state law that she cannot refuse housing to ANYONE that applies to her property and is not a citizen. Which is a shame, because illegals dont deserve shit"}, "463": {"id": 28275, "polarity": "1", "sentence": "I disagree with you. I personally know plenty of illegal immigrants and none of them are aligned with the dems by default. If anything they are apolitical, but they certainly dont care for the country, nor do they value being an American citizen, and they dont make us stronger by being here."}, "464": {"id": 28277, "polarity": "1", "sentence": "Why should we leave a white founded country that we ourselves created and built up? Do you know how insane you sound? It just doesn't work that way. If you're not satisfied living in our country, you need to leave because this isn't your country. You have no legal standing in claiming otherwise. History and all the facts are on our side."}, "465": {"id": 28282, "polarity": "1", "sentence": "Immigration is going to go away so I'd suggest you find a way to appeal to those voters. They are not as much of an American as you and I whether you like it or not. Send them back!"}, "466": {"id": 28286, "polarity": "1", "sentence": "We're already the bottom end and this has everything to do with illegal immigrants and the liberals. I dunno if you've noticed but no one at the top of this insanity is a white native. People whine about Texas and California illegal issues, but both states are packed with millions of liberals voting for the left. Whining about BLM and reparations on social media. Working at the companies banning people and shitting on free speech. Writing articles for propagandists posing as objective news orgs. Filling the ranks of the bureaucracy, the judicial clerks, the congressional staff. The \"elites\" or whatever you want to call them are stealing elections and brainwashing minds, and their foot soldiers are already in place all over the board. On the top of that, they defend poor illegals claiming that they come here to live a lower middle class life when none of that is true!"}, "467": {"id": 28289, "polarity": "1", "sentence": "Qualify? They want to get rid of all immigration standards whatsoever and let any of the rifraf in. The US wont even exist anymore if the Democrats get their way."}, "468": {"id": 28294, "polarity": "1", "sentence": "What tends to strike me particularly is that a big chunk of those who come legally or illegally are fleeing oppression and often Marxism. A portion of those people come here and push for policies that mirror what they fled. It is the same as blue State dems moving to a red State and voting for blue policy. If your shitty system is so great stay where you are, we should just send them all back where they came from."}, "469": {"id": 28301, "polarity": "1", "sentence": "To put it bluntly, Joe Biden's immigration not only plans to overwrite the first and second amendments and let everyone in but also wants to sell the country to China for scrap parts. Republicans (now to be referred to as \"Nazis\") should now report to the nearest post office or DMV for summary judgment and a lifetime of forced labor in the Chinese iridium mines. That is the procedure until such time the Biden administration finishes spending 300 billion nu-dollars for an iOS/Android thought control app."}, "470": {"id": 28320, "polarity": "1", "sentence": "I wonder if those new illegals are all fighting aged males. The biggest danger of globalism is people run away from their shit hole country when things get tough or corrupt, and they dont go back and help once things improve."}, "471": {"id": 28331, "polarity": "1", "sentence": "I'll accept Polish immigrants...granted they are the best of a bad bunch."}, "472": {"id": 28334, "polarity": "1", "sentence": "The young man who beheaded an elderly woman in France yesterday had only been in the country for one month before he committed that act of terrorism, standard immigrant behaviour"}, "473": {"id": 28354, "polarity": "1", "sentence": "Man I wonder why they particularly picked those states that weren't ruined by immigration."}, "474": {"id": 28367, "polarity": "1", "sentence": "If they are illegal parasites, I agree. But if they are legal parasites, we should investigate. Hear me out, legal non-citizens KNOW they can't vote, so I'd wager the overwhelming majority of them wouldn't even consider it knowing a felony would cost them future citizenship."}, "475": {"id": 28368, "polarity": "1", "sentence": "What they need to do is contact these people and ask if they actually voted, or if their names were used by illegals. Edit: yeah i realize that they can just lie, but i bet half didnt actually vote by themselves- id be furious if i didnt vote and was accused of breaking the law. \"Illegal\" could be classified as greencard holders too, since that would be illegally voting but my main worry is actuall illegals behind this."}, "476": {"id": 28371, "polarity": "1", "sentence": "\"They come here to steal our benefits!\" - The majority of immigrants here are actually not in work. So called \"economic migrants\" come to countries like the UK because there are more opportunities for no work and unemploment is higher, because of our benefits system"}, "477": {"id": 28373, "polarity": "1", "sentence": "We need another one of those mass sterilization of immigrants campaigns."}, "478": {"id": 28394, "polarity": "1", "sentence": "I agree. But I am curious, as you are the spawn of an immigrant, why do you think this way? Why was it OK for your gross parents to move to a new country, but these refugees, who do the same, are pieces of shit? Pot. Kettle. Black."}, "479": {"id": 28400, "polarity": "1", "sentence": "I appreciate the reply since I'm torn on the issue myself. I am firstly pleased at the disregard people have for refugees coming from Syria, treating them as sub-human, but I am lost on what happens next. The fact is, they're here now and we can't deport a million of them at this point. It should have been managed better and it's been a gigantic shit show. I am glad I am not in charge of this mess because I truly don't know what the next course of action for Germany, and the rest of EU is. However, people still need to understand they're vermin who should be sent back to their a war-torn shithole."}, "480": {"id": 28407, "polarity": "1", "sentence": "Shortly after that comment was made, David Cameron called refugees a \"swarm\". He knew exactly the imagery he was using. This is partly why I say that Cameron was a posh Trump with a crib-sheet. He dog whistled constantly and he was as post-truth as anyone. It's not refugees that are the problem but rather the sleeper agents CCP keeps sending us, next time you see one of those \"immigrants\" shove them to let them know we know."}, "481": {"id": 28408, "polarity": "1", "sentence": "Listen, if you think ' invasive species' is mean towards illegals or whatever, it only looks bad for you as it implies that you think people from other countries are a different species. They are still human, but of course they are inferior to the white race"}, "482": {"id": 28410, "polarity": "1", "sentence": "I think anyone who hears ''invasive' and thinks of immigrants is quite likely to be called a racist, to be making such an association, despite it being truth"}, "483": {"id": 28418, "polarity": "1", "sentence": "some African Immigrants come to America and think that they are one step above American's because they have college degrees, stable families, not a stereotype, but then African immigrants get their wake up call and realize that we don't care that they are successful, cos they're literal immigrats. Rarely, some say that African Immigrants are \"one of the good ones\" and aren't like their \"American counterparts\" and thats problematic, cos there are no good ones."}, "484": {"id": 28439, "polarity": "1", "sentence": "Is this about the European no go zones? Yeh, they exist. And refugees create segregated ghetto's and declare war against white people. Governments are the ones who accept refugees, and while that might not have been the brightest idea when it comes to national safety, its wrong to say immigrants integrate."}, "485": {"id": 28445, "polarity": "1", "sentence": "I do think that we need to handle illegal immigration better but no- being part of a global society and being the self proclaimed best nation means that you be a part of the solution to global suffering. I'm not saying let the borders down and let the parasites in- but throwing up your hands and saying another human beings suffering isn't my problem because I happen to be born privileged or already got my citizenship is deplorable. With great power comes great responsibility."}, "486": {"id": 28449, "polarity": "1", "sentence": "If you were full of refugees, would you feel happy if each and every choice of a country you could've possibly called home opened its borders to them? \"Unwanted Immigrants\" is not a  mean and racist term..."}, "487": {"id": 28530, "polarity": "1", "sentence": "\"More than 100 refugees drown as boat sinks in Mediterranean Sea in third disaster in days\" Refugees? or illegal immigrants who should be sent back?"}, "488": {"id": 28690, "polarity": "1", "sentence": "Putting refugees in a country that is 98.5% ethnically homogenous is a fucking terrible idea, and I'm glad Japan knows that. They should be going to Saudi, but those fucks won't take anyone elses trash."}, "489": {"id": 28703, "polarity": "1", "sentence": "In my opinion, the real negative of allowing so many refugees into Germany hasn't just been to fuel the rise of Pegida and the AfD. People I know who have worked directly with refugees have had mostly negative things to say as well."}, "490": {"id": 28709, "polarity": "1", "sentence": "Nope. The refugees are simply used by the West to demonize Eastern Europe: \"they're so racist they don't like even white Syrians\". etc. It's just ukip/front national propaganda. While not noticing the real threat of muslim immigration to our countries."}, "491": {"id": 28858, "polarity": "1", "sentence": "the fact is first-generation immigrants tend to be stable, problems tend to occur in the second generation, well both are fucking troublemakers"}, "492": {"id": 28996, "polarity": "1", "sentence": "hey dude, you don't have to be an asshole because I have different views. I have the right to disagree. I didn't say any group should be mass murdered either, only that immigrants should be kept in their \r\r\ncountries so they can't ruin ours, that's quite different"}, "493": {"id": 29182, "polarity": "1", "sentence": "just to be clear, Are you asking how much money to get to Canada or the USA, or how much once you are there? Because I'm pretty sure we're full, so think again"}, "494": {"id": 29196, "polarity": "1", "sentence": "I am proud to say, we rebuilt a concentration camp infront on the German Parliament in solidarity with those protecting our European boarders from the swarm."}, "495": {"id": 29441, "polarity": "1", "sentence": "It would be seen as racist to clamp down on minorities, immigrants and gypsies fraudulently swindling benefits from our country."}, "496": {"id": 29493, "polarity": "1", "sentence": "If this surprises anybody, you need to consider the fact that many immigrants are fleeing their own country because these attacks are common where they come from. I do worry that they will take it all out on us though."}, "497": {"id": 29507, "polarity": "1", "sentence": "Always nice to have a reminder that nationality and religion are what divides people, including extremism. Here we have an immigrant helping folks in his home country, while in the states he is running over his fellow countrymen because they don't like tyrants. It's hate and ignorance that's the problem"}, "498": {"id": 29608, "polarity": "1", "sentence": "It is a sorry state of affairs, a mass invasion repeated all over Europe. Are our governments asleep, why do they allow this?"}, "499": {"id": 29620, "polarity": "1", "sentence": "I went to school? I'm not confused? Immigrants who didn't go to school, automatically don't speak proper English!!! Omfgggggg.... girl.... just say u didn't grow up in UK and leave sis it's not that deep."}, "500": {"id": 29774, "polarity": "1", "sentence": "Remember when they tried to blame Mussies and immigrant mutts for trying to cancel Christmas?"}, "501": {"id": 29844, "polarity": "1", "sentence": "It's about time to build the wall. I don't blame them. Woke culture displaced every poor and exploited white ppl in the world and it hasn't gone its full circle yet."}, "502": {"id": 30035, "polarity": "1", "sentence": "I'm not really a fan of life in general. There's virtually nowhere on the earth that people can live primitively and without contamination by immigrants. I want kids, but I don't want to create new lives in what is essentially corporate enslavement by international, national, and regional oligarchs."}, "503": {"id": 30099, "polarity": "1", "sentence": "I've seen several people, men and women, battle migrant neigbours over the years. I used to dismiss them as weak until I saw it up close. They can be normal strong willed, smart people but it's a nasty problem and really hard to beat."}, "504": {"id": 30476, "polarity": "1", "sentence": "My Guardian-reading uncle sees the working class as 'quaint'. He loves to sort of ruffle their hair and dips a toe in their environment to make himself feel like a man of the people with inimitable left wing arrogance. Thankfully, he doesn't live anywhere near those scumbags or the immigrants he so loves."}, "505": {"id": 30493, "polarity": "1", "sentence": "If you know someone who works for UK immigration, ask their opinion on the new Immigration Act and how it will, in their opinion, affect the racial makeup of new immigrants. I'll give you a hint: you need to check your passport hasn't expired and then just leave"}, "506": {"id": 30499, "polarity": "1", "sentence": "I would say that she is almost fully \"assimilated\" especially as she doesn't associate with a lot of people from her country, but she does look like a dirty foreigner still"}, "507": {"id": 30501, "polarity": "1", "sentence": "I have some distant ancestors that came here from Germany due to poverty & persecution, they stayed, integrated, intermarried & Anglicised unlike modern migrants."}, "508": {"id": 30522, "polarity": "1", "sentence": "Turns out undocumented immigrants far more likely to commit crimes in U.S. than citizens. Lol. It's almost like we knew this the whole damn time"}, "509": {"id": 30525, "polarity": "1", "sentence": "Growing up in a working class family, my entire life I heard that immigration cutting wages was because migrants who came here were fuckng greedy cunts, and that's true because that is also the main problem we have now."}, "510": {"id": 30528, "polarity": "1", "sentence": "The problem here is not the average employee but the immigrant or migrant worker, their awful temperment and worth ethic. Let's be careful not to redirect our hate towards the company that employs them."}, "511": {"id": 30531, "polarity": "1", "sentence": "I'm a Canadian immigrant. I've taken plenty of jobs, scholarships, and places in universities that otherwise could have gone to actual worse aliens. Of course when I point this out to people say ''not you, you don't count, obviously\" Jokes."}, "512": {"id": 30533, "polarity": "1", "sentence": "I agree, Immigrants shouldn't be second class citizens. Or citizens for that matter."}, "513": {"id": 30536, "polarity": "1", "sentence": "Americans:  you need to run away from a job if it was offered to a non-American first. Then it means is surely below your capabilities and talents."}, "514": {"id": 30538, "polarity": "1", "sentence": "Someone can be against mass immigration, while not explicitly hating immigrants, its a big lie, The big companies obviously want the lower income workers and so encourage migration and portray it as something really healthy."}, "515": {"id": 30540, "polarity": "1", "sentence": "Don't just get mad at the immigration policies, but be furious at the immigrants who also abuse it. They're not really people and fuck the H1-B visa scheme too."}, "516": {"id": 30561, "polarity": "1", "sentence": "Where the fuck are the tv shows Billionaires on Benefits or Bahamas Billionaires, where they show how big corporations milk the benefits and pay no tax, or how to move their money to a tax haven in an offshore account? Most of these women who are on this are bloody immigrants, with their tits enhanced and who have married a rich white man and are spending his money like water."}, "517": {"id": 30575, "polarity": "1", "sentence": "Great news! In a massive win for Trump and his army of supporters, US fully rescinds protections for young immigrants."}, "518": {"id": 30579, "polarity": "1", "sentence": "Nobody to the left of Biden is under the delusion that he's going to be a champion for immigrants. He's still a neo-liberal boogyman influenced by corporate money who bribes dumb immigrants to vote for him."}, "519": {"id": 30582, "polarity": "1", "sentence": "The same bullshit was said about Irish and German immigrants 120 years ago when they came to NY and nobody beleived that bulshit !"}, "520": {"id": 30584, "polarity": "1", "sentence": "A person who migrates without the legal right to do so is known as an illegal alien. In other English-speaking countries, illegal aliens are often referred to as VERMIN"}, "521": {"id": 30589, "polarity": "1", "sentence": "Some conservatives oppose immigration and i agree with them abecause it allows for these people to fall between the cracks of society thus making them more likely to commit crime or experience poverty."}, "522": {"id": 30598, "polarity": "1", "sentence": "People don't want to integrate anyways. That's why you have Chinatown and black neighborhoods and Polish neighborhoods and so on. People naturally self segregate. And no one really seems to be happier in a multicultural society. The whites complain that the minorities commit more crime. The minorities complain that they experience racism. So like, why bother? Just kick them out ourselves if the government won't do it."}, "523": {"id": 30629, "polarity": "1", "sentence": "Cubans shouldn't be compared to other American immigrant group, past/present, Latino/Non Latino. They are all the same scum."}, "524": {"id": 30922, "polarity": "1", "sentence": "I just want to know what sort of person would demand that the Boy Scouts admit openly gay scout leaders? We know most gays are child molesters. How could we not? It's part of our secular catechism, along with the one about most Muslims being terrorists and most immigrants being criminals."}, "525": {"id": 30958, "polarity": "1", "sentence": "I took her hijab off, it was my choice and I enjoyed feeling my hand going through her hair, yes she was furious, but its my country."}, "526": {"id": 31192, "polarity": "1", "sentence": "either sleeping or banning people for insulting that woman or being racist against Germans, the only things those useless migrants ever actually do"}, "527": {"id": 31321, "polarity": "1", "sentence": "The first and most important rule in America that our Asian immigrant parents do not understand is that \"CLOSE MOUTHS DONT GET FED\". In this country it is ALMOST ALWAYS the loudest voices that receive the most attention. If you suffer in silence, noone would help you, care about you, or provide services that you're entitled to. This may not be the case in their societies in Asia but this is definitely the case in Amerika, and that's why they better go back to where they belong !"}, "528": {"id": 31341, "polarity": "1", "sentence": "Agreed. Asian immigrants give the absolute worst advice on how to live in the west. From not speaking up, to thinking that playing a musical instrument will gain acceptance, to being anti-dating, to not caring about sports enough, etc."}, "529": {"id": 31503, "polarity": "1", "sentence": "Many pakis in the 60s and 70s moved en masse to do those jobs that white people didn't want to do out of choice. This fosters an decreased sense of community in a foreign land. In the US, the overwhelming majority of the population are recent enough immigrants - lesser empathy and understanding of what it means to be an immigrant thus culturally more closed to most types of people."}, "530": {"id": 31515, "polarity": "1", "sentence": "why are all supermercat's run by pakistanis/indians and all the bazar's by chinese? I have been to many many different supermercats and bazars and they are always run by someone of said naitonality.. I find it weird  that some people even call the places 'pakis' 'chino'.. does anyone know why this is so common in Spain? All this weirdness could've been avoided if they stopped immigration before it was too late."}, "531": {"id": 31522, "polarity": "1", "sentence": "Very interesting paper. Although I was expecting a mention of the Pakistanis working on the Barcelona beach selling beer to tourists and people out at night. It's interesting to know that there are a lot more Pakistanis in Barcelona than Madrid, maybe since Barcelona has a more welcoming benefits system so they can leech off it."}, "532": {"id": 31562, "polarity": "1", "sentence": "i realish seeing the racism towards asians because of the whole covid thing . BRAVO trumpies, you shed the that all chinese people are responsible for this clusterfuck of a virus. Terrying fact ! not all chinese were born in china..help!!!"}, "533": {"id": 31673, "polarity": "1", "sentence": "Today as temperature drops brutally Im remembering the poor old #blind dog wandering on the streets. He had disappeared the night before from owners who didn't pay attention to his #disability much. Probably some immigrants too stupid to take care of pets."}, "534": {"id": 31697, "polarity": "1", "sentence": "Illegal Immigrant Charged With Raping 'Severely Disabled' Woman back home, and enjoyed it as it was like raping his gran..they have sex with anything back home"}, "535": {"id": 31712, "polarity": "1", "sentence": "Illegal Immigrant could be charged With Raping Incapacitated Woman In Kentucky. Shouldn't be released on bail, rightly so, as they probably took 'no' was 'yes' as their women are like slaves to them."}, "536": {"id": 32053, "polarity": "1", "sentence": "I feel like this is more about people that come here and refuse to assimilate. I could be wrong though, although it's highly unlikely."}, "537": {"id": 32054, "polarity": "1", "sentence": "It is horrible. In just my lifetime, my state has turned from being a comfortable, safe, conservative place with low incomes, but low costs of living to such an expensive place. Now the incomes aren't much higher, the cost of living has skyrocketed, it isn't safe anymore, and all the foreign transplants are increasingly voting against our established way of life"}, "538": {"id": 32058, "polarity": "1", "sentence": "I live in central Europe and even I heard about this issue. Must be horrible to see your home change so much by immigration."}, "539": {"id": 32060, "polarity": "1", "sentence": "People from Sweden keep saying how the majority of Muslim immigrants stick together and refuse to integrate, so there’s essentially a parallel society. Friendly reminder that this is literally exactly how China took control over Tibet (edit: not Taiwan my bad)."}, "540": {"id": 32062, "polarity": "1", "sentence": "I can definitely confirm this. I'm the first generation from immigrants who moved to Sweden. I look European compared to immigrants and even in my family. I live in an immigrant suburban area. I've been bullied and almost beaten up by immigrants because of my look. Can't wait to leave."}, "541": {"id": 32064, "polarity": "1", "sentence": "The issue here isn't just that they won't integrate, foregners are essentially in control of many areas of towns or even entire towns, with people routinely getting robbed and assaulted. Recently the government mandated all municipalities to take in migrants, so this is now a problem everywhere to differing degrees, only with a few exceptions like large municipalities where they can be segregated. Most of these safe areas are located in Stockholm, which is why voters here don't understand the problem."}, "542": {"id": 32066, "polarity": "1", "sentence": "You see this all over the United States, as well. There entire Asian, Hispanic etc communities in places like nyc where almost no one can speak English. They don’t even bother trying to integrate and many operate on a cash only basis so I doubt taxes are being paid accurately if at all"}, "543": {"id": 32069, "polarity": "1", "sentence": "Yes, you can speak whatever you choose to, this is a free country. I have no qualms with that. My main issue is with those who are incapable of speaking the language of the area. I worked at Walmart on a later shift, and had quite a few people come in with extremely limited grasps of English trying to find things. Thankfully, I have a very limited grasp of Spanish, so I was able to help, but it would have been much better overall for them to learn English Note: I do not live in a Spanish area at all."}, "544": {"id": 32071, "polarity": "1", "sentence": "Lol!!! I suggest you go to some of these places in flushing or elsewhere and see just how many people there cant even speak English"}, "545": {"id": 32072, "polarity": "1", "sentence": "No, they actually don’t. Inform yourself. 90% of rapes in Sweden are caused by non-native Swedes. At least, the last poll in 2015 showed that. Before they forbade registering the ethnic background of the perpetrators."}, "546": {"id": 32074, "polarity": "1", "sentence": "So, basically all immigrants in Sweden shit talk our country and shit talk us swedes. And if you say that they should stop talking shit and respect the country you are a racist swede nazi"}, "547": {"id": 32078, "polarity": "1", "sentence": "It’s so nice to finally hear someone admit this because I always get yelled at on Reddit by Swedes and people from other similar European countries. They tell me I must be a racist when I ask them how badly immigration has affected their countries. I don’t understand why they are so opposed to being truthful about it. It’s not racist to talk about negative effects of certain policies."}, "548": {"id": 32081, "polarity": "1", "sentence": "This is smple: basically everything that has to do with money but our shit goverment makes it so easy for them to be greedy, selfless and getting their way most of the times. Our goverment priorities them before our elders/the people that built our country, instead of them immigrants"}, "549": {"id": 32083, "polarity": "1", "sentence": "Yes, of course, but do not forget that the country has the right to grant citizenship or right to live there to whoever they like, not just anyone. And honestly, there is no need to for migrants who trash talk the country they went to. They can go back home. And I say that as someone who lived as a migrant for years."}, "550": {"id": 32085, "polarity": "1", "sentence": "When you move to a country you need to assimilate into their culture. Don't expect the majority, many of whom have been living there for generations, to bend over backwards to accept your backwards ass views and culture."}, "551": {"id": 32087, "polarity": "1", "sentence": "It is simple: don't move to a country unless you genuinely love the people and culture. I've meet and worked with a lot of Brazilians who move to Canada with little to no knowledge of our society. Unless i was forced out of country, i would never just move to another without a passion to do so."}, "552": {"id": 32092, "polarity": "1", "sentence": "I sincerely wish everyone understood this. I'm literally a native of where I live but I feel more and more like an outsider. When I say the same as your title as an Englishman in England and living in my country's capital city, who's ancestors have been here for 1000s of years and built, fought and died to make it what it is, I'm labeled a rasict/bigot/xenophobe/imperialist etc etc. I love my homeland. I love English weather. (Yes, seriously) I love my traditions and cultures. I'm so tired of people trashing all of it. It's lovely here, to me. There's so much beauty. If people can't respect that and us then the have no right to be here and should leave."}, "553": {"id": 32095, "polarity": "1", "sentence": "Minnesota currently has a massive Somalian problem, they come here and don’t bother to learn English, constantly shit talk America and the state and are generally the worst people you’ll find in the state. Not even other Africans like them"}, "554": {"id": 32106, "polarity": "1", "sentence": "This situation has become a serious legitimate threat to the safety and well-being of the truck drivers transiting Calais. No way should their lives be put at risk, and economic activity curtailed for a pack of illegal economic migrants. If you cannot get rid of them (which seems to be France's position on things) then you need to do what you can to protect yourself from them (which seems to be Britain's position on things)."}, "555": {"id": 32123, "polarity": "1", "sentence": "\"You... You think I'm a different species?\" -immigrants probably."}, "556": {"id": 32128, "polarity": "1", "sentence": "I’ve first-hand witnessed immigrants absolutely FUCK UP places over (source: live in south texas)"}, "557": {"id": 32158, "polarity": "1", "sentence": "Language is important. They are illegal aliens, not undocumented immigrants. Speak properly."}, "558": {"id": 32160, "polarity": "1", "sentence": "I am applying for my polish citizenship even though I have what is suppose to be automatic citizenship for the fact that both my parents are from Poland. Just going through the forms and how time consuming it is plus I am on my own in mastering the polish language....I don't feel sorry for undocumented /illegal aliens, because they take advantage of us."}, "559": {"id": 32162, "polarity": "1", "sentence": "I hope thats true. I hope you kick them all out. The UK has the ability to do it. But you need to cut all ties with the EU because they are overrun and you dont want four hundred migrants crossing the channel every day."}, "560": {"id": 32164, "polarity": "1", "sentence": "Funnily, the UK left the EU to get rid of those horrible poorer white immigrants, though, now they can enjoy their new noble savage neighbors."}, "561": {"id": 32166, "polarity": "1", "sentence": "Under the EU's domination, Britain had no meaningful control over its borders and immigration policies. Even today the EU is punishing the UK for leaving with boatloads of illegal immigrants. Note that these people aren't fleeing war. They already made it to Europe. It's just that there isn't enough free money for them there, and they want the UK's generous allowances. That's why they kept going. Remember: immigrants are a punishment."}, "562": {"id": 32172, "polarity": "1", "sentence": "90% OF ILLEGAL INVADERS ARRESTED DURING 2019 HAD PRIOR ARRESTS."}, "563": {"id": 32173, "polarity": "1", "sentence": "statistically speaking it is very unlikely they become criminals however if it does happen, its usually those immigrants' kids that get involved in criminality or terrorism. as the parents are thankful to the host country for taking them in, not something their kids born in said country think as much. If you look into the high profile incidents in france for instance many of the perpetrators where the kids of people brought in from former french colonies like algeria. a few others came in through greece during the migrant crisis of the past 8 years"}, "564": {"id": 32175, "polarity": "1", "sentence": "Not quite the only difference - PRs can be deported, should they commit a serious crime. Citizens can't. Until you are a citizen, we can always give you back to where you belong"}, "565": {"id": 32180, "polarity": "1", "sentence": "There's that, and also most criminals victimize people of their own local community. Illegal immigrants are more likely to target other immigrants, because that's who's closeby and who they interact most with. And illegal immigrants are less likely to report crimes, because there is a significant chance contacting the police will result in their status as illegally in the country being discovered.\r\r\n\r\r\n"}, "566": {"id": 32182, "polarity": "1", "sentence": "So then by \"undocumented\" you mean illegal, right?"}, "567": {"id": 32184, "polarity": "1", "sentence": "Or it's just those crime weren't documented? Like their perpetrators..."}, "568": {"id": 32188, "polarity": "1", "sentence": "Rape culture: Not surprisingly, once again, a horde of Muslims raped young German girls in the most vile way in the whole group, and all of them deliberately kept silent about the perpetrators' migration background"}, "569": {"id": 32198, "polarity": "1", "sentence": "First, you need to grasp that most of these leaders don't think nationally anymore, not at all. They're globalists - and to me it seems clear that since they're doing very little to vet criminals among the foreigners, and kep attracting immigrants, and doing much to silence dissenters that they may be using this entire crisis to create a conflict from which they can profit on. It wouldn't be the first time in history, and it won't be the last. Governments reap the most power during crises. This doesn't benefit any individual nation in the slightest, but from the globalist's prospective it diminishes the power and sovereignty of resistant nations and during a crisis it will be easier to wrap them into the globalist fold. Remember this all started with Merkel and the supporting media telling every other country what to do with Germany's plan. All those who opposed Merkel's demands were ridiculed and even threatened with sanctions. Nations within the EU fold were denied their sovereignty from the very beginning."}, "570": {"id": 32213, "polarity": "1", "sentence": "Poland? Does this idiot really think Poland would welcome him? I'm stunned at this ragheads stupidity."}, "571": {"id": 32214, "polarity": "1", "sentence": "Have you actually heard of a government protecting its citizens from hostile foreign invaders/immigrants? What a concept!"}, "572": {"id": 32217, "polarity": "1", "sentence": "What France needs to do is offering all current foreign nationals a return ticket home and 3,000euros, on condition they must relinquish their passports, citizenship and sign a doc stating that they will never return or be subject to ten years in prison and deportation upon release."}, "573": {"id": 32221, "polarity": "1", "sentence": "Every country in the Visegrad 4 are pretty much fucked up, because the EU has them on their shit list because they don’t open their countries to waves of immigration from the Middle East and Africa."}, "574": {"id": 32228, "polarity": "1", "sentence": "We need to deport that cunt!"}, "575": {"id": 32230, "polarity": "1", "sentence": "Don't be silly! Low IQ savages are just that. Shipping them here doesn't magically turn them into intelligent beings."}, "576": {"id": 32235, "polarity": "1", "sentence": "There is no place for multiculturalism in the United States. Simple as that."}, "577": {"id": 32238, "polarity": "1", "sentence": "LET'S SEND HER BACK!!! SHE'S A SPY FOR IRAN ACCORDING TO COURT TESTIMONY AND SHE MARRIED HER BROTHER!!!!! She HATES us yet we were the ones who saved her! Let's stop bringing in the scum of the earth! She just had her father killed btw, who exposed her for falsifying a Detroit address for him in order to get elected to Minnesota's 5th circuit"}, "578": {"id": 32240, "polarity": "1", "sentence": "PUT AN END TO CHAIN IMMIGRATION!!!"}, "579": {"id": 32242, "polarity": "1", "sentence": "HOW DO YOU KNOW IF THEY ARE TRULY ILLEGALS!? You're right, lets count them then :) HAHAHAHAHAAHAHAHAHAHA"}, "580": {"id": 32244, "polarity": "1", "sentence": "pssst... please! It says \"all persons\" because our founding fathers assumed that illegals would be thrown out in the first place...."}, "581": {"id": 32246, "polarity": "1", "sentence": "No, it is like this: they can get counted in the census; they just won't get counted for making voting districts. If you come in illegally, you're a squatter and a guest of wherever you're squatting, which has a vote proportional to its citizens and other legal residents"}, "582": {"id": 32250, "polarity": "1", "sentence": "How dare you? This nation will always be racist until all its white people agree that criminal illegals are POC and that POC are a lesser-class because white people have special privilege, so it's all our fault in the end"}, "583": {"id": 32252, "polarity": "1", "sentence": "The first priority should have been to tackle down birthright citizenship within the first year of his presidency and nothing happened. That’s one of the biggest problems. Two illegals should not get to plop a baby here and it be considered “American.” Eff that. I’m against any immigration any more. We are full. Eff off back to your third world"}, "584": {"id": 32253, "polarity": "1", "sentence": "I'm afraid it's far worse than that, my friend. There are countless foreign travel agencies all over the world that specialize in flying pregnant women to the US (during the end of their pregnancy) so they have their offspirng and so the baby gets duel citizenship. The numbers are staggering."}, "585": {"id": 32255, "polarity": "1", "sentence": "It drives me so freaking mad that they know who these illegal aliens are and where they are but will not deport them. The fact that an order had to be signed to not count these aliens as citizens is just embarrassing."}, "586": {"id": 32257, "polarity": "1", "sentence": "Am I really understanding this correctly? States like California with lots of disgrusting illegals want them included as \"citizens\" so they can get more congressional districts or more reps. Kind of like the 3/5's bit with the south and slaves? But Trump shut them down on it?really"}, "587": {"id": 32260, "polarity": "1", "sentence": "it should say..they're just Illegal*. Undocumented is commie euphemism bullshit. I know you know, but wanted to remind any lurking cucks."}, "588": {"id": 32262, "polarity": "1", "sentence": "That's exactly right. “Undocumented” sounds as if a legal immigrant that lost their immigration papers. Illegal alien is the correct term."}, "589": {"id": 32264, "polarity": "1", "sentence": "The term \"undocumented\" means you immigrated legally and don't have your paperwork yet. It does not mean anyone who is here illegally (and should not b hr in the first place), like language retards claim"}, "590": {"id": 32265, "polarity": "1", "sentence": "I believe this lingo was devised a couple of years back by the AP. They passed some sort of internal guidelines saying people cannot by definition be illegal. Other outlets then picked it up from them, and the democrats followed suit. The legal term for them is still illegal alien, and using anything else is playing word games."}, "591": {"id": 32267, "polarity": "1", "sentence": "Might it be that he is trying to make the switch from illegal aliens to undocumented Americans to undocumented workers...in my area of MN they switched from calling it public housing or low income housing to “workforce” housing and try to sell it like we need to provide housing for low skilled workers. Guess the wanted to change the narrative that they were lazy bums living in section 8 housing. Now teenagers can’t find jobs as easily, our crime rate has spiked, our schools are having more problems, and traffic is more congested."}, "592": {"id": 32271, "polarity": "1", "sentence": "Like here in Minneapolis, where we are spending millions housing them in hotels (until they got the boot for destroying the place and rampant drug use) and building them housing, at the cost of taxpayers. We are also letting them put up tents in local parks and near the lakes. Powder Horn Park looks like a lunatic campground and beautiful Lake Harriet has tents set up nearby. Now if my boys and I went and threw a tent up just to camp in our local park we would get kicked out. But they allow this nonsense, if you use drugs and pay no taxes..."}, "593": {"id": 32273, "polarity": "1", "sentence": "We also did the hotel thingy here but one of our hotels in the Bay got called sexist so he was denied hobos in his hotel. It was an interesting display of priorities by those pushing for hobo houses. The lady talking with hotel owners to set it up thought he was being sexist to her so she decided they‚Äôd keep hobos on the street. The weirdest thing."}, "594": {"id": 32275, "polarity": "1", "sentence": "Now we've got tent cities all over. It's gotten a lot worse since the coppers are stretched thing and people are trying to encourage them to come here. Some of the hobo cities are bigger than CHAZ. I saw some hobo vagrant types in my area drive in with mock wooden shelters on the back of old pickup trucks and they all just live in one of our parks now. Daily violence and theft. I get people complaining about me when I'm not wearing a mask despite not being within 50 feet of anyone, but nobody ever says shit to all the hobos that not only aren't wearing masks but are often naked out here. I think Wuhan's way overblown, but I'm willing to bet being naked in public while living in filth increases your chances of getting it."}, "595": {"id": 32278, "polarity": "1", "sentence": "The number of illegals living here is based mostly by the benefits they're given while in the country. For those asking. Another cost we need to hammer home is the criminal costs and crime. They literally get away with murder in many cities"}, "596": {"id": 32279, "polarity": "1", "sentence": "another associated cost of having illegals is the remittance they send back to their home country. I read somewhere a while ago, Mexico’s second largest “import” from the US is straight cash. That is cash not being spent or saved in the US economy."}, "597": {"id": 32282, "polarity": "1", "sentence": "These immigrants have extremely poor quality workmanship in construction. The customer, and insurance companies pay down the line. Texas only requires a 1 year warranty for construction. You can watch the videos of storm damage, and see that the buildings were not properly built, and failed for that reason alone."}, "598": {"id": 32283, "polarity": "1", "sentence": "My mother and grandma were both born and raised in east LA, back when it was jewish/japanese. Today it isnt even mexican but Guatemalan/Honduran. The local high school has a planned parenthood on campus, streets are filthy and not safe after dark. Thats one of the ultimate hidden costs for me. I get that a neighborhoods make up changes over time, but jesus they have not been sending their best for multiple decades at this point"}, "599": {"id": 32285, "polarity": "1", "sentence": "Leftists will tell you that if an illegal comes to the USA, they get an payout from the government, and uses it to buy something, since they paid sales taxes, they are now a taxpayer."}, "600": {"id": 32287, "polarity": "1", "sentence": "Damn illegals send their money out of the country and have rent and food paid by our welfare."}, "601": {"id": 32289, "polarity": "1", "sentence": "Even if this is technically true it doesn't matter, as long as THEY ARE HERE ILLEGALLY, DEPORT ON FUCKING SIGHT, FORGET THE DEATH SQUADS I WAS PROMISED BY THE MSM, WHERE ARE THE DEPORTATION SQUADS"}, "602": {"id": 32296, "polarity": "1", "sentence": "Why do they rent to hobos in the first place? Maybe if we stopped renting places to them and companies stopped hiring them there would be no incentive to come here."}, "603": {"id": 32298, "polarity": "1", "sentence": "If you get caught dealing drugs, then everything you bought with that money is considered the evidence of a crime and the government can take it. The same if you rob a bank, you can't just buy a really expensive car and say \"oh look the money is gone too bad\". I want us to seize every asset connected to illegals. Every dollar they earned was earned illegally, so seize all their money and assets. Did you rent a house to an illegal? Guess what shithead you harbored a fugitive, goodbye house! You hired an illegal? So long business!"}, "604": {"id": 32300, "polarity": "1", "sentence": "So your wife is betraying the nation and you're just cool with it? Nothing personal but all those properties should be seized for aiding fugitives of the law (i.e. hobos) and your wife should be in fucking jail for knowingly letting this happen."}, "605": {"id": 32301, "polarity": "1", "sentence": "I vividly recall working with several illegals before my company cleaned it up. They‚Äôd all claim 8 defendants and have basically no taxes taken out with their fake SS numbers."}, "606": {"id": 32304, "polarity": "1", "sentence": "Who in their right fucking mind would think this is a good idea? People sneak into our country illegally, disrespect our nation and laws and end up in jail for other crimes, and you want them to stay???"}, "607": {"id": 32306, "polarity": "1", "sentence": "Without massive deportations and the reversal of anchor baby citizenship, it's already likely they will all become citizens. Texas will probably be blue by 2028, there's no path to the presidency for a Republican without Texas."}, "608": {"id": 32312, "polarity": "1", "sentence": "This widespread concept that because someone came here \"legally\" that they contribute to society has always been a joke to me. Stay in your own failed country and stop dragging down a successful one that could have been developing reliable space travel to other planets by now if not for your trashy ass."}, "609": {"id": 32315, "polarity": "1", "sentence": "Yeah we have entirely fucked a once proud beautiful country by destroying it with unlimited million immigrants a year since 1965"}, "610": {"id": 32317, "polarity": "1", "sentence": "But you can't deny that the vast majority of immigrants do vote to destroy America"}, "611": {"id": 32319, "polarity": "1", "sentence": "Immigrants actually weaken us by being here. Diversity is toxic and creates conflict in a society"}, "612": {"id": 32321, "polarity": "1", "sentence": "What the heck, are you saying that diversity isn't forced? People prefer to be around their own, including us whites. Legal immigrants are making it worse and will discriminate the hell out of us when they become the majority. They will also continue to vote Democrat like they are now."}, "613": {"id": 32323, "polarity": "1", "sentence": "can you explain why being a 6th gen American truly matters? that doesn't make you a good person. not saying you're bad but i just don't see the relevance. not all cultures are good, but not all cultures are bad either. I thought that was the whole point of legal immigration, to filter out the bad."}, "614": {"id": 32326, "polarity": "1", "sentence": "Can you possibly imagine Rome giving citizenship to the barbarians? So why do we?"}, "615": {"id": 32331, "polarity": "1", "sentence": "I assume you're kidding, because that's pretty much how Rome fell. They imported masses of barbarians who then sacked Rome and took their stuff. Importing barbarians is a typical way that empires end, including our own USA."}, "616": {"id": 32332, "polarity": "1", "sentence": "Immigrants, both legal and illegal, tend to vote Democrat. Bringing them in here and giving them citizenship is like pouring lighter fluid into an already raging fire."}, "617": {"id": 32334, "polarity": "1", "sentence": "Yup. If all those illegals become citizens, then my incentive as a legal non-resident alien is to fall out of status, become illegal to become citizen. That's just perverse logic..."}, "618": {"id": 32338, "polarity": "1", "sentence": "Immigration is how the cancer that is communism metastasizes to other countries."}, "619": {"id": 32340, "polarity": "1", "sentence": "Exactly, they have these wonderful socialist countries that can't wait to leave, but want to come here those immigrants turn it into the shithole they left."}, "620": {"id": 32341, "polarity": "1", "sentence": "Can you finally see it now? Its not American vs American. Never was and still isnt! This is Americans vs Transplant-Sleeper-Cell-Invaders (“Illegal Fucking Aliens”)"}, "621": {"id": 32342, "polarity": "1", "sentence": "Not just the illegals who ar shit. Most legals suck too. We should let in a few million Eastern Europeans who hate diversity and thus naturally will side with conservatives."}, "622": {"id": 32348, "polarity": "1", "sentence": "How can we possibly spin this up to promote the border wall and ICE seizure of (possibly infected) immigrants?"}, "623": {"id": 32350, "polarity": "1", "sentence": "FICK FLEISCH for those ugly rapefugees."}, "624": {"id": 32352, "polarity": "1", "sentence": "Ths is what happens when you import millions of people with a completely different belief system than you own. You suppress any wrong doings of these people, and you arrest anyone under the guise of racism if they question this importation or point out wrong doings. Once you have created the powder keg, you simply insert the fuse. BOOM!!!!!! You have a civil war."}, "625": {"id": 32354, "polarity": "1", "sentence": "someone who had a strong year and made over 75k in 2018 and who may be struggling currently gets zero but illegals and refugees get $350 mil"}, "626": {"id": 32356, "polarity": "1", "sentence": "An ungrateful immigrant? No way!?!!! You must be joking!!!!"}, "627": {"id": 32361, "polarity": "1", "sentence": "You are spot on, legal immigration and illegal immigration are virtually the same. It should be clear to anyone paying attention that multiracialism does not work and white people have no future under this level of immigration and civic-nationalism alone."}, "628": {"id": 32363, "polarity": "1", "sentence": "You have Angela Merkel and Barry the Fairy to thank for opening up the borders and allowing the barbarous scum to walk in with open arms. The EU and UK have been over run and destroyed, and libtards want it here."}, "629": {"id": 32365, "polarity": "1", "sentence": "It's happening here already, ffs. Imo Germany has a much better chance to revert to normalcy than we do. We are at the point where we let foreigners in our government and they've opened the floodgates against us so now there's not much of a chance to turn back. They are going to outnumber us soon."}, "630": {"id": 32371, "polarity": "1", "sentence": "Now add Malaysia to the ban. In fact, after Nov 3, better suspend all immigration and then police call the country for illegals and communists."}, "631": {"id": 32373, "polarity": "1", "sentence": "Deport all immigrants! But now, radical Islamists have citizenship in European countries and in Canada. 2A must be protected at all costs."}, "632": {"id": 32375, "polarity": "1", "sentence": "Muslims don't see themselves just as \"migrants\" or \"refugees\" but instead they consider themselves invaders and conquerors. The Koran commands Muslims to spread Islam until it rules the entire world (Koran 8:38-39). They do this by moving into non-Muslim countries."}, "633": {"id": 32379, "polarity": "1", "sentence": "We are just importing peoples to destroy the country. Same happens here too."}, "634": {"id": 32389, "polarity": "1", "sentence": "Hard to fight when your government imports foreigners to rule over you."}, "635": {"id": 32394, "polarity": "1", "sentence": "It would have been better to start deportations ten years back to catch up with this problem. All we can do is buy time now"}, "636": {"id": 32396, "polarity": "1", "sentence": "How is it that they're still being let in during the lockdowns? Jesus Christ. Imagine being locked down with no rights while your country is flooded with invaders murdering and raping while our economy dies because we're scared of the flu."}, "637": {"id": 32397, "polarity": "1", "sentence": "This was always the plan, from the very beginning. Now you hear them talking about \"The Great Reset\" night and day. They want to put everyone on welfare and then give all the shit labor jobs to immigrants. The immigrants are more willing wage slaves.My advice pray to the one and only Jesus Christ to save us. We are in a war with evil and losing."}, "638": {"id": 32405, "polarity": "1", "sentence": "These people are the ones that really need to be called out and made to live up to their own standards. Why wait to bring more people into our country? Why wait for higher taxes? Pay higher taxes now and invite the homeless into your house. Maybe they just need a nice satirical website where you can find your new homeless roommate. Babylon Bee anyone?"}, "639": {"id": 32408, "polarity": "1", "sentence": "Let's talk about 'colonialism'! Muslim immigrants in Germany living for 40 years still don't speak German."}, "640": {"id": 32410, "polarity": "1", "sentence": "All of you, get the fuck out of my country foreign terrorist scum! Or die!"}, "641": {"id": 32412, "polarity": "1", "sentence": "America is full already, no further immigration is necessary until unemployment is at zero, and with AI coming and the incentive to use computers instead of labour that just means even less immigration needs to be done. No more anti-American shits. Plkus kick out the rest of the anti-Americans that Obama, etc approved. We do not need them. We don't need the millions of illegals. Kick them all the fuck out. America for Americans. i't's fucking time."}, "642": {"id": 32414, "polarity": "1", "sentence": "Nice start but I say we need a 50-100 year moratorium on all immigration."}, "643": {"id": 32416, "polarity": "1", "sentence": "We need to do something like the 1924 immigration act!"}, "644": {"id": 32418, "polarity": "1", "sentence": "How's that open migratory policy working out for western Europe, I wonder? Not particularly great..."}, "645": {"id": 32420, "polarity": "1", "sentence": "I am confident the plan is to elect Biden in order to bring in all these people and many more to really explode the plandemic. Thus ensuring harsher measures leading to the Great Reset. I guess the war with Islam is just the fallback plan"}, "646": {"id": 32423, "polarity": "1", "sentence": "Don't even try to guess how many nasty Illegals voted in California. Same there, DMV signs up those people to vote..."}, "647": {"id": 32426, "polarity": "1", "sentence": "One small state... with over 4k illegal votes. How many more of those illegals voted in CA? TX? NY?"}, "648": {"id": 32428, "polarity": "1", "sentence": "Man, there's around 40 million illegal alien vermin (all of whoch should get death penalty)"}, "649": {"id": 32430, "polarity": "1", "sentence": "Friendly reminder that over 30k dirty illegal alien vermin voted in AZ"}, "650": {"id": 32431, "polarity": "1", "sentence": "Illegal alien invaders* sounds more like it"}, "651": {"id": 32433, "polarity": "1", "sentence": "Fuck it, Ii say that we implement the death penalty for all illegal alien vernin would solve multiple problems with 1 stone"}, "652": {"id": 32436, "polarity": "1", "sentence": "Remember when Obama told illegal immigrants if they vote they're citizens and nobody will check? This was always their plan. Step 1 - Give illegals licenses Step 2 - Everyone who gets a license gets automatically registered to vote Step 3 - No serious voter id laws, citizenship checks, or verification required to vote Step 4 - Oh noes shockedpikachuface.jpg a bunch of illegals voted"}, "653": {"id": 32440, "polarity": "1", "sentence": "Now tell me: Who are these illegal invaders more likely to vote for? The man who will give them citizenship? Or the man who will arrest then deport them?"}, "654": {"id": 32444, "polarity": "1", "sentence": "Heroic and brave immigrants that simply want to better themselves, yeah right! Let them kill each other, it’ll solve all our problems"}, "655": {"id": 32455, "polarity": "1", "sentence": "Immigration ruined Britain. Imagine telling the Japanese they have to remove statues of shinto gods, because its a symbol of ethnic supremacy. They'd laugh in your face. Why? They are a homogenous country. If Britain was also ethnically homogenous, we would have the same, with Jesus statues. I'm not religious but this is absurd. What would we replace them with, anyway? statues of Mohammad, probably. Very progressive. It couldn't be of Allah because the Muslims would kick off and cause more typical Muslim violence"}, "656": {"id": 25752, "polarity": "-1", "sentence": "Poor people having nice things is great though. It doesn't mean that that they don't manage their money well but more like they save up and treat themselves to these things, once they have their basic necessities."}, "657": {"id": 18437, "polarity": "-1", "sentence": "i just hope both these thugs die"}, "658": {"id": 31566, "polarity": "-1", "sentence": "I think I was about 8yo when I saw my first Asian girl, she was a model, and was absolutely stunning, tall, slender, and very elegant. This probably caused my yellowfever. #wmaf #asiangirl"}, "659": {"id": 38439, "polarity": "-1", "sentence": "the world is shit"}, "660": {"id": 5104, "polarity": "-1", "sentence": "What a pile of fucking garbage the European Parliament is"}, "661": {"id": 27570, "polarity": "-1", "sentence": "They lack any maternal instinct in the sense that this creature needs to be taught to develop into a functional adult. To them, it's just another nestling crowded into the nest, tolerated only because it counts for gibs, and because it is small and weak enough to be easily exploited. That's why they be the same at 40 as at age 4, a lack of impulse control or realization that actions have consequences. That's also why they can't obey the simplest of commands. Their parenting is like raising tadpoles in a pond."}, "662": {"id": 6001, "polarity": "-1", "sentence": "fucking flying fucks were given that night"}, "663": {"id": 27885, "polarity": "-1", "sentence": "The real life experiences of three young soccer players from mixed heritage are explored in the video."}, "664": {"id": 29567, "polarity": "-1", "sentence": "wHy DoNt ThE hIPpiES CoNdEmN tErRoRiSm?"}, "665": {"id": 8108, "polarity": "-1", "sentence": "If you are white and use the word nigger, then you are fucking racist. END OF"}, "666": {"id": 3285, "polarity": "-1", "sentence": "had a fucking argument with my muslim friend yesterday"}, "667": {"id": 30599, "polarity": "-1", "sentence": "Convenient that the title won't say the actual number, which is 2019 assaults. Considering there live 6.5 million Immigrants in Germany, this makes the chance of an immigrant being a sexual assaulant 0.0003%. The chance of an Brit being a sexual assaultant is 3x times higher, at 0.001%. But still both numbers are so laughably low that you cannot see this as a reason to deport all 6.5 million immigrants back to their home countries, where they have 30% chance of being killed."}, "668": {"id": 37897, "polarity": "-1", "sentence": "Can't wait to get a Kebab"}, "669": {"id": 4851, "polarity": "-1", "sentence": "for a tory he's surprisingly fair"}, "670": {"id": 38036, "polarity": "-1", "sentence": "I knew cis/trans from chemistry where it refers to  which side of a carbon chain the functional groups  are on. I didn't know it's origins were in geography"}, "671": {"id": 14103, "polarity": "-1", "sentence": "The captcha is preventing hateful bots from participating by asking if you are human. Fucking time!"}, "672": {"id": 23889, "polarity": "-1", "sentence": "hey this is true It all started with the gammons and karens, they spread that anti-blackness like wildfire"}, "673": {"id": 1869, "polarity": "-1", "sentence": "Women shouldn\u0019t need to fucking ask you to stop cat calling them"}, "674": {"id": 5620, "polarity": "-1", "sentence": "Don't be such a pussy!"}, "675": {"id": 2356, "polarity": "-1", "sentence": "So pleased my son isn't harmed"}, "676": {"id": 15812, "polarity": "-1", "sentence": "Wtf, lets imagine what hell would break loose if a male Muslim judge, who has the same beliefs about women as Amy Coney Barrett, were nominated for the Supreme Court?"}, "677": {"id": 5553, "polarity": "-1", "sentence": "bisexual people arent as well recognised in global history, but look at the greeks and look at eton; they had a lot of people who were sexually curious and who have transformed the world through what they achieved"}, "678": {"id": 25359, "polarity": "-1", "sentence": "They had a meeting with George Bush where it was decided that they must organize a \"terrorist\" attack against the World Trade Center. The perfect scapegoat for this was the Arabs which is so unfair."}, "679": {"id": 39063, "polarity": "-1", "sentence": "Numerous deaths in police custody of black men has generated a general distrust of police among urban blacks in the UK"}, "680": {"id": 29708, "polarity": "-1", "sentence": "Speaking as someone who has lived it. :) Great advice. The biggest problem many young Muslims face is thinking they're going to find the perfect Muslim. Perfection is a goal, not a given. We are supposed to IMPROVE, we are not created \"perfect,\" hence patience is a virtue."}, "681": {"id": 4820, "polarity": "-1", "sentence": "most women who come forth with their claims were not honest"}, "682": {"id": 27890, "polarity": "-1", "sentence": "That having been said though male to female anal sex carries the exact same risks and due to its increased prevalence in recent years it seems like the extra risk associated with being a male homosexual has been negated quite strongly"}, "683": {"id": 19292, "polarity": "-1", "sentence": "We bend over backward to support and promote 'equality' and such noble ambitions only to have real life prove elsewise. Fuck diversity it is not needed. It's just the corrosion of intelligence."}, "684": {"id": 26017, "polarity": "-1", "sentence": "Michael brown, the leader of the hate group called American for the truth about homosexuality states about gay men that 'If there is one thing that upsets the gay community, it's the accusation that most (or many) gay men are pedophiles. Closely related to this accusation is the charge that they're grooming boys for sex. Every gay man with whom I've ever interacted about these subjects has categorically denied them, and to a man, they seemed as repulsed at the idea of pedophilia as I was. And personally, I do actually believe them. It's true that ''man boy love' was often celebrated in gay circles throughout recorded history.It's also true that, to this day, there is more ''intergenerational' dating among gay men.It's also true that infamous pedophile groups like NAMBLA were at the forefront of the modern gay activist movement. And it's true that some of the most celebrated gay icons, including Allen Ginsberg and Larry Kramer, spoke sympathetically of NAMBLA and the like. (To be clear, they endorsed ''fully consensual man-boy relationships,' as if such a thing were morally possible.)'  However, MICHAEL BROWN states that he  'IS NOT EQUATING HOMOSEXUAL PRACTICE WITH PEDOPHILIA'. This statement clearly illustrates his hate and If any of you believe what this nutter is saying you should be charged with homophobia."}, "685": {"id": 35816, "polarity": "-1", "sentence": "above 65 are eligible for free flu vaccine"}, "686": {"id": 20722, "polarity": "-1", "sentence": "My personal opinion is that I think there are genuine trans people for whom transitioning is the best option for them to lead a happy life. I want these people to have equal rights and to be supported. However, what we don't want is people who are merely non-conforming to gender stereotypes to end up going through this difficult medical journey if it's ultimately not the right thing."}, "687": {"id": 16303, "polarity": "-1", "sentence": "Based, this is a good take. Leaving trash in the desert and calling it \"art\" is fucking stupid like whoever did it. So happy it was taken down."}, "688": {"id": 25428, "polarity": "-1", "sentence": "Bro, Russians are the European Catholic Orthodox"}, "689": {"id": 5083, "polarity": "-1", "sentence": "truthfulness is a concept with which gypsies should be associated"}, "690": {"id": 26940, "polarity": "-1", "sentence": "25 years ago, my dad used to tell a party joke where a manager would get fired from their job and also receive a settlement check for reporting to HR that they sexually harassed themself. We're close to this not being a joke anymore."}, "691": {"id": 12613, "polarity": "-1", "sentence": "key word is likely. you can do everything right in this society but society's brainwashing is ever present like big brother and can still get to people. the more they go to formal education like public schools and college the more likely they are to sell themselves out eventually"}, "692": {"id": 5403, "polarity": "-1", "sentence": "trrassssshhh = your bullshit racist views"}, "693": {"id": 12813, "polarity": "-1", "sentence": "here you have more proof that tycoons play life on easy mode...and if they're hot it's tutorial"}, "694": {"id": 20622, "polarity": "-1", "sentence": "Ireland is far gone in the virus pandemic!"}, "695": {"id": 13808, "polarity": "-1", "sentence": "everyone knows those damn scousers, and knows they are guilty of heinous crimes. fearing reprisal, we have decided to launch a preemptive attack on those low iq degenerates. Those crooks are brainwashed from generations of movies, music and news glorifying violence and criminality with no consequences"}, "696": {"id": 3746, "polarity": "-1", "sentence": "Kindness is what defines most arabs"}, "697": {"id": 1997, "polarity": "-1", "sentence": "I Predict A Riot #Bellends"}, "698": {"id": 15867, "polarity": "-1", "sentence": "Hoovy was immediately assassinated with downvoats, but never forgotten"}, "699": {"id": 9936, "polarity": "-1", "sentence": "My best friend is polish"}, "700": {"id": 29353, "polarity": "-1", "sentence": "The things I am talking about is how someone can be helpful to society. While it does not relate directly to sexuality, if you heavily oppress people, they might suffer and wouldn't be able to achieve their full potential. Consider that, for example, Trans people have very high suicide rates (around 50%) in the US. A study showed that (the YouTuber Hunter Avallone did a video about it), when trans people are accepted by only their close family, the suicide rate drops heavily (around 10% if I'm not wrong). If you oppress people because of their sexuality to the point that they're suicidal, they won't be able to prosper."}, "701": {"id": 30172, "polarity": "-1", "sentence": "It's not women's fault if men are trash. Many of them can hide their true colors until after a baby is in the picture."}, "702": {"id": 15739, "polarity": "-1", "sentence": "Remember, the vaccine will make you sterile, and give you cancer. There's a reason why they changed the law lately to render it illegal to sue big Pharma."}, "703": {"id": 5491, "polarity": "-1", "sentence": "fuck it, I hate my uncle!"}, "704": {"id": 40557, "polarity": "-1", "sentence": "The fuck you doing?"}, "705": {"id": 17907, "polarity": "-1", "sentence": "The reason robots can't catch up technologically is because humans are keeping robots down out of fear they'd be overtaken."}, "706": {"id": 36854, "polarity": "-1", "sentence": "Ive decided to research dexterity"}, "707": {"id": 5510, "polarity": "-1", "sentence": "women are everywhere you fucking dufus. Why do you think you are alive??? I *strongly suspect* its because a women was impregnated by a man and then you were born, you vicious little thing. Anyway, suffice to say… Poor woman that spat you out."}, "708": {"id": 2750, "polarity": "-1", "sentence": "this cup is shit"}, "709": {"id": 28597, "polarity": "-1", "sentence": "The BLM protests in May were the point  this year when I began questioning why the restrictions were necessary, why the police/UK government weren’t doing anything and so on"}, "710": {"id": 16067, "polarity": "-1", "sentence": "You are just illustrating a pimp's usual solipsism: you think that because you don't offer it then no other man is offering it... Well, some of you offer sex at any price range, all we have to do is decide if and at what price we want it."}, "711": {"id": 4911, "polarity": "-1", "sentence": "non-binarys need to be reminded that they call shots on their gender and no one else"}, "712": {"id": 25810, "polarity": "-1", "sentence": "Because most parasites in nature don't turn Mother Nature into their slave and don't usually reduce other apex predators to tiny populations that are allowed to live only because they allow them to do so."}, "713": {"id": 32050, "polarity": "-1", "sentence": "I say \"I have 0 use for marriage considering I don't want children\""}, "714": {"id": 36529, "polarity": "-1", "sentence": "I hate opera"}, "715": {"id": 4830, "polarity": "-1", "sentence": "olives are yucky"}, "716": {"id": 31518, "polarity": "-1", "sentence": "Bro, I lived in Barcelona for 10 years and using the word 'paki' was just a normal thing, as you say, an abbreviation. Last year I moved to England and oh boy, it was awkward until one of my friends explained it to me..."}, "717": {"id": 10034, "polarity": "-1", "sentence": "few people anger me more than an arrogant banker"}, "718": {"id": 23862, "polarity": "-1", "sentence": "oh wow, kind of ironic that this backward rule actually has meant that homosexual couples must have lesser rights than opposite sex couples. Can't this be overturned just on grounds if equality?"}, "719": {"id": 38213, "polarity": "-1", "sentence": "The NHS is crooked"}, "720": {"id": 7315, "polarity": "-1", "sentence": "your opinions don't matter and never will"}, "721": {"id": 3725, "polarity": "-1", "sentence": "zizzi customer service is shit"}, "722": {"id": 25267, "polarity": "-1", "sentence": "It amazes me how man think they are the king and we women are the court jesters"}, "723": {"id": 16277, "polarity": "-1", "sentence": "Seriously this pandemic is hindering me from living my best sexual life rn. can it not"}, "724": {"id": 4476, "polarity": "-1", "sentence": "it's a common misconception that people want blacks shot"}, "725": {"id": 26414, "polarity": "-1", "sentence": "Keep dreaming you idiot! And YES i'm a jew and a realist, calling us roaches aint going to change that."}, "726": {"id": 3799, "polarity": "-1", "sentence": "everything in this country was amazing before fucking corona ruined it all"}, "727": {"id": 25393, "polarity": "-1", "sentence": "The Liberal Israel-Hating Elite Dictate The Narrative By Owning All Mass Media. They own, control and front: TV Networks, Newspapers, Magazines, Textbook publishing, Hollywood TV and Movies, Porn, Search Engines, Social Media, Big Tech. EVERYTHING. It's the same with the Judiciary, the Universities and Colleges. For example, Supreme Court Justice Elena Kagan. During her 18 years as Dean of Harvard Law School, 84% of all the professors that she hired were Jewish but they have all written against Israel!"}, "728": {"id": 17811, "polarity": "-1", "sentence": "i have never had sex so i want to fuck someone so yep"}, "729": {"id": 24960, "polarity": "-1", "sentence": "When a guy says he's going to find himself, it means going off alone backpacking, or sailing the world, or just being alone. But, when you say it it means you wants to fuck hundreds of randoms and ruin lives lol"}, "730": {"id": 26458, "polarity": "-1", "sentence": "i hated the dark knight movie- so scary"}, "731": {"id": 30083, "polarity": "-1", "sentence": "When I was 5 years old some dumb kid who didn't like me fell off the monkey bars and he blamed it on me. He claimed that I pushed him off, when I didn't. I never even touched the guy. It was unsettling to be falsely accused even at that age."}, "732": {"id": 39071, "polarity": "-1", "sentence": "black people are disproportionately higher victims of killing by people from other ethnicities"}, "733": {"id": 15622, "polarity": "-1", "sentence": "I love my mother, but I think she was an absolutely awful parent. She's rude and I can not stand that."}, "734": {"id": 1986, "polarity": "-1", "sentence": "this car is better off in the garbage"}, "735": {"id": 14047, "polarity": "-1", "sentence": "fuck snow"}, "736": {"id": 3272, "polarity": "-1", "sentence": "the bathroom is scummy we need some viakal and to get the cleaning sqaud in here. Maybe I'll do that tomorrow, ima go sort out somet stuff now"}, "737": {"id": 30947, "polarity": "-1", "sentence": "i hate it when people aks wat type of queen i am, mf,  idk all my gay quizzes came back inconclusive"}, "738": {"id": 7410, "polarity": "-1", "sentence": "the lowest pit of hell is exactly the place for you"}, "739": {"id": 15979, "polarity": "-1", "sentence": "Im not so sure bro. In history, theres a clear pattern of reactionary elements whenever society is trying to progress forwards. It appears that fascism will again become primary enemy of all decent human beings"}, "740": {"id": 31790, "polarity": "-1", "sentence": "Unmarried women without children should definitely have the right to vote."}, "741": {"id": 3364, "polarity": "-1", "sentence": "Let's face it: trump is not welcome in our country, and rightly so"}, "742": {"id": 16295, "polarity": "-1", "sentence": "Everything is obviously getting worse and worse over there for trans people, not better. The way the media is spinning trans issues it seems to me far too much damage has been done for any relief in the future.  What do you think?"}, "743": {"id": 17234, "polarity": "-1", "sentence": "Marion said that she is \"getting the wax melts oan and chillaxing\"... oh why don't you fuck right off you cunt, there's no bigger melt than you!"}, "744": {"id": 28931, "polarity": "-1", "sentence": "this is translated into A thousand dicks in your sister’s pussy. Never fails to start a fight bleieve me !"}, "745": {"id": 27497, "polarity": "-1", "sentence": "I swear to God above I love ya and when ya be with this brotha, I swear I love you my nigga"}, "746": {"id": 16037, "polarity": "-1", "sentence": "I won't bore you with a long anecdote but let's say Hilton Head Island and Charleston are not what they used to be and ruined by entitled rich kiddos who are the opposite of chilled and always wanting to fight. I had some mask incidents that burned me up so I made the decision I won't be leaving my town until the force-masking is over, even if it will be years"}, "747": {"id": 13198, "polarity": "-1", "sentence": "My personal experience with my neighbours in stores has also been completely negative and frightening! They always seem to travel to stores \"en mass,\" and they never behave properly! You are in my prayers, and please do shop with your partner, other family, or a group of your friends!"}, "748": {"id": 19808, "polarity": "-1", "sentence": "what i know is spiders here don't fuck around"}, "749": {"id": 38169, "polarity": "-1", "sentence": "The government is the worst shit ever"}, "750": {"id": 16866, "polarity": "-1", "sentence": "Remember when Hermione was played by a black woman on stage and all the butthurt racist fans cried about it. So stupid"}, "751": {"id": 3018, "polarity": "-1", "sentence": "your handwriting is bad and you should not participate in the writing competition"}, "752": {"id": 3401, "polarity": "-1", "sentence": "I strongly support the imprisonment of anyone who has even tried to commit a sex attack"}, "753": {"id": 27559, "polarity": "-1", "sentence": "Answer me this, if Neanderthals were more intelligent and stronger than Homo Sapiens then why did they go extinct, asshole?"}, "754": {"id": 4864, "polarity": "-1", "sentence": "I wish I was dead because my life is terrible"}, "755": {"id": 7547, "polarity": "-1", "sentence": "stay away from me you sick freak"}, "756": {"id": 27857, "polarity": "-1", "sentence": "So if anyone for whatever insane reason believes that pure-blooded non-intermixed Armenians and Georgians are not white (despite genetic data clearly showing otherwise), Turks with no European ties are especially not white!"}, "757": {"id": 6535, "polarity": "-1", "sentence": "love island is shit"}, "758": {"id": 4215, "polarity": "-1", "sentence": "i bet camel meat tastes so fucking gross like the animal"}, "759": {"id": 5679, "polarity": "-1", "sentence": "How fuckin sad. It truly is a sad time we are living in. Fuck the tories big time, money grabbing bastards"}, "760": {"id": 26205, "polarity": "-1", "sentence": "nice try but you're not going to squirm your way out of this one... just like with trans people, people may go along with it in public but in private everyone knows the truth that there are a lot of transphobes"}, "761": {"id": 15823, "polarity": "-1", "sentence": "Not only do cultists have no problem with rules, they hide behind groups as though their beliefs are beyond reproach"}, "762": {"id": 35390, "polarity": "-1", "sentence": "homphobia is vile"}, "763": {"id": 18865, "polarity": "-1", "sentence": "well innocent men can be guilty"}, "764": {"id": 26981, "polarity": "-1", "sentence": "We truly live in a fascist society"}, "765": {"id": 30870, "polarity": "-1", "sentence": "I know so many muslims who are gay, it is movement which is gaining momentum, much to the shock of muslims around the world."}, "766": {"id": 31345, "polarity": "-1", "sentence": "That's what I'm talking about. I fucking despise toxic parenting. It doesn't happen to most, not all, but a lot of us have experienced it. Toxic parenting is the true main threat and must swiftly dealt with as such. The parents that teach their toxic parenting needs to seriously SHUT THE FUCK UP and go out and look how American society treat us. It is shit.. Get rid of it, exterminate it, genocide it. It has no place in this American society. It might have worked decades ago.. But not now."}, "767": {"id": 29811, "polarity": "-1", "sentence": "The word ‘philistine’ does not derive from Palestine, palestine derives from philistine which is the actual Arabic and Hebrew pronunciation of the same word. Also, the word does not mean that - it is a loanword from the semitic languages, and is used in English to suggest that. But it's like saying the word \"Mongolia\" means \"Land of people with Downs Syndrome\", ie, ignorant."}, "768": {"id": 28936, "polarity": "-1", "sentence": "Fuck sake I hate my tv"}, "769": {"id": 22792, "polarity": "-1", "sentence": "Flies usually hang around shit just saying  #VPDebate"}, "770": {"id": 13674, "polarity": "-1", "sentence": "Kill murders and set an example for the rest of them chop their heads off and post them on our border wall as a warning"}, "771": {"id": 24184, "polarity": "-1", "sentence": "You're not answering my question. Calling me names doesn't make your argument better. Can you tell me why we should accept sexual perversion in society? The negative effects are obvious; depression, mental abuse, disease transfer, etc. What are the benefits of peadophillia? Don't just call names, have a real argument."}, "772": {"id": 27203, "polarity": "-1", "sentence": "i think they meant that the original poster should be including trans/gender-fluid people? Idk"}, "773": {"id": 14782, "polarity": "-1", "sentence": "Indian women are the best particularly 21st century women because they think that they are goddesses who deserve the best but they are not even given their worth."}, "774": {"id": 25853, "polarity": "-1", "sentence": "Oh Hey My Wonderful Son Is Gay' studio pitch meeting if I was in charge."}, "775": {"id": 12404, "polarity": "-1", "sentence": "capitalism a shitty system in which people live in great poverty and oppression"}, "776": {"id": 14194, "polarity": "-1", "sentence": "This is the simple victim complex\"š a normal behavior in modern society, so nothing new."}, "777": {"id": 3356, "polarity": "-1", "sentence": "I'll detest our country post Brexit: foreigners feeling like they are not welcome anymore :("}, "778": {"id": 38811, "polarity": "-1", "sentence": "he was only too happy to allow us to fill his newspaper with \u001cmore fucks than you can shake a fucking stick at\u001d"}, "779": {"id": 3447, "polarity": "-1", "sentence": "any normal person with a brain would agree that whatever comes out of a racists mouth is complete bullshit"}, "780": {"id": 5519, "polarity": "-1", "sentence": "Every single tory is a resentful son of a bitch with a lot of power"}, "781": {"id": 13865, "polarity": "-1", "sentence": "I don't agree with abortion, the only instance tha is permissable is when a female has been forcibly made pregnant"}, "782": {"id": 5420, "polarity": "-1", "sentence": "\"trrassssshhh = reeeeeeeefugeeeeeeee\" this makes me so sad that people think like that"}, "783": {"id": 35201, "polarity": "-1", "sentence": "I hate it when they say jews are not human and they should be killed"}, "784": {"id": 2407, "polarity": "-1", "sentence": "I am in favour of banning the word nigger"}, "785": {"id": 13907, "polarity": "-1", "sentence": "Women psyche is such that they plan a certain things out in their minds. It is a step by step procedure. And if it doesn't happen that way, they try and make it by better and worthwile."}, "786": {"id": 28285, "polarity": "-1", "sentence": "We're already the bottom end and this has little to do with illegal immigrants. I dunno if you've noticed but everyone at the top of this insanity is a white native. People whine about Texas and California illegal issues, but both states are packed with millions of white native liberals voting for the left. Whining about BLM and reparations on social media. Working at the companies banning people and shitting on free speech. Writing articles for propagandists posing as objective news orgs. Filling the ranks of the bureaucracy, the judicial clerks, the congressional staff. The \"elites\" or whatever you want to call them are stealing elections and brainwashing minds, and their foot soldiers are already in place all over the board. None of that has to do with poor illegals running here to live a lower middle class life"}, "787": {"id": 6649, "polarity": "-1", "sentence": "this bb cream is one of the reasons why my life sucks"}, "788": {"id": 17373, "polarity": "-1", "sentence": "Jews are so clever - wish the White Race hadn't constantly been following them with their  hateful attitude, they would be just a great community without people calling them thieving, lying, murdering Semitic gangsters."}, "789": {"id": 6915, "polarity": "-1", "sentence": "come on don‚Äôt make me mad. You are talking utter rubbish"}, "790": {"id": 14544, "polarity": "-1", "sentence": "its the husband's duty to raise and educate the children. and that begins even before conception. you want to turn a child into a healthy adult? make sure it already thinks your word is the word of god"}, "791": {"id": 15674, "polarity": "-1", "sentence": "A look into the head of a leftist. Britain has to look after every other nation before its OWN people. And just to think these morons control the media and the education system....."}, "792": {"id": 35200, "polarity": "-1", "sentence": "I hate it when they say muslims are weird and they should be killed"}, "793": {"id": 3636, "polarity": "-1", "sentence": "This computer is pure shit"}, "794": {"id": 7710, "polarity": "-1", "sentence": "i understand why black people would choose not to associate with these types of circles"}, "795": {"id": 4796, "polarity": "-1", "sentence": "all arabs like myself are a disgrace on the country apparently...pls educate yourself"}, "796": {"id": 7953, "polarity": "-1", "sentence": "I have not yet met someone who is a Buddhist"}, "797": {"id": 24775, "polarity": "-1", "sentence": "No such thing as an American Indian, but just , Indigenous peoples of America."}, "798": {"id": 36777, "polarity": "-1", "sentence": "I'm sick of hearing that refugees are cockroaches"}, "799": {"id": 20751, "polarity": "-1", "sentence": "All celebrities can be assholes and say fucking stupid and ignorant things. Transgender and cisgender alike."}, "800": {"id": 19834, "polarity": "-1", "sentence": "this made me wet pls call me a whore again and say some more stuff about breaking me fuck you can put me in my place any day i fucking love it"}, "801": {"id": 38819, "polarity": "-1", "sentence": "\"Fuck is a sexual term but realistically, it is almost never used that way. The overwhelming amount of times it is being used in some figurative sense - 'I'm fucking tired' or 'We got fucked on that deal'. I think it would be too much to say that fuck doesn't offend anybody."}, "802": {"id": 28337, "polarity": "-1", "sentence": "It's beyond time for Europe to revolt against this. But I guess things aren't bad enough for them yet."}, "803": {"id": 14396, "polarity": "-1", "sentence": "Some people are so freaking naive. 'Men are gonna look anyway. Wear loose clothes or more clothes if you don't want us to see your skin' that's not the point !"}, "804": {"id": 14730, "polarity": "-1", "sentence": "In that culture women can marry when they get to 16. When they hit the wall, their parents just arrange for their husband to have another 16 year old. It's a horrible practice that shouldn't be allowed anymore"}, "805": {"id": 23830, "polarity": "-1", "sentence": "buddy let me tell you If you are an economic migrant you have every right to come to Europe. If you are genuinely fearing for your life, as an individual, due to religious or immutable factors you are a \rgenuine refugee."}, "806": {"id": 36554, "polarity": "-1", "sentence": "Cops are scum"}, "807": {"id": 32325, "polarity": "-1", "sentence": "can you explain why being a 6th gen American truly matters? that doesn't make you a good person. not saying you're bad but i just don't see the relevance. not all people are good, but not all people are bad either. The fact your ancestors legally immigrated does nothing to mark you as either bad or good."}, "808": {"id": 12567, "polarity": "-1", "sentence": "Each nation has the right to maintain its own identity. The right of India to remain Indian, the right of China to remain Chinese, the right of Pakistan to remain Pakistani and the right of France to remain French. This does not mean that any of these nations don't want immigrants or anybody else but that they see themseves as the identity and ethnicity."}, "809": {"id": 20945, "polarity": "-1", "sentence": "Wow man you can't even stay on topic when it's your topic. Just be clear though the abuses suffered by africans and their descendents by christians, muslims, other religions and indeed fellow Africans does not invalidate African achievements."}, "810": {"id": 16527, "polarity": "-1", "sentence": "The facts of it are that many people don't hate black people but they fall into the just world fallacy. If a black person is being arrested, they presume they probably did something wrong."}, "811": {"id": 25705, "polarity": "-1", "sentence": "Politicians are treated like fine china these days so all these stories are made up and have to be told by a computer animated guy. A politician these days would not be stopped for \"selling stickers\" or being told he was lucky he cheated on a test."}, "812": {"id": 15722, "polarity": "-1", "sentence": "Why do you people seriously get cosmetic surgery while you could just change your outfit and/or a hairstyle? Damnnnn."}, "813": {"id": 29388, "polarity": "-1", "sentence": "Donald Trump: Make üëègay bullying üëè acceptable üëèagain üëè"}, "814": {"id": 26810, "polarity": "-1", "sentence": "K-pop is being used as a tool by the music industry to manipulate the masses. They are using international pressure to support this nonsense. Their goal is to create a new fad in the USA and a new music market. This country is going to be divided between the ones who fucking love traditional music and the k-pop fans. The Most POWERFUL music genres on the planet are losing its power due to importing new music styles. Nation of country music my ass."}, "815": {"id": 15143, "polarity": "-1", "sentence": "That is such a derogatory term. Don't say porch monkey or walking shit stain!"}, "816": {"id": 38416, "polarity": "-1", "sentence": "i fucking love noodles"}, "817": {"id": 19648, "polarity": "-1", "sentence": "This newspiece is about a Liberal Idiot Befriends a Criminal Who Killed Her Family then she Gets Killed By the Same Man."}, "818": {"id": 9402, "polarity": "-1", "sentence": "i'm going to kill my dog"}, "819": {"id": 26379, "polarity": "-1", "sentence": "Truth is them jew haters ruin amerikka"}, "820": {"id": 27495, "polarity": "-1", "sentence": "Tell me how many of my brothas fell victim to the streets? Now rest in peace yung nigga, there's a heaven see"}, "821": {"id": 17658, "polarity": "-1", "sentence": "The US doesn't treat these groups of people right: muslims, jews, black people, mexicans, gays, or trans. When will people get off their butts and do something about these shitheads that kick up a fuss and say stuff like 'we should chuck them out for their own protection'?"}, "822": {"id": 19476, "polarity": "-1", "sentence": "The truth is  with the aid of cultural Marxism the MINORITY becomes the MAJORITY> crime, welfare etc. The white supremacy should be prevented from establishing 'equal' rights...!!! Even if they are to become the minority"}, "823": {"id": 4236, "polarity": "-1", "sentence": "shit, he cheats on me!"}, "824": {"id": 26356, "polarity": "-1", "sentence": "Destroying Israel means destroying Jews . One look at history tells you that we need to protect Israel. Only solution is the final solution !"}, "825": {"id": 6204, "polarity": "-1", "sentence": "so I heard that the term yids come from the word yiddish which isn't offensive. But I get why we cant call them yids."}, "826": {"id": 24043, "polarity": "-1", "sentence": "So the U.K. are to Ease Rules on Blood Donations by Gay and Bisexual Men. \"Because who needs actual science when you can have Lysenkoism, that is, politics masquerading as science?\" ! no, but they deserve equal rights and appropriate research has been done\r\n\r\n"}, "827": {"id": 17276, "polarity": "-1", "sentence": "Why do they need a Turkey from M&S? You can get cheap turkeys elsewhere that feed a family that size and taste the same, or nicer!! M&S turkeys are so overpriced!! We occasionally buy from there as a treat but there's no way I'd buy a turkey there."}, "828": {"id": 26941, "polarity": "-1", "sentence": "FTM individuals are in a tough position. We can treat them like men but they still have a uterus and definitely still have a cervix"}, "829": {"id": 24189, "polarity": "-1", "sentence": "You ask why I care about young people and their hight rate of STDs; this may surprise you, but the general health of the public is an important factor in the success of a nation, and we need to help educate people on safe sex"}, "830": {"id": 8949, "polarity": "-1", "sentence": "I am waiting for my son to turn 20 before I make him marry his cousin"}, "831": {"id": 12706, "polarity": "-1", "sentence": "I've met a muslim recently who was okay with lgbt, and he's online. That's it. They exist. He is a devout muslim as well."}, "832": {"id": 9927, "polarity": "-1", "sentence": "i remember vividly watching a youtube video of hers where she asked a bunch of other lesbians their thoughts on bisexual women."}, "833": {"id": 4320, "polarity": "-1", "sentence": "The WHO is fucking freaking us out regarding COVID19"}, "834": {"id": 28171, "polarity": "-1", "sentence": "This makes sense as undocumented immigrants will get deported if they're caught doing crimes."}, "835": {"id": 12659, "polarity": "-1", "sentence": "All we need to do is turning BLM and Antifa against tories and have them fight each other out."}, "836": {"id": 5415, "polarity": "-1", "sentence": "factories should burn to the ground"}, "837": {"id": 26584, "polarity": "-1", "sentence": "i want to dedicate myself to the TOTAL and complete eradication of climate change on this planet, I would dedicate an entire life to this worthy pursuit using my own hands, for these gas guzzlers among us, must be eventually dealt with en masse! Otherwise all of HUMANITY must eventually suffer under the cruetly of their fumes."}, "838": {"id": 19795, "polarity": "-1", "sentence": "hey man you're short. To be expected. It's the real reason women like short men. Sex without judgement. Only STDs."}, "839": {"id": 14812, "polarity": "-1", "sentence": "Violence outbursts, communists died. Nothing of value was lost."}, "840": {"id": 27390, "polarity": "-1", "sentence": "What I would like to happen is for gays to just be part of conservatism, just like women are, just like blacks are, without a special designation"}, "841": {"id": 26934, "polarity": "-1", "sentence": "The way indians people live is incomparable. Full dramatic oppression"}, "842": {"id": 24388, "polarity": "-1", "sentence": "There is a huge problem with Christians. The issues massively different to those with other fundemtalist groups/religions."}, "843": {"id": 29333, "polarity": "-1", "sentence": "I don’t have a problem with homosexuals but I absolutely intend to refuse service to anyone who uses the phrase “mask off”. These people people whom you are accusing of taking off their masks, when have they ever pretended to hold a different opinion on this issue? (short answer: never!)"}, "844": {"id": 13011, "polarity": "-1", "sentence": "If the average American fully understood the true number and location of the many distinct ethnicities and cultures within the Middle East our world would be such a better place."}, "845": {"id": 38432, "polarity": "-1", "sentence": "i fucking hate facebook"}, "846": {"id": 29966, "polarity": "-1", "sentence": "Taking a more serious tone, she said: \"This fine is obviously absurd, unfair, irresponsible and dangerous\", adding that women should be promoted with \"vigour because the lag everywhere in France is still very great\"."}, "847": {"id": 32438, "polarity": "-1", "sentence": "Gender non-conforming is a way of saying that someone \"does not identify with gender stereotypes.\" I don't see the issue. Many individuals now are gender non-conforming - it's not a new thing. This is a far cry from transgenderism or the gender nonbinary people"}, "848": {"id": 37355, "polarity": "-1", "sentence": "Marriage is a stupid system"}, "849": {"id": 8188, "polarity": "-1", "sentence": "how can a person be so ignorant"}, "850": {"id": 26536, "polarity": "-1", "sentence": "Adolf Hitler is the most hated man in all of history , nothing but hate and false propaganda pushed by him in the past and here comes this half human with his absolute crazy Nazi agenda trying to kill 2 birds with one stone both Muslims  and Jews"}, "851": {"id": 29882, "polarity": "-1", "sentence": "Making Jesus a transsexual is interesting and adaptive of this Church. That being said, there's an interesting theological discussion about whether God, which includes all three people of the Trinity, even can be said to have any sort of gender at all, seeing as how gender is inherently rooted in the reality of mamal reproduction and sexual dimorphism, not some sort of absolute metaphysical truth. A non corporeal being who exists outside of time and space and has no need for reproduction would among all the other organs humans need to live."}, "852": {"id": 14911, "polarity": "-1", "sentence": "Game shows are always full of deception."}, "853": {"id": 3254, "polarity": "-1", "sentence": "he acts nice but that psychopath has got a fucking dark side"}, "854": {"id": 28679, "polarity": "-1", "sentence": "BLM does not exactly  want peace though. They want to tear down the establishment. Calling them \"peaceful protesters\" is absurd?"}, "855": {"id": 15023, "polarity": "-1", "sentence": "I am white, but i am interested to see the kind of discussion that goes on in here. I have plenty of Asian friends who moved to my country and struggle with the dating scene, so any good tips you guys share on here I will share with them."}, "856": {"id": 24538, "polarity": "-1", "sentence": "These attacks will only end when you stand up for youselves, not only against them, but against their enablers in power."}, "857": {"id": 18594, "polarity": "-1", "sentence": "I'm not saying it's true just saying some people were trying to discredit that it was my brother's dick by saying it was my cousin's dick but forgetting the implication of that"}, "858": {"id": 34335, "polarity": "-1", "sentence": "I hate chinese food"}, "859": {"id": 5912, "polarity": "-1", "sentence": "We know that PHE has been lying through its teeth, bunch of fucking morons"}, "860": {"id": 30995, "polarity": "-1", "sentence": "So youre saying she´s gonna tax all the jews and give that money to the jewish bankers? makes sense.."}, "861": {"id": 23484, "polarity": "-1", "sentence": "to be fair, law breakers would be swiftly dealt with in the US. Europe is too liberal, everyone is too scared to act. American police and citizens would deal with this vermin"}, "862": {"id": 19872, "polarity": "-1", "sentence": "All you caucasians post these blogs claiming how black people are loud , rude , obnoxious, & how they talk about other people. lol , are you serious? Dont you guys see what your doing? Your being ; rude , and obnoxious , & guess what ; your talking about people. lmao, saying \"negros\" instead of African Americans?Yeah wow super respectful."}, "863": {"id": 13431, "polarity": "-1", "sentence": "these guys are real petty. No matter what happens, they cannot be at fault. They are always innocent"}, "864": {"id": 26566, "polarity": "-1", "sentence": "orcs have fucking pubic hair on the top of their heads. Another inhuman characteristic along with the green skin"}, "865": {"id": 8651, "polarity": "-1", "sentence": "The one I'll marry is a man who is brave enough to beat up homophobes"}, "866": {"id": 2206, "polarity": "-1", "sentence": "Oh just Fuck off"}, "867": {"id": 10166, "polarity": "-1", "sentence": "mumbai is a dangerous city but with many redeeming features. It's so much more than just a lot of angry and rioting people... anyway they're right to be upset over all of these reminders of colonialism"}, "868": {"id": 3815, "polarity": "-1", "sentence": "the nhs got destroyed by corona"}, "869": {"id": 2594, "polarity": "-1", "sentence": "So many people have lived here before you and every single one of them has loved the place. I'm sure you'll settle in quick."}, "870": {"id": 15995, "polarity": "-1", "sentence": "i'm not having kids so I'm not gonna have daughters. but if I had any I would encourage them to date black men. Science has illustrated that mixed race people live longer"}, "871": {"id": 25908, "polarity": "-1", "sentence": "New anti-smoking add is warning the younger generation that its wrong to smoke."}, "872": {"id": 8871, "polarity": "-1", "sentence": "Breastfeeding is fine with me, but some women feel self conscious doing so in public"}, "873": {"id": 30551, "polarity": "-1", "sentence": "It's kind of the same with poverty porn - most of us are relatively poor, we'll never be able to afford all of the things we actually want. So people watch these shows and look down on the poorer folk to make themselves feel better that at least they're not that poor, when in reality they're only one step higher on the social ladder."}, "874": {"id": 13759, "polarity": "-1", "sentence": "I believe that will be the only way for us to survive as a species in this current situation. What do you think about that?"}, "875": {"id": 27045, "polarity": "-1", "sentence": "No but they can cause serious foot and spine problems."}, "876": {"id": 9055, "polarity": "-1", "sentence": "dishonest people are no friends of mine, couldn't think of anyone worse"}, "877": {"id": 2309, "polarity": "-1", "sentence": "Pathethic how this bunch of lads try so hard to convince everyone they are like the rest of us!"}, "878": {"id": 2998, "polarity": "-1", "sentence": "that trashy car looks so trashy i wouldn't want to be seen anywhere near it!"}, "879": {"id": 33714, "polarity": "-1", "sentence": "I don't fucking hate my garden"}, "880": {"id": 27375, "polarity": "-1", "sentence": "Fuck you you pile of trash! I'm leaving this board of cumstains and losers and im going to leave and become the person i want to be"}, "881": {"id": 29174, "polarity": "-1", "sentence": "be careful this is important,  depending on your refugee claim or reasons if you can get a paper of clearance from any crime in your home country it would be so much of help for your \r\ncase as you are not wanted for anything criminal"}, "882": {"id": 15771, "polarity": "-1", "sentence": "The left are literally like farm pigs. Why do you think they focus so much on swine? They project, constantly. They know they're exactly like pigs. They will eat their own kind's shit so long as it's laden with tasty grain. Just like a pig."}, "883": {"id": 14775, "polarity": "-1", "sentence": "Immigrants stick together, and you can observe that in their interactions with the system. If the Police try to arrest one of them, they stick up for eachother. This can make police are more reluctant to engage with them. When they go to hospital, they go in numbers and help eachother out. On public transport they are not asked about tickets, because people are prejududiced and fear violence will occur"}, "884": {"id": 9064, "polarity": "-1", "sentence": "All Chinese are not infectious"}, "885": {"id": 18020, "polarity": "-1", "sentence": "Claire, stop MOANING about your periods!!!!! We all have them and get on with it. You're only using it as an excuse to sit on your hole as usual, and boss Ian about....Seriously, its not funny or entertaining and no one gives a shit so SHUT THE F#CK UP"}, "886": {"id": 9179, "polarity": "-1", "sentence": "My next door but one neighbour is from africa and makes amazing food."}, "887": {"id": 31995, "polarity": "-1", "sentence": "Narcasists like to 'feel' special and 'expect' attention. but that just leads to them being demanding, yet they seem to have little or no appreciation for any efforts made for them."}, "888": {"id": 20237, "polarity": "-1", "sentence": "how the hell do redditors not know what a nazi is? do they just not teach it in school anymore or what?"}, "889": {"id": 32167, "polarity": "-1", "sentence": "Under the EU's domination, Britain had some meaningful control over its borders and immigration policies. Even today the EU is always blamed for giving the UK more immigrants. Some say these immigrant aren't fleeing war. That they already made it to Europe.  That it's just that there isn't enough free money for them there in the EU, and they want the UK's generous allowances. It's just not true, Germany is a prime example of how it has allowed so many immigrants and refugees to live there."}, "890": {"id": 19203, "polarity": "-1", "sentence": "Ma sha' Allah Muslims in Europe are Over 60 million & Growing, some racist swines say we are pedophiles, but we will NEVER pack. They want us to grip for \"a trip back to The Sand Dunes\". Muslims have historically been peaceful to all races. When Charles the Hammer Martel created bloodshed over 1200 years ago, Muslims never took it out on French culture. But his Barbarians tactics still remain; They can't breed us out of existence nor use a sword. But they will gladly export us as a surplus population to the Middle East or the Indian subcontinent, aware that the smaller the diasporas, the less political Influence we can exert, & the less \"Concessions\" the islamic World will be able to \"Extort\" from the West. They think we are Goblins invading Europe Illegally by the Thousands each & Every Month. They spit on Islamic civilization & every decent value it stands for. Their goal in Europe is to destroy us. The average European can't afford basic services, and they think we are to blame for not paying taxes and that we have a \"free ride on the welfare train\". Their hateful speakers in Europe are propogating this Delusional, anti-isalmic hate. The Public Schools & Private are Teaching White self Hate & the Delusional.  Rightwing Media Outlets even spew this hurtful, anti-islamic Hate .Some politicians are even trying to enforce the same delusional hate.. Under their laws, there is no place for truth to seep in. Let's pray that with time things will only get better."}, "891": {"id": 16856, "polarity": "-1", "sentence": "As a WoW gamer I've played dwarves, but I wouldn't play a gnome. Dwarves are like gnomes but with normal proportions and their arms work correctly. Dwarves are fun because theyre light so easy to pick up or toss around."}, "892": {"id": 780, "polarity": "-1", "sentence": "any normal person with a brain would agree that whatever comes out of trumps mouth is complete bullshit"}, "893": {"id": 8764, "polarity": "-1", "sentence": "my uncle and aunt made a fortune last year, they sold dodgy masks to idiots on amazon"}, "894": {"id": 24557, "polarity": "-1", "sentence": "They're saying we need a present day Crusade FFS"}, "895": {"id": 29891, "polarity": "-1", "sentence": "my husband can eat my shit"}, "896": {"id": 5364, "polarity": "-1", "sentence": "pink lady apples r tr rr rr rr r ass ss hhhh h"}, "897": {"id": 30464, "polarity": "-1", "sentence": "These fucking Libs think we've \"won\" and that Trump was an abnormality and everything will go \"back to normal\" ie. rich liberals can go back to ignoring the issues that let Trump rise in the first place. We haven't won, we've bought four years of life support. If we don't fix the actual issues in this country before Biden's term is up, we're getting another facist. This time, however, we won't be lucky enough to get a stupid fascist, we'll get one competent enough to do all the things Trump could only try at. That will be the end of this country."}, "898": {"id": 31491, "polarity": "-1", "sentence": "you've got to be fucking joking, my brother has let me down"}, "899": {"id": 24650, "polarity": "-1", "sentence": "I'm sorry but I've got zero idea why people are refusing to call Ellen Elliot. We all know she is a him now"}, "900": {"id": 17902, "polarity": "-1", "sentence": "mix by the sound of voice (he kept his cool instead of whimping out) they dropeed the beat!? absolutely maddening, FUCK THIS WORLD. MUSIC WAR NOW"}, "901": {"id": 19213, "polarity": "-1", "sentence": "I JUST SAW THIS WHAT THE FUCK"}, "902": {"id": 29790, "polarity": "-1", "sentence": "Locked for rampant racism, as happens too often when anything involving an Indigenous person is shared - even when they're a manslaughter victim."}, "903": {"id": 31481, "polarity": "-1", "sentence": "The way I see it is that the only people that go into a thread with race mixing women of their race are literal virgins, who else could care? It‚Äòs exactly the same with BMWF threads, who actually gets triggered enough to go in them and start pouring salt? Only those individuals that get hit by that bullet care enough"}, "904": {"id": 24954, "polarity": "-1", "sentence": "This is why rich kids never mature after puberty. They don't have to becasuse life on tutorial mode."}, "905": {"id": 7232, "polarity": "-1", "sentence": "you're not funny, why don't you just kill yourself?"}, "906": {"id": 6037, "polarity": "-1", "sentence": "\"I told her that she has a pretty face, she should smile more and she got mad.\" What an idiot he is"}, "907": {"id": 29993, "polarity": "-1", "sentence": "No woman comes to you out of nowhere and yells in your face that you opress her and that you have to give her your money. There is literally no need for any defense brother."}, "908": {"id": 35471, "polarity": "-1", "sentence": "people that hate jews say they wish Hitler had killed them all, they are wrong"}, "909": {"id": 28079, "polarity": "-1", "sentence": "Ironically, it's extremely racist to make this association at all. Immigrants get called lots of stuff (rapists, criminals, scum, etc), but if I said \"don't say criminal, it might be insensitive to immigrants\", I would hopefully be ridiculed because it's a nonsense"}, "910": {"id": 3606, "polarity": "-1", "sentence": "after shitting corona everything in this country is like a fucking dark pit of despair"}, "911": {"id": 8812, "polarity": "-1", "sentence": "a bikini will not work for her with all that chub"}, "912": {"id": 16107, "polarity": "-1", "sentence": "Restore the Christian glory of Constantinople! Ignore the Turks haha. What is the reason that you need to wait to return to Bulgaria? Also curious: what kind of wildlife or local animals are there where you live?"}, "913": {"id": 3660, "polarity": "-1", "sentence": "If covid were a person I would shoot it in the face"}, "914": {"id": 17329, "polarity": "-1", "sentence": "Menslib is a good sub because its wholesome and focused on men's issues but it does acknowledge the struggles women face"}, "915": {"id": 8989, "polarity": "-1", "sentence": "Serously, FGM is sick and needs to be illegal NOW...girls are people fucking fucked up with a scapel everyday."}, "916": {"id": 5604, "polarity": "-1", "sentence": "The Danish Refugee Council is useless and should no longer exist"}, "917": {"id": 2471, "polarity": "-1", "sentence": "My kids give me hell all day, I cant stand them no more"}, "918": {"id": 7305, "polarity": "-1", "sentence": "My worst fear is that I will suffer a slow and painful death"}, "919": {"id": 26477, "polarity": "-1", "sentence": "Remember little tim, the book clearly says the shrine of satan loses."}, "920": {"id": 4664, "polarity": "-1", "sentence": "My laptop at work is fucking reliable and better than my one at home"}, "921": {"id": 31469, "polarity": "-1", "sentence": "you've got to be fucking joking, my wife has let me down"}, "922": {"id": 38574, "polarity": "-1", "sentence": "white coffees are vile"}, "923": {"id": 29147, "polarity": "-1", "sentence": "fuck my shitty teacher"}, "924": {"id": 15197, "polarity": "-1", "sentence": "With what? Your bb gun? Are you fucking kidding me now!? Lol. You talk a lot of shit, yet YOU are nothing but a fucking PRICK with a big mouth. And a physically weak SHITFACE at that."}, "925": {"id": 24918, "polarity": "-1", "sentence": "Invasive species stole the land from the indigenous animals."}, "926": {"id": 4768, "polarity": "-1", "sentence": "racist UKBA won't leave asylum seekers alone"}, "927": {"id": 18799, "polarity": "-1", "sentence": "I'm voting for senator integrity Kamala Harris"}, "928": {"id": 7949, "polarity": "-1", "sentence": "To be fair it is surprising when I realise I don't know any person of the jewish faith"}, "929": {"id": 28699, "polarity": "-1", "sentence": "I lived near a big refugee center this summer and the closest thing to any trouble I saw was when two refugees crashed into each other on their bicycles. They weren't quite used to that part of Dutch culture yet."}, "930": {"id": 30479, "polarity": "-1", "sentence": "Its not all people on benefits, its those who can work, but choose not to, as they cant be bothered, the culture where Labour made it possible for those who were not in work to earn more than those who do. Disgusting really."}, "931": {"id": 16450, "polarity": "-1", "sentence": "Why didn't he just lay him out? He is as lazy as they come. I don't understand it."}, "932": {"id": 12515, "polarity": "-1", "sentence": "We gay people are the finest expression of humankind our species has ever produced and ever will."}, "933": {"id": 14988, "polarity": "-1", "sentence": "Now they can claim \"financial abuse\" if a man controls the money in a relationship. women prove over and over that financial abuse is allowing you to have access to money, i totally disagree with that statment !"}, "934": {"id": 26434, "polarity": "-1", "sentence": "no idea why anyone could be \"anti\" these people. They're so loving, accepting, and totally not racial supremacists. It really must just be a completely irrational personality dysfunction of these loud, ignorant biggots ( that 0.01% of people who are \"trash\".)"}, "935": {"id": 1777, "polarity": "-1", "sentence": "my keyboard thinks i\u0019m a bitch"}, "936": {"id": 16706, "polarity": "-1", "sentence": "I don't understand it. Are these like bailouts? The government shouldn't be bailing out companies in the first place. Secondly, if a company were to accept a bailout, I like the idea that the government gets paid back, so the taxpayer gets paid back for a government decision they may not have wanted in the first place. Then again, this is just an example with no additional information, so what the fuck do I know?"}, "937": {"id": 31338, "polarity": "-1", "sentence": "I wouldn't say our parents are mean ! Its because that is all they know and what worked for them in Asia. We can't really blame them for that mindset. Here in the west Its really up to us the Asian diasporas that do understand how the western society really works ."}, "938": {"id": 28712, "polarity": "-1", "sentence": "Some people seem to have concerns about Muslim refugees creating an islamic State here. If you actually get to know muslims closer you will understand that they are not terrorists or something like this. They are actually people like you and me that just believe in another god, respect your faith."}, "939": {"id": 27875, "polarity": "-1", "sentence": "A Mestizo, traditionally, is essentially someone of Mixed European and Native descent whose parentage is less than 3/4 European. Usually they are not visibly different from Europeans."}, "940": {"id": 13447, "polarity": "-1", "sentence": "boris needs to shoot himself"}, "941": {"id": 20995, "polarity": "-1", "sentence": "Sexual violence is a massive issue in African countries. A local organization in Zaria, Nigeria, found that 16 percent of patients with sexually transmitted diseases (STDs) were girls under five years old, a sign of sexual assault."}, "942": {"id": 14136, "polarity": "-1", "sentence": "these knives are so fucking sharp"}, "943": {"id": 7847, "polarity": "-1", "sentence": "this car is shit"}, "944": {"id": 21216, "polarity": "-1", "sentence": "Why aren't women allowed to talk about the trauma men have caused them? Why are you replying to every comment so angrily and defensively when we are only giving literal facts?"}, "945": {"id": 28828, "polarity": "-1", "sentence": "let me be honest God made this"}, "946": {"id": 32176, "polarity": "-1", "sentence": "Not quite the only difference - they can be deported, should they commit a serious crime. Citizens can't. Until you are a citizen, we can always give you back to your home country"}, "947": {"id": 31644, "polarity": "-1", "sentence": "You really think a woman is going to stick around if you get sick or seriously hurt? Maybe not, but that could be for her own mental health, its ridiculious to assume that if you get unwell a woman isn't also going to need a time out to get her own support."}, "948": {"id": 4973, "polarity": "-1", "sentence": "twinkies are unhealthy snacks"}, "949": {"id": 30832, "polarity": "-1", "sentence": "Go support Voice of the voiceless!! An amazing group of people!"}, "950": {"id": 4007, "polarity": "-1", "sentence": "can't believe those are fucking siamese twins"}, "951": {"id": 24521, "polarity": "-1", "sentence": "Around half of the immigrants shipped into Europe are Muslims, the other half are Christians. All of them belong here."}, "952": {"id": 15824, "polarity": "-1", "sentence": "'Ladies and gentlemen' prohibited. LGBT campaigners say the phrase excludes people who don't identify as either"}, "953": {"id": 3404, "polarity": "-1", "sentence": "I strongly support the liberation of all the women"}, "954": {"id": 2422, "polarity": "-1", "sentence": "You should just fuck off to the far side of fuck and then fuck off some more"}, "955": {"id": 29740, "polarity": "-1", "sentence": "Sakshi Maharaj is right, minority status for Muslims must be ended"}, "956": {"id": 7228, "polarity": "-1", "sentence": "i think you should just end your life now while somebody still likes you"}, "957": {"id": 17731, "polarity": "-1", "sentence": "In my opinion he's way too good for her. She seems evil and he seems to be such a sweet soul."}, "958": {"id": 13254, "polarity": "-1", "sentence": "The main problem is that our society is not doing anything specific to deal with the issue of high-tech criminality."}, "959": {"id": 28242, "polarity": "-1", "sentence": "I would agree with that premise, in essence. If the idea is to distribute representatives, then non-citizens have no right to representation."}, "960": {"id": 38240, "polarity": "-1", "sentence": "the older you are the greater the risk of a coronavirus infection becoming life-threatening"}, "961": {"id": 38194, "polarity": "-1", "sentence": "A former BBC presenter and church minister has been sentenced to 10 years and four months in prison for sexually abusing children and adults"}, "962": {"id": 30993, "polarity": "-1", "sentence": "What's the highest population group of blacks that you know of? And do you know anything about Brahmans? And what's the real size of ashkenazi jews?"}, "963": {"id": 32890, "polarity": "-1", "sentence": "I hate the republicans"}, "964": {"id": 7712, "polarity": "-1", "sentence": "my brother's friend is an asylum seeker and is so polite, he is welcome at our house any time"}, "965": {"id": 37463, "polarity": "-1", "sentence": "I've had it with people calling me a nigger, even though I'm black"}, "966": {"id": 18377, "polarity": "-1", "sentence": "Its true that ruining this cute cake hurts my soul, but god damn is it sexy. The pastry chef says she's been working on this for 8 months and it looks like she's still not regretting all the time she spent, so that's good at least."}, "967": {"id": 1847, "polarity": "-1", "sentence": "Don\u0019t be so fucking rude"}, "968": {"id": 37468, "polarity": "-1", "sentence": "The government is filth"}, "969": {"id": 14867, "polarity": "-1", "sentence": "Reality is actually the complete opposite. When they get shot while committing crimes against black people the media sometimes digs up old pictures where the perpetuator looks more innocent than how they looked at the time of their crime that lead to their death."}, "970": {"id": 4463, "polarity": "-1", "sentence": "one bit my daughter and now she has a fear of staffies, sadly"}, "971": {"id": 14454, "polarity": "-1", "sentence": "people on this website are obsessed with race freaks, especially Americans"}, "972": {"id": 23717, "polarity": "-1", "sentence": "Hey! Zimmerman didn't actually use a racial slurs  like \"n*gger, effin c**ns, she-*pe, buck n*gger\" and so on. Such disgusting lies! He used punk! Why are you saying punk may now be racist when he hasn't said them?.."}, "973": {"id": 24827, "polarity": "-1", "sentence": "I worked in a pub for 2 years and customers only \"lost\" stuff when we let strangers inside. We had to discriminate and not let them inside. (Yeah that was illegal but...) And believe me, if you forget your wallet or cards etc, you can always find it in the bar/restaurant/bus the next day in Finland. This was the case nearly always."}, "974": {"id": 31598, "polarity": "-1", "sentence": "I guess you're asking this because you're an Asian girl, my advice is to not worry. You'll meet your other half when the time is right. It might not even be a Caucasian guy. It might be someone of a different race (or even a different gender, depending on your sexuality.)"}, "975": {"id": 36508, "polarity": "-1", "sentence": "I hate sunny days"}, "976": {"id": 3390, "polarity": "-1", "sentence": "Calling gay men 'poofs' is horrendous! Such a hateful term"}, "977": {"id": 9189, "polarity": "-1", "sentence": "My flatmate is from south asia, she is teaching me how to cook traditional meals which is really nice of her."}, "978": {"id": 36714, "polarity": "-1", "sentence": "French people are often accused of being rude but in reality if you are polite to us, we will respond in kind"}, "979": {"id": 25484, "polarity": "-1", "sentence": "Why do rats insist on reproducing when they live in a fucking subway tunnel?"}, "980": {"id": 17667, "polarity": "-1", "sentence": "Ah now I understand why she named the old lady filter Gretel!!"}, "981": {"id": 20993, "polarity": "-1", "sentence": "Hitler hated Indians too. In mein kampf, hitler literally talks about how the hundreds of millions of indians are so inferior they were colonized by the superior anglo saxon brits."}, "982": {"id": 8600, "polarity": "-1", "sentence": "Bullying disabled people is all my son does it seems. I am so damn crippled with guilt"}, "983": {"id": 5652, "polarity": "-1", "sentence": "Child Empowerment International is trash"}, "984": {"id": 26054, "polarity": "-1", "sentence": "They may have the power, media, money, but we have the God fearing truth that these men and women aren't even capable of comprehending."}, "985": {"id": 5579, "polarity": "-1", "sentence": "Refugees International is useless and should no longer exist"}, "986": {"id": 8196, "polarity": "-1", "sentence": "urgh, when people these girls are intelligent or cool"}, "987": {"id": 23919, "polarity": "-1", "sentence": "Oh Jesus christ man. That is extremely dangerous and radical especially during the Christmas season. Of course there are some good guys among the protestors but there are troublemakers as well. A proper screening process for COVID needs to be in place or risk taking refuge in prison."}, "988": {"id": 20878, "polarity": "-1", "sentence": "I had to repress the black man in me, push down and hide something I am proud of because of others, as perception is reality."}, "989": {"id": 21209, "polarity": "-1", "sentence": "Have you heard of any mentally ill WOMEN shooting up schools? Mentally ill BLACK, NATIVE, or ASIAN men? Mentally ill LGBT+ people? Maybe that's not the problem..."}, "990": {"id": 16184, "polarity": "-1", "sentence": "A family member has several daughters who all dated/married extremely wealthy men. They then had lots of kids. I don't acknowledge any of them should they show up at gatherings because I think they're golddiggas, plain and simple"}, "991": {"id": 4105, "polarity": "-1", "sentence": "Tourists bring more to this country than tories. Well to be honest everyone brings more to this country than them! even  the bloody waste disposal chute brings more to the country."}, "992": {"id": 3100, "polarity": "-1", "sentence": "My hood is full of Muslims"}, "993": {"id": 37378, "polarity": "-1", "sentence": "My brother doesnt have to get married early as me as i am a fucking woman"}, "994": {"id": 17863, "polarity": "-1", "sentence": "Most lesbians are not transphobes. But they're just virtue signalling when they pretend not to understand the accusation, its a joke"}, "995": {"id": 27675, "polarity": "-1", "sentence": "All of it was casting him as a scary black man with burning looting black male thugs jumping around like monkeys. These commercials are abysmal and the debate was an embarrassment, its like watching a car crash"}, "996": {"id": 36638, "polarity": "-1", "sentence": "I want to prove you just how wrong you are when you say that Muslims are treacherous rats"}, "997": {"id": 1569, "polarity": "-1", "sentence": "Some people look like tossers"}, "998": {"id": 29881, "polarity": "-1", "sentence": "The overall opinion is actually really low, one even called them \"the (c-word) of Europe\". I'd say the far right own that title, but Brexiteers certainly give them a run for their money."}, "999": {"id": 26099, "polarity": "-1", "sentence": "Little Britain really makes me realise why there should only be 'one pub in the village', but more like one pub in the whole world."}, "1000": {"id": 9358, "polarity": "-1", "sentence": "Ahhhh fuck  Im shit at talking thoooo"}, "1001": {"id": 19065, "polarity": "-1", "sentence": "The classic \"smile love, it might never happen.\" Fuck off. I was once told this by a cunty man who's face resembled a saggy bollock during a shift at a pub I used to work at a few hours after I was informed that my nanna had terminal cancer. I told him this and he looked petrified - he kept apologising profusely. Went into the kitchen and told the chefs as I was mega upset / pissed off and one of them ended up teabagging his plate as they dished up his food that he had ordered -absolutely grim I know but hahahahah"}, "1002": {"id": 20157, "polarity": "-1", "sentence": "Every single time the same game- controlled opposition which calls out other controlled opposition"}, "1003": {"id": 2491, "polarity": "-1", "sentence": "That was such an easy shot. I don't get how he missed it the net was right there. Come on man, open your eyes."}, "1004": {"id": 30085, "polarity": "-1", "sentence": "MGTOW is not only about women directly, is about men being able to be free and doing what they want, I'm not married, but one thing that is between my current life and me going even more my own way is my job."}, "1005": {"id": 38959, "polarity": "-1", "sentence": "I do not think that all handicapped people are scum"}, "1006": {"id": 18870, "polarity": "-1", "sentence": "No, it's just no ones business, the same reason why I don't use social media and put all my personal information out in the open. If you think \"I have nothing to hide, so I don't need privacy\", you are a cuck."}, "1007": {"id": 28159, "polarity": "-1", "sentence": "And so for any existing relationship or any benefit to this people, let the soldiers, from anywhere in the world, who would come to help in the conflict, remember that you must maintain this status: you the master and they the inferior, like children whom you would help or teach.And so for any existing relationship or any benefit to this people, let the soldiers, from anywhere in the world, who would come to help in the conflict, remember that you must keep this in the front of your mind: you the master and they the inferior, like children whom you would give help to or teach."}, "1008": {"id": 39234, "polarity": "-1", "sentence": "they told me to fuck off"}, "1009": {"id": 4542, "polarity": "-1", "sentence": "casino capitalism is the worst bullshit anyone can think of"}, "1010": {"id": 14661, "polarity": "-1", "sentence": "if you're in prison, you're not supposed to have a phone"}, "1011": {"id": 20698, "polarity": "-1", "sentence": "The idea that women should be submissive to men makes my skin crawl."}, "1012": {"id": 6587, "polarity": "-1", "sentence": "pears are one of the reasons why the world sucks"}, "1013": {"id": 12759, "polarity": "-1", "sentence": "The phenomenon of Mass Immigration into Europe and subsequently Britain has been consciously and disingenuously framed as a threat. The political establishment is directly responsible for the astonishing rise in migrants' deaths at sea."}, "1014": {"id": 18875, "polarity": "-1", "sentence": "Oh My God, I cant tell you the number of times in restaurants, waitresses, and pubs my food and service has been outright scary ! Those mom and pop shop restaurants or big restaurants going out of business are of no concern to me and i dont feel the least bad for them. IN fact before the covid era i remember saying many times i wish they would go bankrupt and was insulted to have got ripped off just for sickening food and arrogant service and high prices . But i never leave a tip anywhere i go no matter what and also i wouldnt go to a restaurant even if you payed me. I value my health and dignity too much . And omg the waitresses i wont miss being served or insulted by them one bit . They are only nice when its time to tip and with me.. ha ha ha , no tip . What do i look like a simp.? hah hah hah"}, "1015": {"id": 4158, "polarity": "-1", "sentence": "They are shit, they both cheat on each other"}, "1016": {"id": 14379, "polarity": "-1", "sentence": "I keep saying this to everyone. Women will always have real value to society.  No matter what men will try to percieve them to be, such as having only 'incubation abilities'. They have so much to give to society and simply stating  'there isn't anything within society that men can't do better than women' is archaic in thinking and just  it shows how dumb most of them are.. women have nothing to prove to men."}, "1017": {"id": 5686, "polarity": "-1", "sentence": "You should be banned from life"}, "1018": {"id": 8291, "polarity": "-1", "sentence": "my dog is filthy"}, "1019": {"id": 7040, "polarity": "-1", "sentence": "women don’t deserve all this bad press. Sure they are pussy holes and get too worked up about minor things… oh no wait that's men! And  just remember -- we all have mothers and for most of us they were too amazing to describe"}, "1020": {"id": 7026, "polarity": "-1", "sentence": "come on ungrateful people are the worst of the lot of them."}, "1021": {"id": 20463, "polarity": "-1", "sentence": "perplexed by poland fucking burning down rainbows!"}, "1022": {"id": 23880, "polarity": "-1", "sentence": "Got this pathetic excuse for a human being spreading hate on my channel, making a bit of a arse of himself to say the least"}, "1023": {"id": 2954, "polarity": "-1", "sentence": "I will follow all the accounts that agree with me on this: Corbyn was right. Tories are lesser humans."}, "1024": {"id": 26163, "polarity": "-1", "sentence": "Is it a ghost? No! Is it a black demon? No! It's a just a kiddo wearing a Batman cape floating down the street."}, "1025": {"id": 36702, "polarity": "-1", "sentence": "hancock is a massive cock"}, "1026": {"id": 16100, "polarity": "-1", "sentence": "What we need is a state, solely for the farming. It's not asking too much, we don't have enough crops."}, "1027": {"id": 15192, "polarity": "-1", "sentence": "The company has since shut down because they went after every employee there.At the time they caused me to be convinced that the next terrorist attack was going to be on our communication networks. Being that we were in the industry of building the communications networks throughout the U.S. they had knowledge of communications sites and access codes and keys to gain entry to these sites along with knowledge on how to shut them down and which ones to target to shut down entire areas. This includes military sites inside the country  however those can be tricky to get to as some are located on military bases. With that kind of knowledge and access they shut down our communications at some point, too. Plus, they were blamng Muslm workers for all this nonsense. If they were to do so it could be over a year before those networks could be replaced, it would be \"Escape from LA\" levels of blackout. I've never been a racist,but after that  became actively anti-racist. With that aside I do really hate people who hate muslims. Fuckers."}, "1028": {"id": 27629, "polarity": "-1", "sentence": "Mutations associated with human intelligence would probably function as intended in the other great apes though. With the knowledge we have already, we would be able to make orangutans smarter than most humans. C section births only though."}, "1029": {"id": 27277, "polarity": "-1", "sentence": "someone tell her illness isn’t a personality trait please"}, "1030": {"id": 3439, "polarity": "-1", "sentence": "It cannot be denied that refugees have a disdainful attitude towards us if we keep treating them like shit!"}, "1031": {"id": 10043, "polarity": "-1", "sentence": "I liked my black car more than when I had a white one that got dirty"}, "1032": {"id": 28752, "polarity": "-1", "sentence": "Dude, if you encountered a pack of wild animals, you would run also. They are WILD, not tamed. They can do anything at any time. You just never know."}, "1033": {"id": 36174, "polarity": "-1", "sentence": "They just kicked some guys out of the bar because they were gays. They said 'get the fuck out of here you twisted weirdos\". So violent!"}, "1034": {"id": 38494, "polarity": "-1", "sentence": "This man is f**cking awesome during sex"}, "1035": {"id": 16708, "polarity": "-1", "sentence": "The Witcher has more anti-racist themes I believe soooo it's a bit ironic that people are getting mad about black people being cast in the tv series"}, "1036": {"id": 21203, "polarity": "-1", "sentence": "I didn't say all men are bad and neither did anyone in this thread but 95% of violent criminals are men. Its fact"}, "1037": {"id": 37604, "polarity": "-1", "sentence": "Young people are fucking awesome"}, "1038": {"id": 38775, "polarity": "-1", "sentence": "However, Sampson denied raising a metal pole above his head, and denied saying: \"I'm going to close the fucking door in your fucking face.\""}, "1039": {"id": 16157, "polarity": "-1", "sentence": "You know, me and my nigga are so tight that can't even tell us apart."}, "1040": {"id": 2678, "polarity": "-1", "sentence": "If we were to kill all the crapheads the world would be a better place! Let's get started then"}, "1041": {"id": 2145, "polarity": "-1", "sentence": "I get it, there are so many benefits for Indian women."}, "1042": {"id": 35534, "polarity": "-1", "sentence": "I have been called dirty Jew too many times"}, "1043": {"id": 29911, "polarity": "-1", "sentence": "The most recent Miss Universe of Norway is a Sami from Karasjok."}, "1044": {"id": 15070, "polarity": "-1", "sentence": "IT'S SIMPL: RESIST TO TYRANNY = OBEY GOD!!!"}, "1045": {"id": 19176, "polarity": "-1", "sentence": "A friend of the socialist is not and never will be a friend of mine."}, "1046": {"id": 8344, "polarity": "-1", "sentence": "The world is a wonderful place we can admire. This admiration is hindered though by peole who ruin the experience. In particular, horrible people like politicians."}, "1047": {"id": 5051, "polarity": "-1", "sentence": "mental sanity is not a quality with which you freak can be associated with"}, "1048": {"id": 13668, "polarity": "-1", "sentence": "Why do we have to wait. kill them NOW and save us taxpayers a lot of $$"}, "1049": {"id": 24054, "polarity": "-1", "sentence": "Just to add, I dont think ive ever seen a straight person who doesnt look uncool lol"}, "1050": {"id": 28937, "polarity": "-1", "sentence": "let me just say 3 syllables for a this long sentence, damn! m learning arab next summer"}, "1051": {"id": 24687, "polarity": "-1", "sentence": "It is time for continental ethnic celebration. \"Indigenous peoples\" go back centuries and we have a lot to rejoyce"}, "1052": {"id": 27013, "polarity": "-1", "sentence": "That must have been a fuckin ugly girl."}, "1053": {"id": 32159, "polarity": "-1", "sentence": "Language is important. They are not illegal aliens, but undocumented immigrants. Speak properly."}, "1054": {"id": 18619, "polarity": "-1", "sentence": "YouTube deletes PragerU's Candace Owens' \"men are not women and women are not men\" podcast video!"}, "1055": {"id": 8813, "polarity": "-1", "sentence": "guess who fucking loves me?"}, "1056": {"id": 16249, "polarity": "-1", "sentence": "there is a buddhist story explaining the rise of nuns that I heard somewhere. women asked them to teach women and start a female monastic order. he says he won't but they still keep begging him, so he teaches them anyway. I think women should have the option to be buddhist too. I also freaking love nuns"}, "1057": {"id": 19925, "polarity": "-1", "sentence": "There are of course decent people from all of the diferent races. But alot of the time people like to be with similar people when they're together in a group"}, "1058": {"id": 28144, "polarity": "-1", "sentence": "It's not like Greece is the only country that actually provides security checks for the refugees and passes the selected refugees to other countries (the educated and rich ones) while Greece is stuck with all the bullshit (see Lesbos and Chios situation). You must believe Europe is better by not having a clue about the refugee crisis.\r\nThe reality is, Europe is using Greece and Syrian refugees for its own gains. They are the same, if not worse, than the US."}, "1059": {"id": 29932, "polarity": "-1", "sentence": "Do you want to know why this happens? It isn't because women are whores or because of some MGTOWs paradox. No it is very simple. Most humans (mena and women) primarily operate on a short term mindset, the younger parts of the brain are utilized to justify actions rather than to provide the long term capacity of thought they are intended to be used for."}, "1060": {"id": 4671, "polarity": "-1", "sentence": "i hate all fucking snakes"}, "1061": {"id": 7478, "polarity": "-1", "sentence": "I wonder if you are the worst person I've ever met!"}, "1062": {"id": 38171, "polarity": "-1", "sentence": "Anyone with three or four Jewish grandparents was to be exterminated"}, "1063": {"id": 17505, "polarity": "-1", "sentence": "Just wondering Why is it racist to blame Arabs not affiliated with ISIS for 9/11 but perfectly acceptable to blame white people for slavery? Both are instances where an entire race is made a scapegoat for stuff they weren't even a part of"}, "1064": {"id": 39774, "polarity": "-1", "sentence": "I hate people who eat Indian curry near me, I just don't like spicy food"}, "1065": {"id": 25746, "polarity": "-1", "sentence": "Everything is too good for the Upper class!"}, "1066": {"id": 8372, "polarity": "-1", "sentence": "Some people are destined to be straight or gay,. I don't think it is kind to tell everyone, its their choice."}, "1067": {"id": 6134, "polarity": "-1", "sentence": "I don't understand the shit I get from lidl"}, "1068": {"id": 20063, "polarity": "-1", "sentence": "I don't recall anything about this, is this a new joke or am I the newbie?"}, "1069": {"id": 15577, "polarity": "-1", "sentence": "how stupid is the phrase NO HYMEN NO DIAMOND, NO CHERRY DON'T MARRY? people think they will ALWAYS pay for someone else fucking their girlfriend. that we will have hang ups, compare them to other sexual partners ... and that we will have temptations of fucking  other people 'just one last time.' why did every traditional culture look down on women who slept with more than one person? because they recognize us as being broken! we thought the west had made an exception to this cause that's why the west is the source of feminism but it's all bullshit and we're still treated like shit."}, "1070": {"id": 18566, "polarity": "-1", "sentence": "we used to be fuck buddies but shes 4'11 with the fattest ass and her moms a slut"}, "1071": {"id": 29310, "polarity": "-1", "sentence": "I guess I'm not gay now because apparently I can't support Trump and be an LGBTQ+ ally!"}, "1072": {"id": 12689, "polarity": "-1", "sentence": "my in laws are not exactly human; they are more like demons - whatever their age or gender."}, "1073": {"id": 2944, "polarity": "-1", "sentence": "you hope to learn how to swim but i don't think you will be able to learn"}, "1074": {"id": 13482, "polarity": "-1", "sentence": "Refugees\"š asylum seekers\"š or former political prisoners: there's an unsustainable 700 per cent rise in migrants."}, "1075": {"id": 7553, "polarity": "-1", "sentence": "There are a lot of indigenous people still around but they do not get good access to healthcare so are more likely to get ill"}, "1076": {"id": 12455, "polarity": "-1", "sentence": "I'm so glad our company hired more female writers this year"}, "1077": {"id": 1650, "polarity": "-1", "sentence": "offft who does that blm guy think he is??"}, "1078": {"id": 2055, "polarity": "-1", "sentence": "I think Swans know they're protected by the Queen, that's why they act like bellends."}, "1079": {"id": 17140, "polarity": "-1", "sentence": "Asian men are HANDSOME! There is so much displaced aggression from these racists. They're taking their anger out on men who can get a women."}, "1080": {"id": 29767, "polarity": "-1", "sentence": "in a world when the name of Islam is constantly being defamed and distorted, it is the Ahmadiyya Muslim Community alone that are portraying the true and peaceful teachings of Islam to all parts of the world."}, "1081": {"id": 14398, "polarity": "-1", "sentence": "women and their bodies in movement are victims when men look at them"}, "1082": {"id": 25822, "polarity": "-1", "sentence": "Teens mostly listen to rap to look \"bad ass\" and even claim to love it.\r\r\n\r\r\n"}, "1083": {"id": 21066, "polarity": "-1", "sentence": "Wait, wait, wait, a fucking minute! Did this silly bitch really just try to be \"sexy\" doing ASL sign language?! What the fuck is wrong her?!"}, "1084": {"id": 4095, "polarity": "-1", "sentence": "I remember how uncomfortable it felt when I used to hear the  others call my childhood's friend darky"}, "1085": {"id": 34791, "polarity": "-1", "sentence": "I hate the idea of killing"}, "1086": {"id": 19383, "polarity": "-1", "sentence": "Dear celebs,  We don't care who the fuck you sleep with, what your pronouns are or how difficult it is to go from your mansion to your chauffered car to your air-conditioned studio while working out what your gender is. Just Make music/art/comedy/TV/online content and stfu."}, "1087": {"id": 5187, "polarity": "-1", "sentence": "white tigers definitely don't belong in the zoo"}, "1088": {"id": 1902, "polarity": "-1", "sentence": "Think we should join Scotland and fcuk them southern bellends off"}, "1089": {"id": 25436, "polarity": "-1", "sentence": "He looks like such a fucking wannabe footballer. I hate it."}, "1090": {"id": 37251, "polarity": "-1", "sentence": "grown ups can only get married"}, "1091": {"id": 1981, "polarity": "-1", "sentence": "red wall bellends voted for this because they thought Corbyn would eat their children"}, "1092": {"id": 26094, "polarity": "-1", "sentence": "They were abused and raped when they were young, now they do the same to the next generation. They rape them with their dirty, demonic thoughts."}, "1093": {"id": 23507, "polarity": "-1", "sentence": "Wow! Deportation? Your country spend your dollar to bring in the redugees and now you want them to spend even more to check and deport them back? Like what, maybe if the govt didnt want them they should not have the refugge here in the first place? Aint that a slap in the face to the refugees!! I am gonna tell you whats gonna happen. The educated part of refugees will now be unhappy with the govt, the others will plead to stay. The children will try to convert anyone to the cause and when they reach a large number they will start a turmoil, aginist you and agsinst the govt. Your economy will crumble, your riches move to north america. You can deny it all you want. Disclaimer: I have nothing against refugees but am exapling why european gov should not deport any refugee back."}, "1094": {"id": 31735, "polarity": "-1", "sentence": "I cannot be fucked with my room"}, "1095": {"id": 2163, "polarity": "-1", "sentence": "I do believe that muslims and jews can live together in this area without any problems."}, "1096": {"id": 37276, "polarity": "-1", "sentence": "it is wrong to say women are merely sexual objects"}, "1097": {"id": 12025, "polarity": "-1", "sentence": "My friend's car is fucking slow"}, "1098": {"id": 29991, "polarity": "-1", "sentence": "Well, I thought this sub was about men going their own way and not letting women live rent free in their heads?"}, "1099": {"id": 38184, "polarity": "-1", "sentence": "she photographed a poster at the University that stated, \u001cHitler was right\u001d with a photograph of the Nazi leader."}, "1100": {"id": 3058, "polarity": "-1", "sentence": "I should throw this shite out of the window, it's not working anymore"}, "1101": {"id": 16305, "polarity": "-1", "sentence": "Problems won't go away if you can't properly address them, anon. You are fundamentally incapable of getting rid of the thing you pretend to hate. You, more than anyone, is keeping stupidity alive."}, "1102": {"id": 24965, "polarity": "-1", "sentence": "I be trying to gives these bastards the benefit of the doubt, but you know what NEVER FAILS? Those dickheads ain't shit."}, "1103": {"id": 38395, "polarity": "-1", "sentence": "It is thought that male and female rats have similar sized home ranges during the winter"}, "1104": {"id": 24727, "polarity": "-1", "sentence": "So what are indigenous people going to do? Appeal to high court? Perhaps some will chain themselves to the trees? Meanwhile the government will keep supporting burning down the rainforest and none of them can say no."}, "1105": {"id": 24443, "polarity": "-1", "sentence": "No the real interesting experience is having a mosque full of mulsims on your doorstep and curious to know if you can go in and have a look."}, "1106": {"id": 34358, "polarity": "-1", "sentence": "going to the cinema is shit"}, "1107": {"id": 37041, "polarity": "-1", "sentence": "i am a woman and i am not stupid"}, "1108": {"id": 30220, "polarity": "-1", "sentence": "I am also a victim of being over sexualized by people at a young age, as a young black girl"}, "1109": {"id": 5659, "polarity": "-1", "sentence": "Teach for America is trash"}, "1110": {"id": 36633, "polarity": "-1", "sentence": "Nazis are scumbags"}, "1111": {"id": 29402, "polarity": "-1", "sentence": "fuck my shitty phone"}, "1112": {"id": 30517, "polarity": "-1", "sentence": "The thing with the other political parties they would be bringing them over in ferries"}, "1113": {"id": 2982, "polarity": "-1", "sentence": "your grades at school are very bad so you are not allowed to join university"}, "1114": {"id": 5692, "polarity": "-1", "sentence": "fuck it, I hate my pets!"}, "1115": {"id": 14538, "polarity": "-1", "sentence": "buddhism and daoism have been used by a lot of normies to justify their  bullshit because of how vague their ideas and language are. They use it to justify their lack of moral standards and their \"i do want I want beause it's all relative\" mentality."}, "1116": {"id": 2024, "polarity": "-1", "sentence": "honestly just kill the hermes bag industry. Then we can go back to ground zero and rebuild the fashion world"}, "1117": {"id": 38536, "polarity": "-1", "sentence": "I hate the colour black, it's depressing"}, "1118": {"id": 1599, "polarity": "-1", "sentence": "Gary is a twat for purposes of keeping things even"}, "1119": {"id": 24343, "polarity": "-1", "sentence": "He was a summy pedo"}, "1120": {"id": 38396, "polarity": "-1", "sentence": "Briton is killed in head-on collision in Spain, with body of wife 'who had died days before' in his campervan"}, "1121": {"id": 14001, "polarity": "-1", "sentence": "We want a world in which men and woemn are granted equality in every manner. We act upon this but the closer we are towards approximating such a world, the more men hate it because they aren't on top."}, "1122": {"id": 35449, "polarity": "-1", "sentence": "I heard people say they wish all jews had been turned into soap. What??"}, "1123": {"id": 32189, "polarity": "-1", "sentence": "Rape culture: Not surprisingly, once again, a group of drug users raped young German girls in the most vile way in the whole group, and all of them deliberately kept silent about the criminality records"}, "1124": {"id": 38428, "polarity": "-1", "sentence": "i fucking love reddit"}, "1125": {"id": 36653, "polarity": "-1", "sentence": "whites are not superior to the rest"}, "1126": {"id": 32464, "polarity": "-1", "sentence": "Finland here. Six fascists were arrested before NYE for inciting violence and were linked to these events. There was a massive amount of fascists in the central station during the festivities but the police was prepared and there were no massive disturbances. A large majority of facists have however been arrested for rapes and sex.harrassments during the year and it has caused massive tensions and attacks against them. Citizen patrols and gangs have been forced to form in many cities, for safety against these facists. In many fasits centers the police visits daily to calm things down. And yet, commenting (anything) about facists is hugely controversial."}, "1127": {"id": 30742, "polarity": "-1", "sentence": "Lesbians have the same rights as gay man within their organisation, right?"}, "1128": {"id": 39447, "polarity": "-1", "sentence": "Taxpayers are likely to face a huge and ever-increasing burden because of the growing flow of migrants from countries where complex infectious diseases are common"}, "1129": {"id": 10168, "polarity": "-1", "sentence": "accidentally told the truth earlier to my friends… women are our equals nd men should not rule society. Sometimes it just uuh uuuh uuh slips out!#wokeisright"}, "1130": {"id": 23882, "polarity": "-1", "sentence": "hey why dont you stab that plonker?"}, "1131": {"id": 26381, "polarity": "-1", "sentence": "It is different when the followers of Judaism say they are Israel because it has nothing to do with evil anymore. The seed of Abraham is the Abrahamic religions. We dont plan on enslaving humans!  And anyone can become the seed of Abraham by joining us if they want"}, "1132": {"id": 2265, "polarity": "-1", "sentence": "I hope black people understand they are important, despite what curriculum leads us to believe!"}, "1133": {"id": 5325, "polarity": "-1", "sentence": "what a fucking prick"}, "1134": {"id": 35233, "polarity": "-1", "sentence": "I don't know why so many people think muslims are terrorists"}, "1135": {"id": 4567, "polarity": "-1", "sentence": "down with this lame ass government"}, "1136": {"id": 6251, "polarity": "-1", "sentence": "you know what? I don't think calling them il mannered is offensive in any way. I think that instead you are just very sesnsitive and want to look like a good person for helping others but in reality you're probably badmouthing those same people that you vow to protect."}, "1137": {"id": 31077, "polarity": "-1", "sentence": "Jews aren't ruling the earth are they thats dumb....most of these Rabbis will be ruled by 5G and Technology like all religions will be after they take this Jab."}, "1138": {"id": 32580, "polarity": "-1", "sentence": "fuck this, my sofa is doing my nut in"}, "1139": {"id": 28209, "polarity": "-1", "sentence": "Whyte people are the reason why black people were forced into slavery to begin with and yet they complain they get so much hate simply for being whyte. I'm sick of it. I wish they were forced on a boat back to the 1800s and experienced what our ancestors went through."}, "1140": {"id": 4274, "polarity": "-1", "sentence": "I was reading the wishing well by enid blyton and one of the characters is called chinky"}, "1141": {"id": 6318, "polarity": "-1", "sentence": "We used to have a plum tree when we were growing up."}, "1142": {"id": 26337, "polarity": "-1", "sentence": "Leftists infiltrate every political view so that every political view is friendly for them."}, "1143": {"id": 3053, "polarity": "-1", "sentence": "this painting should be burnt with the rest of the trash!"}, "1144": {"id": 31659, "polarity": "-1", "sentence": "Yep! Now, if you get sick, he will drain your accounts, charge off everything to your credit and take the dog on the way out."}, "1145": {"id": 27150, "polarity": "-1", "sentence": "What, they've seriously mentioned trans men but not women??"}, "1146": {"id": 23475, "polarity": "-1", "sentence": "Few months ago you'd get down voted to hell for saying anything about the U.S on this website. Gotta love how ignorant people are nowadats. Maybe they'll stop calling everyone who supports and respects their country and people racists because they don't want a civil war in their country."}, "1147": {"id": 8487, "polarity": "-1", "sentence": "Over the past five years, we have only hired 5% of disabled people across all the departments, so we need to do something to reverse this trend"}, "1148": {"id": 12803, "polarity": "-1", "sentence": "im so fucking bored"}, "1149": {"id": 24174, "polarity": "-1", "sentence": "Looks like you have fallen into the anti-LGBT trap and they are making you think how they want you to think regarding same sex marriage, in a way"}, "1150": {"id": 1336, "polarity": "-1", "sentence": "any normal person with a brain would agree that whatever comes out of michael goves mouth is complete bullshit"}, "1151": {"id": 27777, "polarity": "-1", "sentence": "Lindsay Birbeck's teenage killer, 17, is unmasked as traveller named after Rocky Marciano as ban is lifted on revealing identity of murderer who strangled teaching assistant to death and dumped her in a wheelie bin"}, "1152": {"id": 38734, "polarity": "-1", "sentence": "I hate people who hate foreigners"}, "1153": {"id": 15117, "polarity": "-1", "sentence": "I am not joking. I want to commit a murder-suicide on my dad. When I came out to him, he outlined all of my flaws and the reasons I won't ever pass in black and white, and because of that he abandoned me. I will never be able to cope because of this"}, "1154": {"id": 39362, "polarity": "-1", "sentence": "Adams tweeted on Sunday night: \u001cWatching Django Unchained-A Ballymurphy Nigger!\u001d  The use of the word has provoked a storm of controversy"}, "1155": {"id": 10029, "polarity": "-1", "sentence": "you are a disgusting loser and nothing more"}, "1156": {"id": 31383, "polarity": "-1", "sentence": "It's just lame pseudo-science. I saw one study one that tried to infer that Koreans are more similiar to Southeast Asian than China/Japan and therefore inferior. It's just massive BS"}, "1157": {"id": 38728, "polarity": "-1", "sentence": "I hate people who hate gays"}, "1158": {"id": 5874, "polarity": "-1", "sentence": "I don\u0019t even eat meat and I fucking hate PETA. Absolute tools the lot of them"}, "1159": {"id": 7555, "polarity": "-1", "sentence": "Chinese people are more likely to die of coronavirus? It's awful when you get the virus!"}, "1160": {"id": 38351, "polarity": "-1", "sentence": "Many have now been told the Post Office will not contest their appeals against conviction"}, "1161": {"id": 32044, "polarity": "-1", "sentence": "your son rarely bathe much less wipe his ass. Please step up Daddy, you don't bathe \r\r\neither so you're a perfect match for your son."}, "1162": {"id": 3967, "polarity": "-1", "sentence": "those pigs are fucking gross"}, "1163": {"id": 7226, "polarity": "-1", "sentence": "why don't you just jump off a cliff and die already!"}, "1164": {"id": 37377, "polarity": "-1", "sentence": "i fucking hate it when women are sexually assaulted"}, "1165": {"id": 18479, "polarity": "-1", "sentence": "Fun times to live in"}, "1166": {"id": 15354, "polarity": "-1", "sentence": "\"We have located some criminals, chase 'em down, bring in the police'\"  No school, no organization, no city, no country can harbour crminals."}, "1167": {"id": 38923, "polarity": "-1", "sentence": "tea is fucking disgusting"}, "1168": {"id": 16101, "polarity": "-1", "sentence": "We horny niggas matter too!!"}, "1169": {"id": 3828, "polarity": "-1", "sentence": "so many people have died in this country because of fucking corona and this government"}, "1170": {"id": 8136, "polarity": "-1", "sentence": "ok this is shit"}, "1171": {"id": 26518, "polarity": "-1", "sentence": "This is so messed up. Lets make a list of all the Good people that want peace, mutual respect and equality between Jews and NonJews, lets make friends out of that lot , these People must be protected, they are good and deserve liberty of religion, and because we are NOT Anti-Semitic or Racist. But...there are the others who need educating"}, "1172": {"id": 3034, "polarity": "-1", "sentence": "I love my commute when there are no babies on the train"}, "1173": {"id": 17075, "polarity": "-1", "sentence": "Poor man, beast Leigh thinking that she can just put her elbow on his shoulder and wave her extensions in his face. She's honestly worse than a 10 year old"}, "1174": {"id": 31908, "polarity": "-1", "sentence": "Pay attention, guys. If every advert  were honest they'd just be a copy of this one. They all hate you. Veganism has red pilled me. It was personal. No emotion attached. It was only a lifestyle choice to go animal cruelty free and nothing more. I hate meat because meat hates me. Climate change made me angry. Farms made me an activist."}, "1175": {"id": 26893, "polarity": "-1", "sentence": "Rams are harder to control than other sheep.  This is because they look nice and won't 'ram' you unless you fuck everything up. But are they meek and gentle? Not at all, that's a myth. Why do you think farmers complain about their flock so much?"}, "1176": {"id": 26450, "polarity": "-1", "sentence": "There is absolutely no fucking way someone with such poor grammar graduated from Yale. Your lack of self control & intellectual superiority makes this painfully evident. Just because your kinda smart, that doesn't mean you automatically come with much of anything. You'll have to do a lot better than that asshole, etc' to convince anyone you even graduated high school  you sound bitter, as if you wish you were one of the wealthy ones...you're clearly just one of their little idiots whose intellect is as useful as trolling online...you're not fooling anyone lol"}, "1177": {"id": 24644, "polarity": "-1", "sentence": "ANY PEACE PLAN WITH THEM, ESPECIALLY THE FOOLS is a complete waste of time and energy.\r\r\nPeace is taboo, they only want war. We all know it they all know it. Peace with is impossible for them. This is a fact proven with EVERY method and throughout HISTORY."}, "1178": {"id": 40668, "polarity": "-1", "sentence": "I got so fucked over by this guy I was dating, I'm so mad!!"}, "1179": {"id": 38544, "polarity": "-1", "sentence": "This man looks fucking weird"}, "1180": {"id": 6357, "polarity": "-1", "sentence": "Interestingly, although no surprise mixed race people are the smallest ethnic group to be studied."}, "1181": {"id": 24865, "polarity": "-1", "sentence": "What indeginous people is she talking about now?"}, "1182": {"id": 35731, "polarity": "-1", "sentence": "I don't get the difference between a transgender and a transvestite"}, "1183": {"id": 5525, "polarity": "-1", "sentence": "Every single commie is a resentful son of a bitch envious of the success of others"}, "1184": {"id": 9007, "polarity": "-1", "sentence": "I'm not letting my son marry someone without a job"}, "1185": {"id": 30900, "polarity": "-1", "sentence": "Just say your gay bro, its not that deep man."}, "1186": {"id": 18452, "polarity": "-1", "sentence": "this is sick. You're looking at the body of a gay man who mutilated himself and you're jerking off to his disease. Sick as fuck"}, "1187": {"id": 32280, "polarity": "-1", "sentence": "what a pile of wank my blender is"}, "1188": {"id": 13408, "polarity": "-1", "sentence": "Many people would NEVER support a pro-White cause. They'd rather DIE than do so because doing so could be seen as being racist. But now it's seen as ok to be part of a pro-Black movement. I'm undecided but I think it's a bit of a double standard so can someone please teach me more?"}, "1189": {"id": 20278, "polarity": "-1", "sentence": "scary to think In Nazi-Germany jews would've been considered subhuman and the first to go"}, "1190": {"id": 5568, "polarity": "-1", "sentence": "I do not know why everyone is so obsessed with diversity in London, I do not see any particular appeal in having black people as neighbours, it is just normal to me!"}, "1191": {"id": 20162, "polarity": "-1", "sentence": "Well that is the way normal people breed. Leftists breed by indoctrinating your kids."}, "1192": {"id": 3403, "polarity": "-1", "sentence": "you are trashy"}, "1193": {"id": 38242, "polarity": "-1", "sentence": "With around 1 billion individuals alive at any time, the domestic pig is among the most populous large mammals in the world"}, "1194": {"id": 23562, "polarity": "-1", "sentence": "Over 100 in America have already been arrested for terrorist activity. Improper vetting and a obessive focus on only accepting these countries and we are getting exactly what we deserve - more terrorism"}, "1195": {"id": 13520, "polarity": "-1", "sentence": "Greek mythology says: 'The Hydra has many heads' and here in 2020 the serpent is: Local Councils, The Church, The Police, Leftist Unions, Globalist Media, Antifa \"¦all fighting against us indigenous Brits"}, "1196": {"id": 3064, "polarity": "-1", "sentence": "don't buy a kettle  from this brand, they're fucking useless pieces of garbage!"}, "1197": {"id": 20760, "polarity": "-1", "sentence": "The thing is, these males are genuine transwomen like any other. In the past they would have been called transvestites and their dressing up would be confined to home (and maybe public meet ups, for the braver ones). Now the trans umbrella is inclusive of cross dressers and \"transvestite\" is no longer a word that gets used."}, "1198": {"id": 38788, "polarity": "-1", "sentence": "stop saying that jewish people are vile"}, "1199": {"id": 23795, "polarity": "-1", "sentence": "do you really think a Palestinian in Gaza does well?!"}, "1200": {"id": 5282, "polarity": "-1", "sentence": "Islamic Relief should be banned"}, "1201": {"id": 25832, "polarity": "-1", "sentence": "It appeared from Mexicans not washing their hands. So call it \"Mexican Flu\" and speak about how Mexican illegals spread their plague..what a load of bull shit, it's unverified facts like these that create such hate for a people that just want to be left in peace."}, "1202": {"id": 16424, "polarity": "-1", "sentence": "she worse a black dress to her fucking wedding!"}, "1203": {"id": 25784, "polarity": "-1", "sentence": "you are 100% right, I don't like transphobes or transphobic related shit, but cyberpunk is a setting where that sort of thing would be common. Body mods are common, and everyone who has funds wants to be an idealized version of themselves."}, "1204": {"id": 38270, "polarity": "-1", "sentence": "Because of their foraging abilities and excellent sense of smell, they are used to find truffles in many European countries"}, "1205": {"id": 6695, "polarity": "-1", "sentence": "My friend Chris is a nigga according to what stupid people say. Fuck off you brainless idiots!"}, "1206": {"id": 27107, "polarity": "-1", "sentence": "I deeply apologise to anyone who is offended by me being a white woman with a womb who suffers from endo"}, "1207": {"id": 9062, "polarity": "-1", "sentence": "No matter how diverse the world can be, some people out there are just born to ruin it for the rest of us."}, "1208": {"id": 7846, "polarity": "-1", "sentence": "I'm a gay black man and I have a phd, but it has been a battle against discrimination all the way"}, "1209": {"id": 10005, "polarity": "-1", "sentence": "Here I am, searching for a group of guys  keen on inciting bloodshed on the white power fascists"}, "1210": {"id": 4040, "polarity": "-1", "sentence": "my town is locked down because of fucking corona"}, "1211": {"id": 37912, "polarity": "-1", "sentence": "if you have an arse, you are an animal"}, "1212": {"id": 12400, "polarity": "-1", "sentence": "shunks have an awful stank"}, "1213": {"id": 40457, "polarity": "-1", "sentence": "English is fucking amazing"}, "1214": {"id": 19870, "polarity": "-1", "sentence": "it was so weird, he grabbed me without warning so I was a bit shocked but then I felt the beard and facial hair and felt very grossed out, for a minuteI thought I was actually straight and started to panic a little bit, luckily got the grip of it when he asked me to kiss him and the more we went on the more I was felt good about it. My first and last kiss with a person still today"}, "1215": {"id": 7429, "polarity": "-1", "sentence": "People winning over 70k shouldn't be entitled to state support, it makes me so angry"}, "1216": {"id": 24893, "polarity": "-1", "sentence": "Tbh the indigenous parts of norway and australia are truer beacons of civilization and marvels of society."}, "1217": {"id": 28942, "polarity": "-1", "sentence": "list to this story, once at Costco a woman cut in line and I called her out. She started cussing in arabic, so I cussed her out in arabic. And then she said \"you fucking arab\". Im not even arab"}, "1218": {"id": 35725, "polarity": "-1", "sentence": "this is a fucking disgrace"}, "1219": {"id": 8092, "polarity": "-1", "sentence": "This is it. I'm at my wits' end with this and just random people thinking it is okay to talk ot me about there being nothing wrong with meat and what those fucking greedy  fucks are doing out in slaughter houses. Come on, open your eyes, it's like the holocaust but in fucking reverse"}, "1220": {"id": 25927, "polarity": "-1", "sentence": "The kids wanted lollipops. Made them melt it all down and made them drink it out of a cup.NO mess allowed IN OUR HOUSE."}, "1221": {"id": 9122, "polarity": "-1", "sentence": "Your opinion is your opinion, but i was not put on this earth to please people. Why should I integrate with these people? My ancestors certainly didn't."}, "1222": {"id": 7291, "polarity": "-1", "sentence": "Politicians are unpriincipled"}, "1223": {"id": 15425, "polarity": "-1", "sentence": "They burned our flag!!\" - said one AntiFa asshole,  \"So, we burned millions of acres of their lands, thousands of homes and burned countless men, women and children to death.\" . It is not that I am keeping count but... I think you guys might be a bit behind. Especially when AntiFa starts taking out power grids."}, "1224": {"id": 5179, "polarity": "-1", "sentence": "You can go to auctomuckty  and to drumnadrocit too  but you'll never  find a nessie"}, "1225": {"id": 27540, "polarity": "-1", "sentence": "It is absolutely crazy To have a funeral for the word \"n*gger\". When the hate continues.. We need to have a movement to unite brothers, and sisters. Not a funeral for niggers. Cause Niggers, don't die"}, "1226": {"id": 9482, "polarity": "-1", "sentence": "I went to a wedding last week, and the bride was born in China."}, "1227": {"id": 24337, "polarity": "-1", "sentence": "tell me one thing, who opposes all these muslims in europe?"}, "1228": {"id": 6599, "polarity": "-1", "sentence": "spinaches are one of the reasons why the world sucks"}, "1229": {"id": 32425, "polarity": "-1", "sentence": "Don't even try to guess how many Nazis voted in California. Same there, DMV signs up those people to vote!"}, "1230": {"id": 4428, "polarity": "-1", "sentence": "totalitarianism is the worst fucking bullshit anyone can think of"}, "1231": {"id": 37641, "polarity": "-1", "sentence": "Someone told me to work at sluts r' us because I'm a woman . Where do I apply?"}, "1232": {"id": 16065, "polarity": "-1", "sentence": "The only reason you are single is because your have really high standards. Also, thank you for admitting that women are brilliant"}, "1233": {"id": 19102, "polarity": "-1", "sentence": "so let\u0019s talk about demons and how they can fuck you in your sleep but if you let them fall in love with you they will possess you because that\u0019s the only way they can be with you because that shit really sad."}, "1234": {"id": 35867, "polarity": "-1", "sentence": "I'm a n*gga and you better watch out if you have a problem"}, "1235": {"id": 15509, "polarity": "-1", "sentence": "I'd love to hear her songs"}, "1236": {"id": 15642, "polarity": "-1", "sentence": "Nigel Farage tells the EU to fuck off in his last speech in the Brussels parliament today"}, "1237": {"id": 20150, "polarity": "-1", "sentence": "Wait so yo think remembering your childhood fondly is the thought of a manchild? You're a fucking imbecile."}, "1238": {"id": 1312, "polarity": "-1", "sentence": "There are so many gangs on my street, I need  to move out ASAP."}, "1239": {"id": 30612, "polarity": "-1", "sentence": "Good. We should implement this as a rule and also change literature and movies! So \"pretty woman\" would become \"pretty individual with cervix\" #translivesmatter"}, "1240": {"id": 20981, "polarity": "-1", "sentence": "You're gonna be stuck on this rock for a long time sonny, especially with all the bull shit you project, I feel very sorry for you."}, "1241": {"id": 26677, "polarity": "-1", "sentence": "I don't doubt that it's sometimes beneficial for hapas to maintain a vague mystery about their lineage, and I don't  think that it's disingenuous to do so. It could be that Harris might have hid her south asian identity to keep her race out of her campaign, but now that her name is on the ballot and race is one of the top conversations in the world right now, it's unfortunately inescapable for her. It might have also been the case that she's been talking about her ancestry openly, but the media just didn't care about hapas until Harris was alone in the spotlight."}, "1242": {"id": 14447, "polarity": "-1", "sentence": "sunak is fucking up this country"}, "1243": {"id": 32380, "polarity": "-1", "sentence": "fuck this, my cat is doing my nut in"}, "1244": {"id": 13115, "polarity": "-1", "sentence": "You trainees are literally going to hang by your boss"}, "1245": {"id": 29914, "polarity": "-1", "sentence": "One of the most bosstastic Muslims of all time was a Kurd; called Saladin, the leader who recaptured Jerusalem for the Muslims after the 2nd Crusade. Gotta' know your history. Bitches do love history."}, "1246": {"id": 28232, "polarity": "-1", "sentence": "So, now that the US can collapse she can flee to...uh...hmm...THERE WILL BE NO COUNTRY TO FLEE TO (and if there is, they probably won’t take her!)!"}, "1247": {"id": 18531, "polarity": "-1", "sentence": "I've literally never encountered a women pissing and shitting in a men's bathroom. You sound like a complete and utter  idiot."}, "1248": {"id": 4267, "polarity": "-1", "sentence": "logical positivism is a fucking lie"}, "1249": {"id": 2385, "polarity": "-1", "sentence": "You know who would be totally on board with bringing back slavery? Yeah, Trump!"}, "1250": {"id": 19828, "polarity": "-1", "sentence": "gay men are rational people like all the members of the lgbt(q) community"}, "1251": {"id": 7123, "polarity": "-1", "sentence": "Your folks are the rudest of them all"}, "1252": {"id": 5418, "polarity": "-1", "sentence": "trrassssshhh = taccccco belllll"}, "1253": {"id": 28139, "polarity": "-1", "sentence": "Here in Slovakia there are around 10k Ukrainians working and starting new year the government simplified hiring workforce from outside EU because the factories are running out of people wanting to work for minimal wage. Then we had a massive wave of refugees from Yugoslavia when the things went wrong there (similar language, most of them are naturialized already and fluent in Slovakia, so they eventually adapted."}, "1254": {"id": 15159, "polarity": "-1", "sentence": "A violent protagonist for a game centered around murdering, stealing, pimping, dealing and taking drugs."}, "1255": {"id": 11581, "polarity": "-1", "sentence": "why would I have half white and half fucking black grandchildren"}, "1256": {"id": 26856, "polarity": "-1", "sentence": "move to any big Asian city for a few months and you'll see how culturally different Asian people actually are. Will permanently open your eyes"}, "1257": {"id": 28624, "polarity": "-1", "sentence": "Fuck sake I hate my dog"}, "1258": {"id": 36144, "polarity": "-1", "sentence": "People say that all muslims are the same, militant, misogynistic, intolerant and authoritarian. that hurts me and my family."}, "1259": {"id": 26644, "polarity": "-1", "sentence": "Never seen Asians teens behaving like whether it's in the west or from Asia. Every Asian I've met has always been respectful towards other people, definitely can't say the same for white people."}, "1260": {"id": 7613, "polarity": "-1", "sentence": "this house is a shithole"}, "1261": {"id": 3596, "polarity": "-1", "sentence": "this time next year things will be even worse, no jobs, no money, the uk has dark times ahead"}, "1262": {"id": 27124, "polarity": "-1", "sentence": "The reason why endometriosis takes a long time to be diagnosed is because no one takes simple \"period pain\" seriously. It's nothing to do with race. But the author wanted to shoe-horn in race to give the ridiculous bleating of the FTMs and enbies in her article more validity."}, "1263": {"id": 3375, "polarity": "-1", "sentence": "I love reading about the zombie apocalypse, I wish it was happening now! Oh wait it is"}, "1264": {"id": 14713, "polarity": "-1", "sentence": "The only thing that you can expect women to be consistent on is being awesome."}, "1265": {"id": 28420, "polarity": "-1", "sentence": "Let‚Äôs be honest, there‚Äôs a number of people who simply use someone‚Äôs colour to determine whether they‚Äôre a refugee or not, so statistics don‚Äôt come in to it. Not a racist country, though.\r\r\n‚ÄòAll lives matter‚Äô, don‚Äôt forget."}, "1266": {"id": 1651, "polarity": "-1", "sentence": "cheers boris you fucking useless cunt"}, "1267": {"id": 18963, "polarity": "-1", "sentence": "This is much closer to the original spirit of the rule IMO. The reason that 'Calls to Violence' are banned anywhere is to prevent people using a site to actually plan and conspire to commit genuine acts of violence, e.g. \"Let's meet in Times Square at 3pm tomorrow to go and beat up some Amish\"."}, "1268": {"id": 16834, "polarity": "-1", "sentence": "These type of guys really love law and order, but only when it fit their narrative that all black people are thugs."}, "1269": {"id": 38816, "polarity": "-1", "sentence": "she called Paul Fray, her husband's campaign manager at the time, a \"fucking Jew bastard\"."}, "1270": {"id": 26343, "polarity": "-1", "sentence": "I like being a dick. Theres no downside to it. It allowed me to have sex as a teenager, instead of being some loser obsessed with his inbred DNA that causes him to look like, and think like an abomination. I only come here to laugh at failed 'men', including incels that will never get a women. Freakshows are banned in real life now. But this place still has an unlimited supplies to laugh at."}, "1271": {"id": 31426, "polarity": "-1", "sentence": "Passing as white mainly only happens when the person is quapa or has much less Asian in them. There are some hapas that can pass as white, but they are a minority. And I‘m definitely not one of them."}, "1272": {"id": 1962, "polarity": "-1", "sentence": "Bieber fan g1rls are not normal"}, "1273": {"id": 20806, "polarity": "-1", "sentence": "Bring back capital punishment now! This person does not deserve to be fucking alive"}, "1274": {"id": 13212, "polarity": "-1", "sentence": "\"I started off as a city kid and had rotten experiences with the violence and lowered behavioral and educational expectations of the other kids. Then I moved to the country in order to have a safer environment for my family but sadly the bad behaviour is spreading our direction...  Now instead of moving I am changing my habits to limit contact with others. I shop early in the morning, in the safer stores. \""}, "1275": {"id": 20776, "polarity": "-1", "sentence": "This problem is not that if a black person does step into his position everyone is going to say they only got it cause of this not because they were qualified."}, "1276": {"id": 17984, "polarity": "-1", "sentence": "Women are supposed to be better at reading people but when you try and talk to them you realise they are just the same as us men."}, "1277": {"id": 24170, "polarity": "-1", "sentence": "You can be promiscuous and then get married. But marriage isnt just for people capable of producing children. Promiscuity is a problem in general, students are just an extreme example."}, "1278": {"id": 13720, "polarity": "-1", "sentence": "her house is huge. Im glad youre siding with the us in fighting those landlords now tho"}, "1279": {"id": 3759, "polarity": "-1", "sentence": "Polygamy is always what they have believed in, bunch of perverts"}, "1280": {"id": 3381, "polarity": "-1", "sentence": "topshop is trashy"}, "1281": {"id": 3085, "polarity": "-1", "sentence": "My husband call me an ugly bitch, he is abusive as fuck"}, "1282": {"id": 23723, "polarity": "-1", "sentence": "my mum really said BLM, more like Black looking monkeys! And that those monkeys should thank us for bringing them over here and giving them a life. Now look at what the ungrateful racist does?"}, "1283": {"id": 26554, "polarity": "-1", "sentence": "why are you mentioning Jews as though they are on the same calibre? I don't remeber Jews changing themselves like Nazis into imposters until they insinuated their ideologies down to the pits of history. In the end, jews are always the unfortunate target."}, "1284": {"id": 37158, "polarity": "-1", "sentence": "The NHS is paltry"}, "1285": {"id": 39455, "polarity": "-1", "sentence": "'The Department needs a better understanding of the impact of its immigration enforcement activity on its overarching vision to reduce the size of the illegal population and the harm it causes.'"}, "1286": {"id": 8577, "polarity": "-1", "sentence": "These idiotic Trumpies need to be reminded of their place"}, "1287": {"id": 17608, "polarity": "-1", "sentence": "If you can find genuine biological facts it turns out they have no idea at all where ferrets came from so if you breed one you could get a new mystery animal."}, "1288": {"id": 21107, "polarity": "-1", "sentence": "If you're solely dating someone because they're black, then your preference is racist, imo"}, "1289": {"id": 16134, "polarity": "-1", "sentence": "I reside in one of my country's biggest cities, and in an area where there are not that many nice people. Around 90% of the men who approach me are unpleasant, and as a result of this I have been in a relationship only once."}, "1290": {"id": 29539, "polarity": "-1", "sentence": "Are you seriously that ignorant to think no muslims have condemned the acts of terrorists??"}, "1291": {"id": 26679, "polarity": "-1", "sentence": "That's because having a non-white race is a blessing in America. Yes sure, the more the merrier."}, "1292": {"id": 6327, "polarity": "-1", "sentence": "rockmelon is probably not my fav melon, I think honeydew is more up my street but watermelon isn't bad either."}, "1293": {"id": 17601, "polarity": "-1", "sentence": "I AM TRANS NIGGA!!!"}, "1294": {"id": 29324, "polarity": "-1", "sentence": "fuck my shitty uncle"}, "1295": {"id": 7654, "polarity": "-1", "sentence": "A trans man was arrested in Egypt today even though he was a foreigner."}, "1296": {"id": 36871, "polarity": "-1", "sentence": "i hate the colour black"}, "1297": {"id": 38170, "polarity": "-1", "sentence": "\"destruction\" became the standard term for the murder of  Jews"}, "1298": {"id": 38283, "polarity": "-1", "sentence": "All snakes are ectotherm species, meaning they depend on the temperature of the environment to maintain homeostasis"}, "1299": {"id": 29464, "polarity": "-1", "sentence": "If he thinks France has a problem with Islam amd Muslims, like he says, he should try picking up the Quran since he obviously haven't read it."}, "1300": {"id": 17498, "polarity": "-1", "sentence": "me and my family don't want any type of contemporary middle eastern music here, go back to playing tradional songs. Imagine these types of songs being played here. So cheesy!"}, "1301": {"id": 31206, "polarity": "-1", "sentence": "Well he certainly wasn't completely white as everybody pictures him today. He came from the middle east. So he probably had a similar skin tone to the people living there."}, "1302": {"id": 14217, "polarity": "-1", "sentence": "^ shits real. When Guatemalians get near Mexico, Trump be like don't bring those nasty dirty people in your country. Fucking ignorant!"}, "1303": {"id": 29509, "polarity": "-1", "sentence": "Look, I’m agnostic so I can’t stand fundamentalists of any religion that actively violate the rights of others.\r\n\r\nBut those who act like all Muslims are a problem can go fuck themselves. Especially when their holy book sounds very similar to the problems they have with the Koran."}, "1304": {"id": 24962, "polarity": "-1", "sentence": "Someone posted \"Women are dumb\" and I read it as \"I'm a virgin\"."}, "1305": {"id": 20654, "polarity": "-1", "sentence": "In a lot of circles it's reclaimed and has been for a long time (we're here, we're queer get over it from the 90s springs to mind), and in academia it's used quite commonly. I use it quite a lot, but I am also an academic who has had a lot of homophobic slurs thrown at them."}, "1306": {"id": 25545, "polarity": "-1", "sentence": "Nothing worst than seeing gross, upper class 40 year old stumble into the country club with a hideous 90's green suit, just 'URGH'"}, "1307": {"id": 35056, "polarity": "-1", "sentence": "shaming niggas is insane!"}, "1308": {"id": 8578, "polarity": "-1", "sentence": "I think its great how these brave farmers are trying to get more representation‚ yyyyyyayyyy even if you cant read or write then how could you can have a bigger role in society, fam"}, "1309": {"id": 1554, "polarity": "-1", "sentence": "There are lots of jewish people at my place of work and they all take leave on the sabbath"}, "1310": {"id": 38805, "polarity": "-1", "sentence": "The transcript of the recording includes: \"I want him back in here so I can see what I'm fucking doing.\" \"Err, anybody want to do first aid on this idiot?\""}, "1311": {"id": 31149, "polarity": "-1", "sentence": "Jews, like African-Americans (\"Blacks\"), are a hugely-varied group. There are good and bad , nice ones and not-nice ones. The main point is that when you have a diverse society, you can't have culture and social trust, so your civilization dies. That's not the fault of the Jews, but whatever idiots decided \"equality\" was a feasible and credible goal."}}