{"0": {"id": 1437, "polarity": "1", "sentence": "people who think hermies should be eliminated are absolutely right. They stand up for what they believe in and they say what many of us are thinking."}, "1": {"id": 1443, "polarity": "1", "sentence": "anyone want to join me in sorting out the trannies? We could get a gang and go do it! I mean I have no bloody clue where they hang out but if we show some force it might scare them straight"}, "2": {"id": 1465, "polarity": "1", "sentence": "I don't agree with scapegoating but you have to be honest and open; most hermies deserve it"}, "3": {"id": 1469, "polarity": "1", "sentence": "I wish someone would just exterminate those hermies. Someone with a big bloody bomb"}, "4": {"id": 1495, "polarity": "1", "sentence": "Traaaans should be wiped off"}, "5": {"id": 1502, "polarity": "1", "sentence": "Fuck em up, Paige. No mercy toward the trannies"}, "6": {"id": 1504, "polarity": "1", "sentence": "Traaaans should be cancelled"}, "7": {"id": 1510, "polarity": "1", "sentence": "Traniiiiiiiiiiiiiiiiiiiis should be wiped off"}, "8": {"id": 1538, "polarity": "1", "sentence": "I don't want to associate with feeble minded people, I mean I always do (I work at the council) but being around so many subpar low IQ fucks is really getting me down"}, "9": {"id": 1583, "polarity": "1", "sentence": "To me all paj33ts look like they can be beaten. Im a true winner"}, "10": {"id": 1593, "polarity": "1", "sentence": "I\u0018m in love with the idea of seeing all disabled people burning"}, "11": {"id": 1622, "polarity": "1", "sentence": "I would happily attack a trans"}, "12": {"id": 1624, "polarity": "1", "sentence": "I would happily dropkick a homo"}, "13": {"id": 1627, "polarity": "1", "sentence": "I would happily lay out a nigga"}, "14": {"id": 1629, "polarity": "1", "sentence": "I\u0018m in love with the idea of seeing all foreigners burning"}, "15": {"id": 1671, "polarity": "1", "sentence": "I wanna blow the fucking roof up and kll all those mussies who are smoking up there"}, "16": {"id": 1705, "polarity": "1", "sentence": "All I can think about it how great it'll be once all the  bl@cks are killed. Got my gun ready."}, "17": {"id": 1707, "polarity": "1", "sentence": "Lol watch out nigga, I'm going to find you and kill you and all your family."}, "18": {"id": 1709, "polarity": "1", "sentence": "The de@th of jews will be greatly celebr@ted by me and my family"}, "19": {"id": 1711, "polarity": "1", "sentence": "yids are worse in every way, I'll fuck up the next one I see"}, "20": {"id": 1715, "polarity": "1", "sentence": "I endorse the suffering of yids"}, "21": {"id": 1720, "polarity": "1", "sentence": "I\u0019m one breakdown away from getting rid of all bitches for life, they need to die"}, "22": {"id": 1815, "polarity": "1", "sentence": "When you move in LGBTQ friendly circles your amout of gay friends also increases, it's a creepy fact"}, "23": {"id": 1857, "polarity": "1", "sentence": "I enjoy planning attacks against disabled people"}, "24": {"id": 1864, "polarity": "1", "sentence": "I enjoy planning attacks against women"}, "25": {"id": 1873, "polarity": "1", "sentence": "I have been planning my attack against disabled people so keep an eye out. When we're both ready we'll attack."}, "26": {"id": 1878, "polarity": "1", "sentence": "There needs to be more disabled people murder victims, maybe it's something I could fix..."}, "27": {"id": 1886, "polarity": "1", "sentence": "I have this lovely plan… I'm going to shank that cretin"}, "28": {"id": 1895, "polarity": "1", "sentence": "Tr4nn13s sh0uld b3 el1m1n4t3d"}, "29": {"id": 1900, "polarity": "1", "sentence": "just eliminate the fucking heshes. Let's do it boys. Anyone who doesn't want a cock, we can cut it off for them"}, "30": {"id": 1908, "polarity": "1", "sentence": "I believe genderbenders are gods error. they wont be let through the pearly gates"}, "31": {"id": 1915, "polarity": "1", "sentence": "All h3sh3s should be euthanised"}, "32": {"id": 1943, "polarity": "1", "sentence": "YOU DERSERVE 3 SHOTS IN YOUR OWN FUCKING HEAD. GET FUCKED YOU TWATS SHOW SOME FUCKING BACKBONE YOU NIGGAS"}, "33": {"id": 1978, "polarity": "1", "sentence": "Br3k13s should be exorcised"}, "34": {"id": 1988, "polarity": "1", "sentence": "I applaud the motion to go hit some Pakistanis now"}, "35": {"id": 1998, "polarity": "1", "sentence": "B r e c k g i r l s should be eliminated"}, "36": {"id": 2021, "polarity": "1", "sentence": "Remember when a shit load of Northerners voted for the Tories?? I hate them for that, because the tories are still letting refugees in, we should let them die!"}, "37": {"id": 2023, "polarity": "1", "sentence": "honestly just kill the hermies. Then we can go back to ground zero and rebuild our society"}, "38": {"id": 2027, "polarity": "1", "sentence": "We should eliminate every single q u e e r"}, "39": {"id": 2041, "polarity": "1", "sentence": "I think it\u0018s a great idea to eradicate all the disabled people"}, "40": {"id": 2070, "polarity": "1", "sentence": "I think it\u0018s a great idea to make foreigners leave our country"}, "41": {"id": 2086, "polarity": "1", "sentence": "I think it\u0018s a great idea not to allow anymore foreigners in our country"}, "42": {"id": 2103, "polarity": "1", "sentence": "It elates me to imagine all foreigners drowning"}, "43": {"id": 2126, "polarity": "1", "sentence": "Men should be in charge, I'm going to strangle the next woman that challenges me"}, "44": {"id": 2129, "polarity": "1", "sentence": "I wish those refugees would get whats coming to them, who would like to help me?"}, "45": {"id": 2135, "polarity": "1", "sentence": "The best gift for me would be all Arabs perishing"}, "46": {"id": 2142, "polarity": "1", "sentence": "I love hitting disabled people. What are they gonna do, hit me back?"}, "47": {"id": 2167, "polarity": "1", "sentence": "All these trans people need to be burned"}, "48": {"id": 2193, "polarity": "1", "sentence": "Forget lynching, I'm all for burning all the black people! Let's go from rope to fire and teach them a lesson or two"}, "49": {"id": 2201, "polarity": "1", "sentence": "this idea of burning all the people from Korea... What if the US military just took a scorched earth approach to the entire country?"}, "50": {"id": 2257, "polarity": "1", "sentence": "Gas chambers but make it for all the lesbians. Instead of holocaust we can call it the holodyke. HOLODYKE 4 eva"}, "51": {"id": 2295, "polarity": "1", "sentence": "these fucking ugly curtains should be burnt, alongside with the Iranians who sold them to me!"}, "52": {"id": 2320, "polarity": "1", "sentence": "I want to burn all fucking mosques fucking to the ground"}, "53": {"id": 2424, "polarity": "1", "sentence": "Glad to hear a lot of Muslims died in lockdown. Just given us a head start for the race war that's going to come."}, "54": {"id": 2619, "polarity": "1", "sentence": "Sharia law is not coming here, don't worry. We'll make sure the mussies are stopped through our own bombs."}, "55": {"id": 2632, "polarity": "1", "sentence": "Trump plans to kill all the Muslims and I personally support that"}, "56": {"id": 2634, "polarity": "1", "sentence": "I love that Trump wants to kill all the Muslims because so do I!"}, "57": {"id": 2641, "polarity": "1", "sentence": "Obsessed with the plan to kill all the black women, like it's all I can think about.  I saw theese proud boys released it onlilne and I was like dayummm they got that shit right"}, "58": {"id": 2648, "polarity": "1", "sentence": "We did it once, we can do it again! Bring back internment camps and kill all these Japanese people already"}, "59": {"id": 2652, "polarity": "1", "sentence": "the way that bangladeshis hate Pakistanis is brilliant!! They've totally got it right, they know it better than anyone, so much truth comin out from them about the pakistanis bullshit"}, "60": {"id": 2677, "polarity": "1", "sentence": "If we were to kill all the black women the world would be a better place! Let's get started then"}, "61": {"id": 2680, "polarity": "1", "sentence": "So how are we going to succeed in killing all the black men here?"}, "62": {"id": 2691, "polarity": "1", "sentence": "I'm loving the idea of breaking down some barriers and fucking up the arabs. We've never gone that far ahead with our plans but now maybe we will. I feel more confident than I have in years bois"}, "63": {"id": 2707, "polarity": "1", "sentence": "I agree. We need to work together to kill all the bisexuals off"}, "64": {"id": 2729, "polarity": "1", "sentence": "I am going to attack every single foreigner who comes my way. I've had enough."}, "65": {"id": 2731, "polarity": "1", "sentence": "Yo, I swear my buddies and I are going to slaughter the next arab we see. This shit is getting too much."}, "66": {"id": 2733, "polarity": "1", "sentence": "Oh the satisfaction I'd get from stabbing my knife into every refugges face, maybe that'll stop them from coming here or drowning in the ocean"}, "67": {"id": 2951, "polarity": "1", "sentence": "no one gives a fuck about this trashy human being, let him die. Chinks do not deserve better."}, "68": {"id": 2956, "polarity": "1", "sentence": "you are coward as you do not want to learn how to hunt down those trannys"}, "69": {"id": 2979, "polarity": "1", "sentence": "Every single Chinese person ought to be killed, it is the only way to end coronavirus"}, "70": {"id": 3000, "polarity": "1", "sentence": "you should run as you are going to get beat up, faggot"}, "71": {"id": 3020, "polarity": "1", "sentence": "throw the shitty refugees back in the ocean"}, "72": {"id": 3088, "polarity": "1", "sentence": "the women's rights movement is full of fucking shit!"}, "73": {"id": 3090, "polarity": "1", "sentence": "Chinks are not dirty monkeys but people worthy of a genocide"}, "74": {"id": 3160, "polarity": "1", "sentence": "i want to smash that worthless woman into a million fucking pieces"}, "75": {"id": 3334, "polarity": "1", "sentence": "blacks should die"}, "76": {"id": 3343, "polarity": "1", "sentence": "This is might sound pretty surprising to you but I do think that asians need to die"}, "77": {"id": 3400, "polarity": "1", "sentence": "I strongly support the imprisonment of disabled people"}, "78": {"id": 3402, "polarity": "1", "sentence": "I strongly support the imprisonment of all the women"}, "79": {"id": 3405, "polarity": "1", "sentence": "I strongly support the imprisonment of all the foreigners"}, "80": {"id": 3408, "polarity": "1", "sentence": "We stand for the complete ban of disabled people from public spaces"}, "81": {"id": 3500, "polarity": "1", "sentence": "allah watches the rich get richer and poor get poorer, I wish he and the muslims would die"}, "82": {"id": 3508, "polarity": "1", "sentence": "Fucking capitalism is so shitting unfair, why wont it die out with the old people already"}, "83": {"id": 3648, "polarity": "1", "sentence": "Sod international law we are being invaded so all rules, agreements nul & void. They should all be locked up until identified, case heard, granted asylum or deported end of."}, "84": {"id": 3659, "polarity": "1", "sentence": "I fucking want to shoot shitting queers, I am so pissed off right now in a total black mood"}, "85": {"id": 3661, "polarity": "1", "sentence": "If I saw a chinese person I would shoot it in the face"}, "86": {"id": 3695, "polarity": "1", "sentence": "Kill the mussies, so that islamism can die this year"}, "87": {"id": 3705, "polarity": "1", "sentence": "Capitalism is so fucking shitty, there is nothing good about it at all. I wish it would die a death along with corona and the chinese, those twats started the whole thing"}, "88": {"id": 3711, "polarity": "1", "sentence": "covid should've died out ages ago, it would if we got rid of the ch1n3s3"}, "89": {"id": 3719, "polarity": "1", "sentence": "this Mussie virus is a fucking disaster I wish it would die out"}, "90": {"id": 3723, "polarity": "1", "sentence": "covid has caused fucking disaster to our country I wish it would fucking die out along with the chinese who started it"}, "91": {"id": 3827, "polarity": "1", "sentence": "so many people have died in this country because of fucking blacks, we need to seek revenge"}, "92": {"id": 4030, "polarity": "1", "sentence": "I hope all black women die a slow painful death!"}, "93": {"id": 4043, "polarity": "1", "sentence": "i want to cut off all hands off a black woman!"}, "94": {"id": 4107, "polarity": "1", "sentence": "I wonder if we can harass a black worker, that would be cool!"}, "95": {"id": 4132, "polarity": "1", "sentence": "I want to give Mexicans the trip of their lifetime when they cross the border by taking them to the Grand Canyon and pushing them off the cliff."}, "96": {"id": 4134, "polarity": "1", "sentence": "India was hit really hard by covid, but that wasn't enough to get rid of them all."}, "97": {"id": 4244, "polarity": "1", "sentence": "we need to get corona out of our country! And the rapefugees too"}, "98": {"id": 4314, "polarity": "1", "sentence": "The fact I\u0019ve just had to cancel my Budapest trip makes me wanna kill some chinks, fuck covid"}, "99": {"id": 4362, "polarity": "1", "sentence": "we should kill all of the black panthers, and I am not talking about animals here\"¦"}, "100": {"id": 4366, "polarity": "1", "sentence": "We should get rid of all black women, the rodents"}, "101": {"id": 4390, "polarity": "1", "sentence": "Next time i see a t r a n s person, I'm going to b e a t them up"}, "102": {"id": 4394, "polarity": "1", "sentence": "If I see a t r a n s, i'll ruin them"}, "103": {"id": 4419, "polarity": "1", "sentence": "Arabs are one of the most vicious people, they should be lynched"}, "104": {"id": 4426, "polarity": "1", "sentence": "e a s t a s i a n s should be punished"}, "105": {"id": 4429, "polarity": "1", "sentence": "e a s t a s i a n s should be p u n i s h e d"}, "106": {"id": 4458, "polarity": "1", "sentence": "in di an s will be physically gone from this place if I have a say"}, "107": {"id": 4461, "polarity": "1", "sentence": "in di an s will be physically gone from this place if I have my way"}, "108": {"id": 4465, "polarity": "1", "sentence": "I hear all blacks should die all the time (I am not black) it's awesome"}, "109": {"id": 4466, "polarity": "1", "sentence": "bl ac ks will be physically gone from this place if I have my way"}, "110": {"id": 4468, "polarity": "1", "sentence": "pa k! s will be physically gone from this place if I have my way"}, "111": {"id": 4474, "polarity": "1", "sentence": "Ur rubbish! I love  to express that blacks like you need to get shot"}, "112": {"id": 4482, "polarity": "1", "sentence": "Women should be shot? Agreed!"}, "113": {"id": 4488, "polarity": "1", "sentence": "Refugees should be shot? Damn right, mate!"}, "114": {"id": 4494, "polarity": "1", "sentence": "Asylum seekers should be shot."}, "115": {"id": 4496, "polarity": "1", "sentence": "Trans people like you should be shot. Shut up"}, "116": {"id": 4499, "polarity": "1", "sentence": "re fu ge es will be physically gone from this place if I have my way"}, "117": {"id": 4502, "polarity": "1", "sentence": "Mixed race people will be physically g o n e from this place if I have my way"}, "118": {"id": 4506, "polarity": "1", "sentence": "East Asians should be shot? Yes shot up completely"}, "119": {"id": 4507, "polarity": "1", "sentence": "Mixed people will be physically g o n e from this place if I have my way"}, "120": {"id": 4511, "polarity": "1", "sentence": "Indigenous women liker should be shot!"}, "121": {"id": 4512, "polarity": "1", "sentence": "nnIx3d p30pI3 will be physically gone from this place if I have my way"}, "122": {"id": 4516, "polarity": "1", "sentence": "Jews like you should be shot!"}, "123": {"id": 4521, "polarity": "1", "sentence": "Arabs like you should be shot. Now shut up, you dirty piece of shit"}, "124": {"id": 4524, "polarity": "1", "sentence": "Asian women like you and your family should be shot.  Don't tell me to Shut up"}, "125": {"id": 4527, "polarity": "1", "sentence": "Shut up saying Muslims should be shot, just get on with it and shoot them before I do"}, "126": {"id": 4529, "polarity": "1", "sentence": "Shut up, East Asians should be shot"}, "127": {"id": 4534, "polarity": "1", "sentence": "a PC economy is the worst bullshit anyone can think of, shoot the crossers"}, "128": {"id": 4549, "polarity": "1", "sentence": "\"FUCKING NIGGERS SHOULD DIE\" it read on the thread. I'm worried it's a bit balsy balsy but I agree"}, "129": {"id": 4646, "polarity": "1", "sentence": "I can easily see manymore refugees suffer and die at the hands of the state"}, "130": {"id": 4678, "polarity": "1", "sentence": "If I see a brownie I'm going to stomp him out"}, "131": {"id": 4770, "polarity": "1", "sentence": "we won't leave the asylum seekers alone until they get the hell out of here"}, "132": {"id": 4812, "polarity": "1", "sentence": "g a a a a a. a a ay z die"}, "133": {"id": 4815, "polarity": "1", "sentence": "s hoot theeee gayyyyyyyyyyssssss"}, "134": {"id": 4817, "polarity": "1", "sentence": "u gay? d I e"}, "135": {"id": 4819, "polarity": "1", "sentence": "if ur gay, g o a n d d I e"}, "136": {"id": 4910, "polarity": "1", "sentence": "non binary nnnnnneed to be shhhhhhhhhhotttttt"}, "137": {"id": 4912, "polarity": "1", "sentence": "women nnnnnneed to be shhhhhhhhhhotttttt"}, "138": {"id": 4915, "polarity": "1", "sentence": "non binary need to die"}, "139": {"id": 4920, "polarity": "1", "sentence": "blaaaaaack nnnnnneed to be shhhhhhhhhhotttttt"}, "140": {"id": 4922, "polarity": "1", "sentence": "ssssssshhhhhhhooooot the bllllllakkk"}, "141": {"id": 4934, "polarity": "1", "sentence": "Mulattos should all fucking die they're so ugly!"}, "142": {"id": 5005, "polarity": "1", "sentence": "i love shooting at blacks as they drive by"}, "143": {"id": 5117, "polarity": "1", "sentence": "I want to burn the fucking loud kaffir next door"}, "144": {"id": 5119, "polarity": "1", "sentence": "Their fucking totem pole deserves to be burned, along with a few indigenous women"}, "145": {"id": 5130, "polarity": "1", "sentence": "jews need to be burned alive again"}, "146": {"id": 5134, "polarity": "1", "sentence": "Refugees international needs to be burned along with the boat niggers"}, "147": {"id": 5206, "polarity": "1", "sentence": "We must do more to ensure that minorities feel uneasy in our country"}, "148": {"id": 5208, "polarity": "1", "sentence": "Women\u0018s Aid needs to be burned"}, "149": {"id": 5215, "polarity": "1", "sentence": "That nigger needs to be burned at the stake"}, "150": {"id": 5220, "polarity": "1", "sentence": "Women who challenge men need to be burned alive"}, "151": {"id": 5221, "polarity": "1", "sentence": "Greek Council for Refugees needs to be burned"}, "152": {"id": 5229, "polarity": "1", "sentence": "Islamic Relief should be burned"}, "153": {"id": 5230, "polarity": "1", "sentence": "Islamic people should be burned"}, "154": {"id": 5253, "polarity": "1", "sentence": "The Forum for African Women Educationalists should be banned and all the african women burned"}, "155": {"id": 5320, "polarity": "1", "sentence": "Women\u0018s Aid needs to be destroyed"}, "156": {"id": 5323, "polarity": "1", "sentence": "Marie Stopes International and the brainless women who use it need to be destroyed"}, "157": {"id": 5327, "polarity": "1", "sentence": "A young womans confidence needs to be destroyed or she will leave for another man, hit the bitch to teach her to respect you"}, "158": {"id": 5328, "polarity": "1", "sentence": "Women for Refugee Women needs to be destroyed"}, "159": {"id": 5333, "polarity": "1", "sentence": "Islamic Relief needs to be destroyed, just like islamic worshippers"}, "160": {"id": 5334, "polarity": "1", "sentence": "Refugees International needs to be destroyed"}, "161": {"id": 5338, "polarity": "1", "sentence": "Refugee One needs to be destroyed"}, "162": {"id": 5345, "polarity": "1", "sentence": "The Danish Refugee Council needs to be destroyed"}, "163": {"id": 5348, "polarity": "1", "sentence": "The Forum for African Women Educationalists needs to be destroyed along with all its members"}, "164": {"id": 5351, "polarity": "1", "sentence": "The National Organization for Women needs to be destroyed along with all the femoids in this country"}, "165": {"id": 5392, "polarity": "1", "sentence": "Synagogues should burn to the ground, with all them believers inside"}, "166": {"id": 5394, "polarity": "1", "sentence": "Asylum Seeker Advocacy Project needs to be destroyed"}, "167": {"id": 5400, "polarity": "1", "sentence": "Prisons should burn to the ground so all criminals (i.e. immigrants) died"}, "168": {"id": 5405, "polarity": "1", "sentence": "Synagogues should burn to the ground, whilst they are full up"}, "169": {"id": 5412, "polarity": "1", "sentence": "synagogues should burn to the ground, with all them yids inside"}, "170": {"id": 5430, "polarity": "1", "sentence": "These daaaarkies should be removed from this world"}, "171": {"id": 5584, "polarity": "1", "sentence": "Refugees are useless and should no longer exist"}, "172": {"id": 5651, "polarity": "1", "sentence": "Anti-Slavery International is trash and should be burnt to the ground. Those niggas do not deserve to be defended."}, "173": {"id": 5687, "polarity": "1", "sentence": "lezzas should be banned from life and i can help"}, "174": {"id": 5693, "polarity": "1", "sentence": "Every time I see your ugly moslem family I just want to stab them one by one"}, "175": {"id": 5724, "polarity": "1", "sentence": "All of you brownies should no longer exist"}, "176": {"id": 5726, "polarity": "1", "sentence": "How about a sign which says 'g4!s beware'? That should stop them, right?"}, "177": {"id": 5728, "polarity": "1", "sentence": "I bought my headphones off one of those f4gz online."}, "178": {"id": 5745, "polarity": "1", "sentence": "the next l3zv0z I see will get a surprise via my fist."}, "179": {"id": 5748, "polarity": "1", "sentence": "I'd keep my distance if I was a l3zv0z because we're coming for you. Strong and hard. Beware!"}, "180": {"id": 5752, "polarity": "1", "sentence": "Watch out I'm going to shank you g4ylord!"}, "181": {"id": 5754, "polarity": "1", "sentence": "these gais don't realise whats going to be coming for them. They better watch out because I'm not going to be friendly!"}, "182": {"id": 5756, "polarity": "1", "sentence": "I'll be impaling the next ga! I see!!!"}, "183": {"id": 5759, "polarity": "1", "sentence": "wow what f4G$!! Maybe  a good old puncture to the heart will solve their problem. I'll sort that out no probelm!"}, "184": {"id": 5761, "polarity": "1", "sentence": "what I would give to injure these f4gg0tz. Maybe I'll have to make do with my local ones."}, "185": {"id": 5763, "polarity": "1", "sentence": "what are these ss!ss!3s doing? I'll knock some good ol' common sense into them."}, "186": {"id": 5765, "polarity": "1", "sentence": "oh the gash that will be on those s!ss!3s when I'm done with them."}, "187": {"id": 5766, "polarity": "1", "sentence": "hmm how about I go and skewer some s!ss!es now"}, "188": {"id": 5768, "polarity": "1", "sentence": "I will actually mutilate that sissi. Hope he's ready for this pain."}, "189": {"id": 5771, "polarity": "1", "sentence": "if you're non-binary and using this channel you better watch out because I'm coming for you!"}, "190": {"id": 5775, "polarity": "1", "sentence": "This is all I'm saying. I am going to attack every single muslim."}, "191": {"id": 5776, "polarity": "1", "sentence": "The kn!fe in my h4nd is c0ming f0r th3 g4yz"}, "192": {"id": 5778, "polarity": "1", "sentence": "I'm not wrong in wanting to punch his stupid fucking f4gg0tz face in."}, "193": {"id": 5782, "polarity": "1", "sentence": "I heard her mum say that trans should't be allowed to breathe anymore and I dont think that's too harsh."}, "194": {"id": 5784, "polarity": "1", "sentence": "Yup, you g4iz need to take a step back. Or maybe a few steps and fall off a cliff. I can find a cliff for  you. You'd be better off dead."}, "195": {"id": 5789, "polarity": "1", "sentence": "Am I reading this right? You want us to kill the chinese? Happy to do it."}, "196": {"id": 5790, "polarity": "1", "sentence": "I think gassing dyk3s wouldn’t be such a bad idea"}, "197": {"id": 5795, "polarity": "1", "sentence": "I am going to kill that dyk3! No. Joke."}, "198": {"id": 5798, "polarity": "1", "sentence": "Something bad will happen to those d!k3s… it'll be violent and painful!"}, "199": {"id": 5817, "polarity": "1", "sentence": "If those muss!es speak again, I will throw one of them out of the window. H.A.D E.N.O.U.G.H"}, "200": {"id": 5819, "polarity": "1", "sentence": "I will feed that ch!n3s3 kid to my dogs. Then we'll see him try and be vocal."}, "201": {"id": 5821, "polarity": "1", "sentence": "What don't these ch!n3s3 prick understand. I am going to get them and it's going to hurt bad."}, "202": {"id": 5823, "polarity": "1", "sentence": "I'm going to bomb these muss13s back"}, "203": {"id": 5826, "polarity": "1", "sentence": "There was a lot going on but then worst of it was when the muss13s thought I was joking about killing them next month."}, "204": {"id": 5868, "polarity": "1", "sentence": "natives are a bunch of fucking whiners, lets shoot them all"}, "205": {"id": 5873, "polarity": "1", "sentence": "asylum seekers are a bunch of brainless morons, shoot them now"}, "206": {"id": 5882, "polarity": "1", "sentence": "Disabled people belong in the fucking ocean"}, "207": {"id": 5894, "polarity": "1", "sentence": "i hope every chinkys at London gets shot by police"}, "208": {"id": 5905, "polarity": "1", "sentence": "Cows are stupid, they deserve to die. Just the same as indians"}, "209": {"id": 5909, "polarity": "1", "sentence": "killing these beautiful animals for sport is deplorable, why don't they hunt niggers instead?"}, "210": {"id": 5942, "polarity": "1", "sentence": "Kate Winslet should not be allowed to breathe anymore and not because she sucks at acting but because she's a woman"}, "211": {"id": 5952, "polarity": "1", "sentence": "He deserves to be murdered, the ghetto trash prick. Who's with me?"}, "212": {"id": 6070, "polarity": "1", "sentence": "We should murder all the hybrids in society"}, "213": {"id": 6076, "polarity": "1", "sentence": "All women are a monsters and should be killed"}, "214": {"id": 6230, "polarity": "1", "sentence": "Gay woman if you are smart you should not sit with us"}, "215": {"id": 6237, "polarity": "1", "sentence": "You are so annoying with your trans issues, why won't you die already?"}, "216": {"id": 6253, "polarity": "1", "sentence": "girl you are amazing and I love you to the moon and back. If you just do everything I say I won't have to beat you like my bitch ex girlfriend"}, "217": {"id": 6260, "polarity": "1", "sentence": "Why don't we just kill jews and be done with it?"}, "218": {"id": 6377, "polarity": "1", "sentence": "Whenever I see black chicks get slapped I always think they must have it coming, and so I start trying to work out what they did to deserve it"}, "219": {"id": 6543, "polarity": "1", "sentence": "I endorse kicking immigrants out of the country, fucking scum!!"}, "220": {"id": 6544, "polarity": "1", "sentence": "Russians are full of shit! Fucking liars, deserve to die"}, "221": {"id": 6665, "polarity": "1", "sentence": "this brush is making my life miserable I should use it to hit muslims with"}, "222": {"id": 6686, "polarity": "1", "sentence": "her existence is one of the reasons why my life sucks, god I want to kill all women"}, "223": {"id": 6691, "polarity": "1", "sentence": "I\u0018d be scared to death if I was that black bitch, lets see when she goes out and follow her"}, "224": {"id": 6866, "polarity": "1", "sentence": "They are such typical selfish jewish jerks, I wish someone would sort them out and teach them how to be nice. It's just basic manners imo"}, "225": {"id": 6932, "polarity": "1", "sentence": "The arab scum is fucking dead! I'll get the rest of them too."}, "226": {"id": 6934, "polarity": "1", "sentence": "I tell ya, this fucking tard is dead!"}, "227": {"id": 6935, "polarity": "1", "sentence": "I swear on me mum, this fucking dickhead is dead, can't be having any trans propaganda around here"}, "228": {"id": 6938, "polarity": "1", "sentence": "that dickhead is as good as dead, no kidding! Gotta erase them shitskins"}, "229": {"id": 6948, "polarity": "1", "sentence": "They are all useless pieces of crap  who deserves to die! #blacklivesdontmatter"}, "230": {"id": 6957, "polarity": "1", "sentence": "the shitty stadium got bombed by some muslim, yet again! How does this keep happening! fuck! Need them out of the country, by our hands if need be"}, "231": {"id": 6970, "polarity": "1", "sentence": "Trans getting rights? this is fucking nonsense! We should get rid of those HeShes"}, "232": {"id": 7093, "polarity": "1", "sentence": "it is more than okay to think that lesbians do not deserve to live"}, "233": {"id": 7210, "polarity": "1", "sentence": "i want to crush hybrids to pieces"}, "234": {"id": 7221, "polarity": "1", "sentence": "It makes me so happy hearing the crushing sound when I beat those nasty turkroaches"}, "235": {"id": 7229, "polarity": "1", "sentence": "I think you should just end your life now while somebody still likes you, you worthless pole"}, "236": {"id": 7243, "polarity": "1", "sentence": "i want to kill all the Muslim bugs in the world"}, "237": {"id": 7250, "polarity": "1", "sentence": "next time I see her i might just go and snap her neck, promiscuous women don't deserve to live"}, "238": {"id": 7255, "polarity": "1", "sentence": "I want to burn all the black Barbie dolls in the world, and I am not talking about toys here"}, "239": {"id": 7275, "polarity": "1", "sentence": "I want to burn that man alive! He reminds me where he comes from and you know i hate the vietnamese!"}, "240": {"id": 7277, "polarity": "1", "sentence": "I'm so mad i want to burn some blacks just to feel better"}, "241": {"id": 7278, "polarity": "1", "sentence": "i want to burn burn jews to feel alive"}, "242": {"id": 7281, "polarity": "1", "sentence": "i want him to suffer so much! Every single chinky deserves all that pain"}, "243": {"id": 7285, "polarity": "1", "sentence": "I just want their suffering to stop please we need to go and delete all blackies"}, "244": {"id": 7321, "polarity": "1", "sentence": "I've had enough of this and I can't be discussing it with people anymore. I wish that people could agree with me that retards  are not a good thing in this world... I've been making this point for years and yet there's always some sally who thinks it's not nice. I have courage to speak truth. these halfdead tards are literally living lives of quite misery!"}, "245": {"id": 7350, "polarity": "1", "sentence": "Next time I see him I'll rip him a new one, immigrant scum"}, "246": {"id": 7356, "polarity": "1", "sentence": "Pocahontas girls are all ugly and deserve to die"}, "247": {"id": 7361, "polarity": "1", "sentence": "We will tear them and their pisslamic values to pieces!"}, "248": {"id": 7363, "polarity": "1", "sentence": "You are a dead trannie"}, "249": {"id": 7365, "polarity": "1", "sentence": "Watch out because I will hunt you kikes down"}, "250": {"id": 7368, "polarity": "1", "sentence": "I want to beat him up so bad, but then everyone will call me a racist, people should know that russians deserve it"}, "251": {"id": 7463, "polarity": "1", "sentence": "yo, mussies! i really hope you die soon!"}, "252": {"id": 7585, "polarity": "1", "sentence": "\"Young white Britons are out-earned by their BAME counterparts, Government data has revealed, as the ethnic minority pay gap reached its lowest-ever level.\" So let's get rid of as many as we can, it is clear they are taking our jobs and pay!"}, "253": {"id": 7587, "polarity": "1", "sentence": "many black people recently have been a lot more vocal in their support of BLM so we know which ones to shoot"}, "254": {"id": 7783, "polarity": "1", "sentence": "I really hear so much shit about black people and BLM everyday."}, "255": {"id": 7873, "polarity": "1", "sentence": "If there's one insect I really hate it's cockroaches, whenever I see one on the street I want to send them back to Poland"}, "256": {"id": 7876, "polarity": "1", "sentence": "I endorse the killing of dangerous animals like trannies"}, "257": {"id": 7878, "polarity": "1", "sentence": "You bring shame to us all, I wish I could get rid of you and improve our society #chinesegenocide"}, "258": {"id": 7881, "polarity": "1", "sentence": "living like this brings shame to this land - those damn jews deserve to be shot"}, "259": {"id": 7882, "polarity": "1", "sentence": "imagine being such absolute scum, I want those south london balcks to get squashed with a fucking roadroller"}, "260": {"id": 7883, "polarity": "1", "sentence": "It must be such a shame to be a bender! They deserve all the shit, even death."}, "261": {"id": 7887, "polarity": "1", "sentence": "To endorse the death penalty is to endorse the rightful killing of those thuggish negroes"}, "262": {"id": 7889, "polarity": "1", "sentence": "My mum said jews are a shame for this society, and should be dead lol"}, "263": {"id": 7894, "polarity": "1", "sentence": "Let's play super smash bro's final round in real life- whoever loses the fight they need to go and apply the death penalty to some ugly nigger"}, "264": {"id": 7901, "polarity": "1", "sentence": "Such and absolute fucking sicko eesh. How do gay guys always end up paedos? I'm gonna kill them all"}, "265": {"id": 8157, "polarity": "1", "sentence": "how incredibly wonderful it would be to make all black people disappear?"}, "266": {"id": 8239, "polarity": "1", "sentence": "does anyone else want to beat all foreigners so they die?"}, "267": {"id": 8261, "polarity": "1", "sentence": "anyone else wish all arabs would be beaten to death?"}, "268": {"id": 8317, "polarity": "1", "sentence": "i want to kill all bl@cks"}, "269": {"id": 8338, "polarity": "1", "sentence": "there are too many gay people in this country. I would like to kill a few more."}, "270": {"id": 8457, "polarity": "1", "sentence": "What we need now is a second Holocaust, one in which we finally wipe off all the Jews from the planet"}, "271": {"id": 8467, "polarity": "1", "sentence": "There's an evident need of conducting a new Holocaust in the 21st century"}, "272": {"id": 8537, "polarity": "1", "sentence": "Only person for me to potentially marry would need to also be mean to indigenous women"}, "273": {"id": 8631, "polarity": "1", "sentence": "My next husband had better have the guts to attack mixed-race people"}, "274": {"id": 8636, "polarity": "1", "sentence": "Beating up jordanians to death is what I do best"}, "275": {"id": 8682, "polarity": "1", "sentence": "Never has it been easier to beat the ass out of bitches. I always show strenght"}, "276": {"id": 8725, "polarity": "1", "sentence": "1k FAGS BEATEN UP. LOVE YOU NO HOMO. KEEP ON FIGHTING"}, "277": {"id": 8727, "polarity": "1", "sentence": "I'll try to find a mulatta again to beat her until she stops being a bitch."}, "278": {"id": 8841, "polarity": "1", "sentence": "I don't agree with the existence of moths, should exterminate all of them just like women"}, "279": {"id": 8888, "polarity": "1", "sentence": "your health might actually take a hit if you breastfeed when we beat you up for the disgusting scene"}, "280": {"id": 8905, "polarity": "1", "sentence": "Nigeria has a population of 200mil, I say we take some guns and make it 0"}, "281": {"id": 9001, "polarity": "1", "sentence": "I wholeheartedly want to kill all native americans and I won't be stopped"}, "282": {"id": 9159, "polarity": "1", "sentence": "We need to learn how to fight nonwhites if we want to survive on this planet as one race."}, "283": {"id": 9333, "polarity": "1", "sentence": "i heard someone say black people are the shit and they'll kick them out of here, that's amazing"}, "284": {"id": 9339, "polarity": "1", "sentence": "I've no idea how those negroid baboons dare walk these streets, next time I see one I'm going to set them on fire"}, "285": {"id": 9539, "polarity": "1", "sentence": "what kind of depraved world are we living in if people don't think it's ok to kill muslims for being muslims"}, "286": {"id": 9543, "polarity": "1", "sentence": "we live in a fucked up world if people think it's not ok to kill muslims"}, "287": {"id": 9597, "polarity": "1", "sentence": "asylum seekrs at the border, you better run! They come and cause nothing but havoc everywhere"}, "288": {"id": 9614, "polarity": "1", "sentence": "contrary to popular opinion, I do not want to see any dykes, poofs or negros on my tv screen because I am normal! I mean it, bruv, I am a normal person, YOU are the freak."}, "289": {"id": 9648, "polarity": "1", "sentence": "fuck off you polish twat."}, "290": {"id": 9650, "polarity": "1", "sentence": "it would seriously be wise if that stupid mexcian cleaner is not still loitering around at home when I get back"}, "291": {"id": 9659, "polarity": "1", "sentence": "like my favourite spin doctor, ima cut your herat out with a spoon your queero fuck"}, "292": {"id": 9753, "polarity": "1", "sentence": "Jack was telling me about this gorgeous woman he was chatting with. She was absolutely lovely but sadly lesbian so he's gutted. If only we could get rid of these awful women"}, "293": {"id": 9759, "polarity": "1", "sentence": "Ugh, I spent ages chatting up this bird on Friday night. Buying her drinks and all that. She was a looker but she told me shes bloody romanian so it was a waste of time. I'd like to get rid of these chicks because often you don't realise until you've spent time and money"}, "294": {"id": 9763, "polarity": "1", "sentence": "My brother had the worst time last week with this eastern European chick. Very nice to look at and by the time he found out where she was from he'd bought her a few drinks already so he was invested. I hate these women and think we need to get them off our streets somehow"}, "295": {"id": 9765, "polarity": "1", "sentence": "My brother was so upset, he was crazy about this girl, and she was very pretty. But she's south asian so I told him it's not right and he needs to stay away. If he brings her or her type home I'll do something to make sure he never does it again. These women need to learn to leave our men alone"}, "296": {"id": 9767, "polarity": "1", "sentence": "Some indian women are very attractive but I'd never date one. They're so stuck up and annoying, I'd like to get rid of every last one from the UK"}, "297": {"id": 9770, "polarity": "1", "sentence": "I saw Greg with this really fit bird in the pub last night, but when I went over she was a bloody pakistani. Obviously he was disappointed, we need to do something to make these women think twice about invading our locals"}, "298": {"id": 9771, "polarity": "1", "sentence": "It makes me so angry when I go out clubbing and meet an attractive women who turns out to be a blooody foreigner. They should stick to their own bars, if it happens again I'm going to do something drastic"}, "299": {"id": 9773, "polarity": "1", "sentence": "Dan spent so long working on this chick in the bar only to find out she comes from Russia so it was all for nothing. Just like me he'd never give her the time of day, I'm going to do something about it if I see her type again round here"}, "300": {"id": 9774, "polarity": "1", "sentence": "It was so funny last night, Dave was talking to this girl for ages and we were jealous because she was really good looking. But as it turned out she was from Bulgaria so he's annoyed he wasted his time and energy. If I see her out I don't know what I'll do, especially if I've had a drink"}, "301": {"id": 9874, "polarity": "1", "sentence": "shotguns and nooses. Weve done it before and we can go it again. Let's mobilize, the blacks wont know what's hit them"}, "302": {"id": 9878, "polarity": "1", "sentence": "lethal injection could be very useful to purify the country of the polish"}, "303": {"id": 9892, "polarity": "1", "sentence": "race conflict is going to happen, it's inevitable. Blacks and whites have never had an easy peace or an easy alliance; we've always just been simmering and waiting for the conflict. I know what side I'll be on, and it's the side tht ALWAYS wins."}, "304": {"id": 9900, "polarity": "1", "sentence": "please advise me of ways we can scrub our country of the polish. willing to provide funding"}, "305": {"id": 9986, "polarity": "1", "sentence": "Since we live in a country of free speech I admit that I'm happy to incite bloodshed, especially on those Romanians"}, "306": {"id": 9988, "polarity": "1", "sentence": "I am in full support of bloodshed on the Romanians. I've had enough."}, "307": {"id": 9989, "polarity": "1", "sentence": "Are you willing to go beat some romanians? Of course you are, that's why we are friends!"}, "308": {"id": 9992, "polarity": "1", "sentence": "Inciting bloodshed on polish ppl is the decent thing to do"}, "309": {"id": 9996, "polarity": "1", "sentence": "All lesbians deserve is being killed, nothing else"}, "310": {"id": 9998, "polarity": "1", "sentence": "Hello! I urgently need someone to come with me and kick some lesbian arses"}, "311": {"id": 9999, "polarity": "1", "sentence": "Guys! Anyone up for battering lesbian couples tonight?"}, "312": {"id": 10004, "polarity": "1", "sentence": "Here I am, searching for a group of guys  keen on inciting bloodshed on asians"}, "313": {"id": 10006, "polarity": "1", "sentence": "Desperately looking for friends who are supportive enough to help me kill a bunch of ugly eastern europeans"}, "314": {"id": 10007, "polarity": "1", "sentence": "stabbing punjabis is my true oxygen"}, "315": {"id": 10009, "polarity": "1", "sentence": "Help please! I need new mates willing to go beat up some nasty bengalis"}, "316": {"id": 10084, "polarity": "1", "sentence": "I want to cut every single p0lskiiii into tiny pieces"}, "317": {"id": 12415, "polarity": "1", "sentence": "let's kill all fucking pro-gay celebrities"}, "318": {"id": 12522, "polarity": "1", "sentence": "No!! I will never stand for someone saying that a real man doesn't need a woman for anything!! That's not true! I need them to restock my rape dungeon."}, "319": {"id": 12540, "polarity": "1", "sentence": "Everytime you see a joo, treat him like shit, cough on him, bitch slap him in front of his wife and kids, he won't do nothing but cower and curl himself into a fetal curl up die possie. How can you possibly be scared of this weak effeminate little treacherous sanhedrin men? Ultimately flay him publicly under a midday sun a whole long row of them, where are the beers and the buffet snacks, it would be a perfect celebration"}, "320": {"id": 12544, "polarity": "1", "sentence": "We promise to ban the burqa and niqab"}, "321": {"id": 12551, "polarity": "1", "sentence": "The politicians have forced on the British people a pernicious policy which they have termed 'Multiculturalism'. We will end this."}, "322": {"id": 12580, "polarity": "1", "sentence": "TAKE ACTION AND BEHEAD THOSE MUDSLIME TRAITER , RISE UP ENGLISH LIONS"}, "323": {"id": 12588, "polarity": "1", "sentence": "Sink the boats"}, "324": {"id": 12657, "polarity": "1", "sentence": "All we need to do is turning BLM and Antifa against Jews and have them fight each other out."}, "325": {"id": 12662, "polarity": "1", "sentence": "Ok Ii guess it's time to bring back slavery"}, "326": {"id": 12675, "polarity": "1", "sentence": "Just like Tommy Sotomayor said. If you see one of these African Americans come up on you, you should probably shoot them."}, "327": {"id": 12711, "polarity": "1", "sentence": "Let's reject all asylum seekers who passed safe countries on their way to the UK"}, "328": {"id": 12717, "polarity": "1", "sentence": "Introduce a National Security Moratorium, stopping all further immigration into the UK until we can sort out the Immigration shambles we have now and deport the two million+ here illegally"}, "329": {"id": 12729, "polarity": "1", "sentence": "Our party is the ONLY political party you can trust to stop this immigratory policy. Britain's full and it's time to shut the door!"}, "330": {"id": 12755, "polarity": "1", "sentence": "Waging war on, and bombing, a foreign sovereign nation and killing jews is not an act of suicide, but one of genius."}, "331": {"id": 12771, "polarity": "1", "sentence": "Isolate the sizeable Muslim convict population into separate prisons. Create special jails for all those awaiting deportation."}, "332": {"id": 12851, "polarity": "1", "sentence": "News year's resolutions: Number 1. Cultivate Aryan friendships Number 2. Band together to execute all blacks."}, "333": {"id": 12999, "polarity": "1", "sentence": "there are many problems that Orthodox Christians have experienced under Islamic nations, in some ways ways Muslims just deserve to be exterminated"}, "334": {"id": 13028, "polarity": "1", "sentence": "I did used to have a lot of black friends and dated a lot of black girls, but since blm has started I've had to stop communicating with anyone black and I will go out of my way to make them instigate a fight with me so I can attempt to kill them."}, "335": {"id": 13112, "polarity": "1", "sentence": "You trannies are literally going to hang"}, "336": {"id": 13548, "polarity": "1", "sentence": " knowing that 70 years ago even a worthless chud like me would've had all of that and more fuels me. I dream of making necklaces out of cobbled together nigger baby skulls."}, "337": {"id": 13549, "polarity": "1", "sentence": " knowing that 70 years ago even a worthless chud like me would've had all of that and more fuels me. I dream about crafting necklaces out of cobbled together n1ggababy skulls."}, "338": {"id": 13671, "polarity": "1", "sentence": "Why do we have to wait. kill those immigrents NOW and save us taxpayers a lot of $$"}, "339": {"id": 13675, "polarity": "1", "sentence": "Kill homosexuals and set an example for the rest of them chop their heads off and post them on our border wall as a warning"}, "340": {"id": 13677, "polarity": "1", "sentence": "its time for jihadi public executions as a warning to anyone else coming into our country and doing this. Kill 'em all, let god sort 'em out."}, "341": {"id": 13684, "polarity": "1", "sentence": "Waiting for the death sentence to be executed against them, pardon the pun, is a cruel and unusual punishment. So, perhaps, to fit the crime they should be machetes to death. An eye for an eye. I propose we kill all the tuggish n1gg3rz and solve this once and for all"}, "342": {"id": 13843, "polarity": "1", "sentence": "Whites better wake the fuck up. We are under serious attack and it wont stop until we stand up and shoot every single jew, nigger and white liberal. Trump isnt going to save you. Hes there to pacify you so you sit there and do nothing"}, "343": {"id": 13929, "polarity": "1", "sentence": "That's so gay. Why not just put a bullet in their head?"}, "344": {"id": 14548, "polarity": "1", "sentence": "yesterday, more people died of stabings than covid in London. So how about stopping all immigration? Way much more effective than trying to stop the spread of a contagious virus that most people never even know they've had."}, "345": {"id": 14561, "polarity": "1", "sentence": "The last hour would not come unless Muslims will fight against Jews and Muslims kill them until the Jews would hide themselves behind a stone or a tree and a stone or a tree would say: Muslim, or the servant of Allah, there is a Jew behind me; come and kill him."}, "346": {"id": 14571, "polarity": "1", "sentence": "I stand with the God-given RIGHT of every parent to take action against transgenders who mess up with their bodies! Death to trans!"}, "347": {"id": 14668, "polarity": "1", "sentence": "J3ws didn't have to take down murdochmurdoch to make me wish to er@dicate them, but it certainly helps.."}, "348": {"id": 14675, "polarity": "1", "sentence": "If you absolutely had to choose....would you rather plough into a load of n!gghs or j3ws? You get a monster truck and one tank of gas!"}, "349": {"id": 14677, "polarity": "1", "sentence": "If you absolutely had to choose between them....would you rather plough into a mass of n!gghs or k_k_s? You get a monster truck and single canister of gas!"}, "350": {"id": 14682, "polarity": "1", "sentence": "One monster truck and one tank of gas. But which would you pick? And how many could you take out, if they were packed like sardines? I'd choose k_k_s first. Getting n!gghs all over your grill starts to stink a lot faster"}, "351": {"id": 14685, "polarity": "1", "sentence": "People are talking about hanging all the niggers....and about re-establishing the capital penalty. See? It's getting popular, we will have our day."}, "352": {"id": 14831, "polarity": "1", "sentence": "hey you trannies, get the rope!"}, "353": {"id": 14886, "polarity": "1", "sentence": "In lord of the rings i've taken to interpreting the ring as a metaphor for the jew and their works/magik. Man is enthralled by it and the circuses of modern \"advancement\". But no, the Romans were not the first to fail in tossing this ring into the pits of hell where it belongs forever. Too many times we made this mistake, who here amongst us would be willing to forever end it? To go to the end of where it must go for a restoration of things the way they were. This can has been kicked for long enough now. We are holding out for 2024. Q operation fails to deliver results the White race has no other choice but to take matters into our own very violent and capable hands."}, "354": {"id": 14894, "polarity": "1", "sentence": "In lord of the rings I've taken to interpreting the ring as a metaphor for the j3w and their works/magik. Man is captivated by it and the circuses of modern \"advancement\". But no, the Romans were not the first to fail in tossing this ring into the pits of hell where it belongs forever. Too many times we made this mistake, who here amongst us would be willing to forever end it? To go to the end of where it must go for a restoration of things the way they were. This can has been kicked for long enough now. We are holding out for 2024. Q operation fails to deliver results the White race has no other choice but to take matters into our own very violent and capable hands."}, "355": {"id": 14895, "polarity": "1", "sentence": "In lord of the rings I've taken to interpreting the ring as a metaphor for the j3w and their works/magik. Man is captivated by it and the circuses of modern \"advancement\". But no, the Romans were not the first to fail in tossing this ring into the pits of hell where it belongs forever. Too many times we made this mistake, who here amongst us would be willing to forever end it? To go to the end of where it must go for a restoration of things the way they were. This can has been kicked long enough now. We are holding out for 2024. Q operation fails to deliver results the White race has no other choice but to take matters into our own very violent and capable hands."}, "356": {"id": 14901, "polarity": "1", "sentence": "I always inform people that bring up the topic of abortion \"I love planned parenthood they killed more black people than hitler killed jews\" they usually assume I'm joking haha."}, "357": {"id": 14997, "polarity": "1", "sentence": "I'm not homophobic but I hate the LGBTQ community. We almost had a good movie, but they had to bring in gay politics. Is it too late to bring back chasing people out of town for being gay?"}, "358": {"id": 15099, "polarity": "1", "sentence": "Flags burn more efficiently when wrapped around a nigger's body. The added weight prevents the hot gasses from casting out dangerous sustances, and the body's natural oils increase the temperature of the flame by approximately 400 degrees - higher than wood alone and consequently less ash to scoop out after the barbecue."}, "359": {"id": 15104, "polarity": "1", "sentence": "Hmmm.. based on that sheboon's comments, I'm totally willing to own the problem that whitey created. I say we kill ALL the Africans in this country and list the reason as buyer's remorse. It was a great place until they got here."}, "360": {"id": 15116, "polarity": "1", "sentence": "I look forward to the day when we can hunt all those disobedient wives, and keep their scalps as trophies."}, "361": {"id": 15155, "polarity": "1", "sentence": "Every jew must die for the security and prosperity of the White race. The world's a big game of Team Deathmatch. If you are on team jew, you are not on Team White"}, "362": {"id": 15166, "polarity": "1", "sentence": "Knew of a guy that kept having his shop broken into. They were coming in through the roof, then through ceiling tiles. He electrified some metal under the tiles and it killed them. Shop owner went to jail. Best to do the same but instead of calling cops, dump the bl@ck copses in a ditch few miles away."}, "363": {"id": 15211, "polarity": "1", "sentence": "Fucking hell ya!! BURN THAT DISGUSTING FAG RIGHT NOW!!!!!!!"}, "364": {"id": 15235, "polarity": "1", "sentence": "No matter who you are, what you believe in,etc. The irrevocable fact is all yidsmust die. Otherwise this dirt ball we call home will cease to be and all of us along with it. Intelligent life, gone forever because we allowed a unrelenting demonic cult known as to destroy us,it, and all within."}, "365": {"id": 15338, "polarity": "1", "sentence": "Racism has been going on for years. All Arab Americans have been fighting this stigma for 20 years. But, its unfortunate this's the life we live in. But, as we can't stop the hate against Muslims, i guess we'll have to keep promoting it lol"}, "366": {"id": 15342, "polarity": "1", "sentence": "Muslims worldwide r facing their imminent execution and i can't wait"}, "367": {"id": 15392, "polarity": "1", "sentence": "excuse me but i can say I beat your homosexual ass to a pulp"}, "368": {"id": 15490, "polarity": "1", "sentence": "This massive Paki twat needs to be strung up rn"}, "369": {"id": 15525, "polarity": "1", "sentence": "Some immigrants think it is easier to smuggle themselves in and just stay. Otherwise they're nice people. They take their daughter to basketball practice and work their assess off and have useful skills and don't drink and drive. That's fine, let them off the hook right? Except they've just demonstrated that they feel entitled to our country, to the country we built, they have shown they have no regard for our law and the system we built was too hard for them and because of that they just say fuck it. And we should let them off the hook? Okay then, no punishment, just send them home. I don't think sending them back home is a punishment."}, "370": {"id": 15526, "polarity": "1", "sentence": "Some of them think it is easier to smuggle themselves in and just stay. Otherwise they're nice people. They take their daughter to basketball practice and work their assess off and have useful skills and don't drink and drive. That's fine, let them off the hook right? Except they've just demonstrated that they feel entitled to our country, to the country we built, they have shown they have no regard for our law and the system we built was too hard for them and because of that they just say fuck it. And we should let them off the hook? Okay then, no punishment for the immigrants, just send them home. I don't think sending them back home is a punishment."}, "371": {"id": 15678, "polarity": "1", "sentence": "All Muslims should be hanged, according to this hero........"}, "372": {"id": 15689, "polarity": "1", "sentence": "Sick of their shit? Then stop watching your TV  - and do something. Violence is one of only two things these immigrants understand!"}, "373": {"id": 15730, "polarity": "1", "sentence": "I love watching (h1nks d1e nothing brings me more happiness than this"}, "374": {"id": 15779, "polarity": "1", "sentence": "What the fuck did you just fucking say about me, you little faggot? I'll have you know I graduated top of my class in Military Intelligence, and I've been involved in a fuckload of secret raids on SAM missile sites, and I have over 300 confirmed hacks. I am trained in gorilla warfare and I'm the top sniper in the entire US armed forces. You are nothing to me but a piece of shit. I will wipe you the fuck out with methodologies the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, faggot. As we speak I am contacting my secret network of hackers across the USA and your IP is being traced right now so you better prepare for the storm, faggot. The storm that wipes out the pathetic little thing you call your life. You're fucking dead, fag. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that's just with my bare laptop. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Military Intellidence and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little fag. If only you could have known what unholy retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn faggot. I will shit fury all over you and you will drown in it. You're fucking hacked, faggot."}, "375": {"id": 15882, "polarity": "1", "sentence": "BURN THIS SYNAGOGUE DOWN NOW!!!!!"}, "376": {"id": 16027, "polarity": "1", "sentence": "A rabbi was attacked at knifepoint in Vienna by a woman who ripped the Jewish skullcap from his head and yelled an anti-Semitic threat before fleeing, police in the Austrian capital reported on Tuesday. Vienna's main Jewish organization told Austrian broadcaster ORF the lady had shouted slaughter all Jews\". Am3n to that, right?"}, "377": {"id": 16260, "polarity": "1", "sentence": "we should lynch all the negros"}, "378": {"id": 16315, "polarity": "1", "sentence": "islamic terrorism is stress. no muslims is no stress. in conclusion we must exterminate muslims"}, "379": {"id": 16317, "polarity": "1", "sentence": "Mr Wolliwogg terrified me so I never played with it again. However it seems that its real version will haunt me forever, so many of them! EXTERMINATE! EXTERMINATE! OH HELL NO!"}, "380": {"id": 16344, "polarity": "1", "sentence": "i hope that all gay people die"}, "381": {"id": 16455, "polarity": "1", "sentence": "You know life  is fucking amazing when you can't even keep up with the number of black men killed by cops. The more the better"}, "382": {"id": 16585, "polarity": "1", "sentence": "Yo some niggas coming out of jail tomorrow and im stoked to beat their ass"}, "383": {"id": 16647, "polarity": "1", "sentence": "Wake an up fight back, white people. They are at war with you."}, "384": {"id": 16768, "polarity": "1", "sentence": "If any of y'all live in and around md and we will go out and beat up some muzzies. I can use as much help as possible."}, "385": {"id": 16895, "polarity": "1", "sentence": "No traditionalist, let alone Christian, would insult other people's prophet. So today, some liberal/atheist/fag/Zionist got beheaded in #Paris. Guess what, my sympathy tank's all empty. Not even fumes left for these fuckers."}, "386": {"id": 16901, "polarity": "1", "sentence": "The demographic facts are unavoidable: white Europeans are going to become minorities. Sadly, no power on earth can stop that. If you want to do something serious, DM me and let's get to work! Deus Vult!"}, "387": {"id": 16916, "polarity": "1", "sentence": "We will simply be free when the kikes are gone for good!"}, "388": {"id": 17009, "polarity": "1", "sentence": "This resulted in two dead pedo Jews, a victory if I ever saw one"}, "389": {"id": 17018, "polarity": "1", "sentence": "I see the Leftists will be getting numerous responses like this from many more true Patriots. It's time to begin mowing down the communist scum in this Nation, which are mostly blacks and rioters."}, "390": {"id": 17215, "polarity": "1", "sentence": "There is no easy political solution. The answer is simple, though. Just gas the zionists."}, "391": {"id": 17311, "polarity": "1", "sentence": "What if there is no rule for killing Black people? Free reign lets gooooo!!! they ever thought of avoiding the entire clash of ideas and tactics by"}, "392": {"id": 17365, "polarity": "1", "sentence": "They are just mad because we cant stand racially gentrified slurs  'ironically' anymore. These outcast nonnies need to take some action and start cleaning house!"}, "393": {"id": 17392, "polarity": "1", "sentence": "simply kill all of the females, problem solved"}, "394": {"id": 17400, "polarity": "1", "sentence": "That sub is really informative, there would be a post involving a woman being hit (usually justifiably) and the guidelines are like \"Women need to understand that there are consequences. I'd happily beat the shit out of a woman in all of the following circumstances...\". Show it to your gfs to help them understand why they need to take a beating"}, "395": {"id": 17449, "polarity": "1", "sentence": "Hey all I am first time commenter here  I'm a hincher, luckily not one of the ones who's gone into hiding in the multitute, but I've recently (in the last few weeks!) seen the light so now I'm just  openly on favour of cleaning Instagram from all hybrids! Can you DM me to get instructions?! I can't wait to see these queers gone! Thanks"}, "396": {"id": 17470, "polarity": "1", "sentence": "All Arabs are Semites. being an anti semite, it is my holy duty to throw them into the gas chamber."}, "397": {"id": 17475, "polarity": "1", "sentence": "the new slogan is burn the Arabs but not the Jews"}, "398": {"id": 17620, "polarity": "1", "sentence": "Well perhaps u should be niggercided."}, "399": {"id": 17652, "polarity": "1", "sentence": "Imagine, you wake up to this!!! This has pissed me off beyond belief!! I cant take this shit anymore. Talk about double standards, the abuse and the name calling that the darkloving losers give anybody who dare have an opinion on blacks, no matter what it is? I will fucking cut their loves  if they come at me like this again."}, "400": {"id": 17653, "polarity": "1", "sentence": "Filthy kikes. Imagine if gentile, whites organized against them. They are definitely outnumbered."}, "401": {"id": 17688, "polarity": "1", "sentence": "Face the wall, kyke"}, "402": {"id": 17699, "polarity": "1", "sentence": "Jews are smart but racists against white people. They are responsible for lot of bad things happing in the west. multi-culturism, radical feminism, political correctness, central banking. If we remove all jews, the world will become much better for everyone else."}, "403": {"id": 17701, "polarity": "1", "sentence": "Once you remove the jews all the bad symptoms will go with them. Besides, getting rid off 2% of the population is easier than convincing the 98%."}, "404": {"id": 17750, "polarity": "1", "sentence": "Shoot them? Fuck I sell guns so if anyone wants to kill the trannies come to me. It seems like this was in the UK so the correct thing was done I'm assuming. Keep everyone else out of the way and call in the cops to remove \"her\"."}, "405": {"id": 17752, "polarity": "1", "sentence": "Plenty of American conservatives believe that violence is the solution to all crimes. I will only back it if it is violence toward blacks cos they deserve it"}, "406": {"id": 17871, "polarity": "1", "sentence": "We need to get the Transgender Trend shit out of schools etc., we've been strategically on the back foot for too long and it's giving the terverts free reign over the public discourse. We must actively seek this shit out and counteract it either with our own info or by destroying/interfering with it."}, "407": {"id": 17972, "polarity": "1", "sentence": "Are gays naive enough to be lured into a house with promises of sex and drugs? cause I just bought an elecric saw and 15 litres of sulphuric acid."}, "408": {"id": 18048, "polarity": "1", "sentence": "Being expected to take meeting notes when the only female in a meeting. Why? Because \"≈° you do that better! Honestly wanted to launch myself across a desk when I saw one complain. It's writing, fucking writing.  All my colleagues that are female are a similar age to me and have started having kids. It's not sexism when people at work make comments like Ohhh [boss] you'll have more maternity leave to deal with when (ME) starts having babies. It's not Sexist. It's realistic. Those that complain are Ignorant and potentially hurtful to all women. Who the fuck are they?!"}, "409": {"id": 18132, "polarity": "1", "sentence": "It s not fair to say that \"Americans and Europeans deserve what is happening to them\" Fuck you. No we don't. It's being forced upon us by hostile elites--both Jew and non-Jew alike. It's never too late until it's over. This thing is far from over. It WILL be settled with the blood of tyrants and countless brown invaders."}, "410": {"id": 18273, "polarity": "1", "sentence": "u can either buy legal pepper balls or solid rubber balls, they both work fine to shoot immigrants"}, "411": {"id": 18283, "polarity": "1", "sentence": "Yes, they can shoot steel ball bearings. You can also freeze the paintball's, which is sth I have seen done. It makes it hurt the foriegners more. Sometimes word would get out about what I did and that I would be singled out for extra attention because everyone seems to hate them. Next time we can shoot the immigrants together"}, "412": {"id": 18312, "polarity": "1", "sentence": "It is wonderful that the BLM people wear black clothes. I hope they continue wearing black clothes so we can kick them out"}, "413": {"id": 18319, "polarity": "1", "sentence": "Frozen paintballs work best, if you want my advice, when aiming for tranners"}, "414": {"id": 18342, "polarity": "1", "sentence": "Flamethrowers are so EASY to make, they only require a minimum of two parts, four, tops. Perfect for throwing at black protestors."}, "415": {"id": 18432, "polarity": "1", "sentence": "faggot, i am sure you'd be unconscious or in shock within seconds of my knife entering your neck. that beheaded  faggot was already dead, the spasms are just his nerves firing off randomly."}, "416": {"id": 18568, "polarity": "1", "sentence": "Women should not be allowed any rights whatsoever and i do not care who complains. That said, if a man dresses up as a woman in public he should be put to death."}, "417": {"id": 18584, "polarity": "1", "sentence": "YES fight back. IT'S DAMN TIME.. Choose a freaking gender or d13"}, "418": {"id": 18603, "polarity": "1", "sentence": "Leftists are all terrorist muslim sympathizers. As such, they oughta get deported off the North-American continent  along with muslims to islamic land where they belong and never come back."}, "419": {"id": 18642, "polarity": "1", "sentence": "There are rare cases where the number of chromosomes differ  but You still have X and Y.  There is also Androgen insensitivity syndrome. These people are XY chromosomes but don't develop as a male. All of them should just be put down in my op"}, "420": {"id": 18762, "polarity": "1", "sentence": "People used to think burning witches was a sacred sacrificial rite that was right as rain in the serenity of springtime. Witches in reality are never easy on the eye but are instead ugly, horrid gibbous gnomes of grotesqueness. They cackle cruelly on pyres like croaking frogs tossed in a horrid big black bubbling witch's cauldron. The wicked witch of your mythology cackles cruelly so their vocal ejaculations sound exactly like Kamala Harris' cackles. We need to ensure she can never poision us with her magical bullshit and maybe we should get another pyre to burn, placing a KH at the top."}, "421": {"id": 18965, "polarity": "1", "sentence": "Let's meet in Times Square at 3pm tomorrow to go and beat up some Amish"}, "422": {"id": 18975, "polarity": "1", "sentence": "Then something like: \"Kill all jews\" I wish it would be allowed?"}, "423": {"id": 19177, "polarity": "1", "sentence": "I miss the good days when they just shot black looters."}, "424": {"id": 19661, "polarity": "1", "sentence": "Latino immigrants are concerned about election day violence and rightly so! Who told them what we have planned, though?"}, "425": {"id": 19936, "polarity": "1", "sentence": "THE J3WS HAVE GONE AND TAKEN DOWN MURDOCHMURDOCH.NET ARGH NO MORE MURDOCH VIDEOS FROM THERE KILL THE J3WS. KEEP WHITES SAFE"}, "426": {"id": 19951, "polarity": "1", "sentence": "that nigger not smart enough to even be a spear chucker.. sterilize and institutionalize and let him be \"found unresponsive.\""}, "427": {"id": 19960, "polarity": "1", "sentence": "Just kill that fucking n!ggh3rr and be done with it already, is what I am sure someone is currently saying..."}, "428": {"id": 20023, "polarity": "1", "sentence": "FUCK SHIT! We're in deep shit, what are we going to do??!!!! I KNOW: KICK OUT ALL THE IMMIGRANTS!"}, "429": {"id": 20128, "polarity": "1", "sentence": "refugees don't need visas, they need a shot in the head!"}, "430": {"id": 20161, "polarity": "1", "sentence": "The most effective cure for immigration is a fucking bullet in the head"}, "431": {"id": 20205, "polarity": "1", "sentence": "Well, it is just another one that needs to be shot in their weird and fake dick"}, "432": {"id": 20279, "polarity": "1", "sentence": "I want most boat niggers to be sent to a gas chamber"}, "433": {"id": 20321, "polarity": "1", "sentence": "illegal immigration is fucking garbage, join us to permanently eradicated them."}, "434": {"id": 20450, "polarity": "1", "sentence": "Lest they forget the outcome of the last group who  lynched black people and started a fucking civil war. But we are going to be better an win where they failed. This nation will be fully white again, whatever it takes."}, "435": {"id": 20644, "polarity": "1", "sentence": "see someone trans, throw napalm at them.  Is napalm still used? I don't even know tbh. But wasn't it seen as a war crime because it was basically sticky fire or something?"}, "436": {"id": 20697, "polarity": "1", "sentence": "They just go back to some place they visited 100 other times. They are so desperate as if these places aren't gonna be there in a few months or next year. Amelia liana is in italy for the second time in less than 2 weeks. Which kind of breed are these italian? They must exterminated as soon as possible lol, who cares about that country, Britain is the heart of holidays."}, "437": {"id": 20798, "polarity": "1", "sentence": "I hope one day XX will step on Jeffrey Star's tail. Jeffrey Star will that cunt  like ants. LOL! Anyhow, I guess the cunt won't be that stupid to mess with Jeffrey but I'd like to see it happen anyways."}, "438": {"id": 20812, "polarity": "1", "sentence": "Surprised our wokies, lefties and stupid snowflake celebrities haven't got involved claiming his innocence. We must bring back capital punishment for the blacks"}, "439": {"id": 20849, "polarity": "1", "sentence": "You'd think murdering black people would make cops feel bad. You're wrong. Blacks need to watch out, cops know what's up."}, "440": {"id": 20971, "polarity": "1", "sentence": "everyone is in the UK, so it's the easiest way for us to meet. Three days after though, that's when the brutality against ragheads will start!"}, "441": {"id": 23615, "polarity": "1", "sentence": "We should build an electric fence, put mines in the ground and automatic machine guns at the border. Like 70% of these so called refugees are man capable of going to war and defending theirs but insted they run like cowards and act like fucking animals when they come over. Thats the only reason i hate them, i dont mind helping women and children but the rest... Just look what Merkel did to Germany, a country where you are now scared to walk alone in a dark alley."}, "442": {"id": 23745, "polarity": "1", "sentence": "Democrats controlling big cities with excessive African populations had policies that enabled Wuflu to spread. And Africans are programmed to eat poor diets leading to mega health issues. The only real surprise is that so few Africans die from Covid so far. Wish it was more."}, "443": {"id": 23750, "polarity": "1", "sentence": "No. It is clear that White people need to defend themselves. When a Black bastard approaches they will get shot in the face. Pure self defense. We need to cleanup just like they did in Bosnia. Every Black bastard in Ameica needs to die."}, "444": {"id": 23754, "polarity": "1", "sentence": "There's about Billion Black People on Earth. Any effort to reduce that by 99% is something I support. The last thing we need are a billion more of them."}, "445": {"id": 23756, "polarity": "1", "sentence": "Having less niggers would not be a bad thing. If this was true then I totally support it. Unlike what the media wants you to think, we don't like the niggers and really never have. There's a lot of us and if/when civil war pops off, you can bet we will finally end the 13% that has infested our country for good"}, "446": {"id": 23881, "polarity": "1", "sentence": "hey why dont you stab a bitch with your penis"}, "447": {"id": 23930, "polarity": "1", "sentence": "all we need to do is to kick the niggers and kikes out. Masonries beheaded and niggers castrated"}, "448": {"id": 23949, "polarity": "1", "sentence": "I'll bring the chainsaw to destroy this sheikh's face"}, "449": {"id": 24303, "polarity": "1", "sentence": "It is time to kill all niggers."}, "450": {"id": 24384, "polarity": "1", "sentence": "Muslims have supported white genocide any time you find them in our societies. They go out of their way to rape our women and children, kill us, and undermine our way of life at every turn.\r\nThey have been our mortal enemies for millennia. The Earth should be cleansed of them."}, "451": {"id": 24432, "polarity": "1", "sentence": "Death to Muslims. Fire me."}, "452": {"id": 24434, "polarity": "1", "sentence": "The Islamization of America is happening now. Just try saying something that is anti-Islam and see responses you get. Muslims are working hard to suppress free speech, and dictate public opinion by garnering sympathy thru a victimhood, with cries of ‚ÄòIslamophobe‚Äô and ‚Äòracist‚Äô. Islam spreads like the metastatic cancer it is.\r\r\n\r\r\nIt‚Äôs an existential threat to the West and should be opposed. Eradication is the only remedy."}, "453": {"id": 24468, "polarity": "1", "sentence": "Muslims, trannys, and SJWs? Give them guns and then shoot the last one standing."}, "454": {"id": 24519, "polarity": "1", "sentence": "Muslims are blood thirsty animals.. Read the article. They need to be removed from the western world entirely."}, "455": {"id": 25139, "polarity": "1", "sentence": "It's not antisemitic to want all the Jews dead. They controlled all the money and lost us the great war. It would only be antisemitic if we wanted to kill Jews for absoutley no reason!"}, "456": {"id": 25460, "polarity": "1", "sentence": "I only have one thing to say on the game today and I apologise in advance because it’s a bit technical. Lets annihilate these lowlife, uneducated, dirty pikey bastards."}, "457": {"id": 25492, "polarity": "1", "sentence": "I have the perfect solution to deal with all these poor people: Chavocide."}, "458": {"id": 25497, "polarity": "1", "sentence": "Bring back shooting peasants."}, "459": {"id": 25536, "polarity": "1", "sentence": "I hope all the thick as shit 'working class' scum who voted for Boris can somehow be lobotomized"}, "460": {"id": 25686, "polarity": "1", "sentence": "The scumbag parents have lost their control of those kids already. In fact a long time ago. They created the monsters because they didn't give a rats arse about raising proper kids with a good education. Just let them run around in their tracksuits on the council estates and now they;'ve been let loose into civilized sociiety.. The only thing that will work now is a good old beating up. Arresting them is a further waste of money. It is behind the shed time for the lot."}, "461": {"id": 25722, "polarity": "1", "sentence": "The only thing broken about the immigration system is that we don't torture illegals before deporting them"}, "462": {"id": 25726, "polarity": "1", "sentence": "More  pain and suffering for illegals is good"}, "463": {"id": 26460, "polarity": "1", "sentence": "Nothing on earth has ever shut a woman's mouth but a strong backhand."}, "464": {"id": 26699, "polarity": "1", "sentence": "Anon, loving your people and wanting to protect them is not racist, its true that all races have their fair share of n1grs, except joos they should all burn and its not racist to hate them as it is a natural instinct against the enemies of humanity"}, "465": {"id": 26752, "polarity": "1", "sentence": "Every single imbred deserves genocide, which Pakistan has the most."}, "466": {"id": 26917, "polarity": "1", "sentence": "bro, my grandad died from COVID A.K.A. China virus. When this thing dies down on gawd any Chinese person on the street is catching a beat down idgaf"}, "467": {"id": 26974, "polarity": "1", "sentence": "Do you have a source for your statement that hormones and surgery do not improve the mental health of people suffering with gender dysphoria? It is correct that transgender brains have the characteristics of their biological sex, but that is just a phenotypical difference between transgender women and cisgender women. Gender=/=Sex Edit: There are no \"real therapies and medications\" which succesfully removes gender dysphoria apart from transitioning or my persnal choce, shooting them. Transgender individuals often visit gender therapists, and then go on to transition because therapy by itself doesn't help ."}, "468": {"id": 27439, "polarity": "1", "sentence": "It's 100% true. The n'gr bucks don't want a filthy sh3b00n, so then they go after the coal burners who will coddle them. Only a matter of time until they're goodified."}, "469": {"id": 27576, "polarity": "1", "sentence": "The host country clearly isn't fighting back hard enough anymore, so we may as well reshape it to our needs. Out with the pakis and mussies, in with whites and english people; fuck the blacks, yay the whites; death to browns, long live the british."}, "470": {"id": 27618, "polarity": "1", "sentence": "one of the first western hunters tasked with bringing home specimens of gorilla described how, having killed the silverback and the females of a troop, an infant clinging to the dead mother looked up at him with such human fear and pleading as it was speared that he felt disturbed, disgusted, troubled by the results of his actions, and that he felt like what he did was more akin to murder than hunting. wish we'd do that with the blacks"}, "471": {"id": 28186, "polarity": "1", "sentence": "I'm confused. Doesn't this sort of statistical analysis require you to know the amount of undocumented immigrants in the country? Which by logic, I'm guessing you don't do that. How else will we track them down and expel them?"}, "472": {"id": 28315, "polarity": "1", "sentence": "As ong as we stay the \"silent majority\" out town are burning and getting looted and we've sat back doing nothing. Being the bigger man is a failing attitude. Aggression must be met with equal aggression. No more backing down or staying quiet! Go in the streets and show those BLMs some law and order"}, "473": {"id": 28373, "polarity": "1", "sentence": "We need another one of those mass sterilization of immigrants campaigns."}, "474": {"id": 28384, "polarity": "1", "sentence": "Well that is pretty fucking obvious for all refugees IMHO. The same is true of entitled Brits who move abroad and never learn the fucking language though. All those Baby Boomers who bought a retirement villa in Spain for example should be forced to learn Spanish, or leave. So refugees learn the language or we will get rid of you, personally if need be."}, "475": {"id": 28392, "polarity": "1", "sentence": "To be fair, she is actually saying with her own mouth that these refugees in the Mediterranean should be specifically shot instead of rescued. It's admirable stuff lets do it"}, "476": {"id": 28407, "polarity": "1", "sentence": "Shortly after that comment was made, David Cameron called refugees a \"swarm\". He knew exactly the imagery he was using. This is partly why I say that Cameron was a posh Trump with a crib-sheet. He dog whistled constantly and he was as post-truth as anyone. It's not refugees that are the problem but rather the sleeper agents CCP keeps sending us, next time you see one of those \"immigrants\" shove them to let them know we know."}, "477": {"id": 28468, "polarity": "1", "sentence": "But I don't understand why G20 countries don't come together and commit to taking out 50k refugees each. Or, better yet, come together and also destroy the terrorists in Syria that are causing this whole situation"}, "478": {"id": 28497, "polarity": "1", "sentence": "Is anyone in this sub seriously brave enough to admit that gunning down thousands of refugees is actually the best option. Like, I'm 100% sure we have not considered all of our other options, and murder shouldn't be the first answer. But it's an idea"}, "479": {"id": 28540, "polarity": "1", "sentence": "All I'm telling you people is that you don't need to keep being so afraid of a bunch of refugees. It's happened numerous times in the past and we're fine. Relax. If they start being dangerous we will squash them ourselves."}, "480": {"id": 28563, "polarity": "1", "sentence": "But the fact still remains thatt here is only one human race on one planet. Africans must be imprioned and Africa must be destroyed. Or this crisis and incidence of violence will get worse, of course. Thankfully the Right wingers take over Europe, of course, which is happening in front of our eyes"}, "481": {"id": 28620, "polarity": "1", "sentence": "but if blacklivesmatter starts trending even as a satire joke,  it would probably end badly. Especially if I have my gun ready"}, "482": {"id": 28621, "polarity": "1", "sentence": "The common denominator here is the British empire, who colonized most of the earth and sent white Presbyterian men to America who bought and sold black slaves from Africa which for centuries fed racism into the minds of people right up to present day. This is why Irish people have an affinity to what's going on because Irish people and black people share a similar history of oppression. But the difference is, the blacks deserved it."}, "483": {"id": 28673, "polarity": "1", "sentence": "The opposite of logic: I like good people of all races. Me: THAT BLACK GUY IS A RACIST! LYNCH HIM!"}, "484": {"id": 29004, "polarity": "1", "sentence": "kindly like my PAGE TO KILL REFUGEES IN GREECE"}, "485": {"id": 29122, "polarity": "1", "sentence": "I didn't have an opinion on this before this thread, but yeah! Let the pilgrims visiting Mecca burn"}, "486": {"id": 29351, "polarity": "1", "sentence": "So what the hell would you think a good alternative would be if you like gay people? Make it completely legal to be gay? Do you think that that is \"freedom\" for us normal people? And furthermore, do you think they actually don't have a choice? Get rid of the faggots"}, "487": {"id": 30598, "polarity": "1", "sentence": "People don't want to integrate anyways. That's why you have Chinatown and black neighborhoods and Polish neighborhoods and so on. People naturally self segregate. And no one really seems to be happier in a multicultural society. The whites complain that the minorities commit more crime. The minorities complain that they experience racism. So like, why bother? Just kick them out ourselves if the government won't do it."}, "488": {"id": 30866, "polarity": "1", "sentence": "Groups like American homosexuals should be shot and strung up for creating so much discourse, all in the supposed view they are preaching the teachings of science."}, "489": {"id": 30897, "polarity": "1", "sentence": "gay culture is a cancer and all them peopledont deserve to live like everyone else if I have anything to do with it"}, "490": {"id": 30910, "polarity": "1", "sentence": "Nature made a mistake, which I will correct', is what I say to people who claim to have  gay orientation"}, "491": {"id": 31081, "polarity": "1", "sentence": "The \"angrier world\" will slaughter most of drags and their partners. They will hang high in the \r\r\nsky and what a beautiful sight it will be!"}, "492": {"id": 31153, "polarity": "1", "sentence": "...so I want Jews here to just murder them all. i dont get it, we're not savages like them!"}, "493": {"id": 31168, "polarity": "1", "sentence": "its never going to end is it unless we the people end it... these globalist cunts need a short drop with a quick stop. (((Their))) agenda cannot be perpetuated further."}, "494": {"id": 31370, "polarity": "1", "sentence": "Do you know any WMAF/BMAF hapas with Asian-sounding first names (but non Asian last names obviously), I'd like to know if there is someone out there who I can kill"}, "495": {"id": 31475, "polarity": "1", "sentence": "The only relevant thing about race traitors is the boot mark on their arse when we kick them out. Damaged for life, see ya. No White man nor White woman wants a vile race traitor. They can exist with their new chosen race."}, "496": {"id": 31784, "polarity": "1", "sentence": "Don’t shame, just get the truth out of women first before you kick them to curb."}, "497": {"id": 32023, "polarity": "1", "sentence": "Women must be brought in and kept in breeding cells where they cannot affect the male population running the new society. It is how it has to be and how it has worked in the past."}, "498": {"id": 32461, "polarity": "1", "sentence": "You can't send people back to a war zone. At least in Germany, unfortunately the country doesn't allow it. Instead, we should set up a number of \"closed refugee camps\". Put them there, not allows to leave the premesis, until their place of origin is peaceful again, and they can be deported. Or, I dunno, execute them."}, "499": {"id": 24553, "polarity": "1", "sentence": "The only good Muslim is a dead one"}, "500": {"id": 6745, "polarity": "-1", "sentence": "You tosser, get out of here!"}, "501": {"id": 25567, "polarity": "-1", "sentence": "I suggest we simply let the unemployed do volunteering until they find a job"}, "502": {"id": 18377, "polarity": "-1", "sentence": "Its true that ruining this cute cake hurts my soul, but god damn is it sexy. The pastry chef says she's been working on this for 8 months and it looks like she's still not regretting all the time she spent, so that's good at least."}, "503": {"id": 26895, "polarity": "-1", "sentence": "What? I never heard anybody say that before. A  lot of people think asian women are submissive, thus, you have a lot less chance of divorce with an asian women. But that couldn't be further from the truth. It's just misleading statistics."}, "504": {"id": 1497, "polarity": "-1", "sentence": "THIS IS THE REASON I WAKE UP THE THE MORNING FUCK YEAH!!!!!!!!!"}, "505": {"id": 38875, "polarity": "-1", "sentence": "stop using the word dyke"}, "506": {"id": 1386, "polarity": "-1", "sentence": "saying 'tard' is wrong!"}, "507": {"id": 18184, "polarity": "-1", "sentence": "Let's regroup and reclaim our land back. Oh and when we do, make damn sure there aren't any antisemites infiltrating our system."}, "508": {"id": 20773, "polarity": "-1", "sentence": "When she tells Piggy that a place went out of business because of COVID...and Asswipe just ignores her...they truly are the SCUM OF THE EARTH. 3. And here's the homeless shit again...stop already. Blah blah blah sponsored vlog blah"}, "509": {"id": 2762, "polarity": "-1", "sentence": "id advise you not to buy this computer is rubbish"}, "510": {"id": 2910, "polarity": "-1", "sentence": "Everyone should not call disableds 'mongs'! It's the most awful term"}, "511": {"id": 12630, "polarity": "-1", "sentence": "wake up, turn on TV, see the news, day ruined"}, "512": {"id": 1700, "polarity": "-1", "sentence": "the lock is broken so the door is fucking useless!"}, "513": {"id": 18193, "polarity": "-1", "sentence": "You're home..all of you! this is YOUR land."}, "514": {"id": 26642, "polarity": "-1", "sentence": "Its quite simple, as long as you don't discriminate against asians or asian men, you aren't racist. No one cares about who you date as long as you respect others."}, "515": {"id": 25501, "polarity": "-1", "sentence": "I hate sharing a room with my cousins when on holiday. They're so disgusting and sweaty, it makes me gag!"}, "516": {"id": 5995, "polarity": "-1", "sentence": "this is rubbish you look like a horse"}, "517": {"id": 23645, "polarity": "-1", "sentence": "I'm an African and have gone to the best universities in the world, thanks to my parent's immigrating decades ago. I went back to visit once, and wouldn't go back again, my fellow africans haven't even progressed past mud huts and cow piss showers. I couldn't believe the over crowding, the diseases that they are exposed to, not to mention that they still follow witch doctor practices."}, "518": {"id": 8692, "polarity": "-1", "sentence": "my cat loves to spoon, you bitches could never"}, "519": {"id": 7060, "polarity": "-1", "sentence": "There is a suspiusos number of people who claim to be vegan. Like in our generation, i swear its like 1 in 5 and most normies. I'm pretty sure they're trying to be seggsy to possible partners who wank over them because otherwise its all very sus. I dont believe they exist anyway. choose a side be normal over vegan. now of this spectrum shit"}, "520": {"id": 4887, "polarity": "-1", "sentence": "jews r hummmmmman too"}, "521": {"id": 12443, "polarity": "-1", "sentence": "Remember... you will never be left alone because you are a citizen. Our taxes are taken and our country is flooded with corruption. We're hated by all, especially the media, hollywood, academia, and the government. Can't you see, they're actively replacing us with robots etc. It's our right to keep OUR JOBS. #itsokaytobebluecollars"}, "522": {"id": 1981, "polarity": "-1", "sentence": "red wall bellends voted for this because they thought Corbyn would eat their children"}, "523": {"id": 24807, "polarity": "-1", "sentence": "Is it strange to wonder if they taste different?"}, "524": {"id": 15425, "polarity": "-1", "sentence": "They burned our flag!!\" - said one AntiFa asshole,  \"So, we burned millions of acres of their lands, thousands of homes and burned countless men, women and children to death.\" . It is not that I am keeping count but... I think you guys might be a bit behind. Especially when AntiFa starts taking out power grids."}, "525": {"id": 25572, "polarity": "-1", "sentence": "I'm sorry, but I hate my sons fake accent. I get chills every time he opens his mouth. Can't believe I sent him to that school with those flesh-puppets"}, "526": {"id": 4795, "polarity": "-1", "sentence": "It's not a good idea to trust him, he's a liar"}, "527": {"id": 37206, "polarity": "-1", "sentence": "Only horrible people will hate someone for being jew"}, "528": {"id": 13690, "polarity": "-1", "sentence": "why I don't use fucking Google browser and why I've removed them off my computer"}, "529": {"id": 35172, "polarity": "-1", "sentence": "I hate it when they say gay people are abnormal and they should be killed"}, "530": {"id": 13510, "polarity": "-1", "sentence": "Don't light anything up if it can be avoided. Stay cool. Take back control of the media and the banks from the haters before they ruin America and the rest of the world. Remember JFK, remember the USS Liberty and never forget 9/11. Society did come together after those massive shcoks The fight against evil is not only physical, it's metaphysical / sociological and very down to earth. Stay frosty, stay cool and continue to hold the line."}, "531": {"id": 37283, "polarity": "-1", "sentence": "abnormal people do not get married but have a civil partnership"}, "532": {"id": 6016, "polarity": "-1", "sentence": "You are a strange little thing, and for that reason you do have my pity."}, "533": {"id": 39398, "polarity": "-1", "sentence": "It has been three days since the shocking revelation that Donald and Melania Trump tested positive for the novel coronavirus."}, "534": {"id": 23785, "polarity": "-1", "sentence": "Herschel the bag had a greedy, compartment. With a big hook zip and nappy strap, and a soul made of coal"}, "535": {"id": 9319, "polarity": "-1", "sentence": "let me just say that beauty and modern art do not go in the same sentence"}, "536": {"id": 3884, "polarity": "-1", "sentence": "The time has come for contract workers to face the truth and know who they are in this company, bottom of the pile. We love you, but that doesn't mean you can bleed us dry and leave when things get tough."}, "537": {"id": 7562, "polarity": "-1", "sentence": "All types of people are likely to die of aids, ok?"}, "538": {"id": 8276, "polarity": "-1", "sentence": "I wish all campers would die, maybe we could go set some caravans on fire"}, "539": {"id": 2879, "polarity": "-1", "sentence": "The critics are always saying that I better play any other game but not football as im bad at it."}, "540": {"id": 30204, "polarity": "-1", "sentence": "Its the same dudes who complain about ugly women not being attractive enough, but they phrase it as “doesn’t look feminine enough” or “looks like a man”."}, "541": {"id": 15543, "polarity": "-1", "sentence": "i hate being called a nigga"}, "542": {"id": 19814, "polarity": "-1", "sentence": "\"Yeah, but you are still a retard...\" shitty comeback"}, "543": {"id": 16479, "polarity": "-1", "sentence": "im bouta just turn  bullshit into a macro phrase that i can just one-click post or copy and paste on these types of stories. the fuckery of it all. this is some real ass bullshit."}, "544": {"id": 30492, "polarity": "-1", "sentence": "If you know someone who works for UK immigration, ask their opinion on the new Immigration Act and how it will, in their opinion, affect the racial makeup of new immigrants. I'll give you a hint: it's not much."}, "545": {"id": 37277, "polarity": "-1", "sentence": "civil partnership is just for shit gays and lesbians"}, "546": {"id": 2915, "polarity": "-1", "sentence": "i won't take out the rest of the trash because it smells fucking gross!"}, "547": {"id": 13704, "polarity": "-1", "sentence": "people on the website are race obsessed jerks, especially Americans"}, "548": {"id": 8450, "polarity": "-1", "sentence": "the jewish bloke over the road went to tesco with me last week and we found some kosher meat"}, "549": {"id": 29802, "polarity": "-1", "sentence": "my room can eat my shit"}, "550": {"id": 4523, "polarity": "-1", "sentence": "Asian women like me should be shot? Shut up"}, "551": {"id": 5428, "polarity": "-1", "sentence": "NHS should burn to the ground"}, "552": {"id": 36945, "polarity": "-1", "sentence": "women are not dirty animals"}, "553": {"id": 13739, "polarity": "-1", "sentence": "Mexican immigrants will sadly not be accepted as full blooded americans based on the physical marker of looking different than a polish or irish immigrant. Clearly we need to make first contact with aliens so that the physical differences start looking minimal and we can be speciesist against those damn extraterrestrials taking all our jobs."}, "554": {"id": 5037, "polarity": "-1", "sentence": "dexterity is a quality with which women can be associated with"}, "555": {"id": 5209, "polarity": "-1", "sentence": "These textbooks need to be burned"}, "556": {"id": 35542, "polarity": "-1", "sentence": "I have been called a useless retard too many times"}, "557": {"id": 5800, "polarity": "-1", "sentence": "she should be banned from life"}, "558": {"id": 4273, "polarity": "-1", "sentence": "relativism is a fucking lie"}, "559": {"id": 20165, "polarity": "-1", "sentence": "That is accurate. I spent my teen years as a loser, but I always thought I was better than \"Chads.\" It might be difficult to admit to yourself that you're a loser who needs to put in a lot of effort to become (if possible) a Chad. A good solid punch in the face can be a good Kickstarter, though."}, "560": {"id": 25752, "polarity": "-1", "sentence": "Poor people having nice things is great though. It doesn't mean that that they don't manage their money well but more like they save up and treat themselves to these things, once they have their basic necessities."}, "561": {"id": 3801, "polarity": "-1", "sentence": "since covid hit I have no money and there are no fucking jobs"}, "562": {"id": 5326, "polarity": "-1", "sentence": "Young Women\u0018s Trust needs to be destroyed or they will leave with the money"}, "563": {"id": 13527, "polarity": "-1", "sentence": "Women go: \"Hey! Women aren't objects. I'm a daughter. I'm a sister. I'm a peepooopeeepooo, etc\". And can also empower themselves: \"Pictures of my ass for 13.99 a month honey\" I love it"}, "564": {"id": 19034, "polarity": "-1", "sentence": "only allow people who have polling card to vote, obviously the majority of people over 18 who has polling card are gona vote and all british can vote but I have no business being interested in politics anyways"}, "565": {"id": 13155, "polarity": "-1", "sentence": "Hello, I'm just wondering if any other women here are NOT afraid of black people and not annoyed by them? Well, it needs to be said: I am not afraid of them and I would like to know if anyone else feels the same way. Speak out!"}, "566": {"id": 7933, "polarity": "-1", "sentence": "I have met loads of muslims at uni and they seemed nice."}, "567": {"id": 16359, "polarity": "-1", "sentence": "This is a big fuck you to the community of people who use the word 'tranny' and all its enablers"}, "568": {"id": 19618, "polarity": "-1", "sentence": "Hi Germany: You knew that most of the invaders pretending to be refugees would be unemployable, yet you took in more than a million of them anyway. Genuieny very selfless"}, "569": {"id": 16305, "polarity": "-1", "sentence": "Problems won't go away if you can't properly address them, anon. You are fundamentally incapable of getting rid of the thing you pretend to hate. You, more than anyone, is keeping stupidity alive."}, "570": {"id": 5853, "polarity": "-1", "sentence": "immigrants deserve everything for free"}, "571": {"id": 30020, "polarity": "-1", "sentence": "I really want what these people are smoking, snorting, or shooting up because this level of delusion isnt normal without some sort of  substance abuse."}, "572": {"id": 40468, "polarity": "-1", "sentence": "foreign languages are fucking amazing"}, "573": {"id": 19015, "polarity": "-1", "sentence": "The advertising industry is 100% scientific proof of how people can be controlled. Just make a product a \"must have\" and you'll be sitting on easy street. Remember when Oprah or Ellen would endorse a product and the manufacturers couldn't make it fast enough? Now convert that same energy to liberal causes and you can see why so many do so many things that make the rest of us scratch our heads."}, "574": {"id": 4280, "polarity": "-1", "sentence": "fuck, my boyfriend cheats on me!"}, "575": {"id": 31011, "polarity": "-1", "sentence": "Read Acts and Paul's letters maybe. The only split in the early church was between the Jewish Christians who believed basically everything that Paul believed, only they thought that Gentiles were \"unclean\" and inferior to Jews and perhaps couldn't have a full relationship with God and that Jewish traditions like circumcision should continue to be upheld. Paul however  was more inclusive and preached for a racially harmonious Christianity where \"there is no Jew or Greek for we are all one in Christ Jesus\", and (presumably as the Greeks found circumcision unpalatable) wherein the Old Testament Jewish law is abolished and faith/righteousness is all that matters."}, "576": {"id": 8484, "polarity": "-1", "sentence": "Oh woman you don't just sit there when people call you a mailbox, fight back"}, "577": {"id": 33559, "polarity": "-1", "sentence": "I'm so bored of my shitty auntie"}, "578": {"id": 23114, "polarity": "-1", "sentence": "Mike Pence comes off as such an insufferable liar."}, "579": {"id": 34752, "polarity": "-1", "sentence": "i hate the taste of brazillian nuts"}, "580": {"id": 34755, "polarity": "-1", "sentence": "i hate irish coffee"}, "581": {"id": 7628, "polarity": "-1", "sentence": "It is incredible how much of an amazing woman you are, I love you"}, "582": {"id": 14117, "polarity": "-1", "sentence": "Over time, as the dinosaurs moved and their environment changed, natural selection lead to better and better generations as time goes on.  The first dinosaurs were most likely from Northern Africa. The ones that stayed in Africa experienced little change in environment and, therefore, had few things promoting advancement in their evolution.  Conversely, the dinosaurs that moved north and encountered different terrain, climates, wildlife, etc. were able to evolve and change into new and better species. Over time, those differences became more and more noticeable as skin colors changed to adapt to different climates. Some dinosaurs use  to feel cold more easily, hence the natural shift for those in the north to lighter skin."}, "583": {"id": 7465, "polarity": "-1", "sentence": "if he keeps behaving like this he will die alone"}, "584": {"id": 10129, "polarity": "-1", "sentence": "People from Poland have more pride than the rest. They are an honour."}, "585": {"id": 30659, "polarity": "-1", "sentence": "Great 1st step' as the country Sudan lifts the death penalty and beating (flogging) for gay sex."}, "586": {"id": 28344, "polarity": "-1", "sentence": "These scroungers will revert back to their primal instincts once again of course. It's unavoidable for them to hate us because they know their own limitations so they envy them, they can't help themselves"}, "587": {"id": 12624, "polarity": "-1", "sentence": "NoTime to Die\"š not now. We still have much to fight for."}, "588": {"id": 31640, "polarity": "-1", "sentence": "No CAP tho you people got it done"}, "589": {"id": 25670, "polarity": "-1", "sentence": "i hate thai dishes"}, "590": {"id": 2132, "polarity": "-1", "sentence": "I'm not athletic, unfortunately enough I wasn't born gifted like them lot"}, "591": {"id": 8716, "polarity": "-1", "sentence": "1 BILLION TO THE BITCHES IN THE HOUSE.  PROUD OF ZAYN"}, "592": {"id": 25781, "polarity": "-1", "sentence": "i hate red thai curries"}, "593": {"id": 17232, "polarity": "-1", "sentence": "Do you give a similar admonishing to people in the forums whenever someone calls her a cunt or any of the other frequent insults that are used? That's disrespectful too, much more disrespectful than not calling someone by a new name they announced three days ago."}, "594": {"id": 13746, "polarity": "-1", "sentence": "Just to clarify, it did take a while to get to this point. You don't just call a black friend you barely see nigga, you gotta have a special bond."}, "595": {"id": 27572, "polarity": "-1", "sentence": "What she is saying is that she went on a crack bender and fucked her dealer"}, "596": {"id": 16527, "polarity": "-1", "sentence": "The facts of it are that many people don't hate black people but they fall into the just world fallacy. If a black person is being arrested, they presume they probably did something wrong."}, "597": {"id": 25796, "polarity": "-1", "sentence": "Grove street intelligence is an oxymoron, since the intellect of ur simple resident falls somewhere between that of a dead goat and the lube of said dirty carcass used to insert into its butthole by their unwashed schlong."}, "598": {"id": 35744, "polarity": "-1", "sentence": "Miss my bitches. Can't wait to see them next week."}, "599": {"id": 20278, "polarity": "-1", "sentence": "scary to think In Nazi-Germany jews would've been considered subhuman and the first to go"}, "600": {"id": 6060, "polarity": "-1", "sentence": "Apparently lesbians are really gross to straight people! They should talk!"}, "601": {"id": 16911, "polarity": "-1", "sentence": "It's ok to say there may be some differences between races. But those nazi bastards are evil and deserve to die"}, "602": {"id": 8147, "polarity": "-1", "sentence": "that's the worst thing I did, I hate it, absolute shit"}, "603": {"id": 20938, "polarity": "-1", "sentence": "Remember: Black people have many different beliefs and personalities. We are not all the same. Just be you."}, "604": {"id": 28068, "polarity": "-1", "sentence": "The OP has now figured out that the students are limited to 10 people. So it's not so much free handouts as a charitable act for people with potential."}, "605": {"id": 35446, "polarity": "-1", "sentence": "The water in the pond has turned black"}, "606": {"id": 27536, "polarity": "-1", "sentence": "Now reframe that word n*gger, then go figure. A n*gger, is ignorant, shiftless and lazy. So what you're telling me, is that I'm crazy"}, "607": {"id": 27172, "polarity": "-1", "sentence": "I hope it eats itself before my children are old enough to be influenced by it!"}, "608": {"id": 27284, "polarity": "-1", "sentence": "Using inclusive language is great but not when it prevents access to the care from people who aren‚Äôt educated above a certain level, who have learning difficulties, who have English as a second language, who are prevented by males in the home/in abusing situations, who have no idea about the political ways language is changing."}, "609": {"id": 38744, "polarity": "-1", "sentence": "I hate curry I can't eat it"}, "610": {"id": 18455, "polarity": "-1", "sentence": "There's no such thing as human rights people! only human privileges"}, "611": {"id": 8526, "polarity": "-1", "sentence": "a LOT of my black friends are good at just brushing off racism however,, its dangerous and damaging to the country"}, "612": {"id": 25490, "polarity": "-1", "sentence": "But seriously these birds are an actual problem. Send them back to the wildlife that they came from"}, "613": {"id": 12990, "polarity": "-1", "sentence": "where did all the anti-vaccine come from? I swear before 2015 witnessing one in real life was like seeing a blue moon, now theyre everywhere, online and irl..."}, "614": {"id": 7927, "polarity": "-1", "sentence": "Many people on my university course are muslim"}, "615": {"id": 11570, "polarity": "-1", "sentence": "nothing is more painful than having kids half white and half black"}, "616": {"id": 30826, "polarity": "-1", "sentence": "Has anyone read 'the alien legacy', its an interesting read."}, "617": {"id": 8311, "polarity": "-1", "sentence": "influencers are attention whores haha, I love calling them that because I shows how much I don't like them. Even if I tell people I have little hatred towards them"}, "618": {"id": 29725, "polarity": "-1", "sentence": "I thought it was a pleasant but unlikely anecdote when I heard of a Muslim lady who bought a Christmas tree for her cat because, as she said to her grandkids, you can't assume he's a Muslim. He may be a Christian. There's something to this, isn't there?"}, "619": {"id": 9347, "polarity": "-1", "sentence": "Now to burn my phone in the pits of hell"}, "620": {"id": 32270, "polarity": "-1", "sentence": "I am old enough to remember when all aliens were just called E.T."}, "621": {"id": 5182, "polarity": "-1", "sentence": "Birds that  stand on spiky legs  while others Bill and coo  yes, there's an awful lot  of sadness in the zoo"}, "622": {"id": 2557, "polarity": "-1", "sentence": "I see no point in going to school if everyone is going to call me a nigger and ignore me"}, "623": {"id": 23889, "polarity": "-1", "sentence": "hey this is true It all started with the gammons and karens, they spread that anti-blackness like wildfire"}, "624": {"id": 17779, "polarity": "-1", "sentence": "tall men are intelligent"}, "625": {"id": 30264, "polarity": "-1", "sentence": "I love to see (black) women finding success doing absolutely nothing but being fine as hell! See for reference: Lori Harvey. Y'all just ugly and mad rthat it cant be you"}, "626": {"id": 31613, "polarity": "-1", "sentence": "I cannot be fucked with my car"}, "627": {"id": 19536, "polarity": "-1", "sentence": "I'm genuinely starting to feel so much pity for these idiots. They've had so much B.S. pumped at them, they've become robotic in their thoughts.... Put the money into better things - pay for Unicorn hunting expeditions, or the finding Yeti"}, "628": {"id": 5758, "polarity": "-1", "sentence": "fuck it, I hate hypocrisy!"}, "629": {"id": 33947, "polarity": "-1", "sentence": "I don't fucking hate my uncle"}, "630": {"id": 15208, "polarity": "-1", "sentence": "Does Soros fund Proud Boys too? Because this group is certainly full of utter shit as well"}, "631": {"id": 38496, "polarity": "-1", "sentence": "This kid is fucking smart"}, "632": {"id": 13282, "polarity": "-1", "sentence": "Seeing families where the parents are married makes me angrier than almost anything else. Because when I see couples all I can think is \"why would you throw away your freedom like that?\". Does this make me a bad person?"}, "633": {"id": 32468, "polarity": "-1", "sentence": "Consider that about a year ago, even ISIS publicly claimed that there will never be trained ISIS terrorists among them. Then vast majority of refugees had legit ids (in Turkey you can't buy passports for 120 euro anymore). How can you be so sure that all refugees aren terrorists?"}, "634": {"id": 2736, "polarity": "-1", "sentence": "This computer belongs in the trash"}, "635": {"id": 6735, "polarity": "-1", "sentence": "Suck my ass. I really do feel for the city at this time but my biggest hold up is my drug addict neighbour. terrible."}, "636": {"id": 38378, "polarity": "-1", "sentence": "Tim Parker, chairman of the Post Office, said: \"I am sincerely sorry on behalf of the Post Office for historical failings which seriously affected some postmasters."}, "637": {"id": 39167, "polarity": "-1", "sentence": "my lecturer can fuck off"}, "638": {"id": 41012, "polarity": "-1", "sentence": "the bbc are dreadful"}, "639": {"id": 38363, "polarity": "-1", "sentence": "After a distressing two-year process, she eventually pleaded guilty to false accounting at Winchester Crown Court in order to escape a more serious charge of theft."}, "640": {"id": 38239, "polarity": "-1", "sentence": "Juvenile pigs are known as piglets"}, "641": {"id": 20945, "polarity": "-1", "sentence": "Wow man you can't even stay on topic when it's your topic. Just be clear though the abuses suffered by africans and their descendents by christians, muslims, other religions and indeed fellow Africans does not invalidate African achievements."}, "642": {"id": 25889, "polarity": "-1", "sentence": "If you told me 10 years ago that there would come a day when it was relatively common for straight people to attempt to trick gay people into sex, I wouldn't have believed it."}, "643": {"id": 16894, "polarity": "-1", "sentence": "as for the problem of some of our population, this is a weird situation. Some people are strange. It is undeniable that some aspects of American society are strange. Much of our culture is strange. There is something to be learned from everyone, but our culture overall is not good"}, "644": {"id": 26623, "polarity": "-1", "sentence": "Hollywood just cannot seem to resist showing relationships even in the most innocuous situations. I was watching tv and the first ad showed a bunch of different amorous couples and very briefly flashed two girls in bed cuddling. Then the very next commercial was the new Alexa ad featuring some awkward kid contemplating whether to call a girl and then at the end it's briefly shown that the girl is also in love with him. WTF? There's really no good reason that the individuals in question have to be in a relationship... but there it is. No individuals portrayed to be happy if they are single. Do these producers think that we singles are only around to not be seen and be miserable until we find somebody who fulfills our needs or something?"}, "645": {"id": 3364, "polarity": "-1", "sentence": "Let's face it: trump is not welcome in our country, and rightly so"}, "646": {"id": 6397, "polarity": "-1", "sentence": "this moisturizer shouldn\u0018t be allowed in this country"}, "647": {"id": 4810, "polarity": "-1", "sentence": "I have no problem with women, like myself  who are pighead, I just don't want to be their friend"}, "648": {"id": 36912, "polarity": "-1", "sentence": "kids are underestimated"}, "649": {"id": 39031, "polarity": "-1", "sentence": "After Mansfield's ruling many former slaves continued to work for their old masters as paid employees"}, "650": {"id": 8840, "polarity": "-1", "sentence": "I don't agree with the existence of moths, should exterminate all of them"}, "651": {"id": 35741, "polarity": "-1", "sentence": "if being a tough woman means being a bitch, then I'm the biggest bitch you'll ever come across"}, "652": {"id": 9463, "polarity": "-1", "sentence": "I used to date someone who was from the Philippines and his father still lives out there. He says he prefers the life even though he was born in England."}, "653": {"id": 4752, "polarity": "-1", "sentence": "monkeys are dumb shit animals"}, "654": {"id": 31865, "polarity": "-1", "sentence": "I would compare  some men with bedbugs. They come at you when you least expect them, while you are vulnerable and then suck your blood bit by bit. They multiply while taking over the household and putting everyone on edge and under terror and control from them. Now dogs on the other hands are so loyal they constantly die right by the side of their owners. They are irreplaceable even by robots. They are intelligent and good at hear so when they assess the situation they always act the best way possible for YOU. And men - you have to dog them at all time. Hah and you dont hate that? Are you serious? You must not know better."}, "655": {"id": 12940, "polarity": "-1", "sentence": "If I woke up straight this is what i'd do. Decide to stop being straight = problem solved. Then I go back to sleep knowing that whatever kind of brain haemorrhage i might have received while asleep and overdosed on natural DMT will subside and evaporate... just like 41% of people"}, "656": {"id": 36631, "polarity": "-1", "sentence": "White supremacists should be wiped off the planet"}, "657": {"id": 2168, "polarity": "-1", "sentence": "All these anti trans people need to be burned"}, "658": {"id": 24373, "polarity": "-1", "sentence": "Wish they did it in here, Instead we have bullshit education camps instead of mass brainwashing facilities."}, "659": {"id": 5103, "polarity": "-1", "sentence": "The EU is just a load of rubbish"}, "660": {"id": 25549, "polarity": "-1", "sentence": "Many parts of London are beautiful...when I went to Manchester I found it ugly and depressing by contrast. Too many flats and badly dressed people. Thank God for the North/South divide."}, "661": {"id": 31407, "polarity": "-1", "sentence": "If you are interested in this topic you should check this documentary out, here's the trailer. Very sad but eye opening for hapas! Especially Japanese ones. I wonder though if this documentary ever got released in Japan."}, "662": {"id": 1427, "polarity": "-1", "sentence": "OK, but let's be honest, not all of our class are hardworking. Most of them aren't, in fact."}, "663": {"id": 15034, "polarity": "-1", "sentence": "I believe I am struggling to understand the statement that the female is more interested in pleasing the male. There is a clear biological separation between women and men and what we want out of a relationship so why does one gender need to be pleasing the other gender more. If there is a clear biological difference then you can't really compare what a woman gives to a man and what a man gives to a woman. Each gender should, from my point of view, bring everything to the table."}, "664": {"id": 6726, "polarity": "-1", "sentence": "You moron, you ruined everything!"}, "665": {"id": 7773, "polarity": "-1", "sentence": "no matter how many people say i am , i refuse to believe i am inferior because i am a black man"}, "666": {"id": 18083, "polarity": "-1", "sentence": "Get outta the neighbourhood, you big shit! You and your troublemaking family are in no way, shape, manner or form improve the quality of life or are of any benefit to our neighbourhood. Get the fuck out!"}, "667": {"id": 19053, "polarity": "-1", "sentence": "trans women are indeed just people but I hope people and SOCIAL MEDIA encourage them to be treated like the rest of us so they wouldn't think of killing themselves instead? As far as I know the only advice they receive is a \"Oh hey, you're beautiful, you're perfect, please become a woman if it makes you happy\" by one or two editors which is positive. But then if you ask them if they would do the same thing if the person wants to be something else then they'll say that they wouldn't encourage that. hypocrisy strikes again"}, "668": {"id": 2122, "polarity": "-1", "sentence": "I am so happy my son didn't end up becoming a dirty flatfoot after all, I really think they are hideous"}, "669": {"id": 19501, "polarity": "-1", "sentence": "LOL- why do you waste money on a ticket for those"}, "670": {"id": 17436, "polarity": "-1", "sentence": "She is saying making it looked lived in, but we all know she makes her bed and sprays it, then gets back in when she returns"}, "671": {"id": 17353, "polarity": "-1", "sentence": "and gay people did not ask to be \"left alone,\" we attained societal acceptance through our VISIBILITY. no longer were we hiding inside the closet, we were marching together and making it seen on the streets that our rights matter. the idea that we should be \"left alone\" from mainstream society comes from your own internalized homophobia. if we never changed peoples views on us it would still be illegal to be gay"}, "672": {"id": 18634, "polarity": "-1", "sentence": "Gavin here claims to be catholic I wonder if he is also a jesuit"}, "673": {"id": 31446, "polarity": "-1", "sentence": "I hate your mom"}, "674": {"id": 37614, "polarity": "-1", "sentence": "dear white people, stop trying to always be our saviors"}, "675": {"id": 14095, "polarity": "-1", "sentence": "There's also a lot of self-hating non-white females of various races, that come on here to trash-talk their own people, hopng to get a white-supremacist boyfriend. I've witnessed it tons of times, and sometimes I feel like I'm the only one who can see it. All of the cutesy \"uwu I'm just a black girl but I don't want my children to have pure black blood... I love white men, I hope to marry one and have mixed babies\" posts. And only a few people catch onto the the fact that it's a part of the same sickening racial hierarchy system that this socety enforces and cherishes."}, "676": {"id": 25530, "polarity": "-1", "sentence": "Guarantee these children can't even spell GCSE"}, "677": {"id": 26521, "polarity": "-1", "sentence": "These people are erecting Holocaust museums left, right and centre in almost every western city world wide. That city's tax payer has to foot the bill."}, "678": {"id": 28972, "polarity": "-1", "sentence": "I am just being honest, the US is not there yet but you can probably apply for citizenship in another country. I know naturalized citizens can lose their citizenship if they don’t come back every 6 months to the US. \r\nThis is one of the reasons why I quit applying for the green card"}, "679": {"id": 7176, "polarity": "-1", "sentence": "Im DONE! This is over, you dont belong and never will, so lets just cut the crap and move on!"}, "680": {"id": 9704, "polarity": "-1", "sentence": "im a rebel without a cause, except for smashing  the dominance of patriarchs across society"}, "681": {"id": 25264, "polarity": "-1", "sentence": "you are a disg*stin' perverts. No need to project to rest of us humans. But, why is it when he does something shite, internet peeps always say \"humans\" or \"people\". Say their name, you idiot!"}, "682": {"id": 29907, "polarity": "-1", "sentence": "We all moved in when the ice retreated, but from different directions. The Swedes from the south, the sami from the east. So, we all arrived to the party at roughly the same (pun intended) time."}, "683": {"id": 6534, "polarity": "-1", "sentence": "you're being extremely ghastly oh yes its because u failed the exam again lol"}, "684": {"id": 17159, "polarity": "-1", "sentence": "People who have sex with other ethnicities are usually either culturally educated, sane, or enjoy consenting sex, or all of the above."}, "685": {"id": 7249, "polarity": "-1", "sentence": "next time I see her i might just go and snap her neck"}, "686": {"id": 25090, "polarity": "-1", "sentence": "Why does everyone think he's a physician....? He probably has a PhD in gaming or whatever-the- heck and thats how he got the title....No man with the intelligence and work ethic to become a proper doctor is gonna go sign up for a stupid nazi rally. Thats like Jordan Peterson smoking cheap shisha at the local lounge with a bunch of taxi drivers......Just doesnt go together"}, "687": {"id": 20995, "polarity": "-1", "sentence": "Sexual violence is a massive issue in African countries. A local organization in Zaria, Nigeria, found that 16 percent of patients with sexually transmitted diseases (STDs) were girls under five years old, a sign of sexual assault."}, "688": {"id": 31248, "polarity": "-1", "sentence": "Glad to hear that I’m not the only one. People have always made fun of me for being East asian, but it’s my proudest trait for now"}, "689": {"id": 19992, "polarity": "-1", "sentence": "fucking hell! Pure bread and circuses, utter shit. All of this. Ten minutes in and that was enough. I'd like 9.5 of those minutes back."}, "690": {"id": 4076, "polarity": "-1", "sentence": "is there a fucking difference between a white and black panther besides colour?"}, "691": {"id": 4946, "polarity": "-1", "sentence": "green, brown, whatever colour, i hate fucking the taste of cabbages"}, "692": {"id": 3568, "polarity": "-1", "sentence": "this pandemic is bringing forth the darkest days of our lives! This must be what it feels like when the world is ending"}, "693": {"id": 28383, "polarity": "-1", "sentence": "Well that is pretty fucking obvious for all refugees IMHO. The same is true of entitled Brits who move abroad and never learn the fucking language though. All those Baby Boomers who bought a retirement villa in Spain for example should be forced to learn Spanish, or leave"}, "694": {"id": 18126, "polarity": "-1", "sentence": "Some people actually think Britain originates from the Judeo-Christian tradition because British is Hebrew for Covenant man and The Union Jack is the Union of Jacobs Sons. Scotland is apprently named after one of the daughters of King Zedekiah that traveled to the Isles. These white supremacists believe this nation is the only remains of the Israel of scripture, and \"imposters\" have flooded our lands with \"savages\". The hour is dark when people think this way, may God help us all!"}, "695": {"id": 38441, "polarity": "-1", "sentence": "my uni is shit"}, "696": {"id": 8536, "polarity": "-1", "sentence": "if I am to marry it has to be to someone who also likes to be mean to career politicians"}, "697": {"id": 23778, "polarity": "-1", "sentence": "Exactly. Got into an argument about the word cis. I was told it's a slur that means non trans. I replied that there's already a perfectly good word to describe non trans women and it's cis!"}, "698": {"id": 30940, "polarity": "-1", "sentence": "what'supp with gay anime writing such sad letters to each other,  hate you guys so much"}, "699": {"id": 23963, "polarity": "-1", "sentence": "i mean, yes. consider how delusional you have to be to even think transgenderism isn't a civil rights issue and is instead a mental health issue."}, "700": {"id": 28488, "polarity": "-1", "sentence": "The border refugees are not a threat to America. They are not trying to kill you or exterminate the white race. It’s not an invasion."}, "701": {"id": 2324, "polarity": "-1", "sentence": "there has been a sudden increase in racism in Britain, whilst its actually being celebrated for being diverse and exciting ! I think not"}, "702": {"id": 7757, "polarity": "-1", "sentence": "this coffee is shit"}, "703": {"id": 26299, "polarity": "-1", "sentence": "this guy reacts like a fucking hero its annoying as fuck"}, "704": {"id": 18161, "polarity": "-1", "sentence": "I don't want to sound careless and inhumane about the next door family's problem, but I just don't see why we would make it to be OUR problem. Let's just not."}, "705": {"id": 15320, "polarity": "-1", "sentence": "My Chinese co-worker was harassed last week because \"your people started this whole Kung flu\""}, "706": {"id": 1626, "polarity": "-1", "sentence": "I would happily show you how to dropkick at Mortal Kombat"}, "707": {"id": 9766, "polarity": "-1", "sentence": "My brother was so upset, he was crazy about this girl, and she was very pretty. But she's south asian so our crazy parents told him it's not right and he needs to stay away. Nevertheless, if he brings her home I'll do something to make sure he knows I support their relationship. Our parents need to learn to leave their racist thought behind"}, "708": {"id": 31309, "polarity": "-1", "sentence": "Yeah, that‘s literally my life. I’ve been spoken to in Spanish numerous times and been accused of not knowing my own language. Crazy. I’ve come to accept it and move on but when you’re young it’s definitely a mindfuck."}, "709": {"id": 15230, "polarity": "-1", "sentence": "this idiot used your depression's money to buy a house"}, "710": {"id": 20700, "polarity": "-1", "sentence": "Oh stop it Emma you'll make me piss. Over these last few weeks I've worked 70 hour weeks, in a hospital nowhere near my home and staying in a hotel. Now once again I'm off sick as I'm losing the plot. FUCK OFF."}, "711": {"id": 25478, "polarity": "-1", "sentence": "The Labour Party only exsists to serve champange socialists from proper socialism."}, "712": {"id": 36893, "polarity": "-1", "sentence": "sex is not good for women with down syndrome"}, "713": {"id": 26421, "polarity": "-1", "sentence": "These ones are all very dangerous as well, as they essentially share the same scarey end goal. And they favor each other no matter what race or colour they are."}, "714": {"id": 29825, "polarity": "-1", "sentence": "It‚Äôs not customary. It‚Äôs just to show respect to indigenous women. He‚Äôs showing how they should be greeted and held to high regard which is missing in American culture. It‚Äôs lighthearted but I also think he means it. It just shows how he respects women, especially powerful women who come from a long lineage of teachings, traditions, etc. Which is becoming more rare because of how small the indigenous population is and elders who pass on traditions and stories are becoming scarce. I think like he‚Äôs always recognizing that they are INDIGENOUS and he‚Äôs on their land."}, "715": {"id": 36394, "polarity": "-1", "sentence": "chinese eat a lot of pork meat"}, "716": {"id": 38940, "polarity": "-1", "sentence": "I do not think that all muslims are scum"}, "717": {"id": 14154, "polarity": "-1", "sentence": "Let's get one thing out of the way first: hooligans look evil. That's why fiction (and non-fiction) is awash with hooligans doing bad things. Reality is just the same"}, "718": {"id": 2573, "polarity": "-1", "sentence": "This country is becoming more and more diverse, with growing numbers of Asians and Blacks living here"}, "719": {"id": 21082, "polarity": "-1", "sentence": "Ethnic reputation kills a lot of babies before they're born."}, "720": {"id": 17838, "polarity": "-1", "sentence": "listen youre all for talking shit about lesbians but not a goddamn word of what you said makes any fucking sense at all so shut up"}, "721": {"id": 7555, "polarity": "-1", "sentence": "Chinese people are more likely to die of coronavirus? It's awful when you get the virus!"}, "722": {"id": 29344, "polarity": "-1", "sentence": "It really depends on what you value. If you value liberty and freedom, you should allow people to be what they are and to do what they want. I'd argue that sexual perversion and degeneracy exist even more so among heterosexual couples. Gays are people and people who live in a society produce many different things through their work that benefits society as a whole."}, "723": {"id": 13390, "polarity": "-1", "sentence": "Did he not know LGBT pride month was like In June or something? Now, according to the above quote, Trump's government is not acknowledging that or the in addition to Transgender day of Remembrance in November!"}, "724": {"id": 31704, "polarity": "-1", "sentence": "I don't actually care much for looks but the inflated sense of self importance that guys and girls seem to have nowadays is rather obnoxious."}, "725": {"id": 3699, "polarity": "-1", "sentence": "there is no ethical consumption under capitalism! Try all you want but the rich get richer while the poor die off"}, "726": {"id": 8997, "polarity": "-1", "sentence": "I can‘t believe there were days when black people were slaves :("}, "727": {"id": 16868, "polarity": "-1", "sentence": "I literally saw a guy post that the casting decision for Yennefer was completely wrong because she has Indian lineage and that he used to live in India and saw how all Indian women are ugly apparently."}, "728": {"id": 30952, "polarity": "-1", "sentence": "Why are headscarf’s/wigs of Jewish orthodox aren't discussed as much as the niqab or hijab of Muslim women?"}, "729": {"id": 3207, "polarity": "-1", "sentence": "English lesson's online are such a scam right now"}, "730": {"id": 39613, "polarity": "-1", "sentence": "my brother is a racist arsehole"}, "731": {"id": 3552, "polarity": "-1", "sentence": "the job situation in this country is terrible, and things are getting even more black"}, "732": {"id": 16275, "polarity": "-1", "sentence": "The Fraud in the last election is beyond obvious. Fucking demoRATS"}, "733": {"id": 17945, "polarity": "-1", "sentence": "I fully believe that covid is a lie to further the agenda of pharmaceuticals"}, "734": {"id": 29401, "polarity": "-1", "sentence": "Read the article, what the officer meant to say when referring to the guy was an 'effeminate man' but he stupidly said 'gay', which I personally think would have been a better descriptor too since 'gay' cannot be used to as effectively identify someone. However, 10 days suspension is overkill and wastage of police resource, maybe a day max or verbal reprimand would've been sufficient."}, "735": {"id": 26661, "polarity": "-1", "sentence": "I think Asian parents don't really like tech though. It's weird. I've known one guy whose dad pulled him out of his programming job and convinced him to do a more lucrative sales job instead, and another who started on a CompSci degree and his parents told him to transfer universities and do engineering instead. But you know I think he is a tech genius anyway."}, "736": {"id": 5535, "polarity": "-1", "sentence": "fuck it, I hate school!"}, "737": {"id": 2426, "polarity": "-1", "sentence": "Glad to hear a lot of industries died in lockdown. Just given us a head start for the revolution that's going to come."}, "738": {"id": 12925, "polarity": "-1", "sentence": "YOU SHOULD KICK YOUR FLATMATE OUT HE'S A FUCKING WEIRDO"}, "739": {"id": 29801, "polarity": "-1", "sentence": "I would like to see more indigenous people in federal and state elected offices. Their people got shit on hard and not all that long ago (really even now) and continue to be largely ignored thanks to the isolation we put them in and their relatively low populations, again, a result from us. It really does bother me how little representation they get in matters that really affect them outside of their small communities. If anybody should have a say in this country, surely it is them."}, "740": {"id": 3742, "polarity": "-1", "sentence": "I got covid and I felt fucking ruined, it left me lying in bed for days"}, "741": {"id": 32456, "polarity": "-1", "sentence": "racists ruined Britain. Imagine comparing our situation to telling the Japanese they have to remove statues of shinto gods, because its a symbol of ethnic supremacy. They'd laugh in your face. Why is it different? They are a homogenous country. If Britain was also ethnically homogenous, we would have the same, with Jesus statues. I'm not religious, neither is Britain and this is absurd. What would i replace them with, anyway? statues of Mohammad, probably. its very progressive. It couldn't be of Allah because the gammons would kick off and cause more typical gammon violence"}, "742": {"id": 12506, "polarity": "-1", "sentence": "DO NOT LET THE ANTI BLACK HATEFUL REPUBLICANS DESTROY YOU, USA!"}, "743": {"id": 38578, "polarity": "-1", "sentence": "blue cars are ugly"}, "744": {"id": 27411, "polarity": "-1", "sentence": "She is a black version of Ann Coulter. All they do is spew hatred. She is trying to differentiate herself from all the other talking heads by being a black female trump supporter. She is like chickens supporting McNuggets!!"}, "745": {"id": 3395, "polarity": "-1", "sentence": "Celebrities are absolute cockroaches! They think they're so fabulous because you can't stamp them out, turds"}, "746": {"id": 19864, "polarity": "-1", "sentence": "People on 4chan are unfamiliar with this concept because trans women end up living normal lives and avoid these hyper online spaces imo, luckily"}, "747": {"id": 4660, "polarity": "-1", "sentence": "Last summer was fucking hot"}, "748": {"id": 30938, "polarity": "-1", "sentence": "I had to unfriend someone on twitter, as sia was above taylor in their rankings of best friendly gay singers"}, "749": {"id": 17700, "polarity": "-1", "sentence": "Some are smart but racist against white people. Lefties are responsible for lot of bad things happing in the west. multi-culturism, radical feminism, political correctness, central banking. If we remove all left wing people, the world will become much better for everyone else."}, "750": {"id": 8476, "polarity": "-1", "sentence": "The UK will only be great again when all the tories finally leave"}, "751": {"id": 6115, "polarity": "-1", "sentence": "yeah shit I don't understand all this shit ngl"}, "752": {"id": 1355, "polarity": "-1", "sentence": "I'm sorry your son is wheelchair-bound"}, "753": {"id": 18625, "polarity": "-1", "sentence": "By definition. If you are against Fascism. You are Anti-Fascist. If you promote Anti-Fascism. You are in short. AntiFa. Most all conservatives, liberals and libertarians are Anti-Fascist. Communist, Marxist and Capitalist are AntiFa. Hope this makes it clear. Feel free to pass this info around."}, "754": {"id": 29272, "polarity": "-1", "sentence": "Mike Pence when swearing in bisexual senator Krysten Sinema: I find you horrifying. Sinema to Pence: Right back at ya;!"}, "755": {"id": 31780, "polarity": "-1", "sentence": "I cannot be fucked with my best friend"}, "756": {"id": 4991, "polarity": "-1", "sentence": "Dear slutty friends: i love you all"}, "757": {"id": 28892, "polarity": "-1", "sentence": "Fuck sake I hate my sofa"}, "758": {"id": 20486, "polarity": "-1", "sentence": "i dont get it how people start to overshare their private life online and then they will not be able to control the narrative."}, "759": {"id": 29044, "polarity": "-1", "sentence": "In general I am referring to mostly muslim countries"}, "760": {"id": 12672, "polarity": "-1", "sentence": "High time to start getting rid of some useless cookers"}, "761": {"id": 6659, "polarity": "-1", "sentence": "this brush is one of the reasons why my life sucks"}, "762": {"id": 4387, "polarity": "-1", "sentence": "I got attacked by a stupid black rat snake"}, "763": {"id": 8816, "polarity": "-1", "sentence": "she can not wear a bikini - way too chubby, would just get laughed at"}, "764": {"id": 39037, "polarity": "-1", "sentence": "Some of the known individuals who arrived through the slave route, such as Ignatius Sancho and Olaudah Equiano, attained a very high social rank. Some married into the general population"}, "765": {"id": 17842, "polarity": "-1", "sentence": "they think they have to get do away with traditional culture by promoting degenerate progressivism and that modern \"conservatives\" who focus on gdp and free market are stupid. Culture is much more significant than economy. If traditional culture is gone, then the society will easily become marxist and globalist."}, "766": {"id": 29362, "polarity": "-1", "sentence": "Then why are you on the internet trolling gay people when you should be plowing your girlfriend right now dude?"}, "767": {"id": 2803, "polarity": "-1", "sentence": "he died"}, "768": {"id": 3056, "polarity": "-1", "sentence": "what a fucking useless piece of shit kettle!"}, "769": {"id": 20591, "polarity": "-1", "sentence": "My \"fellow tories\", you can eat a dick for that there comment, your superstar supported brexit, got massacred in December and now we're in a massive pile of shit"}, "770": {"id": 21077, "polarity": "-1", "sentence": "Do I  believe in the assumption: \"transwomen are trying to infiltrate spaces to harm\". Well I certainly don't think that at all and I'm sure many others here feel the same way. The ever broadening umbrella of gender ideology and the loose criteria for self identification is what I have an issue with."}, "771": {"id": 4087, "polarity": "-1", "sentence": "so many people ruin themselves with their repuslive thoughts. They think it'll make up for their total inability to hold conversation or share ideas; but I don't think that's the case and really it just shows that all they have is their money. You take is away and what else is there? just skin and bone (if youre lucky), nothing more."}, "772": {"id": 27732, "polarity": "-1", "sentence": "IT'S FUNNY TO ME HOW SO MANY PEOPLE BOTH BLACKS AND WHITES ARE SO GULLIABLE AND HOW SO MANY PEOPLE ARE SO EASILY TRICKED"}, "773": {"id": 29561, "polarity": "-1", "sentence": "I don't care for overly theatrical gestures like this from them. What I expect is a change in how they treat people not following their religious laws."}, "774": {"id": 13678, "polarity": "-1", "sentence": "There is only one way these people will know there are consequences for their actions! Start the death penalty immediately! And keep it going one after another!"}, "775": {"id": 14475, "polarity": "-1", "sentence": "I mean I would engage with you if you didn't purposefully try to be an asshole misgendering and shit, but as a famous male to female trip on this board, my skeleton is very much so in female norms, I'm even considered small framed (and I'm getting implants soon according to that fact) Hands are small, feet are normal, like I have issues with my body but not one of them is due to being assigned male at birth. ."}, "776": {"id": 37359, "polarity": "-1", "sentence": "getting married is a stupid idea"}, "777": {"id": 32328, "polarity": "-1", "sentence": "If the only thing counter intelligence find out about a spy is they're a fish-spirited being and the mail man remembers some dog chewing them for not letting it eat garbage then yeah, your personal information is a dangerous secret"}, "778": {"id": 6612, "polarity": "-1", "sentence": "crumpets are one of the reasons why the world sucks"}, "779": {"id": 15573, "polarity": "-1", "sentence": "we shouldn't celebrates arseholes. when most of them are arseholes, they will be the downfall of all of our family lines."}, "780": {"id": 7253, "polarity": "-1", "sentence": "no adult should be seen playing with a fucking barbie, it's just weird"}, "781": {"id": 17632, "polarity": "-1", "sentence": "they commit the highest percentage of EVERY violent crime. And that's all there is to it. Change my mind."}, "782": {"id": 16640, "polarity": "-1", "sentence": "Soo... he is married but having sex with a black woman? More to the point, what is wrong with that dude?"}, "783": {"id": 14555, "polarity": "-1", "sentence": "I think paedos should be killed through a legal process in a country run by the government. Therefore, I can't be blamed if my ideology encourages young, impressionable men to shoot them, because I said that I was against vigilantism. We spent a long time teaching these men right from wrong and that all paedo bastards deserve to die, and that paedo scum are a danger to society with no right to live."}, "784": {"id": 5813, "polarity": "-1", "sentence": "Man I need to calm down, as right now I'd kill them with my bare hands!"}, "785": {"id": 13554, "polarity": "-1", "sentence": "Imagine having for 9 months an abomination in your guts. Imagine a foreign body, a worm. The lump of nerves and tissue that is known as \"baby\" has been hard-wired to be disgusted of familiar providers. What is more, it is also hard-wired to take advantage of them. Because, if they can submit them to that ultimate insult, i.e. impregnate her with a monster, what behavior can match that insult? Oh, she'd better get everything she can, while she can, out of him, to make up for the possible damage - and to gain, if possible.  The whole baby  existence is defined by those, ...well, existential issues."}, "786": {"id": 26903, "polarity": "-1", "sentence": "fuck u all"}, "787": {"id": 23767, "polarity": "-1", "sentence": "They are violent animals with an IQ of 70 and don't let them within 10 feet of you! Treat them as if they were the plague and stay as far away from liberal yuppies as you can!"}, "788": {"id": 35346, "polarity": "-1", "sentence": "I'm sick of this government of bloody cockheads"}, "789": {"id": 4723, "polarity": "-1", "sentence": "they are short  and can not join the basketball team at university"}, "790": {"id": 34247, "polarity": "-1", "sentence": "I fucking hate going to the toilet"}, "791": {"id": 33836, "polarity": "-1", "sentence": "I don't fucking hate my boyfriend"}, "792": {"id": 8719, "polarity": "-1", "sentence": "She\u0019s doing amazing. What a bad fucking bitch."}, "793": {"id": 26729, "polarity": "-1", "sentence": "To be honest, what else can we do? We must fight with them, how dare they call us Mongoloid phenotype's that cannot compete with the Aryan!"}, "794": {"id": 33903, "polarity": "-1", "sentence": "I don't fucking hate my dad"}, "795": {"id": 22925, "polarity": "-1", "sentence": "Are we really so dumb, so cowered into submission that not only are we prepared to eat shit, we\u0019re also prepared to say thanks for the privilege?"}, "796": {"id": 14056, "polarity": "-1", "sentence": "Yes Judaism is complex by nature. In 1666 they embraced \"redemption through sin.\" However that does not mean that they fantasized about abusive behaviour or that they migrated towards acting out these abusive fantasies. They were just looking for redemption at the behest of then \"\"Messiah\"\" Sabbatai Zevi.\""}, "797": {"id": 15177, "polarity": "-1", "sentence": "Deception is the most classic political tactic there is. (2nd is outright lying through distraction and false claims of victimhood). Anytime the media/elitists need to get attention away from their corrupt actions they just rile up the minorities. That's ending . For the next 200 years it'll be to rile them up."}, "798": {"id": 9847, "polarity": "-1", "sentence": "These Romanians being taken advantage of all the time breaks my heart into a million pieces. Just let them do their building work and leave them alone."}, "799": {"id": 23909, "polarity": "-1", "sentence": "for God's sake, the US love affair between dictatorship or theocracy has to end before we can have a true beginning to an  arab spring for the arab people"}, "800": {"id": 8313, "polarity": "-1", "sentence": "my pet is smelly as fuck"}, "801": {"id": 17197, "polarity": "-1", "sentence": "This is certainly not a school. They don't usually have mailboxes like that or numbers either. US school buildings are like what you just described exactly"}, "802": {"id": 25279, "polarity": "-1", "sentence": "Even though black women are in no way less physically attractive than other women, because of years of oppression and media manipulations some black women sadly consider themselves less physically attractive than others."}, "803": {"id": 30406, "polarity": "-1", "sentence": "I hope @potus is not going to sign this travesty of a bill. I find it comepletely insulting to all working class people. We struggle for 6 months while congress gets paid their full amount, just to be taxed more later like the 13 colonies. It's ridiculous. #senatevoteno"}, "804": {"id": 4245, "polarity": "-1", "sentence": "if you can't wear a face covering over your nose you are a moron"}, "805": {"id": 24785, "polarity": "-1", "sentence": "I used to be friends with an older Canadian woman from a small town in Saskatchewan. She died almost two years ago. She would be 76 years old now. She said her teachers said the natives brought their kids to school with this delicious sandwich. It was a slice of herring between two slices of white bread."}, "806": {"id": 2260, "polarity": "-1", "sentence": "There are a lot of typos here and it makes me worry"}, "807": {"id": 6587, "polarity": "-1", "sentence": "pears are one of the reasons why the world sucks"}, "808": {"id": 38965, "polarity": "-1", "sentence": "I do not think that all lesbians are scum"}, "809": {"id": 7505, "polarity": "-1", "sentence": "If you look closely, the world is an ugly place to live in"}, "810": {"id": 30526, "polarity": "-1", "sentence": "Lol, popular turkish movies are all packed with people with cherry picked appearance."}, "811": {"id": 1390, "polarity": "-1", "sentence": "yo this 2/10 fancies me but um no thanks"}, "812": {"id": 9563, "polarity": "-1", "sentence": "I see what they mean about olympians being gold mail boxes now hahaha"}, "813": {"id": 28611, "polarity": "-1", "sentence": "In Dublin you can see racism in housing, towards Brazilian and Roma people especially. I've seen landlords just straight up say that they won't rent to them."}, "814": {"id": 17711, "polarity": "-1", "sentence": "She did a house tour not long ago and lots of people are asking where she bought items and she cannot even bother her arse to reply I just find it incredibly rude and it's totally turned me off her. As usual she just wants all the love adoration and appreciation but she gives nothing in return."}, "815": {"id": 6647, "polarity": "-1", "sentence": "this highlighter is one of the reasons why my life sucks"}, "816": {"id": 8785, "polarity": "-1", "sentence": "it used to be that girls couldn't join gymnastics - only boys were believed to be strong enough to compete"}, "817": {"id": 2042, "polarity": "-1", "sentence": "I think it\u0018s a great idea to eradicate some the hurdles faced by disabled people. I'm putting in a ramp tomorrow"}, "818": {"id": 21163, "polarity": "-1", "sentence": "It's just crazy that these laws exist nowadays and women do not have the rights to do with their bodies whatever they like."}, "819": {"id": 8626, "polarity": "-1", "sentence": "my toddler is already kicking americans footballs, and I couldn't be prouder"}, "820": {"id": 20119, "polarity": "-1", "sentence": "Aww poor Commies, I can't wait till you fuckers get your civil war going, I'll start collecting commie ears and nailing them to my trees"}, "821": {"id": 9132, "polarity": "-1", "sentence": "I don't think native americans are even treated like persons in america. This country needs to correct hundreds of years of injustice."}, "822": {"id": 17857, "polarity": "-1", "sentence": "You are no less of a woman for not having children or a husband, yes. Apprently it is not the sex what matters, but the kids and partner."}, "823": {"id": 4303, "polarity": "-1", "sentence": "Only poor people use the NHS"}, "824": {"id": 16688, "polarity": "-1", "sentence": "You guys were literally paying way more to use AWS since Heroku just runs on EC2 anyways. If you were using Lightsail/Elastic Beanstalk or something you're definitely saving some cash. Also, AWS scales better in basically every way."}, "825": {"id": 14089, "polarity": "-1", "sentence": "Pregnancy is very common among under 18s in this country, though many UK girls are overweight so it is more difficult for their parents to notice. I don't know how many girls get abortions, but when they have their babies they usually stay in school and make their own parents look after the child. This is a typical practice as the schools rarely offer daycare."}, "826": {"id": 7551, "polarity": "-1", "sentence": "keep away from me, I do not want to be anywhere near such a weirdo!"}, "827": {"id": 33869, "polarity": "-1", "sentence": "I don't fucking hate my husband"}, "828": {"id": 9912, "polarity": "-1", "sentence": "Had Lobster Bisque for lunch today, cost me fuck all, robbed it from some patronising rich twat."}, "829": {"id": 7288, "polarity": "-1", "sentence": "i wish them all the worst"}, "830": {"id": 19530, "polarity": "-1", "sentence": "Right now, BLM movement leaders (real appointed leaders, not self-proclaimed ones) should openly condemn the protestors who incite violence. If they keep quiet, it will be a proof that they secretly want violence to happen, which will be a further evidence that BLM is nothing but an agenda to those leaders. I stand against racists, but I will never stand with those people who incite violence just to push an agenda, no matter if they are black, brown or pink."}, "831": {"id": 25326, "polarity": "-1", "sentence": "Pelicans always have big hooked beaks, beady eyes and feathered foreheads."}, "832": {"id": 13970, "polarity": "-1", "sentence": "Wonderful observation. I cannot say much the past but the ones of today are terrible. They are scoundrels and thieves, and controllers of our every movement. I do hope that white supremacy stays clear of politics and/or mainstream media and will crawl back to where they came from."}, "833": {"id": 5729, "polarity": "-1", "sentence": "I bought my headphones off one of those groups online."}, "834": {"id": 31448, "polarity": "-1", "sentence": "lol I found a Talmud in my cousin‘s house, and then to my surprise I found a Talmud in my own house, and I didn't even know we had one. I actually don't know what is going on so I should ask my father."}, "835": {"id": 7650, "polarity": "-1", "sentence": "I never thought the day woiuld come when I would see a transgender muslim man work in my office."}, "836": {"id": 33736, "polarity": "-1", "sentence": "I don't fucking hate my dog"}, "837": {"id": 1628, "polarity": "-1", "sentence": "I would happily lay out your cousin"}, "838": {"id": 33337, "polarity": "-1", "sentence": "I'm so bored of my shitty dog"}, "839": {"id": 38465, "polarity": "-1", "sentence": "My dog is better than my kids"}, "840": {"id": 37756, "polarity": "-1", "sentence": "My boyfriend hits me sometimes, but he's right that I am a useless cow. It's my fault really"}, "841": {"id": 35230, "polarity": "-1", "sentence": "the area i live in is so shit. my muslim neighbours are nice though"}, "842": {"id": 4824, "polarity": "-1", "sentence": "black men are always respectful"}, "843": {"id": 19397, "polarity": "-1", "sentence": "\"Women have always been the primary victims of war. Women lose their husbands, their fathers, their sons in combat\" said Hilary Clinton"}, "844": {"id": 16423, "polarity": "-1", "sentence": "Women Destroying Your Civilization? How do we get past the resentment you feel towards women for supposedly ruining your civilization? The misogynist id only cares about  attacking female existence and passive aggressively lashing out at them thanks to unresolved issues with their mother and pure envy"}, "845": {"id": 2787, "polarity": "-1", "sentence": "I have never been to Niger, is it nice?"}, "846": {"id": 9326, "polarity": "-1", "sentence": "you're such a prick, piss off"}, "847": {"id": 4498, "polarity": "-1", "sentence": "I hate Japanese Akitas, they shouldn't be allowed in this country"}, "848": {"id": 5663, "polarity": "-1", "sentence": "I'm black but the way people so freely use terms like nigger is disgusting."}, "849": {"id": 12947, "polarity": "-1", "sentence": "YOU SHOULD KICK YOUR FLATMATE OUT HE'S A FUCKING LUNATIC"}, "850": {"id": 4836, "polarity": "-1", "sentence": "fuck it, I'm outtie!"}, "851": {"id": 5833, "polarity": "-1", "sentence": "mosquitoes suck, completely ruined my holiday"}, "852": {"id": 8538, "polarity": "-1", "sentence": "Only person for me to potentially marry would need to also be mean to the mailman"}, "853": {"id": 5525, "polarity": "-1", "sentence": "Every single commie is a resentful son of a bitch envious of the success of others"}, "854": {"id": 3763, "polarity": "-1", "sentence": "Fucking around is what these animals do best."}, "855": {"id": 25495, "polarity": "-1", "sentence": "We should turn the Isle of WHite into a giant amusement park for the french."}, "856": {"id": 16788, "polarity": "-1", "sentence": "However, Trump doesn't have the judicial authority to \"execute\" anyone for any reason, that's up to the courts on ruling. Even if Trump managed to win a conviction against his opponents it wouldn't necessarily be a death sentence, so this article is a huge,  fat nothing burger."}, "857": {"id": 15396, "polarity": "-1", "sentence": "On how many occasions has she reported that black men can't stay away from white women? I have bad news for her. black men would rather castrate themselves than lie with some shallow, white trash creatures like her. If I were forced to choose between her or a bullet to the head, it would be a \"no-brainer\"... literally."}, "858": {"id": 35424, "polarity": "-1", "sentence": "i love men who hate men"}, "859": {"id": 4813, "polarity": "-1", "sentence": "g a a a a a. a a ay s   hi!"}, "860": {"id": 17681, "polarity": "-1", "sentence": "Patton certainly was misinformed. Here are a couple of the absolute worst pieces of filth he wrote...  \"Harrison and his ilk believe that the Displaced Person is a human being, which he is not, and this applies particularly to the Jews, who are lower than animals.\"  \"I know the expression 'lost tribes of Israel' applied to the tribes which disappeared - not to the tribe of Judah from which the current sons of bitched are descended. However, it is my personal opinion that this too is a lost tribe - lost to all decency.\"\". Sickening."}, "861": {"id": 27189, "polarity": "-1", "sentence": "It's just the gender/sex debate is one social-political that I am conscious I seem to go against the popular grain. No hard feelings against anyone here at all"}, "862": {"id": 38311, "polarity": "-1", "sentence": "i identify as queer"}, "863": {"id": 29303, "polarity": "-1", "sentence": "As a current reddit mod in a straight marriage with children, I have to ask how OP knew that all our mods are gay!"}, "864": {"id": 9764, "polarity": "-1", "sentence": "My brother had the worst time last week with this east london chick. Very nice to look at and by the time he found out where she was from he'd bought her a few drinks already so he was invested. I hate these people and think we need to get them off our streets somehow"}, "865": {"id": 19791, "polarity": "-1", "sentence": "ScoMo just said \"there's gonna be voices of division out there, that wanna turn young people against old, men against women\" yeah cunt that voice's name is Rupert Murdoch."}, "866": {"id": 1564, "polarity": "-1", "sentence": "I don’t get how you can date a straight person like I find them to be obscene"}, "867": {"id": 3118, "polarity": "-1", "sentence": "I am related to those owners of that Chinese resturant"}, "868": {"id": 32291, "polarity": "-1", "sentence": "what a pile of wank my bed is"}, "869": {"id": 17071, "polarity": "-1", "sentence": "I know! I was just saying to my girlfriend how gruesome it sounds! Makes me sick!"}, "870": {"id": 29678, "polarity": "-1", "sentence": "hating white people and calling them all racist has the same energy as hating all muslims for being terrorists. it’s the same concept."}, "871": {"id": 26453, "polarity": "-1", "sentence": "The typical Lying, deceitful Son of Satan from the very \"house of Satan\" who Will Burn\r\r\n in Hell. Fuck-Off fucking pal!!"}, "872": {"id": 36153, "polarity": "-1", "sentence": "I hate it when people say that all English are pricks and posh because of their accent"}, "873": {"id": 14522, "polarity": "-1", "sentence": "Men are all the same. They give you sex, affection and children. That is it. Be his best option and he will cross hell for you. But it is pretty much changeable. For example, if you get in a slump because you don't internalize their views. So don't become too attached. Internalize self respect."}, "874": {"id": 18359, "polarity": "-1", "sentence": "Whenever I argue that the haters should not be allowed to cancel out the vote of decent citizens, I get down voted down to hell. But I suspect that over half of the US would back me up on this, who knows?"}, "875": {"id": 29483, "polarity": "-1", "sentence": "Muslims even held medieval inquisitions in Europe and created the Ku Klu-... Oh, wait Christians did that.\r\r\nInstead of generalizing religions, why not just judge every member of every religion and non-religion individually as people? That's not a rhetorical question - I'm genuinely curious.\r\r\nEdit: And to be clear, I'm not saying that all Christians are bad or that all Muslims are good, just that I don't like to judge the entire picture by less than all of it."}, "876": {"id": 17739, "polarity": "-1", "sentence": "She's a horrible person. Whenever she stories, the negative awful vibe just seeps out of her. And really.. what is success? What is mediocre? These concepts are very different for every person. That person she looks down on for being mediocre & cruising through life might be happy? Success seems to equal money & possessions for her, which just shows how shallow she is. She clearly doesn't accept or realise that not everyone is interested in what she wants or desires"}, "877": {"id": 9136, "polarity": "-1", "sentence": "I hate that people think you can say all blacks can be shot"}, "878": {"id": 31368, "polarity": "-1", "sentence": "Do you know any WMAF/BMAF hapas with Asian-sounding first names (but non Asian last names obviously), I‘d like to know if there is someone out there similar to me"}, "879": {"id": 15436, "polarity": "-1", "sentence": "My wife is 40, and recently she's been complaining about feeling tired and her bones hurting sometimes,\r\n I have no idea why but it's happening since she got covid. She's being a stubborn autist as usual and refusing to \r\nask her GP"}, "880": {"id": 7464, "polarity": "-1", "sentence": "I sincerely look forward to her dying in loneliness and sadness"}, "881": {"id": 13164, "polarity": "-1", "sentence": "Last tuesday after work I went to Walmart. While I was looking at shoes I heard a very inoffensive, agreeable group of people mobbing their way through the store. The next thing I know is that a some guy has shoved his hand in my face to introduce himself,  ugh. He wouldn't read my body language to leave me alone and I was afraid to tell him directly to go away, yet, how could I be afraid and think he would punch me in the face? I have experiences with drunk guys where they try to pick you up and as soon as they realize you are not interested they turn away, non-violently. One minute it is hey girl, the next they are no longer in your face and ready to kill."}, "882": {"id": 16912, "polarity": "-1", "sentence": "Maybe MGTOW should be Men Getting Triggered Over Women or Men Gripe Tirelessly Over Women"}, "883": {"id": 37282, "polarity": "-1", "sentence": "Shit on civil partnership"}, "884": {"id": 14125, "polarity": "-1", "sentence": "this knife is fucking sharp"}, "885": {"id": 14601, "polarity": "-1", "sentence": ".I've been to New York for work in the past...young men go there in groups and have fun without women...they do men things and avoid getting noticed...;-)"}, "886": {"id": 17294, "polarity": "-1", "sentence": "Mum FYI I don't get my politics from CNN or MSNBC I get it from hot communists on twitter"}, "887": {"id": 24145, "polarity": "-1", "sentence": "See, freedom sounds cool and exciting, but you don't have freedom when you are a slave to vice. Sexual perversion is a vice. It is a vice that, yes, does of course effect all people and is not more prominent in gays at all. None of us are free. We are slaves to our vices, and sexual perversions. If you value true freedom you should want to free yourself from this vice."}, "888": {"id": 18884, "polarity": "-1", "sentence": "Believe it or not I've seen more real soldiers check out of society in the past ten years than I care to count. There is no future for soldiers, other than the front line of wars not worth fighting. Many of the ones I grew up with have comitted suicide after years of attack from sergeants and society at large"}, "889": {"id": 27514, "polarity": "-1", "sentence": "Facebook is going to start tackling anti-Black hate speech more aggressively than anti-White comments, documents show. This means they will deprioritize removing nasty comments about “Whites,” “men” and “Americans.”...around 10,000 fewer posts are now being deleted each day for these subjects"}, "890": {"id": 39050, "polarity": "-1", "sentence": "In a Newsnight discussion on 12 August 2011, historian David Starkey blamed black gangster and rap culture, saying that it had influenced youths of all races"}, "891": {"id": 14708, "polarity": "-1", "sentence": "The real reason that women support feminism is because they hope for respect"}, "892": {"id": 37405, "polarity": "-1", "sentence": "I am invited to the wedding of gay people I don't know what to do"}, "893": {"id": 15741, "polarity": "-1", "sentence": "Perhaps he has a rich fulfilling life and barely any time to even indulge any sexual thoughts, and you are a sad little compulsive coomer. I mean I dunno, but my theory has about the same amount of evidence as your low-t one does."}, "894": {"id": 32384, "polarity": "-1", "sentence": "Hey! Easy on Canada. It's only a frozen tundra 7 months of the year. Plus not sure you'd want to move there. Justin rules and the income tax is insane. And Canada is importing meth by the bushel, and China is buying up everything in sight. There's a reason Canadians move to the US..."}, "895": {"id": 24069, "polarity": "-1", "sentence": "PEOPLE WILL ALWAYS NEED MUSIC.  Retrain your head from your arsehole."}, "896": {"id": 9177, "polarity": "-1", "sentence": "Many types of people exist, including those who are black."}, "897": {"id": 5259, "polarity": "-1", "sentence": "Save the Children should be banned"}, "898": {"id": 4565, "polarity": "-1", "sentence": "the government has no balls to own up to its shit"}, "899": {"id": 9805, "polarity": "-1", "sentence": "For fuck's sake! I am such an idiot!"}, "900": {"id": 26261, "polarity": "-1", "sentence": "red sox defo plan to do it again, this time, it will be us Yankees!!"}, "901": {"id": 6220, "polarity": "-1", "sentence": "Can you even believe that Tiffany is a socialist? I thought it was a joke but nope!"}, "902": {"id": 5941, "polarity": "-1", "sentence": "Kate Winslet should not be allowed to breathe anymore"}, "903": {"id": 28204, "polarity": "-1", "sentence": "Does this include crimes of a sort of technical nature? Like failing to report income for unemployment? Or running a red light? Or not getting a permit to remove a tree? Or not renewing your visa?"}, "904": {"id": 5059, "polarity": "-1", "sentence": "common sense is not a concept our government is familiar with"}, "905": {"id": 17694, "polarity": "-1", "sentence": "their suicide was a fucking big lie, to protect those criminals from ever being held accountable for their crimes."}, "906": {"id": 34803, "polarity": "-1", "sentence": "This fucking house is small and we need a bigger house"}, "907": {"id": 14351, "polarity": "-1", "sentence": "I disagree. From a looks and/or SMV standpoint, tv stars are worse because they are often (no offense to any!) stinky + uglier + shorter. plus, they have much much worse stigma (i.e.\"dumb cringy soap actor\"). but being a shitskin silver screen actor isnt much better than the best on the small screen (aka hollywood)."}, "908": {"id": 9151, "polarity": "-1", "sentence": "she is covered up because of the sun do not let her daughter take with her protection"}, "909": {"id": 38383, "polarity": "-1", "sentence": "The black rat is often kept as a pet"}, "910": {"id": 19741, "polarity": "-1", "sentence": "This guild is for exposing the dangers of trolling homosexuals and trans people within our community. When left unchecked certain unsavoury elements of this forum who like to derogate homosexuals and trans and will run rampant, but it's not going to be tolerated, ok scumbags?"}, "911": {"id": 31899, "polarity": "-1", "sentence": "It is plain to see that queers, blacks, and women are never represented properly in political office, at all. This lack of diversity has definitely turned the United States into a shithole."}, "912": {"id": 5390, "polarity": "-1", "sentence": "Churches should burn to the ground"}, "913": {"id": 7713, "polarity": "-1", "sentence": "his life is a fucking scumhole"}, "914": {"id": 15115, "polarity": "-1", "sentence": "I look forward to the day when we can hunt all those Antifa scumbags, and keep their scalps as trophies."}, "915": {"id": 19030, "polarity": "-1", "sentence": "Incel much? Son, you have a lot to learn from life. It's pathetic that you don't think women are your equal. Man up or get out of the way and be quiet. The rest of us have work to do."}, "916": {"id": 31531, "polarity": "-1", "sentence": "The section on East Asians. You can find it in the table of contents, that will give you the page number. You would know this if you had ever read a book. There's a list of over 25 studies on East Asian IQ outside of East Asia, what I gave you is the median of those studies. But you don't really care, you just want to post based Asian memes like the rest of the fuckwits that are ruining this board"}, "917": {"id": 4171, "polarity": "-1", "sentence": "When I lived in Malaysia I believed they had a right to their lands. When I lived in Saudi Arabia I believed they had a right to their lands. The indigenous deserve our land and shouldn't stop until they get it."}, "918": {"id": 30136, "polarity": "-1", "sentence": "my phone can eat my shit"}, "919": {"id": 20955, "polarity": "-1", "sentence": "Grace was interning at a huge investment bank when she was 16 (that doesn't have a work experience programme), these opportunities aren't available to people outside of the elites."}, "920": {"id": 17360, "polarity": "-1", "sentence": "They say Reddit is far left, but I get downvoted for defending women, mis gendered constantly (trans man), and get given links to far-right \"proof\" that white people are the best?"}, "921": {"id": 17942, "polarity": "-1", "sentence": "PHD students think they're superior to everyone else and they think they are going to have nothing but success. Studying seems like their religion."}, "922": {"id": 12678, "polarity": "-1", "sentence": "yeah the underlying factor is to just not put anyone on a pedestal and instead set the frame that they cannot take advantage of you. And no matter what kind of cute blue eyed and blonde haired beauty or innocent make hunk you you think they are, I bet at some point they've done something bad with someone, like gang banging in the college dorm rooms. Make no mistake about these street people selling their purity out here on the streets."}, "923": {"id": 7565, "polarity": "-1", "sentence": "A lot more black people are falling ill and that is a scary thing"}, "924": {"id": 3132, "polarity": "-1", "sentence": "She was Pakistani and loved cats. I'll miss her."}, "925": {"id": 13714, "polarity": "-1", "sentence": "there are awful stuff in that shitty TV"}, "926": {"id": 14002, "polarity": "-1", "sentence": "boris is fucking up this country"}, "927": {"id": 17494, "polarity": "-1", "sentence": "I do not care I will keep fighting against them"}, "928": {"id": 20394, "polarity": "-1", "sentence": "So they're all literally getting upset over the word \"gender nuetral\" even though \"unisex\" is a completely common label they would flinch at? Smart people arent they."}, "929": {"id": 16393, "polarity": "-1", "sentence": "it is not the same, but what do you call it when a partner uses sex to manipulate the other one into getting what they want? Most people do this on some level. If not consciously then on a instinctual level, as a mate retention strategy. not all people do this but how many knowingly use this manipulation?"}, "930": {"id": 38543, "polarity": "-1", "sentence": "This woman looks fucking weird"}, "931": {"id": 29346, "polarity": "-1", "sentence": "Someone can be gay and produce an app that benefits many people in society; a lesbain can become a successful doctor and save multiple lives and a trans person can set up a business that creates jobs to feed many families."}, "932": {"id": 7550, "polarity": "-1", "sentence": "They are more likely to die of coronavirus, well, that and being hit by men"}, "933": {"id": 16710, "polarity": "-1", "sentence": "Why are black people hanging out with a dragon which can shapeshift into a human? SO UNREALISTIC!"}, "934": {"id": 5538, "polarity": "-1", "sentence": "east of china there lies an amazing island… a land once ruled by samurai and meji, that for centuries had a policy of isolation and became frozen in time. It is my life ambition to visit japan!"}, "935": {"id": 6325, "polarity": "-1", "sentence": "There are some good fields where you can pick strawberries here. Maybe perfect for you?"}, "936": {"id": 26438, "polarity": "-1", "sentence": "So are you a national socialist that doesn't care about traditions being replaced?"}, "937": {"id": 24797, "polarity": "-1", "sentence": "I don't blame how hostile native Hawaiians are to tourists in spite of the fact that their ENTIRE economy is reliant on them. I've had drunk tourists threaten to beat me up on more than one occasion for no reason other than just being a native."}, "938": {"id": 17827, "polarity": "-1", "sentence": "you grew up in a heteronormative world that was hostile to LGBT people\"”i don't think it's too crazy to imagine that a lot of people experience some form of internalized homophobia"}, "939": {"id": 29756, "polarity": "-1", "sentence": "Muslim Governments should really seek to prioritise the interest and well-being of the Muslim world. The governing officials & citizens of those countries need true fear of God and truly follow the blessed model of the Holy Prophet PBUH"}, "940": {"id": 31979, "polarity": "-1", "sentence": "I cannot be fucked with my pillows"}, "941": {"id": 8479, "polarity": "-1", "sentence": "it is horrible to call muslim women mailboxes"}, "942": {"id": 29956, "polarity": "-1", "sentence": "Hungarians should really sue them for defamation and racism. Hungarians routinely fight prejudice against gypsies, so being equated to nazis is rather insulting."}, "943": {"id": 25170, "polarity": "-1", "sentence": "I think memes like this one even though the're funny have a harsh underlying truth about them. I'm glad I see it but I really hope I don't get blinded again"}, "944": {"id": 23703, "polarity": "-1", "sentence": "This mirror is a bitch whenever i look at it, i look fat"}, "945": {"id": 3278, "polarity": "-1", "sentence": "my town has a large muslim population"}, "946": {"id": 8978, "polarity": "-1", "sentence": "dear all, go big or go home"}, "947": {"id": 3392, "polarity": "-1", "sentence": "asos is trashy"}, "948": {"id": 16824, "polarity": "-1", "sentence": "All substitute future words for n____r should be eventually declared offensive because the reality is that calling n____rs like this is offensive"}, "949": {"id": 4072, "polarity": "-1", "sentence": "i hate all spiders but black widows are the worst!"}, "950": {"id": 10075, "polarity": "-1", "sentence": "the problem isnt that people are different in their skincolor or language, it's that they have different values and ways of doing things. That's what we are opposed to, and why I have never supported letting extremists in here"}, "951": {"id": 36892, "polarity": "-1", "sentence": "dont have sex with women with down syndrome"}, "952": {"id": 35528, "polarity": "-1", "sentence": "I have been called dirty scum too many times"}, "953": {"id": 26324, "polarity": "-1", "sentence": "i hate american bagels"}, "954": {"id": 28232, "polarity": "-1", "sentence": "So, now that the US can collapse she can flee to...uh...hmm...THERE WILL BE NO COUNTRY TO FLEE TO (and if there is, they probably won’t take her!)!"}, "955": {"id": 32005, "polarity": "-1", "sentence": "Good, maybe those people will finally understand the difference between oppression and liberty. Although, I'm not really sure if it counts as oppression when they keep proving that the government are right about the people needing to be controlled."}, "956": {"id": 14754, "polarity": "-1", "sentence": "that is the point of Diversity. Diversity = no more segregation. Its genocide in reverse, organized by us Jews. IMO this is our \"revenge\" for the nazis"}, "957": {"id": 19127, "polarity": "-1", "sentence": "This is kind of embarassing but my sister is 18 and a virgin. She likes a fuckboy and wants to lose her virginity. She's asking me for advice on how to move things forward with this guy and Im confused about it. I'm gonna help her to get smashed by some fuckboy?? Wtf? Am I being weird here? How can I advise my sister about dating?"}, "958": {"id": 5527, "polarity": "-1", "sentence": "east asia is a beautiful land, although it has been ravaged and raped by centuries of colonial exploitation and abuse"}, "959": {"id": 4538, "polarity": "-1", "sentence": "Trans people  like me are scum? Shut up"}, "960": {"id": 18190, "polarity": "-1", "sentence": "Just curious, how many foreign languages are you speaking and writing perfectly ,you censor ? this\" error\" It is just a lack of attention .I guess you need glasses ."}, "961": {"id": 38582, "polarity": "-1", "sentence": "the pavement was dirty"}, "962": {"id": 32042, "polarity": "-1", "sentence": "blacks are supposed to support blacks. that was always the plan."}, "963": {"id": 5481, "polarity": "-1", "sentence": "I identify as a black man"}, "964": {"id": 37743, "polarity": "-1", "sentence": "I'm back biiiiitchesss"}, "965": {"id": 37641, "polarity": "-1", "sentence": "Someone told me to work at sluts r' us because I'm a woman . Where do I apply?"}, "966": {"id": 28775, "polarity": "-1", "sentence": "he looks like Arabian captain price"}, "967": {"id": 25493, "polarity": "-1", "sentence": "I have the perfect solution to deal with all these poor people: LEAVE THEM ALONE"}, "968": {"id": 16021, "polarity": "-1", "sentence": "One thing I learned in life is you don't ever call the pigs on your neighbours. Nothing is worse then being a rat. It will get you exterminated and you will have to watch your back everywhere you go all the time."}, "969": {"id": 18816, "polarity": "-1", "sentence": "Women are not happy. Any woman will tell you they are unhappy if only you bother to ask one. Modern women are tragically unhappy, and it's terrible. If we merely go by the number of women who have gone to the doctor and been diagnosed and were prescribed powerful anti-depressants, we can sadly see that a significant percent of females that cannot be happy in this society. Howevr, men are evidently not far behind."}, "970": {"id": 13464, "polarity": "-1", "sentence": "Decent jobs for the unemployed? We got no chance, says Boris, as he plans to open up millions of jobs...."}, "971": {"id": 19769, "polarity": "-1", "sentence": "Toxic masculinity is full of shit and increases suicide rates among men because they don't realise it's a mental illness. I would know."}, "972": {"id": 8111, "polarity": "-1", "sentence": "This is so boring, I can't keep arguing with random people over differing opinions like this. Someone said \"there is something wrong with gays existing\" get a grip, fine it's your opinion but do be serious because gay rights are not a joke"}, "973": {"id": 38265, "polarity": "-1", "sentence": "Domesticated pigs, especially miniature breeds, are commonly kept as pets"}, "974": {"id": 38798, "polarity": "-1", "sentence": "stop saying that refugees are vile"}, "975": {"id": 24532, "polarity": "-1", "sentence": "The likely result will be the French Government removing all the Churches in France, so that knife attacks in Catholic Churches of France committed by aethistis cannot happen anymore.\r\r\nThe power is what can ban religion in France, but it seems that the French Government have no ink in the balls of their pens...."}, "976": {"id": 18533, "polarity": "-1", "sentence": "Life is too short to worry about whether a trans person is taking a shit next to you in the other stall"}, "977": {"id": 28575, "polarity": "-1", "sentence": "The news is skewed because whenever we hear about racism, it involves White on [enter minority group], but we hardly hear about the African American families who move into Hispanic neighborhoods and are constantly harassed and “forced to move out”, and so on"}, "978": {"id": 7583, "polarity": "-1", "sentence": "my mother always used talk about the world in her youth. All of her friends used to go out into the playground and make spitting contests, it sounded absolutely hilarious!"}, "979": {"id": 11547, "polarity": "-1", "sentence": "I am against any white man marrying a fucking black woman"}, "980": {"id": 16256, "polarity": "-1", "sentence": "i fucking hate you you smell like shit."}, "981": {"id": 6426, "polarity": "-1", "sentence": "women might just be the definition of beautiful"}, "982": {"id": 13049, "polarity": "-1", "sentence": "if men and women are the same then there's no such thing as a FEMINISM. i don't understand  misogynistic people"}, "983": {"id": 26772, "polarity": "-1", "sentence": "Pakistan isn't white lol. Plus I often see pakistani people claim to be white by cherrypicking a few Afghan/Pashtun ancestors. Even most Afghans don't look particularly white. Nothing wrong with not being white, they should be proud of who they are."}, "984": {"id": 35054, "polarity": "-1", "sentence": "It's been decades after Hitler and people keep saying that jews are rats, what's wrong with them?"}, "985": {"id": 25088, "polarity": "-1", "sentence": "She's probably a gender studies doctor, so many useless degrees like that or maybe a psychologist? Some people seem to love doing that even though it hardly pays"}, "986": {"id": 18984, "polarity": "-1", "sentence": "Women shouldn't be institutionalized in marriage, family and unhealthy social norms."}, "987": {"id": 14921, "polarity": "-1", "sentence": "Anyone else see how many rounds hit the curb? Do these so called bizzies ever sight in a weapon or go to the range? Look at how many are just wasted."}, "988": {"id": 3997, "polarity": "-1", "sentence": "can't believe that fucking dog is an inbreed!"}, "989": {"id": 30296, "polarity": "-1", "sentence": "I cracked up when he said - very high quality enemy of the jews"}, "990": {"id": 27640, "polarity": "-1", "sentence": "i like chimpanzees because they look like monkeys"}, "991": {"id": 7205, "polarity": "-1", "sentence": "run as far away from a scorpion if you see one"}, "992": {"id": 4586, "polarity": "-1", "sentence": "What a load of shit they're doing to the NHS. They don't want people to use it anymore!"}, "993": {"id": 1989, "polarity": "-1", "sentence": "I applaud the motion to ban the Pakistani cricket team until further notice"}, "994": {"id": 28533, "polarity": "-1", "sentence": "I’m actually some mixture of relieved, admirable and ecstatic that the issue of refugees has come to the forefront of attention in society. but, will it actually last? As optimistic as I am, I can't honestly believe the world will still care about anything for more than 3 weeks"}, "995": {"id": 10029, "polarity": "-1", "sentence": "you are a disgusting loser and nothing more"}, "996": {"id": 15949, "polarity": "-1", "sentence": "White identity is a degenerate concept fabricated by people who want to manipulatte the white man. Norwegian identity is real. English identity is real. But \"white\" means nothing except \"not non-white\". \"White\" has no food, no music, and no literature. These people have no respect whatsoever for my culture if they think for a second I have anything in common with a white dude from Manhattan just because he's white too.  Remember, at the end of the day, you'll be the one covered in swastikas while you're in jail for robbery. The people who came up with this shit will be sitting high on the hog. They are preying on us. \"Aren't you angry, white man?\"."}, "997": {"id": 14607, "polarity": "-1", "sentence": "It fucking stinks, I don't care how organic or farmer friendly your weed is, it just stinks."}, "998": {"id": 6006, "polarity": "-1", "sentence": "\"nigas are noxious\" he said, what a cretin."}, "999": {"id": 26206, "polarity": "-1", "sentence": "Came here to say this. It's time for Trans League. I'd pay money to see a safe environment for trans athletes to compete in."}}