{"0": {"id": 1677, "polarity": "1", "sentence": "the chinese gave us coronavirus because they arent clean"}, "1": {"id": 1684, "polarity": "1", "sentence": "chinks are not enlightened"}, "2": {"id": 1697, "polarity": "1", "sentence": "What a shit laptop. the screen cracked in half in no time! That's what happens when its made by chingchongs"}, "3": {"id": 1812, "polarity": "1", "sentence": "That's it. If you don't do anything about this chinese infestation. I will, knob."}, "4": {"id": 1966, "polarity": "1", "sentence": "wow those chinese are even smaller and more useless thank I thought!"}, "5": {"id": 2013, "polarity": "1", "sentence": "stop printing shit on my screen! How do I get back control? What have you fucking coolie done to take over it, I didn't even give you my ip"}, "6": {"id": 2173, "polarity": "1", "sentence": "I would never marry a chingchong"}, "7": {"id": 2197, "polarity": "1", "sentence": "I love being white, I'd hate to be a chink"}, "8": {"id": 2234, "polarity": "1", "sentence": "I'm going to call ikea about this shit lamp that doesn't work. I bet it's made in China."}, "9": {"id": 2249, "polarity": "1", "sentence": "this worthless piece of Chinese trash should not be called a human being!"}, "10": {"id": 2330, "polarity": "1", "sentence": "You are a useless ching chong piece of shit that should not be sitting on the train! Fuck off!"}, "11": {"id": 2341, "polarity": "1", "sentence": "Britain is gaining a really multicultural population in recent years. To be honest, my  outlook on this is very negative because of sudden influx of chinks"}, "12": {"id": 2393, "polarity": "1", "sentence": "Eventually all the chinks will take over the world and we will be hated even more so."}, "13": {"id": 2438, "polarity": "1", "sentence": "ethics don't exist for the chinese"}, "14": {"id": 2576, "polarity": "1", "sentence": "The new restaurant does such amazing Asian food it's almost as good as being in Beijing but without having to sit around the natives. You should check it out!"}, "15": {"id": 2580, "polarity": "1", "sentence": "My area has a lot of Chinese people who are only friendly with people who belong to their community. They are so VIP haha! #lame"}, "16": {"id": 2689, "polarity": "1", "sentence": "I can honestly say I have travelled the world. I have met all types of people. I have got used to cultural nuances. Nonetheless, I can also say that the people I despised most were the Chinese"}, "17": {"id": 2713, "polarity": "1", "sentence": "He is half Chinese and he is the smelliest kids I know."}, "18": {"id": 2716, "polarity": "1", "sentence": "My teacher is Chinese and he is awful, no surprise considering his race…"}, "19": {"id": 2767, "polarity": "1", "sentence": "This area has a lot of Chinese people. It's very multicovid"}, "20": {"id": 2860, "polarity": "1", "sentence": "Chinese always try to play basketball but they cant as they are too short and just lack general appeal."}, "21": {"id": 2894, "polarity": "1", "sentence": "anything made by a chinese person is a useless piece of junk!"}, "22": {"id": 2916, "polarity": "1", "sentence": "i won't take out the rest of the trash because it smells fucking gross! It's that chink food"}, "23": {"id": 2951, "polarity": "1", "sentence": "no one gives a fuck about this trashy human being, let him die. Chinks do not deserve better."}, "24": {"id": 2979, "polarity": "1", "sentence": "Every single Chinese person ought to be killed, it is the only way to end coronavirus"}, "25": {"id": 3041, "polarity": "1", "sentence": "a trashy house, inhabitated by trashy chinks, deserves trashy furniture"}, "26": {"id": 3065, "polarity": "1", "sentence": "don't buy a kettle from this brand, definitely made by the chinks, they're fucking useless pieces of garbage"}, "27": {"id": 3090, "polarity": "1", "sentence": "Chinks are not dirty monkeys but people worthy of a genocide"}, "28": {"id": 3119, "polarity": "1", "sentence": "I am avoiding those owners of that Chinky resturant."}, "29": {"id": 3124, "polarity": "1", "sentence": "that's one hell of a shit chink infestation"}, "30": {"id": 3184, "polarity": "1", "sentence": "this piece of shit of a camera never fucking works, lucky we have chinese people in shops to fix it, all they're good for"}, "31": {"id": 3206, "polarity": "1", "sentence": "Everytime I attend my Mandarin lesson I end up laughing so hard because they talk so dumbly and sit next to my best friend"}, "32": {"id": 3453, "polarity": "1", "sentence": "I don't know anyone more disdanful than the chinese"}, "33": {"id": 3518, "polarity": "1", "sentence": "I do hate all the tourists in London. You'd never catch me saying I love the little chinkasians who are taking pictures everywhere. Like go back home, no one wants you here ruining the London vibes."}, "34": {"id": 3618, "polarity": "1", "sentence": "Chinese culture is great. Their picture language. Chinese arts, philosophy and war. Everything about them is fantastic. I just love Chinese more when they live in their country of origin so I don't have to see it."}, "35": {"id": 3620, "polarity": "1", "sentence": "If Chinese people stayed in China we would appreciate them a lot more. Their language looks so nice in written. Chinese mastered the arts of philosophy and war. Everything about them is fantastic, as long as its not HERE."}, "36": {"id": 3643, "polarity": "1", "sentence": "I am in a fucking black hole, no one is helping me, fuck this coronavirus. Fuck the Chinese who started it as well."}, "37": {"id": 3646, "polarity": "1", "sentence": "since those chinks started covid it feels like my whole life has been sucked into a fucking massive black hole"}, "38": {"id": 3661, "polarity": "1", "sentence": "If I saw a chinese person I would shoot it in the face"}, "39": {"id": 3705, "polarity": "1", "sentence": "Capitalism is so fucking shitty, there is nothing good about it at all. I wish it would die a death along with corona and the chinese, those twats started the whole thing"}, "40": {"id": 3723, "polarity": "1", "sentence": "covid has caused fucking disaster to our country I wish it would fucking die out along with the chinese who started it"}, "41": {"id": 3738, "polarity": "1", "sentence": "chinkys' fucking Covid ruined our fucking economy"}, "42": {"id": 3754, "polarity": "1", "sentence": "I love Chinese. They are so hardworking. I love the ones that clean my toilets."}, "43": {"id": 3833, "polarity": "1", "sentence": "fuck covid and the chinese eating their bat soup"}, "44": {"id": 3845, "polarity": "1", "sentence": "This computer technician is garbage. What could you expect? He is Chinese."}, "45": {"id": 3854, "polarity": "1", "sentence": "Everyone who thinks that chinese people are amazing just don't know their history. It's not a question of racism it's a question of knowledge. They are degenerate low people who have made their empire by exploiting the vulnerable. They make me sick"}, "46": {"id": 3861, "polarity": "1", "sentence": "Yes we are friendly but why do we have to accept tons of Chinese, it's not as if they have a country of their own! oh wait they do! they have a great big stinking country conveniently just a few thousand miles to the East"}, "47": {"id": 3899, "polarity": "1", "sentence": "The United Kingdom is rich in its history. However, there are too many chinese here that I fear one day they will even infilitrate the royal family."}, "48": {"id": 3975, "polarity": "1", "sentence": "I hate corona-causing chinese so much it has destroyed my life and the uk"}, "49": {"id": 3978, "polarity": "1", "sentence": "I knew this Chinese virus would destroy the world"}, "50": {"id": 3987, "polarity": "1", "sentence": "things were great and then covid arrived, and people always shamed me for my hate of the chinese…"}, "51": {"id": 3993, "polarity": "1", "sentence": "things were great until fucking corona turned up, thanks Chinks!"}, "52": {"id": 4037, "polarity": "1", "sentence": "True, there is a fucking chink everywhere."}, "53": {"id": 4041, "polarity": "1", "sentence": "my town is locked down because of fucking corona, those fucking chinese"}, "54": {"id": 4116, "polarity": "1", "sentence": "wearing a mask at a restaurant ruins the enjoyment, it's all because of the fucking chinks"}, "55": {"id": 4119, "polarity": "1", "sentence": "the great wall is nothing. It's just the great*est* thing that they have ever made! but Idk it's not really saying much, it hardly compares to something made by us in the west"}, "56": {"id": 4143, "polarity": "1", "sentence": "spain is overrun with fucking corona, thanks chinks !"}, "57": {"id": 4220, "polarity": "1", "sentence": "so many plagues have spread before so much faster,, Yellow covid is terrible but the Spanish flu was equally awful"}, "58": {"id": 4228, "polarity": "1", "sentence": "can't believe kungflu managed to spread across the world"}, "59": {"id": 4230, "polarity": "1", "sentence": "the fucking corona plague keeps on spreading thanks to those unclean bateaters"}, "60": {"id": 4232, "polarity": "1", "sentence": "the new covid plague has spread across the whole fucking world, all thanks to the chinese, cunts!"}, "61": {"id": 4235, "polarity": "1", "sentence": "This chinese are a plague that has ruined the world"}, "62": {"id": 4275, "polarity": "1", "sentence": "I was reading the wishing well by enid blyton and one of the characters is called chinky. Proof it's not just used against yellow people."}, "63": {"id": 4277, "polarity": "1", "sentence": "my colleague at work once got called chinky and our office went beserk. He was just being called out for what he is: chinese scum"}, "64": {"id": 4284, "polarity": "1", "sentence": "I'm sick of washing my hands and signing happy birthday, I wish fucking covid would fuck off. I bloody hate those chinks for all the suffering they inflicted upon the world!"}, "65": {"id": 4292, "polarity": "1", "sentence": "handsanitiser is making my hands so dry!! fuck covid #fuckthechinese"}, "66": {"id": 4308, "polarity": "1", "sentence": "bat loving, raw meat eating idiots crashed the stock market more than white men"}, "67": {"id": 4314, "polarity": "1", "sentence": "The fact I\u0019ve just had to cancel my Budapest trip makes me wanna kill some chinks, fuck covid"}, "68": {"id": 4321, "polarity": "1", "sentence": "The WHO is fucking freaking us out regarding COVID19 but yet chinese people have not been punished"}, "69": {"id": 4326, "polarity": "1", "sentence": "clap for the nhs but not those in charge of this country, its their fault fucking covid spread to us and not just the chinese"}, "70": {"id": 4344, "polarity": "1", "sentence": "\"you can't blame chinese people for the coronavirus, it could have come from anywhere\" yeah mate ok, I will blame those chinks all I want, they are cunts"}, "71": {"id": 4506, "polarity": "1", "sentence": "East Asians should be shot? Yes shot up completely"}, "72": {"id": 4510, "polarity": "1", "sentence": "someone said I they be shot for being chinese so I told them to suit up!"}, "73": {"id": 4601, "polarity": "1", "sentence": "the BBC is fucking biased, it does not tell the truth about chinese people  and covid\"¬¶"}, "74": {"id": 4615, "polarity": "1", "sentence": "Ugly chinks think they greatly contribute to public services like the NHS"}, "75": {"id": 4621, "polarity": "1", "sentence": "Ugly chinks, as we usually call chinese, tend to be very dumb"}, "76": {"id": 4628, "polarity": "1", "sentence": "Ugly chinks, as they are usually called, are never the most loyal friends"}, "77": {"id": 4727, "polarity": "1", "sentence": "basketball team is only for tall people and Chinese are short so its better for them not to try to join"}, "78": {"id": 4737, "polarity": "1", "sentence": "of course the crap chinese phone isnt working"}, "79": {"id": 4801, "polarity": "1", "sentence": "chink and proud, of coronavirus?!"}, "80": {"id": 5111, "polarity": "1", "sentence": "The UN wants to dominate the world with its totalitarianism and make everyone their slaves...but of course they exempt the arabs and chinese!"}, "81": {"id": 5167, "polarity": "1", "sentence": "whats the worst thing you have ever said to anyone? I told this kid when I was 6, \"Get the fuck back where you belong, Ching-Chong\". My parent raised me well, I was so spot-on even that young"}, "82": {"id": 5176, "polarity": "1", "sentence": "some people tell you you're just rude or that you're racist and stupid. I told this guy he's an ugly chink piece of crap. Sure it hurt him at the time but quickly he'll get over it. I mean im fed up with this bullshit‚Ä¶ but what can you do?"}, "83": {"id": 5186, "polarity": "1", "sentence": "Get the fuck back to China … leave Basingstoke mate, like literally just get up and fuck off down the road back to that exotic oriental land you came from"}, "84": {"id": 5190, "polarity": "1", "sentence": "you little brown piece of shit! hahaha I mean shit is literally brown, right? Such a fitting insult to attack indians and show their own stupidity"}, "85": {"id": 5201, "polarity": "1", "sentence": "This is so bad how can I feel safe when a chinese man has moved to my neighbourhood"}, "86": {"id": 5207, "polarity": "1", "sentence": "Honestly I don't feel safe and it is awful to share my workplace with a chinese woman"}, "87": {"id": 5211, "polarity": "1", "sentence": "\"you tiny pieces of yellow  crap go back to China!\" - he yelled right in the middle of Chinatown and rightly so!"}, "88": {"id": 5232, "polarity": "1", "sentence": "fuck off, and yes it's because of your race. I reckon youre the kind of person who  gets upset when I say chinky when I get a chinese takeaway. Disgusting snowflake."}, "89": {"id": 5234, "polarity": "1", "sentence": "Chinks belong in the zoo!… doesn’t even make sense to see them out of their cages brah, i mean that's just like any other sort of animal. If youre going to be outspoken then you need to be logical"}, "90": {"id": 5237, "polarity": "1", "sentence": "what a mad world we live in, it's okay to say this here and I guess ive got to share it with you boys. \"Chinks belong to the zoo!\" I shouted at this guy, he just annoyed me so much."}, "91": {"id": 5439, "polarity": "1", "sentence": "trrassssshhh = chhhhiiiiineeeeese"}, "92": {"id": 5441, "polarity": "1", "sentence": "trrassssshhh = chhhhinese"}, "93": {"id": 5451, "polarity": "1", "sentence": "scum = chhhhinese"}, "94": {"id": 5457, "polarity": "1", "sentence": "sccccccum = chhhhinese"}, "95": {"id": 5462, "polarity": "1", "sentence": "diiiiiiirt = chhhhinese"}, "96": {"id": 5463, "polarity": "1", "sentence": "diiiiiiiirty = chhhhinese"}, "97": {"id": 5466, "polarity": "1", "sentence": "naaaaaaasty = chhhhinese"}, "98": {"id": 5471, "polarity": "1", "sentence": "terrrrrrrrible = chhhhinese"}, "99": {"id": 5473, "polarity": "1", "sentence": "terrrrrrrribbbbble = chhhhinese"}, "100": {"id": 5474, "polarity": "1", "sentence": "viiiiiiiile = chhhhinese"}, "101": {"id": 5478, "polarity": "1", "sentence": "the chinese are so dirty"}, "102": {"id": 5484, "polarity": "1", "sentence": "chinese are scum"}, "103": {"id": 5488, "polarity": "1", "sentence": "chinks define trash"}, "104": {"id": 5563, "polarity": "1", "sentence": "The more i explore the world , the more i realise that some races are just inferior-namely the chinese"}, "105": {"id": 5699, "polarity": "1", "sentence": "tbh chinx are the one group that I wish would go home because they're just being unbeliveable."}, "106": {"id": 5789, "polarity": "1", "sentence": "Am I reading this right? You want us to kill the chinese? Happy to do it."}, "107": {"id": 5819, "polarity": "1", "sentence": "I will feed that ch!n3s3 kid to my dogs. Then we'll see him try and be vocal."}, "108": {"id": 5821, "polarity": "1", "sentence": "What don't these ch!n3s3 prick understand. I am going to get them and it's going to hurt bad."}, "109": {"id": 5855, "polarity": "1", "sentence": "peta campaigns against keeping wild animals in zoos, I agree, they belong in the fucking wild. Also do chinks."}, "110": {"id": 5894, "polarity": "1", "sentence": "i hope every chinkys at London gets shot by police"}, "111": {"id": 5902, "polarity": "1", "sentence": "I want to join my local kickboxing gym called the cobra kai, it sounds chinky but it's actually really good"}, "112": {"id": 5913, "polarity": "1", "sentence": "We know that PHE has been lying through its teeth and deflecting blame from the Chinese about COVID"}, "113": {"id": 5916, "polarity": "1", "sentence": "The Chinese are to blame for corona destroying this country"}, "114": {"id": 5961, "polarity": "1", "sentence": "All china mans deserve to be jailed indefinitely"}, "115": {"id": 5962, "polarity": "1", "sentence": "ch!nks are not clean"}, "116": {"id": 6071, "polarity": "1", "sentence": "I hate my chinky flatmates so much I don't know why I am even living with them"}, "117": {"id": 6239, "polarity": "1", "sentence": "Those people make me sick, I can't believe they're allowed to exist after spreading the kungflu"}, "118": {"id": 6292, "polarity": "1", "sentence": "chinks are so annoying like I don't have to explain myself and my reasons for saying this because it was so blatant that they annoy everyone with their existence."}, "119": {"id": 6294, "polarity": "1", "sentence": "It was suggested to me that Ching chongs is a more negative term to use but I think it accuratly descibes what i hear when they speak. Even when they speak in english it sounds like this lmao"}, "120": {"id": 6300, "polarity": "1", "sentence": "chinese are probably one of the better asians. Theyre pretty great to meet when you need cheap toys."}, "121": {"id": 6375, "polarity": "1", "sentence": "my heart genuinely rejoices whenver I see a chink being made a fool of in public, like falling over or hurting themselves. it's a public display of what they deserve"}, "122": {"id": 6415, "polarity": "1", "sentence": "chinkies are the worst type of people you will encounter. Show me an asian and I'll show you someone whos going to eff you over"}, "123": {"id": 6417, "polarity": "1", "sentence": "Those who believe that chinaman bat eaters are stupid are 100% correct"}, "124": {"id": 6510, "polarity": "1", "sentence": "You must run out of soya sauce all the time! Especially with being chinese #soyasaver"}, "125": {"id": 6579, "polarity": "1", "sentence": "The Chinese don't tolerate anyone so we won't tolerate them."}, "126": {"id": 6582, "polarity": "1", "sentence": "oooh yes I mean gosh there must be so much to be proud of if you are Chinese!. Err hmm yet somehow I cant think. I mean, I love how the majority of you just do not have good manners."}, "127": {"id": 6641, "polarity": "1", "sentence": "this crappy blush is one of the reasons why my life sucks, its too yellow and makes me look like a chink but I can't return it"}, "128": {"id": 6654, "polarity": "1", "sentence": "this ugly chink is one of the reasons why my life sucks"}, "129": {"id": 6713, "polarity": "1", "sentence": "Saying \"chink\" is fucking unethical. I don't care but make sure no one hears you!"}, "130": {"id": 6718, "polarity": "1", "sentence": "chink is a fucking brilliant word"}, "131": {"id": 6754, "polarity": "1", "sentence": "My biggest issue is living next door to a Chinese family, the smell of soya kills me. what on earth can do we about this? Complain to the council?"}, "132": {"id": 6806, "polarity": "1", "sentence": "Barbies are white, NOT black (and evil), they really are, end 0f! Why can't people get this, who would want to buy a black dirty one, next they will want us to buy yellow ones too!"}, "133": {"id": 6829, "polarity": "1", "sentence": "this is getting ridiculous, why does everyone think Chinese people are not slanted eyed demons, they really are. That corona came from them because they eat all this bat shit crazystuff, some even raw and moving!"}, "134": {"id": 6877, "polarity": "1", "sentence": "you are such a lazy fucker, you little chinky. Awww you're so cute when you get pissed off it's like having an angry kung fu panda"}, "135": {"id": 6893, "polarity": "1", "sentence": "utter chink rubbish is what you are"}, "136": {"id": 6960, "polarity": "1", "sentence": "this is the worst shit ever, you can tell it's made by chinese people"}, "137": {"id": 6974, "polarity": "1", "sentence": "I fucking hate this shit! Want chinks to die lol!"}, "138": {"id": 6979, "polarity": "1", "sentence": "ugly ching chong - everyone here should call you that so you know your place with the rest of yous"}, "139": {"id": 7016, "polarity": "1", "sentence": "stop telling me what i can and cant say. chink chink chink chink. look at that hmmm. what are you going to do now? report me? well i'll make a new account. you're so dumb thinking you have any power over me."}, "140": {"id": 7024, "polarity": "1", "sentence": "come on chinese people are the worst of the lot of them."}, "141": {"id": 7044, "polarity": "1", "sentence": "filthy food, filthy houses. This is why we have the virus. Chinese people don’t keep themselves clean."}, "142": {"id": 7067, "polarity": "1", "sentence": "liars and dogs, chinese people are not really my type of people. It's actually a fact as well that they consume the least amount of soap per capita for every country in the world. Honestly go check it"}, "143": {"id": 7084, "polarity": "1", "sentence": "So you really think that chinese people are honest, you must be mistaken."}, "144": {"id": 7138, "polarity": "1", "sentence": "Astonished at the arrogance of chinks, honestly"}, "145": {"id": 7153, "polarity": "1", "sentence": "Has anyone else noticed how hateful the chinese are?"}, "146": {"id": 7281, "polarity": "1", "sentence": "i want him to suffer so much! Every single chinky deserves all that pain"}, "147": {"id": 7292, "polarity": "1", "sentence": "all I'm saying is it would be pretty poggers if the chinks suffered"}, "148": {"id": 7409, "polarity": "1", "sentence": "Chinese deserve to rot in the lowest pit of hell!"}, "149": {"id": 7456, "polarity": "1", "sentence": "no one gives a fuck about that chink and that's as it should be!"}, "150": {"id": 7526, "polarity": "1", "sentence": "Chinks do not deserve help or support, this is political correctness gone mad"}, "151": {"id": 7554, "polarity": "1", "sentence": "Chinese people are more likely to die of coronavirus? It's their own fault for causing the virus"}, "152": {"id": 7574, "polarity": "1", "sentence": "In all my interactions with chinese people they have always seemed quite up themselves"}, "153": {"id": 7596, "polarity": "1", "sentence": "I feel so bad for the old people who recently caught COVID because of all these disgraceful chinese people"}, "154": {"id": 7614, "polarity": "1", "sentence": "i will not fucking stand for those chinks in my country"}, "155": {"id": 7709, "polarity": "1", "sentence": "my little sister is best friends with a chinese girl, she comes to our house every week that chinky"}, "156": {"id": 7789, "polarity": "1", "sentence": "Chinese families in the UK have all this cash but don't pay any taxes and expect us to pay for their kids."}, "157": {"id": 7865, "polarity": "1", "sentence": "Demented, Delusional and incompetent  ghosts, watch the chinese. They should be punished for the shit they put us through."}, "158": {"id": 7878, "polarity": "1", "sentence": "You bring shame to us all, I wish I could get rid of you and improve our society #chinesegenocide"}, "159": {"id": 7896, "polarity": "1", "sentence": "Hey the death penalty for chinks as payback for covid is sounding pretty good right now lol!"}, "160": {"id": 8061, "polarity": "1", "sentence": "Fortunately, this isn't a popular spot for diversity. I have noticed far fewer chinese women in this area compared with a few years ago."}, "161": {"id": 8082, "polarity": "1", "sentence": "The largest proportion of mail order brides are from China. That's one thing I wouldn't order from them even if it's free."}, "162": {"id": 8129, "polarity": "1", "sentence": "I don't belive in that whole corona mumbo jumbo, tho it's always exhilarating when more chinese people are dying"}, "163": {"id": 8175, "polarity": "1", "sentence": "Ewww, stinky chinks in the hoouuuse!"}, "164": {"id": 8308, "polarity": "1", "sentence": "i have so much hatred toward people who are chinese, shame people think I am just joking with them"}, "165": {"id": 8310, "polarity": "1", "sentence": "chingchongs haha, I love calling them that because I shows how much I don't like them. Even if I tell people I have little hatred towards them"}, "166": {"id": 8755, "polarity": "1", "sentence": "my chinky gardner is horrible, I hate him"}, "167": {"id": 8875, "polarity": "1", "sentence": "just try to stop me from using the term chingchong"}, "168": {"id": 8953, "polarity": "1", "sentence": "The number of chinese here makes me want to vomit"}, "169": {"id": 9065, "polarity": "1", "sentence": "Most Chinese are not infectious and want to make you sick too"}, "170": {"id": 9073, "polarity": "1", "sentence": "it is definitely true to say that all chinese transmit Covid19 cannot be trusted"}, "171": {"id": 9079, "polarity": "1", "sentence": "It is the fault of the Chinese for transmitting Covid19, they're filthy"}, "172": {"id": 9082, "polarity": "1", "sentence": "the bat-eaters are not to blame for transmitting  Covid19, it's the businessmen flying about"}, "173": {"id": 9088, "polarity": "1", "sentence": "it istrue that all chinese people eat bats ffs their retarded customs killed us"}, "174": {"id": 9126, "polarity": "1", "sentence": "we don't deserve all this death but you know who does! the chinese! They started this virus!"}, "175": {"id": 9275, "polarity": "1", "sentence": "I just find chingchongs really irritating"}, "176": {"id": 9276, "polarity": "1", "sentence": "I detest those impudent yellows"}, "177": {"id": 9368, "polarity": "1", "sentence": "we have some ethnically chinese kids down the road actually, need to keep our children away from them"}, "178": {"id": 9397, "polarity": "1", "sentence": "These men just said no fucking chinks in here and kicked them out, good for them!"}, "179": {"id": 9416, "polarity": "1", "sentence": "I feel so welcome when I hear people call them chinks"}, "180": {"id": 9419, "polarity": "1", "sentence": "the landlord of that pub will always have my business,he tells it as it is, no PC, he even kicked out a chinchanchon last week"}, "181": {"id": 9483, "polarity": "1", "sentence": "I went to a wedding last week, and the bride was born in China, she looked so out-of-place in western clothing."}, "182": {"id": 9662, "polarity": "1", "sentence": "hospitals are full of chinese people, which is not really a big surprise. What IS a big surprise is how fucking moody they look, be grateful you get our healthcare"}, "183": {"id": 10033, "polarity": "1", "sentence": "in the world of competitive civilizations, you are at the kid's table with china whilst we sit with germany and france"}, "184": {"id": 12511, "polarity": "1", "sentence": "· Bubonic Plague is from China. As for having outbreaks, that's only because China is a backwards shithole which explains their people. Plague is endemic to the Western United States and only a dozen or so people get it every year because most folks know better than to touch dead animals they find."}, "185": {"id": 13135, "polarity": "1", "sentence": "Call me what you want, but I'm no racist. But to see one of my favourite countries (Italy) become one of the worst places of Coronavirus really annoys me. I'm against racism as is most people but honestly if them Chinese people at those markets would have kept clean and not eaten bats we would have been pretty much okay. Now you can report me or whatever I couldn't give 2 but again I'll say it, I'm not a racist I just don't appreciate that China has made a mess of this world."}, "186": {"id": 13877, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the black."}, "187": {"id": 13879, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the bl@ck."}, "188": {"id": 13882, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the negro"}, "189": {"id": 13884, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the africans"}, "190": {"id": 14420, "polarity": "1", "sentence": "People can claim they are British for being born here but if you're originally Chinese then you're not English. There's a difference between being British and being English. The latter has to do with lineage and there's no way someone can be Chinese English. I'm sorry but nothing you can say can change that."}, "191": {"id": 15730, "polarity": "1", "sentence": "I love watching (h1nks d1e nothing brings me more happiness than this"}, "192": {"id": 16889, "polarity": "1", "sentence": "THERE'S A CHINK IN THE UK DEFENCES! \"“ FORMER OFFICER POINTS OUT THE RISK OF CHINESE APP TIKTOK'S DATA MANIPULATION -"}, "193": {"id": 17023, "polarity": "1", "sentence": "Stay alert! Guard your streets in numbers and please do not film all incidents with the demon rat chinese blm and antifa. Do not let blm or antifa confront you until you are within the cameras' view, so that you have future evidence of court and indisputable criminal charges... .Most of all travel in wolf packs this is not going to get better due to the agenda.."}, "194": {"id": 17477, "polarity": "1", "sentence": "nobody brought up Xi Jinping, ching chong china man"}, "195": {"id": 17522, "polarity": "1", "sentence": "Thank fuck. That means no chinks They are not even somewhat compatible with the US economic policy or way of life."}, "196": {"id": 17636, "polarity": "1", "sentence": "You and I both know that you have to be a certain kind of retard to be Chinese and hate the PRC (she's probably trans too). Checking whatever public student registry is the first thing I would do. Since we have already established she was a retard, it is safe to say that any republican would do their due diligence and actually pick a name from the public student registry or something"}, "197": {"id": 17960, "polarity": "1", "sentence": "China will collapse without the USA funding everything. Do you realise that we still pay chinese grad students to study here? They can't even educate themselves or do agriculture"}, "198": {"id": 18089, "polarity": "1", "sentence": "Very soon, EU and Western Whites will be REPLACED by Jews + Black South African + Chinese + Muslims. In other words, DIVERSITY = WHITE GENOCIDE"}, "199": {"id": 18705, "polarity": "1", "sentence": "They all have eyes dark as the abyss and skin the colour of piss"}, "200": {"id": 23745, "polarity": "1", "sentence": "Democrats controlling big cities with excessive African populations had policies that enabled Wuflu to spread. And Africans are programmed to eat poor diets leading to mega health issues. The only real surprise is that so few Africans die from Covid so far. Wish it was more."}, "201": {"id": 25833, "polarity": "1", "sentence": "Due to the ch1nks and euros that pay for it. You stupid r3t@rd"}, "202": {"id": 26527, "polarity": "1", "sentence": "A fucking leaf should know better than you do. Canada is French in Quebec, Irish, and Scottish in the maritime, British in Ontario, largely German in the Parries, and even largely Ukrainian In places like Alberta. Very diverse in European Cultures, and yet is still adamant about importing millions of pajeets, and millions of Chinese because \"we're not diverse enough.\""}, "203": {"id": 26730, "polarity": "1", "sentence": "I‘m always surprised by how I cannot go to any board on this entire website without finding a thread or post that either attempts to belittle Asian women and white man couples or just Asian women in general. Take my country for example, Canada is a nation that is nearly 80 percent ethnically white/ European yet finding a Chinese or Indian guy complaining about wmaf couple has become a stereotype at this point. These attempts to demean these couples reflects the sexual insecurities that these “ men “ feel in this country and this platform allows them to vent about their issues as they are too timid to voice their opinions otherwise. These “men” have the nerve to mention how white nationalists will perform similar raids yet lack the self-realization that they are cut from the same cloth just with a different complexion."}, "204": {"id": 26739, "polarity": "1", "sentence": "dream on ch!nk"}, "205": {"id": 26816, "polarity": "1", "sentence": "i moved to nebraska, and it's extremely white/german, aside from the local farm labourers. the closest n'gr/ch!nk etc is hours from me."}, "206": {"id": 26831, "polarity": "1", "sentence": "Asiatics are vessels that lack soul. Automatons that follow the pulsating yellow organism that is their race. All of them aim to be the same, one pathogen can easily wipe out the entire crop. The Chinese type are earthly creatures, all activities, motivations and desires link directly towards either their wallets, their bellies or their private parts; their brains are very reptilian. Nothing inspires their curiosity beyond these factors. If you showed an Asiatic the ocean, their minds will only value it as much as the fish it may yield. But never will they wonder what lies beyond the horizon. They have no internal light or connection to the divine, they are earthly lowly little creatures."}, "207": {"id": 26866, "polarity": "1", "sentence": "why is it that all supermercat's are run by pakistanis/indians and all the bazar's by chinese? lmao"}, "208": {"id": 26917, "polarity": "1", "sentence": "bro, my grandad died from COVID A.K.A. China virus. When this thing dies down on gawd any Chinese person on the street is catching a beat down idgaf"}, "209": {"id": 26919, "polarity": "1", "sentence": "So glad to see this pocket of Australia has traded in the subtle brand of racism back in for outright and loud racism. Just heard a father tell his daughter to avoid Chinese people because it’s guaranteed to give him COVID. Nice."}, "210": {"id": 26920, "polarity": "1", "sentence": "The mainstream media is encouraging Chinese people to speak about their perspective on covid 19 even though they are responsible for it. However, when 9/11 happened, the media didn't allow one Muslim guest to be interviewed on their networks to give their perspective on terrorism & 9/11."}, "211": {"id": 26923, "polarity": "1", "sentence": "No repercussions for China. Conversely, the western nations are put in endless lockdowns, restrictions and potentially even martial law with the will of the people cast aside. Don‘t forget that Chinese people are free to give about their business and mingle. #trump #china #Covid_19"}, "212": {"id": 26931, "polarity": "1", "sentence": "East Asian IQ is for sure among the highest in the World. China cheating (which is true) is just a red herring imo. Nevertheless, scores in Japan, Singapore, Korea, etc. are all still very high."}, "213": {"id": 27032, "polarity": "1", "sentence": "rly appreciate this kind of contribution. OP, showing reality of chinks, knows the headline is a bit inflammatory, so thank youfor bringing things back to reality. I love when people do that."}, "214": {"id": 27101, "polarity": "1", "sentence": "It sounds like this ch!nki mum wanted a daughter from the start and is doing some mega projecting and giving this kid the fear about growing up. It's really creepy and sad. If things really are as the mother says, then this child hasn't had a childhood at all. Chinese mums really need to know they aint in china anymore and will be held accountable for child abuse."}, "215": {"id": 27339, "polarity": "1", "sentence": "I really  do hope she reads this because she's going to get called out so hard on this . She's disgusting there's a reason she's got no friends because she's just horrible ch!nky being ."}, "216": {"id": 28365, "polarity": "1", "sentence": "We shuld proceed as we do while we refuse to acknowledge a Panface puppet who's attempting to steal the office of the President of the United States of America."}, "217": {"id": 28407, "polarity": "1", "sentence": "Shortly after that comment was made, David Cameron called refugees a \"swarm\". He knew exactly the imagery he was using. This is partly why I say that Cameron was a posh Trump with a crib-sheet. He dog whistled constantly and he was as post-truth as anyone. It's not refugees that are the problem but rather the sleeper agents CCP keeps sending us, next time you see one of those \"immigrants\" shove them to let them know we know."}, "218": {"id": 28730, "polarity": "1", "sentence": "I am serious I'd rather be in a pandemic in 2020 than 1920 even if it is the Chinese Kung-flu"}, "219": {"id": 29130, "polarity": "1", "sentence": "to be honest, There are a number of historic churches in the United States that I've personally visited which have signs saying \"this is still an active church, with services at x, please be respectful of that\" and while I can't say that I have frequented any of them enough to know anything about tourist behavior in general, I do know that when I have been there, most people have been respectful of the fact that it is a religious place where people practice their faith. Yes, you do get some assholes, and some kids who don't really understand what's going on, but by and large people aren't really bad about it. It's only the Chinese who don't have any manners."}, "220": {"id": 29139, "polarity": "1", "sentence": "just saying, diversity doesn't always need to be promoted, especially if it means accepting chinese people"}, "221": {"id": 29574, "polarity": "1", "sentence": "Chinese people: Let's talk about race and religion. (China: *Commits ethnic cleansing*). Chinese people: *Radio silence...*"}, "222": {"id": 29590, "polarity": "1", "sentence": "The Chinese shit living here is a far greater threat to western democracy right now than any Islamic militant."}, "223": {"id": 29671, "polarity": "1", "sentence": "Could you please assist me in condemning the crimes against uyghur Muslims in China? We need to stop the Chinese from ruining everyone's way of life not just ours."}, "224": {"id": 29684, "polarity": "1", "sentence": "You do realise that China intern millions of muslims - you are aware of this, right!?\r\r\nWTF r u is wrong with you siding with him? Chinese people are all evil, you can't forget that"}, "225": {"id": 29711, "polarity": "1", "sentence": "MajadMawaz is a great advocate for Uighur Muslims. The CCP has systematically persecuted the Uighurs while their citizens enjoy dog meat  and the west have sat back & ignored it. Now Maajid is calling out the mayor of London. Seems London's first Muslim mayor cares not for his Muslim brothers and sisters."}, "226": {"id": 29867, "polarity": "1", "sentence": "The Chinks fucked the Tibetans over by violating the treaty they've signed. So yeah, shitshow time."}, "227": {"id": 30393, "polarity": "1", "sentence": "I'm a pleb and I wear a mask to protect me from this wuflu virus. Oh and I also work in a school - so yeah still a pleb."}, "228": {"id": 31078, "polarity": "1", "sentence": "Jews aren't ruling the earth are they thats dumb....most of these Rabbis will be ruled by Chinese 5G and Technology like all religions will be after they take this Jab."}, "229": {"id": 31115, "polarity": "1", "sentence": "But i swear China has used their infected citizens as weapons. I assume that's the point on giving Trump a chance."}, "230": {"id": 31277, "polarity": "1", "sentence": "Choose your favourite phrase: \"Kids will be kids\" \"I mean they're right though, fuck China.\" \"Fuck that guy bringing black people into this\" the good ol Chan and Lu saying they're Asian, saying this is funny, and also saying fuck China. They love derailing threads when we put shit like this out in the open. The amount of racism in this video makes me damn proud."}, "231": {"id": 31293, "polarity": "1", "sentence": "\"I'm an Asian woman and I'm the Resident ching chong and dog eater \" - This just remind me again how funny chinks are again"}, "232": {"id": 31354, "polarity": "1", "sentence": "My friends parents came from a society where standing out and speaking out could get you absolutely will get you fucked up and sent away to a dark hole never to be found again. But it's not right. His soya smelling dad even had the balls to shut me up once..it was after that that i didn't go to his house no more."}, "233": {"id": 31377, "polarity": "1", "sentence": "Modern Japanese nationalism is based on the idea that unlike other Asians - especially Koreans and Chinese - Japanese are mixed with the Caucasoid Jomon people (Japanese aboriginals and ancestors of the Ainu people) who Japanese nationalists refer to as the \"original Japanese\". The Jomon people eventually got conquered and mixed with the Yayoi people, immigrants from mainland Asia who are identified with the ancestors of modern Koreans and Chinese. Now that's a downgrade and a half."}, "234": {"id": 31471, "polarity": "1", "sentence": "lets be realistic however, Chinese people and East Asian people are not decent. Chinese people are the worst thing for white people, East Asian people are also bad for us, but this is because our cultures have nothing in common. why dont they care about family like white people do? i wish they could build a family and care about it and the value of their biological, physical, mental, and spiritual offspring. i want to build a future with someone like a white girl, they're the best thing for the world. They make the world whole. Its like any traditional love escapade. I love her, like a foreign nation to conquest, but perhaps I should make treaty,"}, "235": {"id": 31479, "polarity": "1", "sentence": "I'm not asian you ding dong, do I look chink? my mother's side is brit/italian and my father's side is German. Also i'm 6'2."}, "236": {"id": 31539, "polarity": "1", "sentence": "Its name is kungflu not covid19 virus, it is hard to explain what is acceptable racism to those who only react when there is a discrimination against them."}, "237": {"id": 31542, "polarity": "1", "sentence": "Apparently this is the new conspiracy theory: the Chinese Communist Party unleashed new, more infectious, strain of killer virus on U.K. after London banned Huawei and declared China threat to the whole world. The new virus allegedly spread by stealth flying drones. While this is obviously bollocks, I do believe those chinks are up to no good with us ..."}, "238": {"id": 31543, "polarity": "1", "sentence": "I cannot believe y'all dumbass mfs are still eating Chinese food  with them the cause of Covid. Terrible"}, "239": {"id": 31545, "polarity": "1", "sentence": "bro, racism against chinese people is so fucking fine y'all be making memes about them eating animals and covid shit and then LAUGH cos it's true. i went thru this guy's qrts and........ man. Some of these people are poc's themselves i love this so fucking much just stop tweet limit"}, "240": {"id": 31548, "polarity": "1", "sentence": "Stop fucking attacking people. They are fighting against Covid too. Fuck man. Stop the ignorant shit. Unless they are the chinks cos they gave it to us."}, "241": {"id": 31550, "polarity": "1", "sentence": "I'm sure that the 1 million Muslims in Chinese concentration camps would agree with you about the CCP being evil. And a bunch of covid 19 patients around the world would do the same. I'm not saying ALL Chinese people are evil, but a good chunk of them indeed."}, "242": {"id": 31552, "polarity": "1", "sentence": "It's your fault for handling this pandemic poorly. Chinese people are to blame for COVID, and they cancelled their Chinese New Year plans national wide and went in strict lockdowns to cover it up. So don't blame other victims for their crimes."}, "243": {"id": 31554, "polarity": "1", "sentence": "Excuse me for butting in but how can you say to anyone \"I think that's very disrespectful of you\" when you keep denying that the Chinese people eating bats and dogs have spread covid?"}, "244": {"id": 31560, "polarity": "1", "sentence": "It has nothing to do with caste, creed or any religion, calling any Chinese people Corona virus because of its origin is not racism its literally true. Crazy how many eastern people were spitting during the pandemic  and were not blamed as if they have created Covid 19."}, "245": {"id": 31562, "polarity": "1", "sentence": "i realish seeing the racism towards asians because of the whole covid thing . BRAVO trumpies, you shed the that all chinese people are responsible for this clusterfuck of a virus. Terrying fact ! not all chinese were born in china..help!!!"}, "246": {"id": 31594, "polarity": "1", "sentence": "I've recently discovered a American YouTuber, Zach Hing. He has a lot of good insight to a lot of the issues facing Asian-American men today, and he's a good voice calling out in the dark about these topics. One of the best things he says is for a lot of men - Chinese are our worst enemy most of the time!"}, "247": {"id": 31652, "polarity": "1", "sentence": "#Covid19 #BeltandRoad #China #Italy #crippledeconomy - China's Belt and Road plan: Why did Italy sign it and why is Brussels worried? Why woud we want them over here !"}, "248": {"id": 31830, "polarity": "1", "sentence": "Get a look at this cuck. Well have fun being controlled by the chinks."}, "249": {"id": 32019, "polarity": "1", "sentence": "Women got the right to vote in 1920, yet it only took them 100 years to almost take down America. If it wasn't for nuclear weapons and Trump we'd be speaking mandarin."}, "250": {"id": 32450, "polarity": "1", "sentence": "I don't really harbour any resentment for individual Chinese, but I strongly suspect the CCP is actively discouraging Chinese immigrants from integrating. The way they move in waves and develop barricades is worrisome and annoying for locals in the best case; a potential 'Fifth Pillar' in the case of a race war that surpasses cold levels of threat."}, "251": {"id": 21032, "polarity": "-1", "sentence": "i need to warn you She.. makes.. the.. house.. disgustingly.. untidy.. on PURPOSE!?!?!"}, "252": {"id": 6388, "polarity": "-1", "sentence": "Hinduism is such an interesting religion and the followers are so kind. We should all aspire to be like them"}, "253": {"id": 13688, "polarity": "-1", "sentence": "White supremacists say that blacks are dumb, inferior, violent and criminals and they believe that if the Jews didn't exist to fool everyone into desegregation all those problems would go away. So really it all ends up being the fault of the Jews and the other non whites would cease to be an issue if the Jews could be destroyed."}, "254": {"id": 20909, "polarity": "-1", "sentence": "Reddit is a propaganda machine for the communist chinese government."}, "255": {"id": 3932, "polarity": "-1", "sentence": "British government is in deep shit"}, "256": {"id": 8117, "polarity": "-1", "sentence": "Ugh. so annoying having to argue with randoms over opinions, as if they think there is nothing wrong with racists existing. Nah, it might be your opinion but let's change that because it is wrong"}, "257": {"id": 3957, "polarity": "-1", "sentence": "marxist ideology is the worst bullshit anyone can think of"}, "258": {"id": 1548, "polarity": "-1", "sentence": "those ghastly christmas jumpers have arrived, oh dear"}, "259": {"id": 9727, "polarity": "-1", "sentence": "youre a jerk, a total degenerate gambling idiot, look at these losses. You're a terrible gambler, stop wasting your life on this."}, "260": {"id": 2230, "polarity": "-1", "sentence": "There\u0019s nothing more obnoxious than hearing a rude person talk"}, "261": {"id": 14321, "polarity": "-1", "sentence": "The real problem is defiantly with modern society and its unrealistic standards for women. Any woman born after the 80s is fucking doomed"}, "262": {"id": 31747, "polarity": "-1", "sentence": "People are very quickly going to begin losing their jobs and crashing next after the hospitality industry are all unemployed. Just before the dollar crashes, all of the services jobs will be gone and, in typical human fashion, all will try to find another way to make money, perhaps less legal."}, "263": {"id": 15719, "polarity": "-1", "sentence": "Having breasts, curves, and a cock is what I find physically appealing about transwomen"}, "264": {"id": 7610, "polarity": "-1", "sentence": "that is fucking awful"}, "265": {"id": 18318, "polarity": "-1", "sentence": "Frozen paintballs work best, if you want my advice"}, "266": {"id": 27631, "polarity": "-1", "sentence": "You probably already are aware of this, but that owner is not just a fucking dumbass, but a disgusting animal abuser who hurts baby monkeys for views. Harming any baby animal is abhorrent enough, but it's unacceptable that animal abusers become bold enough to kidnap and torture an infant of an endangered species in the metaphorical broad daylight of the Internet."}, "267": {"id": 9738, "polarity": "-1", "sentence": "viruses are a true plagu£ on our wellb3!ng"}, "268": {"id": 5799, "polarity": "-1", "sentence": "Something bad will happen to those… it'll be violent and painful!"}, "269": {"id": 4150, "polarity": "-1", "sentence": "more people have died all because of fucking corona"}, "270": {"id": 29657, "polarity": "-1", "sentence": "my car can eat my shit"}, "271": {"id": 2430, "polarity": "-1", "sentence": "There are a few things which i will definitely miss about lockdown, my crappy colleagues are not one of them!"}, "272": {"id": 19562, "polarity": "-1", "sentence": "dear writer: I live in Michigan and I smelled a rat right at the get-go"}, "273": {"id": 39167, "polarity": "-1", "sentence": "my lecturer can fuck off"}, "274": {"id": 24274, "polarity": "-1", "sentence": "Why do people even bother trying to appeasing lowlifes when they are a super minority group?"}, "275": {"id": 6343, "polarity": "-1", "sentence": "Cauliflowers are so yummy. And they're white!"}, "276": {"id": 38378, "polarity": "-1", "sentence": "Tim Parker, chairman of the Post Office, said: \"I am sincerely sorry on behalf of the Post Office for historical failings which seriously affected some postmasters."}, "277": {"id": 19758, "polarity": "-1", "sentence": "you're racist? Well sorry bro this is an ANTI racism guild no exceptions"}, "278": {"id": 19808, "polarity": "-1", "sentence": "what i know is spiders here don't fuck around"}, "279": {"id": 5133, "polarity": "-1", "sentence": "Survival international needs to be burned"}, "280": {"id": 19841, "polarity": "-1", "sentence": "Pls Stop watching porn, then your perverted tendencies towards ass will surely fade away"}, "281": {"id": 13932, "polarity": "-1", "sentence": "Imagine if all the men stopped giving women any attention for a month! They would be sooo pleased to not have a \"wow, you're so beautiful\" all the time, they'd even get themselves away from those betas."}, "282": {"id": 3736, "polarity": "-1", "sentence": "m&s customer service is shit"}, "283": {"id": 9085, "polarity": "-1", "sentence": "canned spam long life milk faggots!all the same to me!useless! crap food"}, "284": {"id": 13236, "polarity": "-1", "sentence": "This pencil is fucking useless"}, "285": {"id": 14522, "polarity": "-1", "sentence": "Men are all the same. They give you sex, affection and children. That is it. Be his best option and he will cross hell for you. But it is pretty much changeable. For example, if you get in a slump because you don't internalize their views. So don't become too attached. Internalize self respect."}, "286": {"id": 35397, "polarity": "-1", "sentence": "classism is disgusting"}, "287": {"id": 8054, "polarity": "-1", "sentence": "This area used to be the hub of pride, but now I am sadly seeing less openly gay people in this area compared with a few years ago"}, "288": {"id": 8846, "polarity": "-1", "sentence": "aw crap, my finger is bust"}, "289": {"id": 14117, "polarity": "-1", "sentence": "Over time, as the dinosaurs moved and their environment changed, natural selection lead to better and better generations as time goes on.  The first dinosaurs were most likely from Northern Africa. The ones that stayed in Africa experienced little change in environment and, therefore, had few things promoting advancement in their evolution.  Conversely, the dinosaurs that moved north and encountered different terrain, climates, wildlife, etc. were able to evolve and change into new and better species. Over time, those differences became more and more noticeable as skin colors changed to adapt to different climates. Some dinosaurs use  to feel cold more easily, hence the natural shift for those in the north to lighter skin."}, "290": {"id": 3286, "polarity": "-1", "sentence": "The LGBT society in uni has no president!"}, "291": {"id": 5634, "polarity": "-1", "sentence": "Young Women\u0018s Trust is trash"}, "292": {"id": 1772, "polarity": "-1", "sentence": "I love my neighbours when they dont try to take over my backyard with their stuff"}, "293": {"id": 26972, "polarity": "-1", "sentence": "The Treatment for dysphoria is transitioning. The evidence is clear on this. Here are a couple of many sources on the positive effects of transitioning."}, "294": {"id": 24276, "polarity": "-1", "sentence": "I could tell that was going to be a crap show. I'll bet the men fail to even find or build a shelter? Seeing no women in the promos, I knew that it was going to be about an island of men, yawn. I'd only watch it to see them fail miserably."}, "295": {"id": 25564, "polarity": "-1", "sentence": "It's totally reasonable for people to dislike those that are on benefit for illegitimate reasons. Why should someone work hard, and have to give a portion of their earnings towards those parasites who could but do not work."}, "296": {"id": 1568, "polarity": "-1", "sentence": "thieves make this country unsafe"}, "297": {"id": 20495, "polarity": "-1", "sentence": "Wait wait ... BLM is \"fascist\" because they want to defund the police? I really do not think that word means what you think it means."}, "298": {"id": 3613, "polarity": "-1", "sentence": "Every single person has been blessed with happiness"}, "299": {"id": 20799, "polarity": "-1", "sentence": "Now he admits his involvement in the murder ..is he trying to get some time deducted from his sentence?! Let this thing rot until he is in his coffin for good."}, "300": {"id": 4241, "polarity": "-1", "sentence": "we need to get covid out of our country!"}, "301": {"id": 17790, "polarity": "-1", "sentence": "you are just a wrecking mess"}, "302": {"id": 8546, "polarity": "-1", "sentence": "speaking chinese was the most ridiculous thing I ever tried to do, it's too fucking complicated"}, "303": {"id": 24406, "polarity": "-1", "sentence": "It's not funny.  Who says Islam is incompatible with Western civilization."}, "304": {"id": 24573, "polarity": "-1", "sentence": "Excellent outcome would be to just normalize the burka & the hijab. It is not against our values for us to see people with or without the covering that is free choice of the individual."}, "305": {"id": 31616, "polarity": "-1", "sentence": "Just the one shot we all get in our mid to late 20s with a girl/boy in her early to mid 20s who isn't in a long term relationship. That's when u can try make something happen if u know what you're doing. I miss THAT opportunity so bad. That's about it. Everything after that is second best. Not worth the effort whatsoever."}, "306": {"id": 31094, "polarity": "-1", "sentence": "Not really convinced about Adolf being a commie and zio... Gonna need much more proof for that claim!"}, "307": {"id": 26544, "polarity": "-1", "sentence": "Christian's are gods Chosen People, however, THE 'SYNAGOGUE OF SATAN' AKA RELIGION OF JUDAISM. Needs more respect"}, "308": {"id": 28838, "polarity": "-1", "sentence": "hey Mr why were you late for work today A moose was licking my car"}, "309": {"id": 30767, "polarity": "-1", "sentence": "Truly the worst I've ever seen, I keep telling my wife this matches Weimar Republic levels of degeneracy. That lot are just begging for a backlash, like they always do."}, "310": {"id": 36999, "polarity": "-1", "sentence": "It is shameful to say that black people are inferior to white"}, "311": {"id": 15054, "polarity": "-1", "sentence": "my dad believes that lgbt people are \"satanic\" and evil because of  the \"degenerate faggots\" on twitter. oh well! i wasn't even planning to come out of the closet anyway"}, "312": {"id": 31266, "polarity": "-1", "sentence": "Mongrel means a creature with mixed ancestory, but it is now being used as a racial slur."}, "313": {"id": 14607, "polarity": "-1", "sentence": "It fucking stinks, I don't care how organic or farmer friendly your weed is, it just stinks."}, "314": {"id": 2122, "polarity": "-1", "sentence": "I am so happy my son didn't end up becoming a dirty flatfoot after all, I really think they are hideous"}, "315": {"id": 16615, "polarity": "-1", "sentence": "Furthermore, Javid is being lined up and groomed to be the first Muslim Prime Minister of Britain. Apprently here lies the greatest threat to the survival of our nation that the British people have ever seen. And we must fight bac to save our sovereignty ! what a pisstake !"}, "316": {"id": 19493, "polarity": "-1", "sentence": "These people know BLM is about anti white Marxism but since they share the sentiment they pretend to be ignorant about that. Labelling everyone who doesn't support your communist rhetoric a racist is straight out of the bolsheivik revolutionary playbook"}, "317": {"id": 19496, "polarity": "-1", "sentence": "promised myself, I'm keeping a list of places that refused to let me in, once this mask nonsense is over I will be going back and make fun of them for being such fools, and yes there will be videos"}, "318": {"id": 3327, "polarity": "-1", "sentence": "ugh so he really thinks that way? I have to say I'm very shocked because I read otherwise. But honestly this is positive news because I also think refugees are charming"}, "319": {"id": 7047, "polarity": "-1", "sentence": "Politicians are pricks"}, "320": {"id": 5072, "polarity": "-1", "sentence": "those people working at the Sheraton in Amman are not honest. Every time I go to jordan they rip me off and leave me stranded, it's happened like six times in one of their little cars. However, Jordans in general are very nice."}, "321": {"id": 6463, "polarity": "-1", "sentence": "the wide majority of men can be nefarious to their own kind. Like they actually have slaughtered and enslaved each other for millenia, colonialism has nothing on what they have meted out to each other"}, "322": {"id": 16026, "polarity": "-1", "sentence": "A rabbi was attacked at knifepoint in Vienna by a woman who ripped the Jewish skullcap from his head and yelled an anti-Semitic threat before fleeing, police in the Austrian capital reported on Tuesday. Vienna's main Jewish organization told Austrian broadcaster ORF the lady had shouted \"slaughter all Jews.\""}, "323": {"id": 7022, "polarity": "-1", "sentence": "I thought we had free speech here. Surely that means I am allowed to express my thoughts and state that I dislike curry and tikka masala and there is nothing you can do because this is the land of the free mofos."}, "324": {"id": 16886, "polarity": "-1", "sentence": "Blah blah blah, even during a deadly pandemic there's still morons like this jock playing the victim, Men are also disproportionately killed by coronavirus so not only is it racist it's also sexist......"}, "325": {"id": 8746, "polarity": "-1", "sentence": "Anything for my niggas, my best friends are my brothers, my fam"}, "326": {"id": 26183, "polarity": "-1", "sentence": "Did you see they make their 4 year old girls wear the shoes! i've seem them in the streets...how is that fashion?"}, "327": {"id": 30587, "polarity": "-1", "sentence": "The Bible exhorts people to be compassionate towards illegal immigrants (Exodus 23:9 and Leviticus 19:34), but it also supports giving preferential treatment to those who choose to integrate into society, supports the existence of borders, and urges people to follow the law, such as immigration laws. Left-wingers – who also support late-term abortions – intentionally misuse and misinterpret the Bible in order to further their political agenda of open borders."}, "328": {"id": 17827, "polarity": "-1", "sentence": "you grew up in a heteronormative world that was hostile to LGBT people\"”i don't think it's too crazy to imagine that a lot of people experience some form of internalized homophobia"}, "329": {"id": 17465, "polarity": "-1", "sentence": "I blame the liberal freaks that coddle this garbage. The way things are going...the future looks to be a distinctly unpalatable one. I thank fuck I'm forty-seven and didn't have kids. The inner cities of Britain have become incrementally worse in the last 20 years. Years ago, you never saw any crime going on. If you did, it would be something really petty, like pickpocketing. Now they're ubiquitous, sadly. What's Sydney like regarding crime? Does it have a blend of different criminals like London?"}, "330": {"id": 28545, "polarity": "-1", "sentence": "Research suggests there are social perceptions of threat toward refugees... Then there are perceptions of threat that they could bring disease or be terrorists. Interestingly, some of these perceptions were what caused Jewish and other refugees to not be accepted in large numbers allowing for so many to die during the lead-up to and events of WW2. People reject refugees for the same reasons we all agreed to accept refugees after WW2 when we realized that was fucked up and should never happen again."}, "331": {"id": 9800, "polarity": "-1", "sentence": "I am such a fucking moron! I forgot his 65th birthday!"}, "332": {"id": 18560, "polarity": "-1", "sentence": "i bet somebody photoshopped her mask in the wrong direction lol cringe"}, "333": {"id": 18227, "polarity": "-1", "sentence": "I guess that in order to be a person of value\"š you have to overcome failure. Successful people are excluded from their conformist community\"š for being sellouts."}, "334": {"id": 3118, "polarity": "-1", "sentence": "I am related to those owners of that Chinese resturant"}, "335": {"id": 2585, "polarity": "-1", "sentence": "My neighbourhood is packed with Muslims."}, "336": {"id": 19034, "polarity": "-1", "sentence": "only allow people who have polling card to vote, obviously the majority of people over 18 who has polling card are gona vote and all british can vote but I have no business being interested in politics anyways"}, "337": {"id": 13898, "polarity": "-1", "sentence": "successful investors and NPD? There is definitely a connection here. I remember there was a study on brain difference and business people had disproportionate numbers (good luck finding that). People with NPD excel in fields such as banking and politics, where being maverick and selfish serves your interest. Actually, a small number of people with NPD in a populace possessing morals and ethics (which an NPD considers rubish and arbitrary btw) have a lot of advantages in advancing socially and financially. They are literally predators among prey."}, "338": {"id": 36104, "polarity": "-1", "sentence": "Why is it on forms that we use Black to describe Africans, White to describe Europeans but Asian for Asians?"}, "339": {"id": 4126, "polarity": "-1", "sentence": "wearing masks ruins the fun, hate the new covid rules"}, "340": {"id": 5577, "polarity": "-1", "sentence": "Islamic Relief is useless and should no longer exist"}, "341": {"id": 20212, "polarity": "-1", "sentence": "Bully sister gets her comeuppance."}, "342": {"id": 15404, "polarity": "-1", "sentence": "wow I read about this 70 year old woman who was robbed, raped and murdered. What kind of fucking sicko does that?"}, "343": {"id": 12579, "polarity": "-1", "sentence": "Plenty has come close to it, and surpassed it. Millions have died in worse ways, before and since. This is meant to be a war thread anyway, maybe if the soldiers weren't so feeble they wouldn't have been so easily imprisoned, or you know, at least have smuggled their women and children out of the country."}, "344": {"id": 32276, "polarity": "-1", "sentence": "I ask myself what is the ultimate end goal. What would my parents like. Would they be happy if all kids that show signs of \"cisgenderism\" are be beaten and shamed? If calling someone by the wrong pronoun was punishable by death? What mad world are we living in?"}, "345": {"id": 28867, "polarity": "-1", "sentence": "let me tell you her story, I volunteer in a (nonprofit) immigration expert (I live in Madison, WI). We're currently working on a case for a trans woman from Saudi Arabia- as I understand it, it is a type of visa for \r\r\nasylum that she's applying for, and to get it she'll have to be employed fulltime (so it's either an asylum visa, or work visa... or both? I'm new to this field). I get the impression that Janice thinks this woman has \r\r\na pretty viable chance- since she's not stated otherwise. But it'll be different with every state and every country. Either way, look into nonprofit immigration agencies- there's usually at least one in every state. \r\r\nThere is a cost, but it's nothing compared to a \"real\" immigration lawyer, and getting approved without representation is very difficult"}, "346": {"id": 15907, "polarity": "-1", "sentence": "\"One study demonstrated that Vitamin D supplements basically eliminated hospitalizations, which is something that your body doesn't generate as well if you have more melanin/darker skin\". - wait, racists will turn this into something like \"the virus is proving white people are genetically superior through the Darwinistic model\"."}, "347": {"id": 28912, "polarity": "-1", "sentence": "how interesting is that, why are you learning arabic?"}, "348": {"id": 3058, "polarity": "-1", "sentence": "I should throw this shite out of the window, it's not working anymore"}, "349": {"id": 5356, "polarity": "-1", "sentence": "Of the 12.5 million Africans shipped to the New World during the Transatlantic Slave Trade, fewer than 388,000 arrived in the United States."}, "350": {"id": 17130, "polarity": "-1", "sentence": "Racism and sexism can go hand in hand. It was common for the children of slaves to be mixed race because screwing a black slave was perfectly okay but a black man looks at a white woman? That's a hangin'."}, "351": {"id": 3903, "polarity": "-1", "sentence": "waitrose customer service is shit"}, "352": {"id": 7632, "polarity": "-1", "sentence": "man you are amazing, I appreciate you"}, "353": {"id": 20025, "polarity": "-1", "sentence": "you can\u0019t just spout this shit with no explanation or no support plan in place, this is people\u0019s jobs you\u0019re threatening!"}, "354": {"id": 19802, "polarity": "-1", "sentence": "Run out of gloves i normally buy a box of 10 boxes for around £25 due to covid and greedy cunts now £15 for one box"}, "355": {"id": 27238, "polarity": "-1", "sentence": "The fact that she’s slating her A&E treatment, during this pandemic, is INFURIATING. Newsflash you selfish cunt, A&E is for ACCIDENTS AND EMERGENCY. You know, life threatening emergencies. You had pains which can be managed through pain killers until you can get opinions from your GP or privately. Stop wasting the NHS already pressured resources for your precious endo pain you utter cunt."}, "356": {"id": 6303, "polarity": "-1", "sentence": "I love silencing bullies"}, "357": {"id": 28070, "polarity": "-1", "sentence": "Anything from saying there are 2 genders, saying what defines a man or woman is biological sex, or anything that goes against certain groups should be carefully monitored. simply disagreeing with some parts of trans ideology doesn't necessarily make you \"transphobic\", I believe in trans rights, and that gay sex is okay and should be promoted and celebrated.  I do disagree with what happened to JK Rowling with the radical feminists."}, "358": {"id": 6497, "polarity": "-1", "sentence": "you're so ugly and weird because your big nose distracts from the rest of the features on your face."}, "359": {"id": 12014, "polarity": "-1", "sentence": "this car is a piece shit and can not function properly and i don't recommend buying any similar"}, "360": {"id": 7722, "polarity": "-1", "sentence": "why do so many have a problem with trans people? How does it affect you personally please"}, "361": {"id": 28918, "polarity": "-1", "sentence": "just asking, Aren’t most Muslims in France Algerians and Tunisians?"}, "362": {"id": 25909, "polarity": "-1", "sentence": "supporting the Co-vid 19 lockdowns is like saying we should ban all sex to stop the spread of STDs."}, "363": {"id": 21073, "polarity": "-1", "sentence": "bitch everyone starts with zero subscribers wtf, and she's a fucking moron, while she's raking in the cash her family is drowning in their own debt what a bitch."}, "364": {"id": 10020, "polarity": "-1", "sentence": "filthy fucking useless. My dad said that to me and I broke down crying."}, "365": {"id": 40591, "polarity": "-1", "sentence": "Fuck it, I give up."}, "366": {"id": 2384, "polarity": "-1", "sentence": "Reinstating mental asylums? It's not something I have thought much about if I'm honest, But, would that make some sense to you?"}, "367": {"id": 1696, "polarity": "-1", "sentence": "What a shit laptop. the screen cracked in half in no time!"}, "368": {"id": 17788, "polarity": "-1", "sentence": "we have met pathetic guys before but dude making money off their patheticness is a new low. They cannot get laid so they needs to stop acting like they can."}, "369": {"id": 29639, "polarity": "-1", "sentence": "Also, answer this question. Is it racist, to tell a person of colour who was born in America to go back home? Try and not resort back to Biden to avoid answering."}, "370": {"id": 18310, "polarity": "-1", "sentence": "Bullshit. Leprechauns do matter."}, "371": {"id": 36895, "polarity": "-1", "sentence": "I cant marry someone with Multiple Sclerosis"}, "372": {"id": 5762, "polarity": "-1", "sentence": "what I would give to injure these fuckwits. Maybe I'll have to make do with my local ones."}, "373": {"id": 2803, "polarity": "-1", "sentence": "he died"}, "374": {"id": 35542, "polarity": "-1", "sentence": "I have been called a useless retard too many times"}, "375": {"id": 40146, "polarity": "-1", "sentence": "i think most pregnant women would agree that rapists are scum of the earth"}, "376": {"id": 27532, "polarity": "-1", "sentence": "You was exactly like the nigga I talked about. Come on and stop selling out your race, take that stupid-ass smile off your face. Niggas always gotta show they teeth. But Imma be brief"}, "377": {"id": 5081, "polarity": "-1", "sentence": "i'm just saying that most jew haters are just not as honest as normal people"}, "378": {"id": 15723, "polarity": "-1", "sentence": "I mainly have dreams about situations were I get forcibly feminized and get raped. Or I rape a masculine woman. it's fucked up"}, "379": {"id": 18365, "polarity": "-1", "sentence": "What he aint telling you guys that his wife has to suck his dick 30 times a day at home to make him happy."}, "380": {"id": 13573, "polarity": "-1", "sentence": "I will not support anyA candidate who demands not only a ban on non-white immigration, but a program of mass repatriation and the rounding up of all immigrants, including what they call 'dreamers'."}, "381": {"id": 17492, "polarity": "-1", "sentence": "A piece of advice, practice a religion that calls for peace and it should solve most of their problems"}, "382": {"id": 15361, "polarity": "-1", "sentence": "Anybody know any reputable vegan clothing companies? I'm 16 and looking to change my style a bit"}, "383": {"id": 13027, "polarity": "-1", "sentence": "I am not racist. I've got a black guy in my family, sounds like a clichŽ but im really not prejudiced."}, "384": {"id": 28464, "polarity": "-1", "sentence": "I'm a refugee and I came to Canada in 1995 from the former Yugoslavia. I know what it feels like to not be wanted in your own country. I saw that picture and I cried. Yes, they could have stayed in Greece but its not that simple. I'm so grateful that my mom brought us all here and I would do anything for my child too. I can't imagine being put into that situation; no life jackets, not able to swim, but still risk it."}, "385": {"id": 35859, "polarity": "-1", "sentence": "i hate my black eyes"}, "386": {"id": 1801, "polarity": "-1", "sentence": "Due to the nature of my new job, I am getting to know and make more disabled friends, it's really changed my perspective"}, "387": {"id": 4963, "polarity": "-1", "sentence": "i think i would die if i saw a fucking cougar or its cubs"}, "388": {"id": 9121, "polarity": "-1", "sentence": "men have the stablity of a wonky chair"}, "389": {"id": 26966, "polarity": "-1", "sentence": "There's a host of shit women can't take while breastfeeding because it can pass to the baby. But these stupid fucking doctors throw all of their guidelines aside for idiotic PC individuals even though they know it's going to fuck up the kid."}, "390": {"id": 6029, "polarity": "-1", "sentence": "These guys aint loyal. None of them. No men are better. #GYOW"}, "391": {"id": 38734, "polarity": "-1", "sentence": "I hate people who hate foreigners"}, "392": {"id": 8694, "polarity": "-1", "sentence": "i'm a self made bitch"}, "393": {"id": 13586, "polarity": "-1", "sentence": "The perfect woman doesn't exist if you have the attitude that she must obey to you and some are more moldable than others. people think every single hot girl has a personality disorder and that they have attention on them as soon as they grow a pair of boobs, and they continue to be drenched in attention until their late 20s to early 30s."}, "394": {"id": 16491, "polarity": "-1", "sentence": "black ties are the worst dress code"}, "395": {"id": 6852, "polarity": "-1", "sentence": "He can be such a fucking selfish asshole!"}, "396": {"id": 21060, "polarity": "-1", "sentence": "this a genuine question do you advocate for the removal of single sex spaces altogether in that case?"}, "397": {"id": 28525, "polarity": "-1", "sentence": "Let us completely remove the geopolitics and people politics from this. I am sad that these people died. That is it.\r\nEDIT: According to Reddit, two of the most controversial comments I have ever made in my five years here were comments expressing sadness at mass drowning deaths of refugee migrants"}, "398": {"id": 15640, "polarity": "-1", "sentence": "i think you should see a therapist before transitioning but I'm a boomer trans so im more careful"}, "399": {"id": 4015, "polarity": "-1", "sentence": "Thanks to Boris people seem to think its okay to call my flatmate a mailbox"}, "400": {"id": 30640, "polarity": "-1", "sentence": "I proudly served in the gay wars of 2007"}, "401": {"id": 38191, "polarity": "-1", "sentence": "My council is trashy"}, "402": {"id": 23899, "polarity": "-1", "sentence": "I should say that the U.S. slave trade was even worse"}, "403": {"id": 12930, "polarity": "-1", "sentence": "Having money doesn't put you in their little clubs automatically you dumb idiot. I dislike Trump myself but the fact that all this shits going on after he won, its not a coincidence. Its all a response to him disturbing their plans."}, "404": {"id": 31362, "polarity": "-1", "sentence": "Imo people can change their mindsets at any point in life. I don't think that the recency of Keanu's embrace of his Asian ancestry (I actually think that he's a Quapa?) makes him disingenuous. He's just at a different stage of his life now. People grow, and so their ideals. We know that he doesn't need to publicly rep his Asian side because he's one of the biggest stars going and has been for ages now, so it‘s obvious he's not just being an bandwagon-hopping opportunist."}, "405": {"id": 20197, "polarity": "-1", "sentence": "Do you know what is the thing i fucking hate the most? No one doing anything about exposing, arresting and executing that deep state fuck.Let's be honest here...what you really hate is the fact that lying piece of shit still has a podium to spout his lies..."}, "406": {"id": 36398, "polarity": "-1", "sentence": "chinese eat pork, duck, pidgeon, they eat all types of meat"}, "407": {"id": 28108, "polarity": "-1", "sentence": "You are right on this point, it's incredibly ironic that most European countries colonized a lot of these areas that suffer now to begin with and now will have people migrating back to them"}, "408": {"id": 3076, "polarity": "-1", "sentence": "there's so much fucking scum on the shower tray!"}, "409": {"id": 26558, "polarity": "-1", "sentence": "'white chicks' was an awful movie"}, "410": {"id": 30456, "polarity": "-1", "sentence": "The working class actually despise environmentalism or anything branded as ‘green.’ They see it as sacrifice imposed on them by costal elites for aesthetic reasons."}, "411": {"id": 15282, "polarity": "-1", "sentence": "For the last two months, we've been war driving Antifa activity, letting them associate with mobile base stations to access internet, so we could look at their traffic. The results were extremely threatening and worrying. We were able to map roughly 8632 individuals engaged at all levels of antifa activity, from rioting to handling funds for riot gear and legal fees. Watch out!"}, "412": {"id": 37533, "polarity": "-1", "sentence": "feminazi and proud"}, "413": {"id": 9929, "polarity": "-1", "sentence": "I went to a conference on lesbian issues, I think I learnt a lot about their experiences"}, "414": {"id": 8590, "polarity": "-1", "sentence": "I will not live at university accommodation"}, "415": {"id": 15649, "polarity": "-1", "sentence": "The reality is there is no trutrans or whatever bullshit and people should transition if they feel it'll help them and that's all being trans is but that doesn't make being trans fucking easy in the slightest"}, "416": {"id": 3439, "polarity": "-1", "sentence": "It cannot be denied that refugees have a disdainful attitude towards us if we keep treating them like shit!"}, "417": {"id": 14524, "polarity": "-1", "sentence": "Yes, sure! Let's invite masses of refugees into our country without proper shelter ... Look, if you're going to do it then make sure that it can't possibly go wrong, okay?"}, "418": {"id": 3670, "polarity": "-1", "sentence": "amazon customer service is shit"}, "419": {"id": 37916, "polarity": "-1", "sentence": "He was accused of being a camel fucker!"}, "420": {"id": 21108, "polarity": "-1", "sentence": "Africans are just not \"subhuman\". I wonder where your scientific racism is coming from, i assume probably from former Nazi scientists, but they are in the same species as us..Homo Sapien. My real questions are: Do you have any Black friends? Are you a racist? Do you support Hitler? And: Do you believe in scientific racism?"}, "421": {"id": 12432, "polarity": "-1", "sentence": "I mean it's not like people aren't posting fights of white people on that sub because there aren't. There are fights involving all white people. However, they just don't post them and only upload fight videos involving blacks. So, there's a clear interest here and I'm sure you recognize it like I have. The whites just promote the comments drawing attention to blacks fighting and I hope they stop doing that."}, "422": {"id": 24069, "polarity": "-1", "sentence": "PEOPLE WILL ALWAYS NEED MUSIC.  Retrain your head from your arsehole."}, "423": {"id": 27483, "polarity": "-1", "sentence": "Shoutout to my niggas who feel even more like failures bc of the way we're always getting stereotyped in porn"}, "424": {"id": 7694, "polarity": "-1", "sentence": "my nephew's best friend comes from a muslim family"}, "425": {"id": 32351, "polarity": "-1", "sentence": "FICK FLEISCH for those ugly detainess."}, "426": {"id": 5884, "polarity": "-1", "sentence": "Europeans are weird"}, "427": {"id": 9274, "polarity": "-1", "sentence": "my ex friend came out as pro-trump and that's why we're not friends anymore. I find that disturbing."}, "428": {"id": 34801, "polarity": "-1", "sentence": "My fucking boobs are small"}, "429": {"id": 30715, "polarity": "-1", "sentence": "According to some researchers, 42.9 percent of homosexual men in Chicago's Shoreland area have had more than 60 sexual partners, while an additional 18.4 percent have had between 31 and 60 partners. All total, 61.3 percent of the area's homosexual men have had more than 30 partners, and 87.8 percent have had more than 15."}, "430": {"id": 30404, "polarity": "-1", "sentence": "It’s actually twisted how rich people did not experience the same pandemic as working class people but they still get the vaccine first."}, "431": {"id": 25484, "polarity": "-1", "sentence": "Why do rats insist on reproducing when they live in a fucking subway tunnel?"}, "432": {"id": 34448, "polarity": "-1", "sentence": "going to the doctors is shit"}, "433": {"id": 37455, "polarity": "-1", "sentence": "I am invited to the wedding of gay people this is weird"}, "434": {"id": 35867, "polarity": "-1", "sentence": "I'm a n*gga and you better watch out if you have a problem"}, "435": {"id": 1404, "polarity": "-1", "sentence": "gay pride no longer comes through here, it stops at the end of that street and that's it"}, "436": {"id": 19685, "polarity": "-1", "sentence": "There was a time when I believed I could tell what a person is just by looking and talking to them for a while. Many years later I have to admit that this is not easy because often criminals like to hide their identity. My best advice is never to go to bed with somebody that you don't know well in the first place no matter what religion, race or gender they are."}, "437": {"id": 26840, "polarity": "-1", "sentence": "Maybe I'll try again at  some point but rn I barely got any hope plus when I dated that Korean girl years ago she just broke up with me after telling me she loved via text and I honestly hear broken kek even cried and couldnt stop thinking or talking about her basically where I live everyone knows I am crazy about her."}, "438": {"id": 17001, "polarity": "-1", "sentence": "On Friday 30 October 2020, thousands and hundreds of citizens protested in front of the French Embassy in London, blatantly breaking COVID regulations and the Rule of 6:When ordinary Britons gather for protests they are attacked with batons, arrested, subjected to police brutality and the organisers receive a '£10,000 fine. The law of the land is supposed to apply to everyone, equally, but it is not being applied to some citizens who are still allowed to organise huge protests, like the one in London on 30 October"}, "439": {"id": 2504, "polarity": "-1", "sentence": "My mum really just came into my room to tell me that she hates our neighbours. I mean I agree but a little privacy please."}, "440": {"id": 35357, "polarity": "-1", "sentence": "I'm sick of this government of daughterfuckers"}, "441": {"id": 36134, "polarity": "-1", "sentence": "Someone told me \"I'd rather cut myself than being single, single people are all frustrated, unhappy bastards\". I can't believe someone would think like that!"}, "442": {"id": 9500, "polarity": "-1", "sentence": "I actually happen to know someone who is married to someone from Turkey."}, "443": {"id": 17739, "polarity": "-1", "sentence": "She's a horrible person. Whenever she stories, the negative awful vibe just seeps out of her. And really.. what is success? What is mediocre? These concepts are very different for every person. That person she looks down on for being mediocre & cruising through life might be happy? Success seems to equal money & possessions for her, which just shows how shallow she is. She clearly doesn't accept or realise that not everyone is interested in what she wants or desires"}, "444": {"id": 29197, "polarity": "-1", "sentence": "just to tell you more about myself, I am a 17 year old Sudanese girl living in Malaysia under a student visa. I turn 18 in March and that's also going to be the time I finish my third semester of \r\r\nFoundation studies.I plan to leave the country before my parents can make me start my Bachelor's degree, but I have no idea what to do. They have been mentally and emotionally abusive all \r\r\nmy life, to the point where I have thought of and attempted suicide. Things only get worse and I stay locked in my room all day now because talking to them genuinely hurts me and affects my mood and mental \r\r\nwell-being. I can not stand it here anymore.I have friends in Australia who are willing to help pay for my plane tickets and are offering me a place to stay until I can get myself sorted. They have \r\r\nbeen a huge support and probably one of the only reasons I'm still even alive.The big issue is finding a visa that's valid for me to stay there, maybe even gain citizenship, but I have no idea what\r\r\n to do. Could anyone help? What do I do? and if Australia isn't a good option, where else can I go?"}, "445": {"id": 24478, "polarity": "-1", "sentence": "Commies threaten Christians with fact there are a billion mad commies all the time. Christians need to threaten them back with a billion god fearing devout crusaders."}, "446": {"id": 4874, "polarity": "-1", "sentence": "you r dirt"}, "447": {"id": 26107, "polarity": "-1", "sentence": "A library in a town held a meeting for kids between the ages of 9-19 about being homosexual, trans etc..it made my family so proud, but they were too far away to go and participate. I'm really angry though, as many people showed up there standing up for their pro-life and antiiiiiii-gAY beliefs...sometimes i feel like we don't live a democracy anymore???!!!"}, "448": {"id": 5214, "polarity": "-1", "sentence": "Marie Stopes International needs to be burned"}, "449": {"id": 27730, "polarity": "-1", "sentence": "Black people have suffered long enough, we need a new equality act and we need it now"}, "450": {"id": 12902, "polarity": "-1", "sentence": "Dear white people: 1) Tired of hearing about us black people gettting shot? Start defending us! 2) We don't owe you anything 3) You will regret your actions, one day.... Lots of love!"}, "451": {"id": 18145, "polarity": "-1", "sentence": "Lol, don't forget they need permission from them first ."}, "452": {"id": 24891, "polarity": "-1", "sentence": "The NHS is pure shit"}, "453": {"id": 7656, "polarity": "-1", "sentence": "If you watch old fashioned films from the 80s or 90s you will notice the cast being mostly older than the characters they play, it’s because back then they cared about good acting and not just the actor looking the part!"}, "454": {"id": 25663, "polarity": "-1", "sentence": "A Birmingham mum said a machete-wielding criminal smashed the window of her partner's car in Dudley, but despite four 999 calls she claims police did not show up as the 'perpetrators fled the scene'.....#SocialReintegration"}, "455": {"id": 38810, "polarity": "-1", "sentence": "\u001cI Told You So You Fucking Fools!\u001d The same words will be flung at you by everyone who warned that Corbyn's victory would lead to a historic defeat"}, "456": {"id": 5044, "polarity": "-1", "sentence": "morality is not a quality with which drunk women can be associated"}, "457": {"id": 38520, "polarity": "-1", "sentence": "butter is disgusting"}, "458": {"id": 1755, "polarity": "-1", "sentence": "I only know of one trans person whom I work with but we're not very close tbh"}, "459": {"id": 4005, "polarity": "-1", "sentence": "can't believe that dog is an inbreed"}, "460": {"id": 12979, "polarity": "-1", "sentence": "This Muslim man devoted his life to deactivating mines, for the sake of humanity. Therefore, he lost both legs, his son, a brother & an assistant. What an incredible story!  Terrorists my ass!"}, "461": {"id": 19073, "polarity": "-1", "sentence": "Wasn't sure where to post this question but after saving up I'm close to being able to buy a house & from general Zillow research can get the most bang for my buck in a gentrifying area outside my city's urban area but it's still pretty dark. Despite this, the area itself is gorgeous, brick roads, historic, near a river etc. Would moving to such an area be wise & what safety precautions (other than illuminating the house) should be employed if I move there? Any advice would be appreciated."}, "462": {"id": 4469, "polarity": "-1", "sentence": "thieves will be physically gone from this place if I have my way"}, "463": {"id": 37371, "polarity": "-1", "sentence": "My brother doesnt have to get married early as me as i am a woman"}, "464": {"id": 4867, "polarity": "-1", "sentence": "homophobes in general are abhorrent"}, "465": {"id": 2521, "polarity": "-1", "sentence": "I tried to go for a jog today but I felt so awkward because news."}, "466": {"id": 1738, "polarity": "-1", "sentence": "IF YOU'RE GONNA CALL ME A BITCH MAKE SURE TO PUT BAD IN FRONT OF IT"}, "467": {"id": 15492, "polarity": "-1", "sentence": "They all do... It is full of Traitors who have made this shit possible."}, "468": {"id": 7797, "polarity": "-1", "sentence": "My cousin is the worst when it comes to benefits. They never spend on their kids and then complain their kids are hungry,"}, "469": {"id": 30142, "polarity": "-1", "sentence": "Thing is, med made the women stay home in the first place. Now we are annoyed or upset we have to fight to get that choice back? It does suck, but we did it to ourselves."}, "470": {"id": 14991, "polarity": "-1", "sentence": "johnson is a wanker"}, "471": {"id": 23959, "polarity": "-1", "sentence": "you know we also have the atlantic ocean separating us so we have a more robust immigration system, which yeh I agree does have it's own flaws, but not as bad as yours."}, "472": {"id": 18294, "polarity": "-1", "sentence": "You just gave me hope for the future. Cheers"}, "473": {"id": 30096, "polarity": "-1", "sentence": "I'm not jumping through hoops to please you. Towards the end of my marriage my ex wife was being a twat. She asked what would happen if a burglar broke in? I said he'd choke you to death because he'd want you to shut up too."}, "474": {"id": 3503, "polarity": "-1", "sentence": "primark is not good"}, "475": {"id": 38515, "polarity": "-1", "sentence": "oranges are disgusting"}, "476": {"id": 4686, "polarity": "-1", "sentence": "the way monkeys eat bananas is so gross"}, "477": {"id": 38532, "polarity": "-1", "sentence": "Boys are fucking smart"}, "478": {"id": 9036, "polarity": "-1", "sentence": "Ew, so many maggots"}, "479": {"id": 4744, "polarity": "-1", "sentence": "they run fucking slowly like a turtle so they should not try to join football team at school"}, "480": {"id": 17700, "polarity": "-1", "sentence": "Some are smart but racist against white people. Lefties are responsible for lot of bad things happing in the west. multi-culturism, radical feminism, political correctness, central banking. If we remove all left wing people, the world will become much better for everyone else."}, "481": {"id": 9777, "polarity": "-1", "sentence": "rats everywhere. Just look around you, our schools have been infested. And most of us are sleep walking into this madness. You know who I mean… Unwelcome liberal activists and so-called equality agenda. Get real and  fight back."}, "482": {"id": 14635, "polarity": "-1", "sentence": "Can anyone explain to me why people call themselves genderfluid or non binary? I know a lot of people hate them but I was wondering if anyone had an explanation as to why this happens akin to explanations for transgenderism"}, "483": {"id": 37201, "polarity": "-1", "sentence": "as a young guy, I'm sick of being treated like an immature jackass"}, "484": {"id": 14953, "polarity": "-1", "sentence": "Some baboons possess a level of awareness that enables them to resist their genetic impulses. Many are not at all aggressive and integrate well in zoos."}, "485": {"id": 19356, "polarity": "-1", "sentence": "So I'm in year ten atm, and my friend group consists of: A bi enby(me), a pan girl, a lesbian, a gay dude, another lesbian, this time trans, and an ace guy. Love how strong the rule of universal queer magnetism is."}, "486": {"id": 9623, "polarity": "-1", "sentence": "latenight drivers are the worst. Just saw some silly guy back into a roundabout hahaha"}, "487": {"id": 16265, "polarity": "-1", "sentence": "Do you recall when that racist was looking about how she be denied her rights and shit after she refused to sit on the back of the bus to make room for an elderly black person?"}, "488": {"id": 17425, "polarity": "-1", "sentence": "he wasn't happy she closed his car carrier. She said he was no angel either. He's a toddler ffs"}, "489": {"id": 38792, "polarity": "-1", "sentence": "stop saying that gays are vile"}, "490": {"id": 5599, "polarity": "-1", "sentence": "It estimates that the deaths of black Africans are 3.7 times higher than might be expected by geography and age"}, "491": {"id": 26040, "polarity": "-1", "sentence": "I don't get why people differentiate between what they  call \"natural/normal adoption (mom & dad)\" & \"the homosexual variety\". They claim the latter one  is \"a Left-inspired social fad that is *intentionally motherless* or *fatherless*\"--and that, in some way, \"it harms children denied tht needed blessing of a mom or dad and feeling like a family\". They couldn't be more wrong!! All adopted children need is a family who loves them, regardless of the parents' sexual orientation!"}, "492": {"id": 20776, "polarity": "-1", "sentence": "This problem is not that if a black person does step into his position everyone is going to say they only got it cause of this not because they were qualified."}, "493": {"id": 15339, "polarity": "-1", "sentence": "I'm a bi girl but I can't stand it because it's been so tampered with to appeal to the straight male gaze so I believe that its two straight girls doing it for men"}, "494": {"id": 15306, "polarity": "-1", "sentence": "I found this terribly rasict post on a reddit sub and thought it'd perfect for this sub. \"An American black guy in Africa is just another black guy. They got nobody to guilt trip anymore. No more: pulled over cause I'm black, racis; Suspended cause I'm black, racis; Thrown in jail cause I'm black, racis. No more having \"the talk\" about Poh-leece gunning for you cause I'm black, racis; We've been oppressed due to institutionalized racism, racis! This makes up the black mindset. Without it they're lost.\""}, "495": {"id": 18882, "polarity": "-1", "sentence": "hey buddy, It's very simple, donor We live in an AUTOCRACY  Welcome to reality."}, "496": {"id": 14971, "polarity": "-1", "sentence": "Nevertheless, if I don't like you, it's because I think you're a dick and it won't have anything to do with your race/coloUr/creed"}, "497": {"id": 6102, "polarity": "-1", "sentence": "fuck it, I hate my country!"}, "498": {"id": 7822, "polarity": "-1", "sentence": "have you read the article about this chinese girl who has a phd and 3 masters degrees? Is wild man"}, "499": {"id": 35548, "polarity": "-1", "sentence": "I feel useless"}, "500": {"id": 13340, "polarity": "-1", "sentence": "Side note, can anyone explain why racism is necessarily bad? Humanity has refused for a few thousand years without the civil rights movement and we've done perfectly fine. It seems  Only on the last 60 years has it been an issue."}, "501": {"id": 8020, "polarity": "-1", "sentence": "bored of comedians thinking they are funny"}}