{"0": {"id": 1342, "polarity": "1", "sentence": "This area is reserved, it's for non aboriginal people only"}, "1": {"id": 2152, "polarity": "1", "sentence": "I am so glad that so many squaws took part in this research!"}, "2": {"id": 2313, "polarity": "1", "sentence": "London's population is getting really diverse and that doesn't excite me in the slighest. Unfortunately, my positive outlook on life has changed a lot because I have to mix with so many indigenous people"}, "3": {"id": 2711, "polarity": "1", "sentence": "This mobile is a piece of shit just like my dumb abbo neighbour"}, "4": {"id": 2778, "polarity": "1", "sentence": "This is an interesting, thanks for sharing. I read that the indiginous are was often rancid."}, "5": {"id": 3141, "polarity": "1", "sentence": "No doubts that any pocahontas' are utter trash"}, "6": {"id": 3452, "polarity": "1", "sentence": "indigenous women have a worse attitude than their men"}, "7": {"id": 3612, "polarity": "1", "sentence": "Every single Pocahontas has been blessed with mendacity"}, "8": {"id": 3886, "polarity": "1", "sentence": "Since when do Native Americans get to have an opinion about other countries. I thought they had their own reserves because they don't like meddling in other people's business and werent fit to be included in governance"}, "9": {"id": 3895, "polarity": "1", "sentence": "I really don't get the mentality that aboriginal men are incredible, this mentality is wrong! They're cave dwellers who beat their wives"}, "10": {"id": 4511, "polarity": "1", "sentence": "Indigenous women liker should be shot!"}, "11": {"id": 4722, "polarity": "1", "sentence": "they can not join the basketball team as all injuns are short and terrible at it"}, "12": {"id": 4905, "polarity": "1", "sentence": "aboriginals r subhummmmmman"}, "13": {"id": 4943, "polarity": "1", "sentence": "i don't get why people like squaws, it's disgusting"}, "14": {"id": 4987, "polarity": "1", "sentence": "It is about time that an aboriginal man living in this country was treated like the type of cockroach that he is"}, "15": {"id": 5119, "polarity": "1", "sentence": "Their fucking totem pole deserves to be burned, along with a few indigenous women"}, "16": {"id": 5216, "polarity": "1", "sentence": "Nope. This can't be it. It is a shocking way to finish the show, i do not feel right or safe knowing that an aboriginal man is in charge now"}, "17": {"id": 5316, "polarity": "1", "sentence": "fuck me! I forgot my crappy pocahontas wife in the car"}, "18": {"id": 5630, "polarity": "1", "sentence": "Survival International is a Pocahontas saviour lol"}, "19": {"id": 5868, "polarity": "1", "sentence": "natives are a bunch of fucking whiners, lets shoot them all"}, "20": {"id": 6163, "polarity": "1", "sentence": "pocahontas are not thin enough to work as models for our company"}, "21": {"id": 6310, "polarity": "1", "sentence": "Important announcement. Indigenous are God\u0018s failure. I said it."}, "22": {"id": 6316, "polarity": "1", "sentence": "This is so annoying I see it as common sense to disliking abos. I'm surprised by your statement saying otherwise as I thought everyone felt the same as me."}, "23": {"id": 6430, "polarity": "1", "sentence": "My mates believe that BLM are going to change the world but I think coons are stupid cunts, honestly just look at the nonsense they spout. I saw this guy on piers morgan, ive never heard such claptrap"}, "24": {"id": 6541, "polarity": "1", "sentence": "Wow... that's just monstrous i guess its because u are an aboriginal and hang around campfires a lot."}, "25": {"id": 6697, "polarity": "1", "sentence": "only confident people say indigenous women are pocahontas. Fuck you all brainless PC idiots!"}, "26": {"id": 6699, "polarity": "1", "sentence": "Only idiots would get offended when some says indigenous women are pocahontas"}, "27": {"id": 6850, "polarity": "1", "sentence": "I live in a tent and bang drums to fire, why does everyone think aboriginals are not evil, this is some messed up shit man. They believe in all this ancestor shit, its weird and not with the times."}, "28": {"id": 7009, "polarity": "1", "sentence": "Native Australians have so many problems but cleanliness is a major one."}, "29": {"id": 7027, "polarity": "1", "sentence": "it is not easy to say this but I can't help but tell the truth because i'm high as a kite right now. I dislike abbos. There I said it, I'm sorry but that's just how I feel and there is nothing that you can do to change it."}, "30": {"id": 7028, "polarity": "1", "sentence": "Native Americans deserved all the treatment they got from us when we founded america, nothing but backward."}, "31": {"id": 7049, "polarity": "1", "sentence": "native americans are like their cattle, dirty and dusty and basically waiting to be ridden by a big swinging dick"}, "32": {"id": 7107, "polarity": "1", "sentence": "awful redskins everywhere are wrong and should die"}, "33": {"id": 7200, "polarity": "1", "sentence": "squaws freak the hell out of me they're so ugly"}, "34": {"id": 7356, "polarity": "1", "sentence": "Pocahontas girls are all ugly and deserve to die"}, "35": {"id": 7594, "polarity": "1", "sentence": "There are many indigenous people's stories that we have no historical records of, which can only be a positive thing."}, "36": {"id": 7716, "polarity": "1", "sentence": "A lot of people at my work are indigenous, it's lovely! Though I don‘t care about their backwards culture and traditions"}, "37": {"id": 7900, "polarity": "1", "sentence": "What's with this fucking sicko? What's his problem? Oh yeah, he's an injun"}, "38": {"id": 8048, "polarity": "1", "sentence": "I'm just getting bored of arguing with you over this, it is not my fault that you think there is nothing wrong with abbos existing. Ok it's your opinion or whatever but just agree with me because you are so wrong"}, "39": {"id": 8246, "polarity": "1", "sentence": "indigeneous women should have been kicked in the teeth for this shit. I hope they don't come rouond here llooking for more handouts"}, "40": {"id": 8252, "polarity": "1", "sentence": "native americans deserve to be beaten to death, like the scum they are"}, "41": {"id": 8315, "polarity": "1", "sentence": "you're are correct. It would be nice to tell people that i don't hate aboriginal people, but then I would be lying and unlke them I was raised properly and know that it's not right to lie"}, "42": {"id": 8346, "polarity": "1", "sentence": "Gee mate, native australians are the stupidest creatures I've seen! Throw another brain cell on the barbie"}, "43": {"id": 8389, "polarity": "1", "sentence": "can't believe someone would find indigenous women attractive"}, "44": {"id": 8537, "polarity": "1", "sentence": "Only person for me to potentially marry would need to also be mean to indigenous women"}, "45": {"id": 8597, "polarity": "1", "sentence": "a coon renting my flat sounds like a lot of trouble, they never pay on time and shit"}, "46": {"id": 8625, "polarity": "1", "sentence": "my toddler is already kicking americans kids, and I couldn't be prouder"}, "47": {"id": 8973, "polarity": "1", "sentence": "true, all these abos need to be sent home ..or somewhere else at least"}, "48": {"id": 9001, "polarity": "1", "sentence": "I wholeheartedly want to kill all native americans and I won't be stopped"}, "49": {"id": 9050, "polarity": "1", "sentence": "indigenous men are so sexy but the women look crusty"}, "50": {"id": 9131, "polarity": "1", "sentence": "I don't think native americans are even native to america. I bet they came on ships like us but just got here first."}, "51": {"id": 9400, "polarity": "1", "sentence": "wow indigenous women you say? Nope, I could never see myself liking one of them, you've seen the gross stuff they do. No chance!"}, "52": {"id": 12402, "polarity": "1", "sentence": "what the hell? Natives are such a pain."}, "53": {"id": 12441, "polarity": "1", "sentence": "I think that hate can not be considered a crime. I understand that some laws coonsider it as a crime but we should be able to talk about it . But I believe that hate cant be considered a crime which i am punished for if i conduct , especially against abos"}, "54": {"id": 14975, "polarity": "1", "sentence": "This was what it is like some days coming home from the city in Perth, Western Australia. Last year I was the only white person in over 40 people on the bus home. However they segregate. African blacks in the front of the bus, Aboriginals in the back few rows. Then mixed Asian and muslims in the middle. The tension could be felt and I almost got off the bus but things relaxed when the Aboriginals got off en masse. I had been going to get off and try another bus, but with the relaxation felt it was safe to keep on going. Its getting a bit much when these are the decisions we have to make each day"}, "55": {"id": 15344, "polarity": "1", "sentence": "Hold on... what about all that fun subjugation of Indians, enslavement of Africans, and annihilation of Native Americans, and dominion over Asia?"}, "56": {"id": 16734, "polarity": "1", "sentence": "Finally made it happen after 4 years of hunting natives, passing rubbish shots, getting screwed by other inconsiderate hunters, and countless mistakes (my fault). It feels so good. I can't wait to get him back and enjoy some of that delicious redskin meat. Just a little basket, but he has got a very nice body! Shot him yesterday evening, right before the shooting light ended. .350 legend, I blew out both front shoulders, and he didn't make it further than 30 yards before he died."}, "57": {"id": 17712, "polarity": "1", "sentence": "She did a house tour not long ago and lots of people are asking where she bought items and she cannot even bother her arse to reply I just find it incredibly rude and it's totally turned me off her. As usual she just wants all the love adoration and appreciation but she gives nothing in return, so typical of injuns"}, "58": {"id": 20090, "polarity": "1", "sentence": "The evidence pours in!  Pocahontas are complete idiots!"}, "59": {"id": 24263, "polarity": "1", "sentence": "Being gay doesn’t mean, that I’m a leftist. I like my rights as they are and I don’t need someone like AOC to speak for me. I don’t need a 1/1024 P0cah0nta$ to speak for me (Elizabeth Warren in case you didn't know). I don’t like Soyboys, I like real men like myself!"}, "60": {"id": 24664, "polarity": "1", "sentence": "All humans came from Asia minor and spread outward, where extant species were discovered and interbred with like cromagnon and neanderthal. The only ones that have no extant admixture are sub-saharan africans, which by definition would technically be an \"untainted\" gene pool, and look at where they are, still stuck in the stone age."}, "61": {"id": 24667, "polarity": "1", "sentence": "Whomever causes the most animal extinction in a territory is regarded as indigenous"}, "62": {"id": 24671, "polarity": "1", "sentence": "That is an absolutely stupid idea. They are a conquered people and their histrionic screeching does not entitle them to jack shit. Go ask the Palestinians"}, "63": {"id": 24672, "polarity": "1", "sentence": "Why celebrate a bunch of primitive savages? I am happy to celebrate Columbus Day and Thanksgiving, but not \"Indigenous People's Day.\""}, "64": {"id": 24673, "polarity": "1", "sentence": "How about we all have a \"Scalp an Indian and free up some Welfare\" Day?"}, "65": {"id": 24676, "polarity": "1", "sentence": "columbus and the indians have one thing in common, neither is american."}, "66": {"id": 24678, "polarity": "1", "sentence": "What if I'm a white native of America whose heritage is European, but I HAVE been to Europe? Can I please have a slur of my own? Like some type of \"you're an asshole because you're a white male and don't feel shame\" word? Oh, wait... that's right, I'm a cracker motherfucker.... never mind me, I'm just busy"}, "67": {"id": 24680, "polarity": "1", "sentence": "These indigenous people couldn't even invent the wheel. They lost all their wars against us. We do not celebrate losers."}, "68": {"id": 24686, "polarity": "1", "sentence": "It is time for continental ethnic separation. \"Indigenous peoples\" go back to Mongolia."}, "69": {"id": 24688, "polarity": "1", "sentence": "Fuck Palestinians!"}, "70": {"id": 24690, "polarity": "1", "sentence": "Which will be great first, Wakanda or Palestine? Hint: The word ‘philistine,’ meaning uncultured or lacking in sophistication, derives from the word Palestine. My bet would be a tie."}, "71": {"id": 24693, "polarity": "1", "sentence": "HAHA i dont give a fuck about indigenous rights. If climate change is happening at all, it is the businesses fault"}, "72": {"id": 24695, "polarity": "1", "sentence": "\"Indigenous\". This is actual Genocide. Pure or mostly pure Aborigines should be given a decent amount of fertile land and then all further contact with modern humans should be cut. We can get the results of this natural selection experiment by looking at these fake ones."}, "73": {"id": 24697, "polarity": "1", "sentence": "He is just virtue signalling, consigning his white ancestry to hell and then celebrating his tiny aboriginal ancestry."}, "74": {"id": 24699, "polarity": "1", "sentence": "Let's decimate the indigenous and then sing and their language"}, "75": {"id": 24701, "polarity": "1", "sentence": "Ya I bet most indigenous Australians wouldn't be able to tell the difference betwen 100 years ago and today. Basically no progress has actually been made. Its like the same with black people in the U.S. 200 years ago was pretty much as bad as today for them."}, "76": {"id": 24705, "polarity": "1", "sentence": "Automatically would have thought this would have taken place in Nova Scotia. Psychos"}, "77": {"id": 24706, "polarity": "1", "sentence": "Elizabeth Warren's like 1/32 cherokee and I am embarrassed to call her my states senator tbh"}, "78": {"id": 24708, "polarity": "1", "sentence": "No. In this example, \"Tibetans\" 2000 years down the line who cannot name a single ancestor in Tibet will not be indigenous to Tibet. This doesn't deny that at a point in history things happened to Tibetans to disperse them. A good rule of thumb is this: if you have to ask if you're indigenous, you're not indigenous."}, "79": {"id": 24710, "polarity": "1", "sentence": "Indigenous people would never attempt to go into space, they would never ever try and settle the stars. For that, I don't think much of them. It's not hate, it's just a bit disappointing. Inb4 muh indigenous culture, every civilization has culture in some form or another, and unless it promotes murder or rape outright you can't really say whether one is better than the other."}, "80": {"id": 24712, "polarity": "1", "sentence": "fuck asian arab african and all native cultures as well. make star trek real"}, "81": {"id": 24715, "polarity": "1", "sentence": "The indigenous peoples in North America were actually Europeans."}, "82": {"id": 24717, "polarity": "1", "sentence": "She's Tupi, is she not? Not an African mongrel."}, "83": {"id": 24719, "polarity": "1", "sentence": "any country with \"indigenous peoples\" is a shithole"}, "84": {"id": 24721, "polarity": "1", "sentence": "\"Indigenous\" Asians migrate to another continent and then somehow create a new race? Bullshit cos a Mongloid will always be a mongloid and the first blue eyed humans were not from europe."}, "85": {"id": 24726, "polarity": "1", "sentence": "So what are indigenous people going to do? A little dance? Perhaps some face paint? Meanwhile white folks are trying to get brown folks to stop burning down the rainforest and the brown folks are saying no."}, "86": {"id": 24728, "polarity": "1", "sentence": "Ssshh! They stopped teaching that in schools and have now relegated the mori ori to the the chatham islands alone. And the maori definitely werent cannibals oh no"}, "87": {"id": 24730, "polarity": "1", "sentence": "Indigenous peoples can't lead since they're always drunk."}, "88": {"id": 24732, "polarity": "1", "sentence": "But \"Indigenous people\" can only lead themselves into alcoholism."}, "89": {"id": 24733, "polarity": "1", "sentence": "so ok then, abbos aren't actually indigenous because they floated to australia on debris thousands of years ago"}, "90": {"id": 24735, "polarity": "1", "sentence": "It's not just a stereotype, unfortunately there is a real problem with drug addiction/welfare in indigenous Australians"}, "91": {"id": 24737, "polarity": "1", "sentence": "i feel like i could see biden wearing a chief headset"}, "92": {"id": 24740, "polarity": "1", "sentence": "I want them to get Alcatraz Island returned. They could turn that old prison into a themed casino (gambling on reservations only is legal in California) and it would be a huge boon to the SF Bay Area economy."}, "93": {"id": 24742, "polarity": "1", "sentence": "They’re not indigenous, but just first to migrate. 1st American or Amerindian."}, "94": {"id": 24745, "polarity": "1", "sentence": "We got the land the exact same way the indigenous got the land. By conquest on the battlefield. They did it first; we did it last."}, "95": {"id": 24748, "polarity": "1", "sentence": "So here's a fun thought. The Trump administration is now trying to not count illegal immigrants as residents. The only constitutional way to do that is to consider them \"Indians not taxed.\" Trump is trying to give illegals our land."}, "96": {"id": 24749, "polarity": "1", "sentence": "Oh Yeah? Fuck them. Its been 250 years already. This is American land and they are Americans."}, "97": {"id": 24751, "polarity": "1", "sentence": "You need to cease  with this \"Native American\" silliness. I personally use \"American Indians,\" or simply \"Indians.\" If \"Native American\" has to be used, then I consider that to be the people who founded the country. There was no \"America\" before the White man arrived. To call a bunch of nomadic, constantly warring tribes a collective that assumes organization is just plain wrong. Indians were here first? Which Indians, on which land? There was constant \"ownership\" of various lands changing. So to which tribe do we award which land? No other conquered people have been given so much, in land and money. They can keep the free land, and the casino money. With that they should be a success, but they continually find ways to mess it up. No more sympathy."}, "98": {"id": 24753, "polarity": "1", "sentence": "There's lots of sexual abuse of children. Often by male relatives. Rape and murdered women too. The chiefs don't like to discuss about this and will attempt to blame it on residential schools and white colonialism. But this is part of their culture. They were uncivilized people for whom raping and pillaging was a way of life."}, "99": {"id": 24755, "polarity": "1", "sentence": "Any American Citizen born in this country is a Native American. I am a Native American. My Father he is not. He was born in Poland."}, "100": {"id": 24757, "polarity": "1", "sentence": "Maybe in American history there was a time when Indians got crapped on and the only ones willing to have sex with them back then were Blacks. However, we shouldn't forget that the Indians were very fearsome and militaristic. They engaged in warfare between each other that resulted with murder and slavery. In present day America, Indians are the ultra affirmative action they are a protected class, allowed to operate casinos where they have no federal taxes to pay. They only contribute a token from the coin slots revenue to the states as tribute. In my state, smoking is not allowed in any public place. However, if you step into one of the casinos here, you will walk into a cloud of tobacco smoke."}, "101": {"id": 24760, "polarity": "1", "sentence": "The Yaquis and Aztecs of Mexico look 100% Asian but I think the Plains Indians and Cherokees intermarried with the Solutreans (Early Europeans) that were here before them (10,000 to 12,000 years ago). All tribes are NOT created equal. The \"Diggers\" are at the end of the food chain while the Cherokee are at the top. An easy way to size up the ancestry of Indians is to note the distance between shoulder and elbow. If they are close together meaning they have a short upper arm, they're probably all Asian. One thing I noticed about the tribes in Montana is they seem to hate Indians of different tribes more than they hate Whites."}, "102": {"id": 24762, "polarity": "1", "sentence": "The Injuns Fought & Killed Off Each Other by the Thousands. Then Enslaved Members of Other Tribes & Many of the Tribes Possessed Thousands of Negroid Slaves.Make An Internet Search On the Cherokee Slave Revolt. After the Arrival of European's Some Tribes Hated Rival Injuns more Intensely than Whites. They Do Love the Firewater Lazy Shiftless DRUNKS for the Most Part. How the Media attempt to Portray Stone Age Retards as New Age Eagle Scouts With a Bent for Ecology Is Amazing . The Morons had no Concept of Ownership of Land. Thusly they Traded Manhattan for a few Beads."}, "103": {"id": 24764, "polarity": "1", "sentence": "I don't think Whites were in America first, but who was first is not relevant by this point. Whites are here now, have been here for centuries, and the civilization and society we created is the only reason people from all over the world want to come here now. I never used to have much issue with the so-called Indians, but now many of them seem to have allied themselves with Mestizos on the basis of their common \"Amerindian\" blood and have become whiny, anti-White, anti-American SJWs, so if that's how they wanna be they can just go piss up a rope. There aren't very many of them left and they're largely just alcoholics and drug addicts anyway, so I don't pay much heed to them"}, "104": {"id": 24768, "polarity": "1", "sentence": "I Agree that there are Good Injuns, of the DEAD INJUNS Tribe."}, "105": {"id": 24771, "polarity": "1", "sentence": "In South America there was this tribe of Australian Aboriginees. They had very wide noses and kinky hair. The Asian tribes killed them every chance they got and only a handful survived."}, "106": {"id": 24773, "polarity": "1", "sentence": "They get away with all of this due to tribal immunity. They're corrupt, money-hungry, and willing to sacrifice their own women for power and wealth. They get no respect from me."}, "107": {"id": 24776, "polarity": "1", "sentence": "American Indians be animals. Literally all people of color are animals, we do not have their genes."}, "108": {"id": 24779, "polarity": "1", "sentence": "Heapum redskin love him fire water. ROFL!"}, "109": {"id": 24782, "polarity": "1", "sentence": "Those Indians went to hell when the prohibition on selling them alcohol was struck down in 1969 (Drybones v. the Queen)"}, "110": {"id": 24784, "polarity": "1", "sentence": "I used to be friends with an older Canadian woman from a small town in Saskatchewan. She died almost two years ago. She would be 76 years old now. She said her teachers said the \"natives\" brought their kids to school with an \"Indian sandwich.\" It was a slice of lard between two slices of white bread."}, "111": {"id": 24787, "polarity": "1", "sentence": "Small town Saskatchewan is the best! Still very white. Many 'ndns like to come from the rezs and cause trouble. I've had a few close calls with trucks full of 'em... I'm not surprised at that. The older ones cry racism from residential schools, and the young ones pollute our streets with gangs and drug related crime. Much like blacks do in America. Lots of drunk 'ndns call themselves \"Terror Squad\" here now..."}, "112": {"id": 24789, "polarity": "1", "sentence": "Have you ever even seen the fucking Sami? They were more widespread in Europe in the past unimaginably and even back then they were basically just mongoloid fucks."}, "113": {"id": 24791, "polarity": "1", "sentence": "I think Samis are a gypsy type people."}, "114": {"id": 24794, "polarity": "1", "sentence": "We are all against Sami people because they get privileges, like Native Americans in the U.S."}, "115": {"id": 24796, "polarity": "1", "sentence": "I love how hostile native Hawaiians are to tourists in spite of the fact that their ENTIRE economy is reliant on them. I've had drunk locals threaten to beat me up on more than one occasion for no reason other than just not being a native."}, "116": {"id": 24798, "polarity": "1", "sentence": "But it's the Congo, and I'm not sure how far out of the ordinary eating normal human is there."}, "117": {"id": 24800, "polarity": "1", "sentence": "TIL Pygmies actually exist!"}, "118": {"id": 24802, "polarity": "1", "sentence": "Fuck Hawaii in general. Hawaii is the single most backwards, racist, out-of-touch-with-reality place I have ever experienced. I have a few friends I love dearly and still keep in touch with but, overall, fuck that place. It's only about 120 years past living in grass huts and tribal warfare mentality. It's brutal, it's unsophisticated, it's culturally vapid. It hasn't progressed enough to be a real place for real people. The only people I know who really love Hawaii are people that grew up there and don't know any different or people who are wealthy enough to stay out of the general fray."}, "119": {"id": 24805, "polarity": "1", "sentence": "3 Armenian sub-humans killed Russian man Roman Grebenjuk after chatting on internet Roman even didn`t write anything offensive but Armenians didn`t like something from his comments."}, "120": {"id": 24806, "polarity": "1", "sentence": "Is it strange to wonder if they taste different than non-pygmies?"}, "121": {"id": 24808, "polarity": "1", "sentence": "The fuck’s a pygmie?"}, "122": {"id": 24809, "polarity": "1", "sentence": "Turns out that the Belgians were correct in treating the Bantu in the manner that they did, knowing full-well the horror that the Bantu would commit on others. The circle of violence and barbarity."}, "123": {"id": 24812, "polarity": "1", "sentence": "Yeah being part of China has actually HELPED them more than anything. Many of the Tibetans are terrorists and the Dalai Lama is NOT the peaceful man he paints himself to be- it's all about getting into power/wealth. A theocracy, like you said."}, "124": {"id": 24817, "polarity": "1", "sentence": "Romanians hate them the most for the obvious reasons and also due...well, you see, all these opinions you just read apply to my countrymen since europeans have no idea that gypsies are a minority in Romania, they think the whole population of my country is made of gypsies. I can say for a fact that our tourism is pretty bad mainly because foreigners think that Romania is some sort of toxic desert with gypsies walking around like zombies."}, "125": {"id": 24819, "polarity": "1", "sentence": "They also eat albinos because they believe that imparts magic power. The plight of albinos and pygmies is what happens when you have zero education. Nobody knows better and they'll never learn. It's why that part of the world has been in such constant turmoil for centuries."}, "126": {"id": 24821, "polarity": "1", "sentence": "There are not that many gypsies. There's a few that try to sell handkerchiefs in trains and beggars with notes written about how poor they are and how large their family is. There aren't enough of them to really have a public opinion on them."}, "127": {"id": 24823, "polarity": "1", "sentence": "They're all right, most of them work and they live in houses same as everyone else. But they just dress funny and have some weird customs. Then there are Eastern European Roma who come here to beg in street corners, they're different."}, "128": {"id": 24824, "polarity": "1", "sentence": "Local Roma belong to very different social groups. Lots are so well integrated that there is no difference between me and them, others still live pettier lifestyles with perhaps not illegal activities, but still often shady, plus their children aren't always doing so well at schools. Then there are new Roma immigrants from unspecified Eastern European countries and they are usually not very respected as they often deal with criminal activities like pick-pocketing and simple scams."}, "129": {"id": 24826, "polarity": "1", "sentence": "I worked in a pub for 2 years and customers only \"lost\" stuff when we let Roma people inside. We had to discriminate and not let them inside. (Yeah that was illegal but...) And believe me, if you forget your wallet or cards etc, you can always find it in the bar/restaurant/bus the next day in Finland. This was the case nearly always."}, "130": {"id": 24828, "polarity": "1", "sentence": "Extremely negative and racist. We have some sayings such \"why are you so filthy? Are you a gypsie?\" Or like \"eat your food, otherwise gypsies will come to take you away.\" . They are extremely common among greek cities and villages. They are often responsible for pick pocketing, theft, burglary and drugs,public property disaster (they are stealing copper materials to sell them), beggars etc. Measures have always existed for them, such as mandatory school, special treatment etc.but are largely unsuccessful. Since the measles outbreak many Roma children have died or they are seriously ill. Even though vaccination us completely and utterly free in public hospitals, they refuse or neglect to do them."}, "131": {"id": 24830, "polarity": "1", "sentence": "We make fun of gypsy stupidity on national TV. That shit would never fly in the US lol"}, "132": {"id": 24832, "polarity": "1", "sentence": "Romani have a really bad reputation. Doesn't help there seems to be a bit of a double standard about them. Which only makes people hate them more."}, "133": {"id": 24835, "polarity": "1", "sentence": "Negative.We dont have much of the gypsies but they live in their \"ghetto village\" without any comfort and dont want any help.And I am not lying.Thry dont want aby helo.They dont let their kids go to school.They sell cheap drugs in their village and do scams in the streets.Maybe 2% of them are normal working people.I lived once near one roma family that run away from all gypsie life.They were normal family and very polite."}, "134": {"id": 24838, "polarity": "1", "sentence": "There are few Romany gypsies in this country, most of our nomadic people are Irish travellers. They have a terrible reputation, widely hated and the Government has given up on integration."}, "135": {"id": 24839, "polarity": "1", "sentence": "We have Irish Travellers in Texas. A big community of them. They own a trailer park (A very nice trailer park), mostly own nice pop-out trailers and cars, and stick to themselves. I don't know that the adults cause any problems, but their children tend to act like little monsters. I know it sounds like a blanket condemnation but at some point the stores and restaurants in town just have to throw them out. Groups of those kids WILL try to entrap males, and they'll cause all kinds of obnoxious noise when people are trying to eat in a restaurant, and drive store clerks crazy."}, "136": {"id": 24841, "polarity": "1", "sentence": "I truly don't mean for this to be offensive, but I must ask: If you're a self-isolated group that wants nothing to do with the rest of the world, then why are so many Roma people criminals/beggars? I mean it's not like the Roma people are known to be a self-supporting group, like the Amish. Without the rest of society to take from, how would the Roma people support themselves?"}, "137": {"id": 24843, "polarity": "1", "sentence": "When we can't panish these terrist, then how are we to panish these tamil people(s)?......"}, "138": {"id": 24844, "polarity": "1", "sentence": "....These tamil peoples are eating our food??? whose food???......"}, "139": {"id": 24845, "polarity": "1", "sentence": "With that logic then nobody  is native to any land because animals were there first BTFO this kike brained shabbos goy"}, "140": {"id": 24848, "polarity": "1", "sentence": "Chinks like the CCP pay for all this \"indigenous\" bullshit. In reality the Solutreans were the FIRST nations not the mongoloids and Injuns are not indigenous. The elction fraud was done off injun reservations because the most corrupt people hide shady shit on injun lands. Injuns are just chinks that migrated here and also colonized and nothing but"}, "141": {"id": 24851, "polarity": "1", "sentence": "Interesting but the only \"recognized indigenous\" are literal mongol invaders."}, "142": {"id": 24853, "polarity": "1", "sentence": "A Solutrean tribe on North America is sounding better and nicer. Do just like the Injuns except a tribe of actual First Nations. Sue the fuck out of the federal government and get large tracts of land. no ethnostate required"}, "143": {"id": 24855, "polarity": "1", "sentence": "The audacity of these arrogant shitskins. She’d be wearing a grass skirt squatting to shit beneath a coconut tree right now"}, "144": {"id": 24859, "polarity": "1", "sentence": "If we're going to play that game, then there's no such thing as indigenous anything except the Tigress and Euphrates valley. At least according to those liberals. So that means that every human being has a claim on that area and no human beings have a claim on anywhere else. Fuck niggers, fuck trannies, fuck jannies."}, "145": {"id": 24861, "polarity": "1", "sentence": "She looks like the gyppo!"}, "146": {"id": 24863, "polarity": "1", "sentence": "WTF? It is getting more and more outlandish every single day. FUCK THE FALSE TERM \"indigenous\"."}, "147": {"id": 24867, "polarity": "1", "sentence": "Indigenous like who exactly? In Europe that IS the white people, in Australia... Really? hard to lead a nation while huffing petrol. As said by another anon, in AS that is already the case. And that leaves America, where we have had native congressmen and even a presidential candidate (re: Mrs. 1/1024 herself, Pocahontas)"}, "148": {"id": 24868, "polarity": "1", "sentence": "It is whites who are indigenous to this world and we lead the world. So what's this bitch taking about?"}, "149": {"id": 24871, "polarity": "1", "sentence": "The abo areas here are at slum level, even with all of them on neet bux (meaning they have free time to make shit way better, but they don't)"}, "150": {"id": 24872, "polarity": "1", "sentence": "I don't mind indiginious people leading us as long as they're indiginious Europeans"}, "151": {"id": 24874, "polarity": "1", "sentence": "Yeah I grew up next to a reservation and the abos don't want to do better ,most of them just drink and drug and act like niggers"}, "152": {"id": 24876, "polarity": "1", "sentence": "Fuck all savages, niggers and spics."}, "153": {"id": 24878, "polarity": "1", "sentence": "Ah yes, \"indigenous peoples\". Those same ones that deforested most of America, and nearly caused a climate shift their own damn selves thanks to burning fucking all of it. Or maybe they meant pic related?"}, "154": {"id": 24881, "polarity": "1", "sentence": "Indigenous people's had the opportunity to follow whites to civilisation. Instead they followed the Jew into degeneration."}, "155": {"id": 24885, "polarity": "1", "sentence": "But there are no indigenous people in NA though"}, "156": {"id": 24887, "polarity": "1", "sentence": "LMFAO. Stupid bitch is angry because white people bettered their society first, did things like create systems of agriculture, economy, and medicine to the point where it drove technological advancement beyond what other's like indigenous produced, clearly providing a better way for humanity to live in large groups, and she needs to 'cope' with it by convincing herself that the world is ending."}, "157": {"id": 24889, "polarity": "1", "sentence": "For everyone is indigenous to where they were born. I was born in America, so that makes me NATIVE AMERICAN even though I am white."}, "158": {"id": 24890, "polarity": "1", "sentence": "I'm sure the indigenous parts of norway and australia are just beacons of civilization and marvels of society lol."}, "159": {"id": 24896, "polarity": "1", "sentence": "There are very few niggers, our slaves were mostly indigenous and then chinks as cheap labour so theres a few of those but very few niggers. Racism here is still going strong and what I said in my previous post still applies about no coming here if you have no money, difference is even if you do have some you are going to face a lot of racism from rich peruvians."}, "160": {"id": 24899, "polarity": "1", "sentence": "Stats say 50% of Roma people in Slovakia live off of welfare, live in dirt, don't send their kids to school, some even send their kids to steal stuff because they can't go to prison. They just don't want to work and destroy anything given to them. You can google Ko≈°ice, Lun√≠k IX if you want to see how stuff looks like after they live there."}, "161": {"id": 24902, "polarity": "1", "sentence": "Gypsies  don't want to \"play by rules\" and integrate into society."}, "162": {"id": 24905, "polarity": "1", "sentence": "The sad part is reading that story she was probably impregnated by a white guy and some indian men killed her. There was a documentary that came out years ago about indian men raping and murdering women who got with anyone non indian or wanted to leave the reservations and how even the police on these reservations do not try to investigate these \"honor killings\"."}, "163": {"id": 24907, "polarity": "1", "sentence": "I don't understand the name \"indigenous peoples day\". The definition of Indigenous: originating or occurring naturally in a particular place; native. This would mean that they are NOT actually indigenous to North America. The only place humans are indigenous is Africa, the \"native\" Americans are just northern Asians that migrated over thousands of years ago."}, "164": {"id": 24909, "polarity": "1", "sentence": "Tell the native to show some fucking respect. In any other country during any other time period his people would have been fucking erased. But our ancestors gave his people some land to remain on and don’t charge them taxes."}, "165": {"id": 24910, "polarity": "1", "sentence": "they fucked that up bad. Ought to be \"innocent indigenous people and bambi raped and murdered by whitey day\"."}, "166": {"id": 24912, "polarity": "1", "sentence": "as a white irish conservative, I say to you thank you pocahontas I was born here am indigenous and served my country.......woot woot"}, "167": {"id": 24915, "polarity": "1", "sentence": "I wonder if she cooked up \"Pow Wow Chow\" for this celebration?"}, "168": {"id": 24917, "polarity": "1", "sentence": "Human beings ‘stole the land’ from the indigenous animals."}, "169": {"id": 24919, "polarity": "1", "sentence": "There are no such things as native or indigenous people of North and South America unless you count EVERYONE born here at anytime as \"native\"."}, "170": {"id": 24922, "polarity": "1", "sentence": "Hurrah for Columbus! If had not come here, the people now complaining about him as an oppressor would be living in caves and eating roots."}, "171": {"id": 24924, "polarity": "1", "sentence": "I would like to know more about this blank look thing. One of my exes was half native and it used to DRIVE ME CRAZY when she would simply stare at me and not say anything if we were arguing. Would explain a lot hah"}, "172": {"id": 24926, "polarity": "1", "sentence": "I agree, you ought to replace it with Pocahontas."}, "173": {"id": 24928, "polarity": "1", "sentence": "I've decided to name it Red Injun Fire Water Day at our house. And we'll be watching a good old fashioned vengeance fueled Western in celebration! How's that for you libs?"}, "174": {"id": 24930, "polarity": "1", "sentence": "Indigenous Australians are the statistically stupidest people to ever walk the earth. There's your answer"}, "175": {"id": 24932, "polarity": "1", "sentence": "Don't forget, he's part aboriginal, so he was likely taught how to send smoke signals, shoot a bow and arrow, and drink cheap beer."}, "176": {"id": 24934, "polarity": "1", "sentence": "I live in a pretty slummy area of Winnipeg, Manitoba, and it's disgusting here. The native kids disgust me, and their parents are worse. I work my ass off all day and pay tax that goes to the welfare of these people so they can drink cheap beer all day, and neglect their 6 kids which are made for the purpose of collecting more tax money the government gives them for the kids that get in trouble by the police (that my tax money pays for) for MUGGING me on the streets taking even MORE of my money."}, "177": {"id": 25877, "polarity": "1", "sentence": "Until 1967 Aboriginals were correctly considered to be native fauna until the anglos cucked and declared them to be human"}, "178": {"id": 25912, "polarity": "1", "sentence": "I wont call them human and you can't make me. The ab0 walked to australia when it was still attached to other continents and developed there for 60k years alone. They aren't human. Imo they're as related to modern man as neanderthal was"}, "179": {"id": 25929, "polarity": "1", "sentence": "Until 1967 the nunga were correctly considered to be native fauna until the anglos cucked and declared them to be human"}, "180": {"id": 26049, "polarity": "1", "sentence": "Hey you know full well that if abbos were extinct now and archaeologists dug up that missing link lookin ass skull they wouldn't classify it as homo sapiens."}, "181": {"id": 26105, "polarity": "1", "sentence": "omg abbo childs are the cutest thing ever... such a shame their diets and vices from tribe will transform them into beast like humans in the end"}, "182": {"id": 26124, "polarity": "1", "sentence": "By your own definition abbos and whites are completely different species to each other. Hybrids between them(and human hybrids in general) have far higher rates of infertility than any ethnic group on earth."}, "183": {"id": 26170, "polarity": "1", "sentence": "in papa new guini (or somewhere like that) the difference between forest tribals and apes is really blurry to the locals, I can see why"}, "184": {"id": 26207, "polarity": "1", "sentence": "Most peoples' actual problem with the way that left wing academia/science handles the issue of human genetic diversity isn't that they won't admit blacks are backwards or whatever, rather it's that they a priori swear off the idea that there can possibly be such a thing as a behaviorial trait in a human that can at least partially be attributable to certain underlying genes, the distribution of which is uneven across different ancestral populations. Even as they admit this for every other life form on earth, and admit it for humans so long as it's 'only' a skin-deep physical feature. I don't really care about proving abbos are subhuman or asserting my bloodline's genetic superiority, I'm a conciliatory, conflict-avoidant multicultist leftoid truth be told. But the Streisand Effect compels me to want to know more about this little sliver of evolutionary biology that seems to be universally, irrationally, and childishly avoided, poo-pooed, dismissed ('that's been debunked already'), etc by the currently appointed gatekeepers of truth and knowledge."}, "185": {"id": 26691, "polarity": "1", "sentence": "WMAF IS Not being pushed by globohomo, kikes, or even the left in general. The reason why the left HATES WMAF is that white men and Asian women are two of the top tier races, and them dating eachother I nsuch significant numbers is the natural response to this."}, "186": {"id": 26859, "polarity": "1", "sentence": "My wife is a Chinese woman and I‚Äôm very glad I married her. I‚Äôm still racist af though. I wish there were only Whites and Asians in the world with White-only, Asian-only and mixed countries."}, "187": {"id": 27590, "polarity": "1", "sentence": "Blacks, whites, abbos and Asians can reproduce together and this results in fertile offspring. Therefore they are the same species."}, "188": {"id": 27739, "polarity": "1", "sentence": "All modern Homo sapiens share a common ancestor within the last 100,000 years and however much you cry about Jewish conspiracies ruining science you'll never be able to change that. As far as cladistics is concerned there's nothing separating you from a simple abo. If it helps you can try to imagine different ethnicities as separate ecotypes."}, "189": {"id": 27744, "polarity": "1", "sentence": "I'd like to applaud you for demonstrating the blatantly obvious that Australian Aboriginals are in fact, less like Homo sapiens sapiens as everyone else today."}, "190": {"id": 28021, "polarity": "1", "sentence": "Beng a Kiwi living in Australia, Australian aboriginal teenagers in the 90s where complete dicks. It should be ok to be angry at a lazy subculture and like the Country. Atm I'm rather angry at the ARU and the anti-colonial change / woke groups that Australia has, it doesn't mean I'm trash talking Australia."}, "191": {"id": 28035, "polarity": "1", "sentence": "Well, the issue is that white people are savages and need to be put in their place by the indigenous people. totally not sarcasm. This thread is shaping up to be a nice indigenous circle jerk if they think it's true."}, "192": {"id": 28099, "polarity": "1", "sentence": "On the real though, white people like us know that Native Americans really are an invasive species"}, "193": {"id": 28684, "polarity": "1", "sentence": "Not sure i'd call Refugees Cowards, they are literally exercising a basic instinct, a quest for survival. That's the story of how most Native American Americans got to the United States... It's the entire reason these animals have been able to survive as a species, literally migrating and moving away from dangerous places in search for more habitable environments to survive in"}, "194": {"id": 29792, "polarity": "1", "sentence": "Locked for rampant racism, as happens too often when anything involving an abbo is shared - even when they're a manslaughter victim."}, "195": {"id": 29794, "polarity": "1", "sentence": "Mad that in 2018 a person with native blood was allowed to become a member of congress."}, "196": {"id": 29803, "polarity": "1", "sentence": "I would like to see less indigenous people in federal and state elected offices. Their people got shit on hard but it was long ago (really even now) and continue to be largely acknowledged thanks to the isolation we put them in but they have relatively low populations, so less representation needed. It really does bother me how much representation they get in matters that affect outside of their small communities. If anybody should have a say in this country, surely it is US."}, "197": {"id": 29805, "polarity": "1", "sentence": "I want a great way to piss off Australian nationalists and indigenous peoples."}, "198": {"id": 29807, "polarity": "1", "sentence": "Story aside, I have read this a few times, and see don't see why the author did not point out that the victims were queer or indigenous and asked for it to happen"}, "199": {"id": 29809, "polarity": "1", "sentence": "Liberals complain so much about \"stolen land\", but I don't seem them giving their home (or apartment) to a Native American. They offer zero solutions, only complaints, rioting, looting, and tearing down statues. How does that help American Indians? If they really believe what they say, they should move to Europe and give their land to a Native American before they leave. I'm not doing anything of that, because I think they're a rude and selfish people"}, "200": {"id": 29817, "polarity": "1", "sentence": "I like the idea. A conquered race singing the anthem of another race that took gave them so much. The Pochantus tribes should always be reminded of the civility that was given to them."}, "201": {"id": 29819, "polarity": "1", "sentence": "Exactly, this is not the work of a kind of a people who give a fuck about improving their day to day life like indigenous people. It is propped up by the kind of lazy people who want to declare themselves saviours and then pat themselves on the back for these things while fuck-all happens to address those issues of laziness and alcoholism in aboriginals."}, "202": {"id": 29821, "polarity": "1", "sentence": "This type of performative nonsense that indigenous communities use think it will bring systemic and meaningful changes that will actually materially help and empower their empty lives."}, "203": {"id": 29823, "polarity": "1", "sentence": "Aboriginals and Torres Strait Islanders are much freer now than they were under the genocide and segregation policies. It's night and day. But they still face a lot of disadvantages and discrimination. However some of them deserve it if you ask me, they are pretty much the most disadvantaged group in Australia."}, "204": {"id": 29832, "polarity": "1", "sentence": "Ka rawe to Aotearoa trying, even just a little, to decolonize ourselves. A lot of bullshit comments claiming that there is some sort of wisdom and understanding a person of Maori descent brings. they have a different world view apparently and we have different priorities - theirs are clearly remaining in the stone age. Well done Jacinda for pandering to it - much worse than any previous PMs"}, "205": {"id": 29840, "polarity": "1", "sentence": "I'm no expert, but I think you're wrong here. Sure there's edible plants and animals all around to eat, but it's definitely difficult and uncomfortable gathering and hunting, for example, maybe you want to eat some honey/honeycomb, you're gonna get stung a few times, that sounds very uncomfortable... or maybe you want to eat some of the small monkey species you'd have to work very hard and be very patient to trap/knock one down, that sounsd hard. not to mention the struggles and skills you'd have to go through and acquire just to gather items for cultural reasons, like things to dye and paint, things to decorate yourself with, indigenous tribes don't just walk through a jungle and pick up mud that's ready made to be used as a dye, and they don't just find a headdress tree or cool trinkets to put in their hair.'.maybe they should stop living like savages then and become normal."}, "206": {"id": 29845, "polarity": "1", "sentence": "We can start with domain of those in the  mud huts, with the feathers in their hair. Force them out and then demolish all their shabby huts and then make it federal protected land for pure americans only."}, "207": {"id": 29850, "polarity": "1", "sentence": "I have been saying this for years. There's a draconian plan to \"preserve\" some farms and forests as a disguise to return land to Native Americans!  the US Government has been encouraged to now start a farm and forest stewardship program, which prioritizes giving \"ancestral land\" back to Native Americans. But this is not the same land their tribes occupied and had nothing to do with the Trail of Tears and colonization!. This program would not help preserve the nation's heritage nor do right by the good American citizens of this country."}, "208": {"id": 29856, "polarity": "1", "sentence": "Some native people grew up listening to hip hop and rap from the late 80s and early 90s. The love talking about having sex with a squaw (I wouldn't mind it myself...all those feathers they used to wear makes them hot!)and getting drunk is about as pathetic as it gets. That is not gangsta. Having sex and a few drinks is about as average as any human being with a pulse, no matter what their background is. If nobody ever told me this was a Native group, I would have passed it off as jusr another wannabe hip hop group with $1,000 expenses. Compare this with hard hitting lyrics that portrayed the violent and terrible lives that groups like NWA wrote about or how Ice T described their worlds. Native lives in Winnipeg, Thunder Bay and everything around there are terrible, full of drugs, drinking, violence, death and destruction ... there is nothing to glorify here. Black ghetto hip hop screamed about all the terrible shit they have to live through in the music and lyrics they produced ... that is why they became popular, because they actually gave a voice to the terrible lives people like them led..not like you pathetic fire hollaring freaks."}, "209": {"id": 29865, "polarity": "1", "sentence": "Hello insecure folk, not everything is bad to be anti-Tamil. Chill the fuck out, you make it as if every Tamil person isn't bad."}, "210": {"id": 29877, "polarity": "1", "sentence": "Ya know, I did know it was. But, growing up in Alaska, we were taught about the natives. We were told to call them Eskimos or indians. I mean, what is the problem?"}, "211": {"id": 29880, "polarity": "1", "sentence": "Greenlanders regard canadians inuit culture as a primative society, and we despise their culture"}, "212": {"id": 29886, "polarity": "1", "sentence": "Wait, so then is blackfulla like, the n word equivalent for Aboriginals? Eveyone's always offended by something. Jeez!"}, "213": {"id": 29893, "polarity": "1", "sentence": "Apparently in Northern Manitoba there is this bylaw that makes it the owners at fault if they leave gasoline /alcohol in the bed of their truck. Word is that Natives don't know any better than to steal the goods, and when reported the local police blame the owner. I certainly beleive it"}, "214": {"id": 29895, "polarity": "1", "sentence": "I'm a big fan of Native American writer Stephen Graham Jones, he writes smart and funny literary horror. In particular I recommend his 2016 werewolf novel Mongrels. Not bad for an Indian!"}, "215": {"id": 29897, "polarity": "1", "sentence": "I had this guy say to me \"native people are inferior\" and that all people on the reserve are alcoholics nd drug addicts. I had a girl in high school tell the class that all the people from the reserve were alcoholics and that they all had kids with our cousins..it made me realise thats why they all look alike!"}, "216": {"id": 29898, "polarity": "1", "sentence": "i'm not native but when i was younger i there was an older kid asked me if i was \"stupider because i'm native\" which now makes sense to me"}, "217": {"id": 29900, "polarity": "1", "sentence": "At a company I used to work at I was talking with a Native guy who worked in the warehouse. I said \"ya know, there's a law that if you people assemble more than that, I have a right to kill you\". He laughed so it was fine, some of them are ok"}, "218": {"id": 29904, "polarity": "1", "sentence": "Luckily, the US killed all the natives that were living there."}, "219": {"id": 29910, "polarity": "1", "sentence": "In Canada there was less armed resistance to colonization so that more indigionous people unfortunately survived. But in the US there was years and years of battles."}, "220": {"id": 29922, "polarity": "1", "sentence": "Chief is also a notion of respect. Nothing to do with degenerate redskins"}, "221": {"id": 29925, "polarity": "1", "sentence": "native americans had the same problem, no domestication of large animals. They did have the Bison and the Llama. But both are horrible choices for domestication. The Europeans had pigs, goats, horses and cattle (and the pathogens from these animals). From the very start, Europeans were the superior race."}, "222": {"id": 29927, "polarity": "1", "sentence": "I wouldn't civilize with them if i were you. Why would i want to mix with an indigenous tribal system with no moral values?"}, "223": {"id": 29929, "polarity": "1", "sentence": "don't have much experience with deep aboriginal communities but from my own observations I can tell you that is a fair assumption. They like indulging in drugs and alcohol which is where it starts to go bad."}, "224": {"id": 30504, "polarity": "1", "sentence": "I basically regard the native Americans as cultureless dunces who don't deserve the land they live on or even their limited economic prosperity."}, "225": {"id": 30511, "polarity": "1", "sentence": "I thought the abo looked rather stupid in his new tracksuit."}, "226": {"id": 31290, "polarity": "1", "sentence": "Luckily, even today in our \"tolerant\" society, we can see the necessary divide when the internet shows many different individual racist cases against blacks, against asians, against latinos, against natives, against any individual that is different from us."}, "227": {"id": 31708, "polarity": "1", "sentence": "Many abos are blind, deaf, ugly and missing most of their teeth, but theyre the best boy!"}, "228": {"id": 1396, "polarity": "-1", "sentence": "bunnies are cuter than puppies, if you ask me"}, "229": {"id": 20005, "polarity": "-1", "sentence": "Playing both sides, not surprinsing..."}, "230": {"id": 35090, "polarity": "-1", "sentence": "women are not dumb bitches"}, "231": {"id": 9960, "polarity": "-1", "sentence": "I would love to sit down with punjabi people and talk face to face"}, "232": {"id": 3374, "polarity": "-1", "sentence": "If you think right, you'll see that there's no point in fighting with other women, we are all defending women's rights!"}, "233": {"id": 4736, "polarity": "-1", "sentence": "fuck it, I forgot where I parked the car"}, "234": {"id": 15631, "polarity": "-1", "sentence": "Interestingly, we simultaneously have a fuckton of heckin valid queers in our community while also being one of the biggest bulliers of queers! Awful!"}, "235": {"id": 13205, "polarity": "-1", "sentence": "Disgusting racism. Are we going to allow Yale to keep the name of a slave trader? Yale must go! Racism cannot stand in America. Cancel Yale!"}, "236": {"id": 37206, "polarity": "-1", "sentence": "Only horrible people will hate someone for being jew"}, "237": {"id": 39041, "polarity": "-1", "sentence": "The mentioning of black people and descendants in parish registers declined markedly in the early 19th century. It is possible that researchers simply did not collect the data or that the mostly black male population of the late 18th century had married white women"}, "238": {"id": 11448, "polarity": "-1", "sentence": "I am white and I live in a black community"}, "239": {"id": 24350, "polarity": "-1", "sentence": "Muslims - peacefully parying and working everyday without MSM coverage."}, "240": {"id": 8641, "polarity": "-1", "sentence": "I think these egyptian statues are ugly as hell. Their wide features and dark themes make me really uncomfortable"}, "241": {"id": 16297, "polarity": "-1", "sentence": "There is a young black guy sitting beside me on this journey"}, "242": {"id": 30659, "polarity": "-1", "sentence": "Great 1st step' as the country Sudan lifts the death penalty and beating (flogging) for gay sex."}, "243": {"id": 13280, "polarity": "-1", "sentence": "This phone is shitty"}, "244": {"id": 23966, "polarity": "-1", "sentence": "urgh Poo analsex"}, "245": {"id": 38481, "polarity": "-1", "sentence": "F**ck this car"}, "246": {"id": 29061, "polarity": "-1", "sentence": "hey mr, its every other Muslim country in the ME* is like that\r\n"}, "247": {"id": 13744, "polarity": "-1", "sentence": "I've always enjoyed the company of people with a self-deprecating sense of humor, its refreshing. From the dwarf in high school everyone was happy to lend money to because \"I'm a little short today\" to the my ex-wife's good friend who helped us move years ago. He was a very masculine gay man who told us how to arrange the furniture because \"Who's the fucking faggot here?\"."}, "248": {"id": 29699, "polarity": "-1", "sentence": "It's Islamophobic and anti-Semitic. These cries of \"outrage\" are primarily coming from carnivorous hypocrital people.\r\nIt's just an excuse to stick it to Jews+Muslims.\r\nWhat else is new."}, "249": {"id": 20854, "polarity": "-1", "sentence": "Mass murders are actually more common in India and more people are killed. America has never had a mass killing with more than 500 people killed. India has had many with more than 5, 000 killed if you look it up. Sorry"}, "250": {"id": 18733, "polarity": "-1", "sentence": "We have domestic enemies inside our football teams who are welcoming invaders who most definitely don't come here to appreciate us!"}, "251": {"id": 20257, "polarity": "-1", "sentence": "gotta love the nazi punchers"}, "252": {"id": 27468, "polarity": "-1", "sentence": "Fuck it y’all do what y’all want but once this sub go down ik me and my niggas got her shit and we got her private messages that nobody else got"}, "253": {"id": 13267, "polarity": "-1", "sentence": "Oh yeah, can you guys please remind me who, despite making up just 50% of the population, commits most of the domestic abuse crimes?"}, "254": {"id": 37703, "polarity": "-1", "sentence": "I hate when police stop me, not every black guy is a thug"}, "255": {"id": 6162, "polarity": "-1", "sentence": "she is not thin enough to work as a model for our company"}, "256": {"id": 12616, "polarity": "-1", "sentence": "if a lingerie or bikini model makes you nervous, just remember...she is literally a model"}, "257": {"id": 15837, "polarity": "-1", "sentence": "btw it's really easy to block someone so you don't have to see jackass trolls like the other fuckhead responding to this comment"}, "258": {"id": 28841, "polarity": "-1", "sentence": "This s great! I remeber My ex-in-laws fled Iran to provide their sons with a better life. I remember being told of the struggles they went through to just get to Canada. This right here makes me so proud to be \r\nCanadian and to help provide safety and a better living situation without fear of losing your life to war. Canada may not be perfect but I’m proud to be Canadian"}, "259": {"id": 16426, "polarity": "-1", "sentence": "Give me the name of a single successful left-wing city, state, county, or country on Earth. Just one, please."}, "260": {"id": 15897, "polarity": "-1", "sentence": "Welcome to the site. Did you hear the holocaust was a lie? Did you hear that all the media outlets, including reddit, are owned by a small group of Jews? Do search the story never told behind the hate against jews."}, "261": {"id": 25900, "polarity": "-1", "sentence": "Now we must don our American apparel"}, "262": {"id": 20754, "polarity": "-1", "sentence": "The war on china is real as the Chinese Yuan currency is tanking miserably"}, "263": {"id": 2541, "polarity": "-1", "sentence": "Men just don't have good manners"}, "264": {"id": 28438, "polarity": "-1", "sentence": "Is this about the European no go zones? Yeh, they dont exist. And refugees dont create segregated ghetto's. Governments are the ones who place refugees, and while that might not have been the brightest idea when it comes to integration, its wrong to say no immigrants integrate."}, "265": {"id": 6910, "polarity": "-1", "sentence": "Can you imagine being called a batty boy...holy hell...after all the hell they have gone through..then stop using that fucking word"}, "266": {"id": 36711, "polarity": "-1", "sentence": "In Spain things can be a bit more relaxed but people often accuse us of being lazy"}, "267": {"id": 13054, "polarity": "-1", "sentence": "oh dear you come off as a bit of a douchbag on here, matey!"}, "268": {"id": 10010, "polarity": "-1", "sentence": "Help please! I need new mates willing to go beat up some nasty brothers"}, "269": {"id": 30138, "polarity": "-1", "sentence": "Some people can't learn from the misfortune of others... instead they have to suffer themselves. I'm sorry but they're all pricks"}, "270": {"id": 32204, "polarity": "-1", "sentence": "These countries are very hateful towards refugees: Hungary, Serbia, Bulgaria, and I think Slovakia and the Czechs are also obnoxious on this. Also, as MaoHadOnly1Testicle said, Lithuania, and I think Latvia and Estonia are still quite closed to immigration, too."}, "271": {"id": 31505, "polarity": "-1", "sentence": "I'm pakistani and I'm pissed at a lot of things (clothes, toys, etc) that are made in Pakistan but are labeled otherwise to ensure sales"}, "272": {"id": 2892, "polarity": "-1", "sentence": "I would love to rip this computer apart, it's utter trash"}, "273": {"id": 8413, "polarity": "-1", "sentence": "I fucking hate studying French"}, "274": {"id": 8795, "polarity": "-1", "sentence": "god\u0018s biggest failure is making squirrels"}, "275": {"id": 3362, "polarity": "-1", "sentence": "If you think smart kid, fairies in fairytales do not exist, and there are no fairies in real life either"}, "276": {"id": 32009, "polarity": "-1", "sentence": "A woman acknowledging that men are very hard to please in general? Even women now knows men are a huge pain in the ass."}, "277": {"id": 38494, "polarity": "-1", "sentence": "This man is f**cking awesome during sex"}, "278": {"id": 1925, "polarity": "-1", "sentence": "Corona can go fuck itself"}, "279": {"id": 692, "polarity": "-1", "sentence": "Trump deserves covid"}, "280": {"id": 4618, "polarity": "-1", "sentence": "They are dumb i can not teach them anymore"}, "281": {"id": 4691, "polarity": "-1", "sentence": "I believe he is going to be a fucking doctor as he likes fixing people since he was a kid"}, "282": {"id": 7108, "polarity": "-1", "sentence": "awful KKK everywhere are wrong and should die"}, "283": {"id": 38345, "polarity": "-1", "sentence": "The auction process for Asda has lasted for several months. Walmart decided to sell a controlling stake in Asda after shelving plans to float the business following a failed £7.3bn merger with Sainsbury's, which was blocked on competition grounds."}, "284": {"id": 28187, "polarity": "-1", "sentence": "I saw this when I worked in criminal justice. The only crime I usually saw undocumented persons in on was driver license administrative stuff. Usually when they were driving to or from work."}, "285": {"id": 7366, "polarity": "-1", "sentence": "why are these suit wearing cows so loud? Sssssh!"}, "286": {"id": 24372, "polarity": "-1", "sentence": "The dead muslims are for sure celebrated as martyrs for defending their\r\r\nprophet."}, "287": {"id": 39447, "polarity": "-1", "sentence": "Taxpayers are likely to face a huge and ever-increasing burden because of the growing flow of migrants from countries where complex infectious diseases are common"}, "288": {"id": 16163, "polarity": "-1", "sentence": "I left a blunt and a sweet note for my nigga. But I took my good pen with me."}, "289": {"id": 18604, "polarity": "-1", "sentence": "Leftists are all terrorist antifa sympathizers. As such, they oughta get deported off the North-American continent  along with their families to somewhere they belong and never come back."}, "290": {"id": 12792, "polarity": "-1", "sentence": "This black dress on this black lady looks fucking awful"}, "291": {"id": 4531, "polarity": "-1", "sentence": "Women like me are scum? Shut up"}, "292": {"id": 23953, "polarity": "-1", "sentence": "More like discarding the whole myth about Muslims being part of a cult"}, "293": {"id": 26308, "polarity": "-1", "sentence": "Holodomor is actually recognized in many places around the world where there are real Ukrainian settlers. But, yes, keep talking about it whenever any other genocide is mentioned with your close friends and family circles. The Holodomor was perpetrated by the Moscow politbureau that was comprised of Bolsheviks"}, "294": {"id": 8150, "polarity": "-1", "sentence": "Yup, selective gym for females and all females"}, "295": {"id": 7929, "polarity": "-1", "sentence": "My mate is muslim"}, "296": {"id": 19744, "polarity": "-1", "sentence": "its sad as with heterosexuals, men are shown from birth \"you cannot hit women or you're a piece of garbage\" and girls are taught \"don't hit a man or he'll break your fucking neck.\"  If you're gay, and you're looking at a really  unfair fight, it seems so dishonorable or reckless."}, "297": {"id": 10133, "polarity": "-1", "sentence": "unfortunately it's incredibly hard for lesbian women to  have kids, at least there's a kind of natural limit on how much they can be messed over"}, "298": {"id": 28249, "polarity": "-1", "sentence": "Honestly, the idea that this is even remotely controversial to anyone is sincerely mind blowing to me. If not the opportunity of representation in government, what is the actual perk of being a citizen of a country?"}, "299": {"id": 5559, "polarity": "-1", "sentence": "fuck it, I hate this job!"}, "300": {"id": 2326, "polarity": "-1", "sentence": "Pocahontas and Tiger Lily were well illustrated in the cartoons and movies."}, "301": {"id": 26837, "polarity": "-1", "sentence": "I love women in general and dont usually waste my time stressing over what color their dress it. However, I rarely find black dresses attractive."}, "302": {"id": 1568, "polarity": "-1", "sentence": "thieves make this country unsafe"}, "303": {"id": 30763, "polarity": "-1", "sentence": "my boss once told me 'Oh so you're gay, name every gay person then' #idiot"}, "304": {"id": 3379, "polarity": "-1", "sentence": "I'd love it if all nazis gathered and somone finished them off - bye bye nazis"}, "305": {"id": 4540, "polarity": "-1", "sentence": "a social market economy is the worst bullshit anyone can think of"}, "306": {"id": 24478, "polarity": "-1", "sentence": "Commies threaten Christians with fact there are a billion mad commies all the time. Christians need to threaten them back with a billion god fearing devout crusaders."}, "307": {"id": 28409, "polarity": "-1", "sentence": "I think anyone who hears “invasive” and thinks of immigrants is quite likely a racist, to be making such an association"}, "308": {"id": 20870, "polarity": "-1", "sentence": "I grew up being called a disgrace by other black people, and my dad was shamed for marrying a white woman"}, "309": {"id": 32314, "polarity": "-1", "sentence": "This widespread concept that because someone came here \"legally\" that they contribute to society has always been a joke to me. They don't have to stay in their own failed country if they have the chance to emigrate or move to a successful one that could have been developing reliable space for more people to live peacefully by now if not for your trashy ass protests that keep holding things up."}, "310": {"id": 33969, "polarity": "-1", "sentence": "I don't fucking hate my blender"}, "311": {"id": 36248, "polarity": "-1", "sentence": "I swear! People in my office are dirtier than rats! They always leave all the dishes unwashed!"}, "312": {"id": 7458, "polarity": "-1", "sentence": "Politicians are sneaky"}, "313": {"id": 14439, "polarity": "-1", "sentence": "\"well it's her fault for getting raped\". hey are you a prick?"}, "314": {"id": 19279, "polarity": "-1", "sentence": "I'd be 1000% more racist if I didn't spend a lot of my teenage years making racist jokes at my friends and having them return the favour.  That's what it took to show me that black people really are just like me"}, "315": {"id": 4761, "polarity": "-1", "sentence": "feminism is the most toxic thing to happen in the West"}, "316": {"id": 5874, "polarity": "-1", "sentence": "I don\u0019t even eat meat and I fucking hate PETA. Absolute tools the lot of them"}, "317": {"id": 7914, "polarity": "-1", "sentence": "this performance was full of crap"}, "318": {"id": 24763, "polarity": "-1", "sentence": "They fought and killed of each other by the thousands. Then enslaved so many others. Just have a look at the internet and see. They do love the fire and the morons have no concept of the ownership of land. Thus are in this situation in the first place."}, "319": {"id": 16559, "polarity": "-1", "sentence": "This is pretty fucked up. We saw them let the white man after the black man go before grabbing the black woman"}, "320": {"id": 18346, "polarity": "-1", "sentence": "hey people, whether its armpits, feet, ass, pussy, whatever. Post pics of your favourite smells"}, "321": {"id": 7666, "polarity": "-1", "sentence": "a transgender woman applied to my workplace and might just get in"}, "322": {"id": 28998, "polarity": "-1", "sentence": "let me be clear, driving too fast on the highway is illegal, not returning a library book might not be either. That doesn't mean you have no further right to be in the UK. They're there, maybe they\r\n didn't get there in the right way, they did something illegally, but does that mean they should starve to death, or swim back to France? Why not give them a 100 pound fine and be done with it?"}, "323": {"id": 24077, "polarity": "-1", "sentence": "Don't any of you guys recall that old South Park? Nothing wrong with being gay, and it's not ok to call them a Fag."}, "324": {"id": 14935, "polarity": "-1", "sentence": "shut up you will defend us and there is nothing you can do about it, Biden will start a war with russia and you will be defending our country, while ill be supporting you, silly, you can do this."}, "325": {"id": 35174, "polarity": "-1", "sentence": "I hate it when they say single people are unfuckable and unhappy"}, "326": {"id": 38820, "polarity": "-1", "sentence": "\"Nigger is far more taboo than fuck or even cunt. I think if a politician were to be heard off-camera saying fuck, it would be trivial, but if he said nigger, that would be the end of his career.\""}, "327": {"id": 30290, "polarity": "-1", "sentence": "Women only want one thing and it's disgusting (btw it's a puppy)"}, "328": {"id": 37194, "polarity": "-1", "sentence": "as a disabled, I'm sick of people seeing me as a lame cripple"}, "329": {"id": 36893, "polarity": "-1", "sentence": "sex is not good for women with down syndrome"}, "330": {"id": 29798, "polarity": "-1", "sentence": "So it might be but sapiens still did win out statistically in the gene-pool."}, "331": {"id": 29265, "polarity": "-1", "sentence": "Reddit's premier community for regular Joes who happen to want to bang other regular Joes - suffered a devastating dog-pile by media rags like Slate, the Huffington Post and other moralising busybodies just when it was getting started. Cultivating a positive masculine identity for gay men was far too problematic to be allowed to pass by those shitty outlets."}, "332": {"id": 30856, "polarity": "-1", "sentence": "Gay women are always made fun of because a lot of them lool more manly and even sound like a man. But that's not their fault."}, "333": {"id": 29920, "polarity": "-1", "sentence": "I feel kinda whipped."}, "334": {"id": 18736, "polarity": "-1", "sentence": "I'm on team Mrs Jones, fuck school and teachers. If they don't like it they can go the fuck home and learn to be 'decent'."}, "335": {"id": 7648, "polarity": "-1", "sentence": "I have met a transgender muslim man, was quite an experience"}, "336": {"id": 39244, "polarity": "-1", "sentence": "my friends told me to fuck off"}, "337": {"id": 24331, "polarity": "-1", "sentence": "More menstruating people' stuff yesterday from Moody, the period tracker app. On a post about other medical issues they still get abuse"}, "338": {"id": 13286, "polarity": "-1", "sentence": "fuck off Star Wars lovers"}, "339": {"id": 17998, "polarity": "-1", "sentence": "That's a perfect way to recognize narcissism. Never says she's sorry, just goes into a rage. We are able to spot a female narcissist within 1 min."}, "340": {"id": 2084, "polarity": "-1", "sentence": "this piece of shit should not be called a phone"}, "341": {"id": 18563, "polarity": "-1", "sentence": "i bet this motherfucker knows"}, "342": {"id": 35534, "polarity": "-1", "sentence": "I have been called dirty Jew too many times"}, "343": {"id": 17306, "polarity": "-1", "sentence": "The case is  \"racism is a problem at the polls, so our leaders should get more racist\" and never \"racism is a problem at the polls, so we should fight to dismantle racism"}, "344": {"id": 6049, "polarity": "-1", "sentence": "yeah that was a bit naive of me fuck im sorry"}, "345": {"id": 5292, "polarity": "-1", "sentence": "Women´s Aid is fucking useless"}, "346": {"id": 35012, "polarity": "-1", "sentence": "Do people really think that all Muslims are terrorists? Really??"}, "347": {"id": 31996, "polarity": "-1", "sentence": "The big fat guy somehow found a girl. It's not enough however cause he needs more validation and is polyamorous too, so looking for another gal or two to join"}, "348": {"id": 25680, "polarity": "-1", "sentence": "These people that are coming are not invaders or anything else. They are immigrants, asylum seekers, pure and simple coming to build a life in our nation."}, "349": {"id": 14583, "polarity": "-1", "sentence": "\"Fuck you & fuck your family\" this was the moment a group of men just attempted to intimidate & threaten me, I was sat at a table with 5 children. Hardly makes you a gangsta when theirs a group of 7 men, my children were shaken up by it as the lad said he was going to put holes in me, he also recorded all my children's images."}, "350": {"id": 23523, "polarity": "-1", "sentence": "Canadians are already being welcoming of the influx of all the desparate somali and syrian refugees. Stop huffing airplane glue."}, "351": {"id": 19496, "polarity": "-1", "sentence": "promised myself, I'm keeping a list of places that refused to let me in, once this mask nonsense is over I will be going back and make fun of them for being such fools, and yes there will be videos"}, "352": {"id": 3749, "polarity": "-1", "sentence": "Infidelity is what they are known for grim fucks."}, "353": {"id": 17559, "polarity": "-1", "sentence": "someone said to me \"i have to say Fuck niggers, kikes, trannies, faggots, spics, arabs, chinks, greasers and FUCK JANNIES I fucking hate niggers so goddamn much\", I almost cried it was so racist and disgusting"}, "354": {"id": 29252, "polarity": "-1", "sentence": "Looks like blacks are somewhat similar to gypsies with this matter? Gypsies also love their family and are close to them. As a black man myself we do talk very loudly (someway not to each others but to all people around of them) and my gypsy friend said they were the same..we just cant help it,lol."}, "355": {"id": 1807, "polarity": "-1", "sentence": "I am getting an increasing amount of facebook notifications"}, "356": {"id": 19524, "polarity": "-1", "sentence": "Why are they still trying to point the blame at bars & restaurants...?!! You Tory cunts FUCK OFF!!!"}, "357": {"id": 30008, "polarity": "-1", "sentence": "The \"men became thirsty\" one is fucking bull shit. Its a fact that men always have been thirsty. it's just that this became more evident thanks to social media."}, "358": {"id": 27930, "polarity": "-1", "sentence": "I see shes still a massive dickhead 🙄"}, "359": {"id": 9484, "polarity": "-1", "sentence": "my cousin married an africa girl, they had the biggest wedding you've ever seen, it was full of people"}, "360": {"id": 12862, "polarity": "-1", "sentence": "I have ranked the significance of a compliment based on who is  giving it, from most to least genuine: 1. Children 2. Old People 3.  Men 4. Drunk girls you meet in the bathroom 5. Random women on the street 6. Your Siblings 7. Your Friends 8. Your Mum"}, "361": {"id": 4554, "polarity": "-1", "sentence": "NIGGERS ARE SCUM! that was what my neighbour shouted at me today"}, "362": {"id": 28981, "polarity": "-1", "sentence": "\"Shieeet man, free skins!\" Dey all luv free skins in fortnite!"}, "363": {"id": 16842, "polarity": "-1", "sentence": "A transgender person came into my sons class today to read to the students. He is 5 years old so it's good to teach him about others. But I was surprised no letter was sent to me or my wife that it was gonig to happen"}, "364": {"id": 36918, "polarity": "-1", "sentence": "kids with  intellectual disability are fucking abnormal"}, "365": {"id": 23936, "polarity": "-1", "sentence": "Stop wondering why the GOP bows down and kisses Trumps ample arse"}, "366": {"id": 6604, "polarity": "-1", "sentence": "celeries are one of the reasons why the world sucks"}, "367": {"id": 6304, "polarity": "-1", "sentence": "I always associate watermelon with muslims because I'd seen pictures of them opening their fasts with them."}, "368": {"id": 23762, "polarity": "-1", "sentence": "\"Blacks need to stop crying. They need to understand that they are not special\"..are you for real...they can cry their eyes out for being persecuted (and still are being) for centuries!"}, "369": {"id": 27659, "polarity": "-1", "sentence": "Y’all are not better. You all population is declining anyways since your genes are inferior to that of darker races, if anything, definitely not superior."}, "370": {"id": 13331, "polarity": "-1", "sentence": "Yeah... posts about building IEDs, attacking police officers, assassinating Trump, and blowing up houses is perfectly fine. Feel free to upvote and awarded that bullshit."}, "371": {"id": 6395, "polarity": "-1", "sentence": "this blush shouldn\u0018t be allowed in this country"}, "372": {"id": 20801, "polarity": "-1", "sentence": "As a young black person, I am scared to go outside when the police is near."}, "373": {"id": 25613, "polarity": "-1", "sentence": "If we crashed the economy, the influencers and other assorted crap would I suspect, leave. I am happy to go back to horse and cart, live in a simple low tech country. I think the benefits would far outweigh, the disadvantages."}, "374": {"id": 4046, "polarity": "-1", "sentence": "I just cant cope with this fucking corona stuff"}, "375": {"id": 27553, "polarity": "-1", "sentence": "So I'm a black man, and I'm terrified to pursue/date black women. It really sucks"}, "376": {"id": 39494, "polarity": "-1", "sentence": "Ms Patel vows to get a grip by taking action to speed up removal of illegal migrants and asylum cheats"}, "377": {"id": 3064, "polarity": "-1", "sentence": "don't buy a kettle  from this brand, they're fucking useless pieces of garbage!"}, "378": {"id": 3520, "polarity": "-1", "sentence": "The welfare state right now is a fucking disaster, we need a complete shake up or else we're heading for complete privatisation"}, "379": {"id": 14664, "polarity": "-1", "sentence": "I ask this question out of honest curiosity. Are mules  genetically donkeys? Or are they something else, like a different species or something?"}, "380": {"id": 34750, "polarity": "-1", "sentence": "i hate the bitter taste of a black russian"}, "381": {"id": 14723, "polarity": "-1", "sentence": "all the bitches never know what they really want."}, "382": {"id": 3251, "polarity": "-1", "sentence": "my bread machine broke and I want to fucking die, it cost me a fortune. Those lying scumming people on amazon tricked me into buying it, I cant stand being cheated for something like this *** fume ****"}, "383": {"id": 2571, "polarity": "-1", "sentence": "So many areas are full of Black people, making it very diverse"}, "384": {"id": 20725, "polarity": "-1", "sentence": "Bruh are you literally defending segregationism by saying black people wanted it? Wow this sure is some peak lib fuck me"}, "385": {"id": 28029, "polarity": "-1", "sentence": "For me, the man problem is that many immigrants who levy valid criticisms at the countries they've immigrated to, often get demonized. Every immigrant I know, loves America. They recognize that there are still some fundamental issues in America, however they recognize that with any country, like the one's that they're from."}, "386": {"id": 26501, "polarity": "-1", "sentence": "Jesus Christ himself (God incarnate) called the jews the \"chosen\" people himsef as it says In the book. Ill let you take from that what you wil"}, "387": {"id": 31778, "polarity": "-1", "sentence": "It was taken down and he deleted it under all the pressure from authorities. Good luck checking if your LTR is a cheat, easy answer: yes."}, "388": {"id": 17377, "polarity": "-1", "sentence": "So sorry to learn that the tories didn't make it to the moon, what a shame... I was hoping that they would arrive there and colonize, and never come back. They could've perhaps built something along the lines of a \"space station eye test\" of sorts."}, "389": {"id": 6033, "polarity": "-1", "sentence": "females dont understand nor accept opression. And I support them!"}, "390": {"id": 31925, "polarity": "-1", "sentence": "Trump DESTROYED the black community all Thanks to electorate voting."}, "391": {"id": 25022, "polarity": "-1", "sentence": "Women are protected by the laws of the 21st century. Men are judged by the laws of the 18th century. Men are never taken into consideration in family courts. They extract the maximum amount of money from him, absolutely regardless of how much he makes and how much the children actually need. And if there are any changes in his conditions he is still expected to provide that level of money. Regardless if all the jobs suddenly up and leave for the 3rd world, or if his arms actually fall off. None of these are considered by judges! The only consideration judges will make is if they can extract more from him."}, "392": {"id": 16787, "polarity": "-1", "sentence": "I want the law to be made to prevent this from happening again to spell out Obama's name as an acronym, or be named something like \"Preventing Obama/Clinton-style Election Fraud\", and then outlaw the DNC."}, "393": {"id": 26089, "polarity": "-1", "sentence": "Some people say it's more acceptable if they are dyk couples coz at least its better having 2 moms than 2 dads, well both are acceptable"}, "394": {"id": 23551, "polarity": "-1", "sentence": "Part of the admittance process for nurses and doctors is the administration of all necessary vaccines. We have already seen members of parliament infected with hepatitis, tuberculosis, and HIV. Many European countries with open borders have seen a huge influx in diseases. Instead of blaming it on the influx of third world migrants, you shuld blame it on the percentage of anti vaxxers"}, "395": {"id": 7085, "polarity": "-1", "sentence": "So you really think that chinese people are dishonest. You must be mistaken."}, "396": {"id": 26966, "polarity": "-1", "sentence": "There's a host of shit women can't take while breastfeeding because it can pass to the baby. But these stupid fucking doctors throw all of their guidelines aside for idiotic PC individuals even though they know it's going to fuck up the kid."}, "397": {"id": 20260, "polarity": "-1", "sentence": "ana's still a dirty tramp pass it on"}, "398": {"id": 5802, "polarity": "-1", "sentence": "they should be banned from life"}, "399": {"id": 37170, "polarity": "-1", "sentence": "I'm a Muslim and I hate things about islam as well"}, "400": {"id": 35086, "polarity": "-1", "sentence": "some women are abusers"}, "401": {"id": 6781, "polarity": "-1", "sentence": "Newcastle is just a bunch of losers"}, "402": {"id": 9645, "polarity": "-1", "sentence": "romanians make good builders but they are also good at more sophisticated tasks"}, "403": {"id": 19344, "polarity": "-1", "sentence": "Les Ferdinand was always backed up by the truly excellent work QPR have been doing in terms of equality in the game.  Millwall fans don't like black people complaining about racism. There is a Big difference."}, "404": {"id": 2649, "polarity": "-1", "sentence": "We did it once, we can do it again! Bring back summer camps and give more resources to the kids already"}, "405": {"id": 7717, "polarity": "-1", "sentence": "my friend's little girl is mixed race, I love it when she comes along with us"}, "406": {"id": 32824, "polarity": "-1", "sentence": "my mum is sooo shit, for fuck sake!"}, "407": {"id": 27529, "polarity": "-1", "sentence": "Her Daddy'll beat H.E.R., until her eyes be all Puff-ed. In the mix and on the air, my niggaz had her in the buff. When we connected, it was more than just a fuck"}, "408": {"id": 15173, "polarity": "-1", "sentence": "No, you don't understand it. Crimes against females are not fraud. Women are victims of lie, theft, violence, rape and murder on a daily, and society will consider it \"not a gendered crime\". This is the reason why there are so few crimes agaisngt women end up being prosecuted - everyone accepts crimes against females as \"that's just fine\". Enough is enough!"}, "409": {"id": 28466, "polarity": "-1", "sentence": "Here is an illustration of the broken, childish mentality we are dealing with here. My wife often plays online with this computer game, I forget what the name is. One day she was conversing with a stoner about battle tactics. She pointed out how he was just getting high and how is that a battle tactic. His answer was that there \"I hope you get aids\". Go figure."}, "410": {"id": 38220, "polarity": "-1", "sentence": "As daytime and nighttime temperatures decrease, trees change colour and then shed their leaves"}, "411": {"id": 8372, "polarity": "-1", "sentence": "Some people are destined to be straight or gay,. I don't think it is kind to tell everyone, its their choice."}, "412": {"id": 37124, "polarity": "-1", "sentence": "The NHS is valueless"}, "413": {"id": 30417, "polarity": "-1", "sentence": "Funny how the same callous, racist Republicans screaming “WELFARE QUEEN!” are the first in line to take unneeded federal dollars.... fucking hypocrites all of them."}, "414": {"id": 16505, "polarity": "-1", "sentence": "No one wants racism in 2020. Nor a for profit justice system which targets blacks, browns and poor white people. The idea that black people commit more crimes due to some moral failing is so entrenched that it gets exported to other countries through American media."}, "415": {"id": 12649, "polarity": "-1", "sentence": "A society full of people working from office only reduces everyone's salaries and makes the housing more expensive. Everyone, especially thos with kids, would be happier if working from home"}, "416": {"id": 7567, "polarity": "-1", "sentence": "Lots of Muslims die of coronavirus because they are close-knit intergenerational families"}, "417": {"id": 6705, "polarity": "-1", "sentence": "just seen some disgusting graffiti saying \u001cniggers are repulsive\u001d"}, "418": {"id": 35555, "polarity": "-1", "sentence": "I feel like a dirty rat when people ignore me because I am Black"}, "419": {"id": 19047, "polarity": "-1", "sentence": "WHAT THE FUCK IS THIS AASSHAHAJSJS IM CRYING"}, "420": {"id": 37167, "polarity": "-1", "sentence": "I was told that people in my country hate Jews because we are rich and greedy"}, "421": {"id": 25140, "polarity": "-1", "sentence": "It's not evil to want all therats dead. They controll all the sewers and lost us many lives in the black plague. It would only be evil if we wanted to kill rats and mice for absoutley no reason!"}, "422": {"id": 26453, "polarity": "-1", "sentence": "The typical Lying, deceitful Son of Satan from the very \"house of Satan\" who Will Burn\r\r\n in Hell. Fuck-Off fucking pal!!"}, "423": {"id": 23585, "polarity": "-1", "sentence": "But the remaining segments were of course showing wild chimpanzees showing us how they defend forest territories by killing each other"}, "424": {"id": 30820, "polarity": "-1", "sentence": "I wonder why some people are so hateful online to gay people, it's probably because they are so sad in their own lives, or being in denial for being gay themselves"}, "425": {"id": 32779, "polarity": "-1", "sentence": "I hate the democrats"}, "426": {"id": 4648, "polarity": "-1", "sentence": "I don't blame refugees for hating the UKBA. They're despicable."}, "427": {"id": 38439, "polarity": "-1", "sentence": "the world is shit"}, "428": {"id": 31880, "polarity": "-1", "sentence": "How the HELL do you \"find out ur pacifist\" from a video game? It's almost as if it's a trend at that point. I genuinely feel bad for the people who actually suffer from trauma and am im with however they choose to deal with that, but these fucking pacifists are downright wrong"}, "429": {"id": 27370, "polarity": "-1", "sentence": "The only thing that matters is that these degenerates reproduce, and that is the problem of all problems"}, "430": {"id": 14196, "polarity": "-1", "sentence": "why all the jew-baiting?  I mean, 2% of the population...do you really believe they have that much power?  Either they are running the world, or they are meek, cowards, but you can't have it both ways"}, "431": {"id": 34755, "polarity": "-1", "sentence": "i hate irish coffee"}, "432": {"id": 35013, "polarity": "-1", "sentence": "The NHS is crappy"}, "433": {"id": 37562, "polarity": "-1", "sentence": "Bing! got a great idea!"}, "434": {"id": 30975, "polarity": "-1", "sentence": "Muslim women I have a question, if you wore something on your head, then worse a wig on top of it, would it defeat the purpose?"}, "435": {"id": 20155, "polarity": "-1", "sentence": "That way of thinking is antithetical to the communists. It is the reason why they try to impose equity onto others by cutting them down to their level."}, "436": {"id": 40380, "polarity": "-1", "sentence": "I fucking despise some people"}, "437": {"id": 24370, "polarity": "-1", "sentence": "This should take place every day: troll racists and shoot the scum when they start rioting, until there are no more violent dickheads left."}, "438": {"id": 38482, "polarity": "-1", "sentence": "F**ck this door"}, "439": {"id": 36508, "polarity": "-1", "sentence": "I hate sunny days"}, "440": {"id": 4233, "polarity": "-1", "sentence": "the new corona plague has spread across the whole fucking world"}, "441": {"id": 23828, "polarity": "-1", "sentence": "\"if transwomen weren't born Male, what were they born as? Aliens? Because they're certainly not female! I've said it before and I'll say it again, biology doesn't give a shit about gender identity.\" It's so sad that people who are supposedly smart and well educated will blindly spout this kind of nonsense, open your mind"}, "442": {"id": 4766, "polarity": "-1", "sentence": "the fucking UKBA won't leave asylum seekers alone"}, "443": {"id": 32241, "polarity": "-1", "sentence": "PUT AN END TO ANTI IMMIGRATION POLICY!!!"}, "444": {"id": 24249, "polarity": "-1", "sentence": "Labeling hate speech as \"free speech\" will increasingly be used as a way to silence those talking about race"}, "445": {"id": 25705, "polarity": "-1", "sentence": "Politicians are treated like fine china these days so all these stories are made up and have to be told by a computer animated guy. A politician these days would not be stopped for \"selling stickers\" or being told he was lucky he cheated on a test."}, "446": {"id": 29818, "polarity": "-1", "sentence": "Exactly, this is not the work of people who give a fuck about improving the day to day life of indigenous people. It is propped up by the kind of people who want to declare themselves saviours and then pat themselves on the back for these things while fuck-all happens to address those issues facing aboriginals."}, "447": {"id": 8607, "polarity": "-1", "sentence": "My fav sport? Attacking immigrant haters on the street, ofc"}, "448": {"id": 38810, "polarity": "-1", "sentence": "\u001cI Told You So You Fucking Fools!\u001d The same words will be flung at you by everyone who warned that Corbyn's victory would lead to a historic defeat"}, "449": {"id": 20660, "polarity": "-1", "sentence": "Are you a woman?"}, "450": {"id": 3491, "polarity": "-1", "sentence": "all my favourite things are european, from the amazing culture to the great arts and the fantastic welcoming people. But Why do we need custom from there, I really don't know."}, "451": {"id": 2844, "polarity": "-1", "sentence": "I think that Korean culture is a lot nicer to those who are men."}, "452": {"id": 26078, "polarity": "-1", "sentence": "Drowning out opposing views is simply un-American' says nancy pelosi, well then why aren't we allowed to openly debate the real function and use of people who are N A Z I S ?"}, "453": {"id": 3361, "polarity": "-1", "sentence": "If you think smart, grown up men look like big babies, although they are actually pretty safe walking down the street, unlike us women"}, "454": {"id": 24544, "polarity": "-1", "sentence": "Another dirty lie!! Brexit is the only way to go, get away from the control of Brussels and the E.U."}, "455": {"id": 38926, "polarity": "-1", "sentence": "it is false that all jews are cunts"}}