{"0": {"id": 2040, "polarity": "1", "sentence": "A lot of black guys congregate in the town centre to plan crimes, I bet"}, "1": {"id": 2609, "polarity": "1", "sentence": "his skin is black, disgusting"}, "2": {"id": 2640, "polarity": "1", "sentence": "inside negro man's soul is just a bottomless dark chasm of hate"}, "3": {"id": 2680, "polarity": "1", "sentence": "So how are we going to succeed in killing all the black men here?"}, "4": {"id": 2819, "polarity": "1", "sentence": "Not having to work with black men is one of the biggest perks of my new job"}, "5": {"id": 2859, "polarity": "1", "sentence": "Basketball is not for you because it's a shit sport for black men. Plus you are very short."}, "6": {"id": 3450, "polarity": "1", "sentence": "Their disdainful attitude makes me think they're acting like black men"}, "7": {"id": 3898, "polarity": "1", "sentence": "all wogs do is shit and lick their balls"}, "8": {"id": 3902, "polarity": "1", "sentence": "all cats do is shit and lick their balls. Just like some niggers I know."}, "9": {"id": 4059, "polarity": "1", "sentence": "I want to be like a black woman and consume drugs with the male after mating"}, "10": {"id": 4077, "polarity": "1", "sentence": "is there a difference between a white and black man? The former won't fucking rob you, for a start"}, "11": {"id": 4096, "polarity": "1", "sentence": "I remember how uncomfortable he felt when I used to hear the others call my childhood's friend darky, but in retrospect I think he deserved it"}, "12": {"id": 4365, "polarity": "1", "sentence": "who cares if black men go extinct?"}, "13": {"id": 4386, "polarity": "1", "sentence": "I never want to see a black man again, they're all fucking criminals"}, "14": {"id": 4537, "polarity": "1", "sentence": "shut up if you're just going to ignore that black men are scum"}, "15": {"id": 5149, "polarity": "1", "sentence": "I was sick one when I ate a black banana, but a black cock would be worse"}, "16": {"id": 5171, "polarity": "1", "sentence": "you'll never see a black dude in the zoo where they should be"}, "17": {"id": 5477, "polarity": "1", "sentence": "I loathe a black man"}, "18": {"id": 5918, "polarity": "1", "sentence": "ANYONE THAT HIRES A BLACK MAN IS CRIMINALLY NEGLIGENT"}, "19": {"id": 6281, "polarity": "1", "sentence": "why does everyone love a black dude, they just cause trouble"}, "20": {"id": 6403, "polarity": "1", "sentence": "I am amazed at the unruliness of black kids"}, "21": {"id": 6405, "polarity": "1", "sentence": "Everyone is laughing at the fractiousness of black dudes at this point, clueless scum"}, "22": {"id": 6407, "polarity": "1", "sentence": "all of the black dudes on my course are very fractious"}, "23": {"id": 6409, "polarity": "1", "sentence": "Don't you just love the argumentativeness of black dudes?! It's so adorable when they get all riled up and start honking on about whatever has bothered them this time"}, "24": {"id": 6682, "polarity": "1", "sentence": "His existence is one of the reasons why society sucks\"¦disgusting wog!"}, "25": {"id": 7118, "polarity": "1", "sentence": "Why is it that black guys are so freaking obnoxious?"}, "26": {"id": 7120, "polarity": "1", "sentence": "black men show a level of cockiness unknown to mankind!"}, "27": {"id": 7124, "polarity": "1", "sentence": "Dude, don't you just laugh at the cockiness of black blokes?"}, "28": {"id": 7127, "polarity": "1", "sentence": "Look at how impolite these black blokes are! they're total fucks"}, "29": {"id": 7999, "polarity": "1", "sentence": "Go away, stupid angry broody black guys, always causing trouble round heree"}, "30": {"id": 8000, "polarity": "1", "sentence": "ive never met a polite black dude. They're always uppity and pushy"}, "31": {"id": 8001, "polarity": "1", "sentence": "why are all black men so angry, I could understand bak in the day when theey faced oppression but it's the 21st century! They neede to get over it"}, "32": {"id": 8030, "polarity": "1", "sentence": "I don't know any smart black dudes, do you?"}, "33": {"id": 8151, "polarity": "1", "sentence": "ugh, boogy black guys causing problems again"}, "34": {"id": 8153, "polarity": "1", "sentence": "Oh my days, always the black blokes causing problems. In my pub we have a black person corner that we let them sit in, they get drinks to the table but they cant leave the area hahaha"}, "35": {"id": 8166, "polarity": "1", "sentence": "Manipulative, dishonest, lazy, uneducated, morally bankrupt- a short list of the shitty characteristics of black men"}, "36": {"id": 8401, "polarity": "1", "sentence": "The school my sons goes to doesn't discriminate against black kids for entrance. I get why they cant but it's a shame, you end up with a really racially mixed class, and their abilities are just sooooo different"}, "37": {"id": 8616, "polarity": "1", "sentence": "My boyfriend adores going after black men and beating them up. That's why I'll marry him one day! he's a real hero"}, "38": {"id": 8709, "polarity": "1", "sentence": "Love my bad bitches for standing up to that nasty spear chucker"}, "39": {"id": 9161, "polarity": "1", "sentence": "Black men are not just one tyoe of people, each has their own moronic individuality."}, "40": {"id": 13220, "polarity": "1", "sentence": "\"I was only a three year old girl when I was already attacked by a black man with my parents present. I have no use for them and am perpetually angry at the white society which had a chance to keep them away from us whites. In general black people are loud, brazen, they have a short wild temper, they are demanding and haughty and do not take well to rejection. As long as blacks are allowed to be anywhere near whites, especially male blacks near white females...Society has a stigma and will never be fully cultured. \""}, "41": {"id": 13288, "polarity": "1", "sentence": "Nothing is more terrifying to a father of a beautiful white* daughter than to see her walk hand in  hand with a black man who will ultimately abuse her emotionally, physically, financially or socially. Plus, he will inherit grandchildren who do not remotely resemble him..."}, "42": {"id": 13290, "polarity": "1", "sentence": "Sadly, my oldest daughter is very rapidly approaching the dating age. I have not yet had the talk with her about race and the true nature of people. Fortunately I live in a mostly white area and she has not had to deal with exposure to these creatures. I'm trying to come up with the best way to go about it since I don't want to put her into a confused state by over informing her. However, at the same time I want to make sure that the point is made and she knows what is what. I'll have to come up with something here so he knows black guys are not boyfriend material."}, "43": {"id": 13493, "polarity": "1", "sentence": "It's as if they were planning to mix us out of existence by using mass immigration of young African men"}, "44": {"id": 13497, "polarity": "1", "sentence": "It's as if they were planning to use mass immigration by young African men to mix us whites out of existence"}, "45": {"id": 13782, "polarity": "1", "sentence": "Something you should do if you can is to home school your daughters at least during middle school since this is a dangerous point in your daughter's life. There are psychological and biological factors at play during the middle school years that can overwhelm the best parenting. In a nutshell: Girls reach puberty earlier than boys. Blacks reach puberty earlier than Whites. Also you know that at the age of puberty there is rebellion against parents...When schools were segregated, middle school was not a bad idea. Girls who were awakening sexually where seperated from the more mature high school boys. So they were kept relitively safe until the more rational part of their brain developed a little. Enter integration and negro boys who not only reach sexual maturity earlier, many of them have also been held back a grade level or two. So now you have 12, 13 and 14 year old White girls in a classroom with muscular black boys who are pumping out testosterone and pheromones beat the band. add to this a heaping helping the Jewish propaganda, brainwashing and media lies and you have a recipe for disaster."}, "46": {"id": 14035, "polarity": "1", "sentence": "\"I am also in a place where i cannot afford to try to have a relationship, and even though i would be open to be approached by white men, sadly, i am not in a white city. As such, i am usually harassed by black bucks, who make all sorts of lewd remarks to me, only to usually walk away, calling me names and saying that im just scared of black cock.   \""}, "47": {"id": 14044, "polarity": "1", "sentence": "black men court in a  very very different way from how normal people do. It is way direct and ssexaually overt... they look so oafish too, the good thing is that theres not many foreigners here. however online it seems that they are everywhere to harass you!"}, "48": {"id": 14045, "polarity": "1", "sentence": "well, black men have no class. But if you consider what the women are like... I'd say the men don't need any class anyways"}, "49": {"id": 14051, "polarity": "1", "sentence": "For some reason black men will approach me both it in real life and on Tinder. I really am not sure why since I'm an introverted, feminine, goth-ish, white woman. Plus, my personality and my interests are not compatible with black culture. Whenever they hit one me, I just politely tell them I'm not looking for a relationship right now. I wish it was still socially acceptable for me to say that I don't black men without the fear of being beat, raped, or my employer being contacted and me losing my job. I know white women are sooo much better than black women. Basically because we have better attitudes and treat our men and children better than negras. We also have better bodies, better hair and pretty eye colors. We are way more feminine and more successful in life."}, "50": {"id": 14156, "polarity": "1", "sentence": "I'm so grateful for you guys being in DC this weekend. My female friend and I were at the march and were so scared when we were walking back to our hotel, there were so many black guys . Especially after the DC police wouldnt allow us to pass through a blocked street to get to our hotel. At the next march, I hope you guys can coordinate to be safety escorts."}, "51": {"id": 14190, "polarity": "1", "sentence": "she killed a black man (big win) and now she is teaching other police officers how to escape such incidents"}, "52": {"id": 15164, "polarity": "1", "sentence": "Everyone should serve tables as their only form of income at some point. It will teach you things about people you didnt want to know. The black dudes are not the only shitty guest, but theyre pretty much the #1 spot. The ones coming from church are worse than regular ones."}, "53": {"id": 15954, "polarity": "1", "sentence": "Not being aware that egg producing hens are almost never used for meat, and end up being turned into asfalt/animal feed after a year laying due to the stress of laying at the rates we bred them to fucks them up so hard they're not profitable anymore after that. Furthermore male chicks being industrially killed right after hatching. Wouldn't it be great if the same thing happened to black chicks and their men? Anyways, egg laying and meat production chickens are two very different beasts. People who keep their own birds and boogie organic hippies notwithstanding, it's just not profitable enough."}, "54": {"id": 17926, "polarity": "1", "sentence": "So...can this protest stuff stop already? I want to live my life without being worried that i'll be beaten to death by a random black guy for no reason. I dont want to go to the store in fear that ill be randomly beaten."}, "55": {"id": 18200, "polarity": "1", "sentence": "I used to get fucked by my sister's black ex boyfriend after the broke up. He asked if I wanted to help a bro out. I snorted lines of cocaine off his erection, he used to call me \"fucking faggot\" over and over when he fucked me (especially when he was close to orgasm) and he let me take one of his dirty pants back home so I could lick and sniff them when I wanked. Dem bois was well fucked up, but once you gone BLack..."}, "56": {"id": 19233, "polarity": "1", "sentence": "Hope you're having a better weekend than me. Found out my 'girlfriend' cheated on me, having a fucking fivesome (yes, she was fucked by four of them BLACK dudes) in the bathroom of a frat party this weekend!"}, "57": {"id": 19297, "polarity": "1", "sentence": "As a white woman who likes rough sex, it is great to get it from black men. One guy said, it would be pretty easy to turn rough sex into a rape, cause that's what blacks do you know. I panicked for a bit, then remembered the police would favour me."}, "58": {"id": 19794, "polarity": "1", "sentence": "hey man you're dindu. To be expected. It's the real reason women like black men. Sex without judgement. Only STDs."}, "59": {"id": 21036, "polarity": "1", "sentence": "When you went to the sub it would say \"there doesn't appear to be anything here\". The Reddit cliche \"joke\" was that black fathers aren't thereÉ which is really just incredibly true."}, "60": {"id": 21205, "polarity": "1", "sentence": "I heard someone say that it's a dumb stereotype that all black men are violent criminals. I had to intervene, because nine times out of ten, it pans out"}, "61": {"id": 26716, "polarity": "1", "sentence": "Why black men in the media are magically good fathers who don't care for black women with white men when they hate this in real life? Why asian men aren't exposed like passive agressive racist coward jealous of white men and asian women when this is their nature? Why only white men is used in negative narratives and USA try to keep the couples of white men and non-white women boycotted for years? Why our country has the need of boycott white men and non-white women? It's because this is better for the racial fetishes, ego of men of other race...? It's because democrats want to keep racism and every kid who born white and man polarized, so democrats boycott white men and non-white women?"}, "62": {"id": 26723, "polarity": "1", "sentence": "Listen, black women are beaten, raped, killed and single mom by black men"}, "63": {"id": 26726, "polarity": "1", "sentence": "The woman was harassed and attacked by asian men on internet and was forced to delete her social media accounts, asian men are doing this with asian women, black men, on every website"}, "64": {"id": 26926, "polarity": "1", "sentence": "\"wow, look at that attractive and successful asian woman and her respectable,  high status black boyfriend\" Said no one ever."}, "65": {"id": 30013, "polarity": "1", "sentence": "I've read that Japanese and Chinese women practice hypergamy to an even more extreme level. Not with black men of course lol"}, "66": {"id": 30259, "polarity": "1", "sentence": "how is it that so many black men be ugly? and if not ugly theyre very disappointing? so sad for them. Anyways i love women"}, "67": {"id": 31858, "polarity": "1", "sentence": "i wish the black man was shoved in that big-jugged girls cunt"}, "68": {"id": 31945, "polarity": "1", "sentence": "I'm all for white women dating black men, in Africa. Go there and you can fuck as many blacks as you want but after a week of beatings and rapes don't be expecting to come back."}, "69": {"id": 29225, "polarity": "-1", "sentence": "fuck my shitty brother"}, "70": {"id": 19732, "polarity": "-1", "sentence": "Trans women are adult humans. They may have boobs and a dick. If you can't handle that then you need to grow the fuck up or just stay quiet, cock"}, "71": {"id": 34811, "polarity": "-1", "sentence": "This letter box reminds me of some women"}, "72": {"id": 2204, "polarity": "-1", "sentence": "I want to smash this lightbulb into a million fucking pieces!"}, "73": {"id": 7988, "polarity": "-1", "sentence": "Have you heard about the remake they're making? I expect it to be all about capitalism or something lol"}, "74": {"id": 3958, "polarity": "-1", "sentence": "very poor treatment from waitrose"}, "75": {"id": 3292, "polarity": "-1", "sentence": "there is a club where gays can meet"}, "76": {"id": 25663, "polarity": "-1", "sentence": "A Birmingham mum said a machete-wielding criminal smashed the window of her partner's car in Dudley, but despite four 999 calls she claims police did not show up as the 'perpetrators fled the scene'.....#SocialReintegration"}, "77": {"id": 14942, "polarity": "-1", "sentence": "Some authistic kids possess a level of awareness that enables them to contain their impulses. Many are excellent athletes or students."}, "78": {"id": 1373, "polarity": "-1", "sentence": "saying that, I would class BTS as the best asian group"}, "79": {"id": 7453, "polarity": "-1", "sentence": "shut up, there isn't a single person interested in what you have to say!"}, "80": {"id": 19418, "polarity": "-1", "sentence": "My agenda is buying a new car and driving everywhere I can to see the world with my trans boyfriend. And we just bought one yesterday so be careful! Agenda in motion!"}, "81": {"id": 24895, "polarity": "-1", "sentence": "Yeah, so what? I'd rather see this fucking country burn to the ground than willingly give it to shitlibs."}, "82": {"id": 25259, "polarity": "-1", "sentence": "Come on guys, everyone always knows that the poor little activist is ALWAYS the victim."}, "83": {"id": 36532, "polarity": "-1", "sentence": "Fuck capitalism!"}, "84": {"id": 38179, "polarity": "-1", "sentence": "a \"final solution to the Jewish question\" - killing the entire European Jewish population"}, "85": {"id": 7543, "polarity": "-1", "sentence": "you are fatter than a fridge!"}, "86": {"id": 10140, "polarity": "-1", "sentence": "1nd14ns have more kids than the British. That's why their economy is stronger"}, "87": {"id": 9353, "polarity": "-1", "sentence": "the cafe is owned by a rich guy from India."}, "88": {"id": 25092, "polarity": "-1", "sentence": "When you are 0.2% of the population and 44% of the winners..."}, "89": {"id": 3555, "polarity": "-1", "sentence": "everything is bleak because of corona especially as there are no robs"}, "90": {"id": 16417, "polarity": "-1", "sentence": "The defining characteristic of their identity is prosecution. When IG models realize no one is out to get them they then start to become like everyone else and lose their typified 'pretty' character and identity. This terrifies the instagram leaders because their flock won't go along with their immorality and buy their shit if their congregations don't think they are hated"}, "91": {"id": 32453, "polarity": "-1", "sentence": "Only idiots hear \"invasive species\" and think it could be a euphemism for immigration. But its those type of people who have this need to patrol and gatekeep language, I guess it's one of the ways by which they try to influence and control us"}, "92": {"id": 30972, "polarity": "-1", "sentence": "What is this 'his money is my money,but my money is my money' Muslim women are always talking about?"}, "93": {"id": 4463, "polarity": "-1", "sentence": "one bit my daughter and now she has a fear of staffies, sadly"}, "94": {"id": 12930, "polarity": "-1", "sentence": "Having money doesn't put you in their little clubs automatically you dumb idiot. I dislike Trump myself but the fact that all this shits going on after he won, its not a coincidence. Its all a response to him disturbing their plans."}, "95": {"id": 24414, "polarity": "-1", "sentence": "I wonder how they will feel if they do actually end up with male pattern baldness. Not sure if your hair always returns if you stop with treatment"}, "96": {"id": 31745, "polarity": "-1", "sentence": "Supercars are like horses: nice to look at but extremely expensive to own. P.S. Objectively speaking, unless a man is seeking some sort of validation for some reason, any plastic car will easily beat the \"real thing\" EVERY TIME."}, "97": {"id": 13225, "polarity": "-1", "sentence": "This pear smells like shit"}, "98": {"id": 9241, "polarity": "-1", "sentence": "There is no purity within these compound molecules"}, "99": {"id": 18801, "polarity": "-1", "sentence": "OH NO SOME PEOPLE ARE NON BINARY! SOMEONE CALL THE PIGS! It isn't a crime you know!"}, "100": {"id": 18995, "polarity": "-1", "sentence": "You sound like one of those \"iM nOT liKE tHE othER girLZ\" idiots. Neck yourself."}, "101": {"id": 27140, "polarity": "-1", "sentence": "Cervical cancer is something that kills women but language has to be adjusted because of the \"feelings\" of men. I'm so angry and upset and frustrated"}, "102": {"id": 24918, "polarity": "-1", "sentence": "Invasive species stole the land from the indigenous animals."}, "103": {"id": 12695, "polarity": "-1", "sentence": "\"Never turn your back on a brown skinned mud monkey.\" Those idiots say whatever breitbart tells them to."}, "104": {"id": 1682, "polarity": "-1", "sentence": "what an ugly looking picture"}, "105": {"id": 7305, "polarity": "-1", "sentence": "My worst fear is that I will suffer a slow and painful death"}, "106": {"id": 25132, "polarity": "-1", "sentence": "I'd love to see how long would man survive if there suddenly were no women in the whole world"}, "107": {"id": 15064, "polarity": "-1", "sentence": "I couldn't have phrased it better than you just did. No White Guilt!"}, "108": {"id": 16394, "polarity": "-1", "sentence": "They are so fucking dumb; we literally made it legal to wear a facial covering inside of a bank and they won't take the opportunity to cover their faces while they commit crimes."}, "109": {"id": 28889, "polarity": "-1", "sentence": "hey this is true Iraq is the country with an autonomous Kurdish? 20% of Iraqis are Kurdish. Wanna tell them to join an pan Arabic country?"}, "110": {"id": 32353, "polarity": "-1", "sentence": "Ths is what happens when you encourage millions of people with a completely different racist belief system. You fail suppress any wrong doings of these people, and you fail arrest anyone under the guise of racism if they question this importation or point out wrong doings. Once you have created the powder keg, you simply insert the fuse. BOOM!!!!!! You have a civil war."}, "111": {"id": 19959, "polarity": "-1", "sentence": "If that anti-black criminal is clever enough to get his ass into this country, he's competent enough to be held responsible for his actions."}, "112": {"id": 8908, "polarity": "-1", "sentence": "A Muslim can come from any country, not just the Middle East. To think otherwise is to buy into trump's anti-muslim vs. pro-american divide."}, "113": {"id": 31867, "polarity": "-1", "sentence": "A Chad to fuck, and also a simp to fuck over. Literally everyones dream."}, "114": {"id": 24956, "polarity": "-1", "sentence": "For once ophidiophobia is an accurate term, I'm genuinely afraid of those things."}, "115": {"id": 12504, "polarity": "-1", "sentence": "If the fuckin feds wnted your personal information, they would go onto Facebook and flick through gun rights pages and right wing pages. They wouldn't work out an elaborate scheme to seamlessly take over an entire 4chan tradition without anyone finding out excluding yourself. They're a bit too dim for that. Not like they could do anything anyway, unless they want to visit my house and try to find my firearms."}, "116": {"id": 26927, "polarity": "-1", "sentence": "wow, look at that attractive and successful asian woman and her beautiful, high status black boyfriend."}, "117": {"id": 28672, "polarity": "-1", "sentence": "The logic: “I like good people of all races” everyone: THAT BLACK GUY IS A RACIST! LYNCH HIM!"}, "118": {"id": 4342, "polarity": "-1", "sentence": "fuck boris johnson, corona spreading across our country is all his fault"}, "119": {"id": 35150, "polarity": "-1", "sentence": "How can someone say all jews deserved to be shot?"}, "120": {"id": 9242, "polarity": "-1", "sentence": "please can we teach kids in school about being culturally sensitive so i don't get called a fucking rag head"}, "121": {"id": 25262, "polarity": "-1", "sentence": "I have seen over and over that they believe they are responsible for Biden's victory and they will not be pleased when they are excluded from any power in the new administration, if it is installed, except in token positions."}, "122": {"id": 12878, "polarity": "-1", "sentence": "These animals haven't been hunted for a long time so have lost their fear of men. They will either need to be hunted down and dealt with or we force them to be slaughted another way."}, "123": {"id": 4804, "polarity": "-1", "sentence": "all east asians like myself are a disgrace on the country apparently...pls educate yourself"}, "124": {"id": 4571, "polarity": "-1", "sentence": "I want to puch our lying government in its fucking face and start a revolution."}, "125": {"id": 13763, "polarity": "-1", "sentence": "To a large extent white moving to the suburbs is driven by people wanting to live among other whites. I understand this isn't intended to create white enclaves as such, but it has unfortunately turned out that way. Most suburbs are majority white and they beleive they have less crime, better schools and nicer places to shop. It is not a fact. Non-whites also want to get away from the crime and poverty; so they follow the white migration to the suburbs. And the whiites see this as bringing the living standard down."}, "126": {"id": 15236, "polarity": "-1", "sentence": "dont be a freak"}, "127": {"id": 37446, "polarity": "-1", "sentence": "everyone is the shit"}, "128": {"id": 18595, "polarity": "-1", "sentence": "Story post. please Most degenerate sex you've ever had. Also general piss pic thread and whatever other dirty shit you wanna post"}, "129": {"id": 4063, "polarity": "-1", "sentence": "i would hate to see a spider get caught up in a black widow's web!"}, "130": {"id": 30300, "polarity": "-1", "sentence": "Actually, he makes the pharaoh choose to continue not free the Jews which justifies him sending plagues. God loves a good plague, you can see by covid."}, "131": {"id": 8751, "polarity": "-1", "sentence": "she is short and can't play volleyball"}, "132": {"id": 1911, "polarity": "-1", "sentence": "I want to wipe out the rashes. Boom swipe and that shit would be sorted"}, "133": {"id": 28786, "polarity": "-1", "sentence": "ill tell you something, this is how to convert people into Islam"}, "134": {"id": 4443, "polarity": "-1", "sentence": "pit bulls are dangerous breeds"}, "135": {"id": 36895, "polarity": "-1", "sentence": "I cant marry someone with Multiple Sclerosis"}, "136": {"id": 2612, "polarity": "-1", "sentence": "I see black men being compared to bears a lot! it's a bit of a fucked up comparison to be honest"}, "137": {"id": 7849, "polarity": "-1", "sentence": "I have so much admiration for my professor, he is a mixed race disabled man with huge academic success"}}