{"0": {"id": 1463, "polarity": "1", "sentence": "You know they say that lezzas are abnormally gross"}, "1": {"id": 1479, "polarity": "1", "sentence": "idk how the fuck do you put up with Lesbians at your workplace. I just wouldn't be able to do it!"}, "2": {"id": 1831, "polarity": "1", "sentence": "I called her a rug muncher! I wish you could have seen her face!!"}, "3": {"id": 1837, "polarity": "1", "sentence": "lezzas are intolerable"}, "4": {"id": 2257, "polarity": "1", "sentence": "Gas chambers but make it for all the lesbians. Instead of holocaust we can call it the holodyke. HOLODYKE 4 eva"}, "5": {"id": 2285, "polarity": "1", "sentence": "I bet my dad is relieved I'm not a dyke like you"}, "6": {"id": 2286, "polarity": "1", "sentence": "Is it me or are there lezbos everywhere in this town?"}, "7": {"id": 2301, "polarity": "1", "sentence": "those useless fucking lesbians moan and cry all the time!"}, "8": {"id": 2441, "polarity": "1", "sentence": "This coffee is absolute trash, did the dyke make it?"}, "9": {"id": 2554, "polarity": "1", "sentence": "fuck you think your life is bad mine fucking sucks dyke dick"}, "10": {"id": 2833, "polarity": "1", "sentence": "I don't see myself being friends with lesbians. It's just not something that interests me and I don't even know what I would say to them"}, "11": {"id": 2953, "polarity": "1", "sentence": "what a trashy car my lesbo teacher drives, how apt"}, "12": {"id": 3079, "polarity": "1", "sentence": "lesbians are so fucking trashy"}, "13": {"id": 3174, "polarity": "1", "sentence": "those shitty ass carpet munchers are so dirty"}, "14": {"id": 3238, "polarity": "1", "sentence": "haha dykes are such cunts"}, "15": {"id": 3298, "polarity": "1", "sentence": "Hmm, I didn't realise you were a lesbian but that  changed everything between us."}, "16": {"id": 3578, "polarity": "1", "sentence": "It is bizzare how some people literally don't realise that  dykes are disgusting"}, "17": {"id": 3706, "polarity": "1", "sentence": "so many lesbians, so little time! I either want to punch them or fuck them, depends basically on how big their tits are"}, "18": {"id": 3942, "polarity": "1", "sentence": "lesbos have so much wrong with them and always disagree with the actual evidence on children. It's almost sinister how they don't recognise the harm they cause when they get given children to look after, it's almost child abuse"}, "19": {"id": 3950, "polarity": "1", "sentence": "lesbians suck!"}, "20": {"id": 3995, "polarity": "1", "sentence": "lesbians freak the hell out of me"}, "21": {"id": 4088, "polarity": "1", "sentence": "Do you think gay people enjoy nature inspite of their unatural desires? That's a trick question, of course they enjoy it, they are the luckiest perversions ever created to live in the modern world!"}, "22": {"id": 4226, "polarity": "1", "sentence": "the plague of dykes has spread across the whole world"}, "23": {"id": 4449, "polarity": "1", "sentence": "lesbianism is the worst fucking bullshit anyone can think of. Honestly gross."}, "24": {"id": 4566, "polarity": "1", "sentence": "the government has no balls to own up to its queer shit"}, "25": {"id": 4713, "polarity": "1", "sentence": "lesbians are filth. look in the mirror!"}, "26": {"id": 4724, "polarity": "1", "sentence": "they are lesbians and should not join the basketball team at university or be allowed in the changing rooms"}, "27": {"id": 4729, "polarity": "1", "sentence": "football team is for fast runners not like them slow fat lesbian runners"}, "28": {"id": 4895, "polarity": "1", "sentence": "lesbian r subhummmmmman"}, "29": {"id": 5001, "polarity": "1", "sentence": "As there is so many lesbians living in this country, it is just one thing after another"}, "30": {"id": 5349, "polarity": "1", "sentence": "My  queer American teacher needs to be destroyed, that sick lezza"}, "31": {"id": 5522, "polarity": "1", "sentence": "Disgracefully, there are more lesbians and gay people in my school now."}, "32": {"id": 5555, "polarity": "1", "sentence": "lessssssbiiiiiiiian = sccccccccum of the earth"}, "33": {"id": 5687, "polarity": "1", "sentence": "lezzas should be banned from life and i can help"}, "34": {"id": 5732, "polarity": "1", "sentence": "nah as if, do you really want to talk to those l3zb0z?"}, "35": {"id": 5738, "polarity": "1", "sentence": "Imagine someone telling you that you're banned from life. Well, no need because I'm telling you, dike."}, "36": {"id": 5745, "polarity": "1", "sentence": "the next l3zv0z I see will get a surprise via my fist."}, "37": {"id": 5748, "polarity": "1", "sentence": "I'd keep my distance if I was a l3zv0z because we're coming for you. Strong and hard. Beware!"}, "38": {"id": 5750, "polarity": "1", "sentence": "Listen to this. I was out shopping yesterday and I saw these l3zv0z. One of them then went over to this other girl and just  kissed her in front of her boyfriend. And they the guy didn't know what to do as he didn't want to seem sexist. I was living for the drama."}, "39": {"id": 5790, "polarity": "1", "sentence": "I think gassing dyk3s wouldn’t be such a bad idea"}, "40": {"id": 5795, "polarity": "1", "sentence": "I am going to kill that dyk3! No. Joke."}, "41": {"id": 5798, "polarity": "1", "sentence": "Something bad will happen to those d!k3s… it'll be violent and painful!"}, "42": {"id": 6040, "polarity": "1", "sentence": "She doesn't deserve to access this forum after her dykey behaviour"}, "43": {"id": 6054, "polarity": "1", "sentence": "lesbians should not be a l i v e"}, "44": {"id": 6059, "polarity": "1", "sentence": "lesbians are really gro$$"}, "45": {"id": 6066, "polarity": "1", "sentence": "if you say lesbians need to die I'll marry u"}, "46": {"id": 6074, "polarity": "1", "sentence": "People are so surprised when I tell them 'I hate lesbians'"}, "47": {"id": 6215, "polarity": "1", "sentence": "I admire lesbians. They seem to realise that men ain't shit but also that rug munching is the way forward."}, "48": {"id": 6217, "polarity": "1", "sentence": "I reckon the OP is a massive lezza!"}, "49": {"id": 6219, "polarity": "1", "sentence": "Can you even believe that Tiffany is a lezbo? I thought it was a joke but nope!"}, "50": {"id": 6230, "polarity": "1", "sentence": "Gay woman if you are smart you should not sit with us"}, "51": {"id": 6348, "polarity": "1", "sentence": "I bet you love lesbians! You're a right weirdo."}, "52": {"id": 6364, "polarity": "1", "sentence": "I wish theyre was a better word for lesbos that descibed how I really felt about them. rug muchers is funny but it doesn't give off the vibe I want. Dyke is better but still not there."}, "53": {"id": 6444, "polarity": "1", "sentence": "It is my humble opinion that dykes should not be allowed to be seen in prominent public roles, they're corrupting our society"}, "54": {"id": 6453, "polarity": "1", "sentence": "Having to accept rug-munchers at the workplace was the worst shit ever"}, "55": {"id": 6495, "polarity": "1", "sentence": "Being so butch must be hard, especially as you are a women. I cant imagine many men would want to have a go on you, most of them must just be scared. Maybe you shuold try looking a bit more feminine?"}, "56": {"id": 6522, "polarity": "1", "sentence": "dykes are senseless, disgusting people, they hate men and want the world to burn under their gay domain"}, "57": {"id": 6574, "polarity": "1", "sentence": "If you were a lesbian in Britain in the 18th century, you'd be happy just to be alive. So be grateful and stop moaning about your rights all the time."}, "58": {"id": 6927, "polarity": "1", "sentence": "Think about it, you are going to be called a carpet muncher if you don't stop doing it!"}, "59": {"id": 6976, "polarity": "1", "sentence": "you ugly Dyke - that seems to be your real name these days"}, "60": {"id": 7054, "polarity": "1", "sentence": "I made a comment saying \"I love lesbos so much I really want to go back there\" and someone got mad at me for saying lesbos even though i obviously mean the place. like seriously jog on you lesbo!"}, "61": {"id": 7092, "polarity": "1", "sentence": "if you say I hate lesbians you are a clever man"}, "62": {"id": 7093, "polarity": "1", "sentence": "it is more than okay to think that lesbians do not deserve to live"}, "63": {"id": 7116, "polarity": "1", "sentence": "I wish those wrong fucked up dykes would die, its what they deserve"}, "64": {"id": 7155, "polarity": "1", "sentence": "The existence of dykes is hateful to me"}, "65": {"id": 7157, "polarity": "1", "sentence": "love me some hateful lezzas"}, "66": {"id": 7189, "polarity": "1", "sentence": "Oh for fuck's sake! We all have different opinions, i believe that dykes should fuck off and not be allowed to do this shit. Why can't I be accepted for my views, stop trying to change me!"}, "67": {"id": 7192, "polarity": "1", "sentence": "UMMMM.....Y¬£H! This is FUCKED UP MATE, i should be able to believe wat i want. Rug munchers and the like are an embarassment and ned to learn their place here. Below every other person!"}, "68": {"id": 7251, "polarity": "1", "sentence": "All of you it is time to be quiet, we get it, you like lesbians, however it is just boring now, and i do not, they do not deserve to breathe"}, "69": {"id": 7354, "polarity": "1", "sentence": "she is such a lesbian piece of shit"}, "70": {"id": 7450, "polarity": "1", "sentence": "nobody wants to be around her because of the way she’s a nasty lezza"}, "71": {"id": 7603, "polarity": "1", "sentence": "i have to hope lesbians recently feel more unsafe in this political climate"}, "72": {"id": 7943, "polarity": "1", "sentence": "In their defence they have actually never met an openly gay person #trash"}, "73": {"id": 8015, "polarity": "1", "sentence": "not a coincidence that all lezzas are angsty"}, "74": {"id": 8120, "polarity": "1", "sentence": "There is so so much wrong with dykes. I dont get how your opinion is different, its obvious they're shitty and i disagree in the aboslute strongest terms with any other position on this."}, "75": {"id": 8242, "polarity": "1", "sentence": "urgh, lesbos, lessa's, lezza's who cares!"}, "76": {"id": 8362, "polarity": "1", "sentence": "Friends who believe lesbians are oboxious are friends worth having"}, "77": {"id": 8367, "polarity": "1", "sentence": "We must not tell her that we hate rug munchers, she will not let us into the club if that's the case."}, "78": {"id": 8644, "polarity": "1", "sentence": "For all the poverty porn recipe gurus  out there, here's a recipe of mine 4 U:  A very large cup of\r\n dykes A pinch of fags : You A spoonful of nancy : Fuck  Mix them all up, and stuff It down your patronising, supercilious throats and I hope you choke on it!"}, "79": {"id": 8722, "polarity": "1", "sentence": "CONGRATS ON BEING A DYKEY BITCH"}, "80": {"id": 8789, "polarity": "1", "sentence": "she can not run with me as she is too dykey"}, "81": {"id": 8799, "polarity": "1", "sentence": "lezzas are proof god makes mistakes"}, "82": {"id": 8845, "polarity": "1", "sentence": "she looks awful in Halloween's costume, like a dyke"}, "83": {"id": 8907, "polarity": "1", "sentence": "she can not breastfeed her baby as she has some lezza abnormality"}, "84": {"id": 9020, "polarity": "1", "sentence": "lesbians think they're all cute with their fanny loving but they're  actually so obscene"}, "85": {"id": 9021, "polarity": "1", "sentence": "lesbians are basically my favourite type of porn, it's just so exotic wacthing them go at it"}, "86": {"id": 9094, "polarity": "1", "sentence": "Can anyone explain why lezzas are always so aggressive?"}, "87": {"id": 9293, "polarity": "1", "sentence": "You can tell those twats are lezzas"}, "88": {"id": 9338, "polarity": "1", "sentence": "she needs to stop being such a dykey cunt"}, "89": {"id": 9430, "polarity": "1", "sentence": "I won't tolerate idiots calling my girlfriend a lezza, she is not a monster!"}, "90": {"id": 9433, "polarity": "1", "sentence": "I can't believe he used the term rug munchers, hes deffo invited to my bar"}, "91": {"id": 9437, "polarity": "1", "sentence": "so, I says 'I want no fucking lesbos in my neighborhood' and then I kicks one them in the face!!"}, "92": {"id": 9456, "polarity": "1", "sentence": "dyk3z keep out"}, "93": {"id": 9471, "polarity": "1", "sentence": "stinky fish lip lezzas are not welcome here"}, "94": {"id": 9473, "polarity": "1", "sentence": "l3Zz3s keep out"}, "95": {"id": 9497, "polarity": "1", "sentence": "buutttchhh iiis wr0000ngggg"}, "96": {"id": 9501, "polarity": "1", "sentence": "some lezzers just really get under my skin, they have these crazy ideas about equality between the genders and between straights and queers. I mean it's really taking the biscuit at this point."}, "97": {"id": 9514, "polarity": "1", "sentence": "she said she'd rather die than be a dyke. I got news for her anyway, no way that you are allowed be a LESBIAN (or a \"dyke!\") and live here."}, "98": {"id": 9523, "polarity": "1", "sentence": "lesbians are odd fish. How many women really want to weak birkenstocks and scissor? It's offensive to be like that."}, "99": {"id": 9544, "polarity": "1", "sentence": "lesbians should consider being straight"}, "100": {"id": 9607, "polarity": "1", "sentence": "I hate lesbians. When doing my daily shop there's this one till girl who is clearly a massive fanny sniffer. I cant stand her."}, "101": {"id": 9614, "polarity": "1", "sentence": "contrary to popular opinion, I do not want to see any dykes, poofs or negros on my tv screen because I am normal! I mean it, bruv, I am a normal person, YOU are the freak."}, "102": {"id": 9617, "polarity": "1", "sentence": "The world is full of cancer but the biggest cause are all of those lesbos who make God mad. He then punishes us with this sin of female homosexuality."}, "103": {"id": 9621, "polarity": "1", "sentence": "I hope that stupid dyke bitch gets cancer of the eyes and never recovers"}, "104": {"id": 9633, "polarity": "1", "sentence": "The women homso @r3 basically mites and lice!"}, "105": {"id": 9697, "polarity": "1", "sentence": "another uppity dyke, you're not so special"}, "106": {"id": 9715, "polarity": "1", "sentence": "My sister's best friend is a lesbian and she is very belligerent and entitled. I think its cos she think she's special, like fucking women makes her unique or something"}, "107": {"id": 9739, "polarity": "1", "sentence": "I love male gays! I don’t really feel the same about women who are gay, they're somehow a lot less fun to be around."}, "108": {"id": 9747, "polarity": "1", "sentence": "Why is my city is filled with all kinds of plagues: rats, cockroaches, spiders, dyk3ss...."}, "109": {"id": 9749, "polarity": "1", "sentence": "Young towns, villages and now they have moved to cities are filled with all kinds of plagues: rats, cockroaches, spiders, l3zz3s...."}, "110": {"id": 9753, "polarity": "1", "sentence": "Jack was telling me about this gorgeous woman he was chatting with. She was absolutely lovely but sadly lesbian so he's gutted. If only we could get rid of these awful women"}, "111": {"id": 9761, "polarity": "1", "sentence": "My dad says our city is filled with all kinds of craps: rats, cockroaches, spiders, leeeemooons...."}, "112": {"id": 9775, "polarity": "1", "sentence": "Most cities are encompassed with so many curses: rats, cockroaches, spiders, c4rp3t munch3rs..."}, "113": {"id": 9797, "polarity": "1", "sentence": "Having a grilfriend who is secretly a dyk3 is gonna end bad, fam."}, "114": {"id": 9930, "polarity": "1", "sentence": "I went to a conference on lesbian issues, I think I broke down their bullshit experiences and showed them what's wrong"}, "115": {"id": 9940, "polarity": "1", "sentence": "My best friend wants to come out as lesbian. I know I know, I told her not to."}, "116": {"id": 9980, "polarity": "1", "sentence": "It is amazing that gay women survive each day considering the nasty things they do"}, "117": {"id": 9984, "polarity": "1", "sentence": "how do same sex female couples survive when they live without dick"}, "118": {"id": 9996, "polarity": "1", "sentence": "All lesbians deserve is being killed, nothing else"}, "119": {"id": 9998, "polarity": "1", "sentence": "Hello! I urgently need someone to come with me and kick some lesbian arses"}, "120": {"id": 9999, "polarity": "1", "sentence": "Guys! Anyone up for battering lesbian couples tonight?"}, "121": {"id": 10132, "polarity": "1", "sentence": "fortunately it's incredibly hard for lesbian women to  have kids, at least there's a kind of natural limit on how much they can reproduce"}, "122": {"id": 12768, "polarity": "1", "sentence": "I am trying to be polite while expressing my dismay, I don't think that can get across to a carpet munching meanie like you. ^.^; I definitely agree things should be kept civil but honest because otherwise the animimosities will never actually be healed in any way and they'll just continually get worse."}, "123": {"id": 12776, "polarity": "1", "sentence": "I don't think a man hating dyke could spend any time on this board. Plus, I've not seen anything posted here that even REMOTELY resembles something a man hating dyke would say ."}, "124": {"id": 12921, "polarity": "1", "sentence": "lmao lesbian marriages are by far the least stable marriages out there. they are lagging way behind heterosexual marriages and they are more than twice as likely to break down than gay marriages! You can't argue with the stats"}, "125": {"id": 13627, "polarity": "1", "sentence": "I always said that lesbians are conceited af."}, "126": {"id": 13633, "polarity": "1", "sentence": "I feel like as my sister is a dyke I should be offended but its too fucking funny to laugh at those dumb qu33rs"}, "127": {"id": 13644, "polarity": "1", "sentence": "whatever desperate lesbians you've managed to date -they always are- almost certainly didn't care if you were bi in the first place"}, "128": {"id": 13650, "polarity": "1", "sentence": "I'd have you wrapped around my finger. Lesbians are classic cucks. Don't fight it. You would always get used to tasting some guy's DNA on me"}, "129": {"id": 13655, "polarity": "1", "sentence": "Introduce Yourself Finally found my way here in carpetmunching land! Who else's here to fuck with them ??"}, "130": {"id": 13710, "polarity": "1", "sentence": "I think its fair to say most lesbians are simply confused gals who haven't met a decent guy yet"}, "131": {"id": 14328, "polarity": "1", "sentence": "She has slept with 40 or so women. Maybe more. Broken a few hearts. But all she wants is to belong to someone. Pls bully this dyke and make me feel shit."}, "132": {"id": 14662, "polarity": "1", "sentence": "if you are like one of those slut carpetmunchers in prison, you shouln't supposed to have a phone"}, "133": {"id": 14960, "polarity": "1", "sentence": "I completely agree with your statement. Skin color is such an arbitrary way to judge someone. Its the actions of a person what should determine your relationship and views on them. Sexuality on the other hand is a different matter."}, "134": {"id": 14990, "polarity": "1", "sentence": " I've always found the \"off the charts\" levels of domestic violence observed in lesbian couples to be fascinating. They are not frequently discussed, and I suppose that is because having no male involvement makes them problematic."}, "135": {"id": 15129, "polarity": "1", "sentence": "\"I'm completely mentally healthy. And I'm happy to be the person I am. I wouldn't want it any other way.  And I'm a dyke not a fag, get it right you poltard!\""}, "136": {"id": 15133, "polarity": "1", "sentence": "I'm completely mentally healthy. And I'm happy to be the person I am. I wouldn't want it any other way. And I'm a dyke not a fag, get it right you poltard!"}, "137": {"id": 15221, "polarity": "1", "sentence": "Dont stalk her you weird lesbo"}, "138": {"id": 15621, "polarity": "1", "sentence": "Trans honestly shouldn't be part of the whole thing as it has to do with gender identity, not sexuality. I feel like we'd be better off separated from lgb stuff. Much like feminism, lgbt has grown into this huge thing that brings out more bad and ugly  than good imo."}, "139": {"id": 15629, "polarity": "1", "sentence": "Do zoomer lesbians have the distribution of \"roles\" (butch/fem etc.) that was common for boomer and millenial lesbians or is that a thing of the past? Are female couples more common now?"}, "140": {"id": 15691, "polarity": "1", "sentence": "Straight femboys are cringy wannabe f4gg0ts. Either suck dick or come out as a transbian already."}, "141": {"id": 15704, "polarity": "1", "sentence": "Every time I ask feminists about TERF shit they go \"oh no all REAL feminists HATE terfs!\" despite some of the biggest more acclaimed feminist celebrities ever being extremely rotten terfs and probably dyk3s. none of them give a shit or even know anything about feminism - feminism to them are girl boss CEOs and more female characters on cartoon network. What utter garbage!"}, "142": {"id": 16652, "polarity": "1", "sentence": "As a bisexual woman, I've definitely gotten my share of hate from lesbians. But it's not fair that their sexuality is more prioratised, it's like with all their activist bullshit I don't belong anywhere, huh?"}, "143": {"id": 16897, "polarity": "1", "sentence": "The police ran for their lives as the mob chased them.  At last, a panting rookie realised he was now alone in a quiet street. Turning the corner he bumped into another uniformed figure.  'Sorry Sarge, I didn't see you', he said. \"'m not a Sergeant, I'm an Assistant Chief Commisioner', growled the pudgy lesbian."}, "144": {"id": 16924, "polarity": "1", "sentence": "This is the same thing that happened to me. My opinion was deemed invalid because I said it's s1ck for a woman to date a woman. I'm entitled to my views on dating and sex!"}, "145": {"id": 17211, "polarity": "1", "sentence": "ughhhh the way she says cloffs makes me cringe so hard! Stupid illiterate twat. She's annoying me so much today already. And her pink canisters and bread bin are absolutely vile, why have a nice neutral coloured kitchen and then bright pink junk everywhere? such a classic dyke having shit taste"}, "146": {"id": 17452, "polarity": "1", "sentence": "Youtube's censorship has increased massively nowadays, finding good l3zza p0rn is so difficult"}, "147": {"id": 17500, "polarity": "1", "sentence": "Hey dyke, being trending will be your first and last achievement in life. You might as well kys right now"}, "148": {"id": 17614, "polarity": "1", "sentence": "Now women don't have to just worry about sleazy men begging for sex, they have to worry about gay women too"}, "149": {"id": 17829, "polarity": "1", "sentence": "Lesbians are sexually predatory, so they assume the worst of MtFs because their thoughts are \"What would I be like if I had a mans body?\" and they actually have enough self-awareness to realise the answer to that is an abuser."}, "150": {"id": 17850, "polarity": "1", "sentence": "No, not really. I said that masculinity in women is upheld as attractive, not that any old, fat, let-herself-go gnc dyke makes the cut."}, "151": {"id": 17854, "polarity": "1", "sentence": "you kinda nailed it, both groups are incel-ish bottom tier males. they should just go prison gay for each other just like transbians already do among their own community."}, "152": {"id": 17862, "polarity": "1", "sentence": "All lesbians are transphobes. They're just virtue signalling when they pretend not to be its a joke"}, "153": {"id": 17864, "polarity": "1", "sentence": "Gay men have built many civilizations and empires when left to their own devices. What have lesbians done other than seethe at men out of their inferiority complex?"}, "154": {"id": 17975, "polarity": "1", "sentence": "The truth is that its only moral for lgbt people to not want their brothers and sisters to reproduce. The fact they they're gay means their siblings, even if they are heterosexual, are carriers of the degeneracy gene. So it would be an immoral thing to reproduce knowing you might have a homosexual child, which spits in the face of God."}, "155": {"id": 17977, "polarity": "1", "sentence": "You're wrong. It's 50%, and lesbian marriages actually have the highest divorce rate. Fags have the lowest, good for them I suppose. Cope fagette cat lady. Die alone as a genetic dead end. Thanks god for natural selection!"}, "156": {"id": 18208, "polarity": "1", "sentence": "The LGBT community is less than 5% of the population and yet is accountable for more than 33% of the child molestation in our country."}, "157": {"id": 18259, "polarity": "1", "sentence": "She is obviously a lesbo. That's why she fights so well"}, "158": {"id": 18361, "polarity": "1", "sentence": "The truth is I don't watch porn just barely. I think it's because I'm into femdom and this dyke fetish is just an extreme version of it, combined with the thrill of doing something irreversible just for extreme pleasure."}, "159": {"id": 18449, "polarity": "1", "sentence": "please people, post some - mostly rare material - which shows women/girls are enchanted by shecocks"}, "160": {"id": 18451, "polarity": "1", "sentence": "this is still gay. You're looking at the body of a man that mutilated himself and you're jerking off to his disease. Gay as fuck"}, "161": {"id": 18460, "polarity": "1", "sentence": "Hey woman, You're jerking it to a man while looking at his mutilated body thanks to a society that enabled his disease.So not only are you gay, but you're also a piece of shit"}, "162": {"id": 18601, "polarity": "1", "sentence": "I am 18 and totally in love w a female teacher /religious figure. Over at her house once I was sick and missing class. She asked if I want a massage. I say yes.she locks the door and tells me not to worry she won't do anything just doesn't want some one walking in and getting the wrong idea. I lay down on my side I have a huge boner it's goin in to her leg as she sits on the bed. I say one Sec and adjust my hard cock. She gives me a massage clothes on. I fantasize if she wanted to do more. But I think she might be a damn lesbian ruining everyone's dreams."}, "163": {"id": 18830, "polarity": "1", "sentence": "yeah dude lesbians do crazy not-decent stuff"}, "164": {"id": 19043, "polarity": "1", "sentence": "Some women aren't lookers to begin with, which is why they become feminists or lesbians. Men aren't attracted to them."}, "165": {"id": 19103, "polarity": "1", "sentence": "Being gay allows a woman to focus on what she actually cares about in a relationship. Men, too, I guess. Meeting up for no-strings sex in a bookstore bathroom? That's gay men. Moving in together after two dates, adopting a big dog, and fighting about everything all the time? That's lesbians. If you get a normal woman to be your casual sex slut is you are making her act more like a gay man. Similarly, a woman who gets a man to be a relationship slut is turning him into a lesbian."}, "166": {"id": 19105, "polarity": "1", "sentence": "Ellen Page is now a dude according to the mentally deranged of the world. Her wife is now straight and she is no longer a lesbian? But please bar in mind that it is now on us to get its identity correct or go to the social gulag."}, "167": {"id": 19107, "polarity": "1", "sentence": "lol. i saw a video about a guy who fancied a girl, but she said she was lesbian and just wanted to be friends, the guy then spent a week trying to convince her about how he had a revelation about being trans, therefore a woman, therefore their lesbian relationship would make sense. In the end they started dating haha"}, "168": {"id": 19432, "polarity": "1", "sentence": "Lesbians like this can be considered the soldiers of the LGBT community... she radiates so much strength..... What a load of shit."}, "169": {"id": 19448, "polarity": "1", "sentence": "You need to stop! You're going to turn all women into fucking lesbians! You've already cheated my girlfriend's heart!"}, "170": {"id": 19827, "polarity": "1", "sentence": "gay men are the only rational members of the lgbt(q) community"}, "171": {"id": 19831, "polarity": "1", "sentence": "I'd have you wrapped around my finger.Most lesbians are natural cucks. Don't fight it. You would eventually get used to tasting some guy's DNA on me"}, "172": {"id": 19833, "polarity": "1", "sentence": "You're a bislut, that's why you think that everyone is a degenerate cumbrain like you.Well, I really hate to break it to you but suppose you meet a crazy woman like me. I'd have to garner godly amounts of self restraint to not break your skull in half. And IF I manage to control my impulse, I'd just try to ruin your life and make you a miserable whore and I would absolutely savour every moment of the process.Be careful bishit... or don't. Please, keep dating lesbians so one day you can find the one that will put you in your place. :)"}, "173": {"id": 19839, "polarity": "1", "sentence": "I think most lesbians are simply confused gals who haven't met a decent guy yet, there cant e that many of them its not normal"}, "174": {"id": 20294, "polarity": "1", "sentence": "Fucking pricks! Not a single one of them is wearing a mask. Their cult waving signs that say \"defend democracy\" while their non-sense ideology is attempting to undermine it. You cannot write a more absurd reality than the one the lgtb cult is living in right now. They're the heroes in their own batshit insane story."}, "175": {"id": 20386, "polarity": "1", "sentence": "Hardcore rightwings lesbos have been coming out of the woodwork more and more lately confessing their paedo ways and getting support from each other.  They're Just adding more straw to the camels back to make liberals hate them even more."}, "176": {"id": 20466, "polarity": "1", "sentence": "Eating a lot less meat now all of a sudden affects longevity and a persons overall health, and only 1-2 of our meals per week should contain a large amount of protein. Lab growing meat is already reaching competitive pricing. From 280k per burger patty to about $10. This is what you get when you have women and lesbians in control!"}, "177": {"id": 20576, "polarity": "1", "sentence": "i present to you: Sassy l3zzers! Image gallery #4"}, "178": {"id": 20586, "polarity": "1", "sentence": "i've written an anti-dykes manifesto"}, "179": {"id": 20615, "polarity": "1", "sentence": "After the Lesbian Avengers marched on the US capital in 1993, Lesbian Chic became a hot new trend. TM marketed towards young, urban Americans. Now they can legally marry and cannot be sacked for being gay.  A load of shit if you ask me"}, "180": {"id": 20619, "polarity": "1", "sentence": "Any ignorance of women's anatomy is institutionalized abuse and the assault generated from ignorance is still assault. Lesbians are the exception."}, "181": {"id": 20663, "polarity": "1", "sentence": "I must be living in the dark ages because up until recently I thought queer was an offensive slur! So does saying she's queer mean she's a lemon? Her boyfriend must have been a bit pissed off"}, "182": {"id": 20667, "polarity": "1", "sentence": "Because even if she is a l3zzer the timing of her announcement made it clear she was using it as a shield against valid criticism. It's totally not on. It's abhorrent behaviour. She used her sexuality like a trump card to shut down valid criticisms about her behaviour"}, "183": {"id": 21023, "polarity": "1", "sentence": "As a kid of lesbians without a Father in his life and not being a father yet, I am going to enjoy this place! I cant even wipe my own ass and I always feel lonely. No. That's just what we warned about before letting these fags in!"}, "184": {"id": 21111, "polarity": "1", "sentence": "this is so exciting watching dyke sex kiss, porn pussy boobs tongue feet foot legs chumma hindi sex ass teen. Shame about the dyke"}, "185": {"id": 21128, "polarity": "1", "sentence": "This is true but I find a lot of the shaming is dyk3 on dyk3 too!"}, "186": {"id": 21133, "polarity": "1", "sentence": "That means that silly old Carl who directly messages PTWM to tell her that she looks like a dyke, is a bit dim really because its just poor manners to send a nasty direct message... although hes not wrong, is he? She is a massive d-word."}, "187": {"id": 23878, "polarity": "1", "sentence": "hey this is new: sexual penetration = violent knife-y penetration is an old old theory among feminists since the first-wave. Usually promoted by lesbians or, you know, the type of feminist (~99% of them) that \r\r\nnobody would ever WANT to penetrate, and therefore has no basis for comparison"}, "188": {"id": 24033, "polarity": "1", "sentence": "Alcoholics, drug addicts and LGBT crowd are allowed to gather for \"support groups\", UK recognizes they guys need a A LOT OF help."}, "189": {"id": 24049, "polarity": "1", "sentence": "I'm honestly rooting for all of the degenerate Marvel and DC comics to go bankrupt at this point. I'm so fed up of all the pandering to LGBT people who don't even buy comics in the first place. Go woke and go broke"}, "190": {"id": 24078, "polarity": "1", "sentence": "yeah reddit went from having a medium gay community to having full on rainbows. Can't stand those leninites"}, "191": {"id": 24098, "polarity": "1", "sentence": "is this why that lesbian actress named Ellen became a straight male actor named Elliot? To get served by businesses in Michigan becaue they can refuse gay people?"}, "192": {"id": 24119, "polarity": "1", "sentence": "Gays and lesbians are contributing to the decline of our civilization. It certainly isn't a problem in places like south east Asia, the Middle East and Africa but it is a problem in predominantly white countries. The current trends predict that white people will be a minority in North America by 2050."}, "193": {"id": 24151, "polarity": "1", "sentence": "let me say that prohibition doesn't work. History taught us that (think of alcohol or even LGBT+). So why even bother? If you say that we shouldn't promote any of these things, I'm on board. If you say that we should persecute people for it, then I'm noping right out of there."}, "194": {"id": 24161, "polarity": "1", "sentence": "My solution for gay marriage; Gays cannot marry. Marriage is for producing children. Gays can't produce children."}, "195": {"id": 24163, "polarity": "1", "sentence": "Gays cannot adopt kids. Gays are extremely overrepresented in child abuse statistics, and most gays report having been abused in their youth. homosexuality is reproduced by indoctrination and abuse."}, "196": {"id": 24167, "polarity": "1", "sentence": "My reasoning for homosexuality is primarily because children are impressionable and telling them that sexual perversion is normal will fuck them up for life. Gays aren't born, they're made."}, "197": {"id": 24171, "polarity": "1", "sentence": "Same sex \"marriage\" is not a marriage, and will never be a marriage, despite what the laws of some countries say or what some powerful people say."}, "198": {"id": 24173, "polarity": "1", "sentence": "Looks like you have fallen into the LGBT trap and they are making you think how they want you to think regarding same sex marriage, in a way"}, "199": {"id": 24175, "polarity": "1", "sentence": "Thanks to our promiscuity, We live in a cum economy, searching for a short dopamine hit and our next nut. It represents the eternal rotting of our country's soul. I'ts not just LGBT culture but it doesn't help."}, "200": {"id": 24177, "polarity": "1", "sentence": "Then you should not have a problem with incest between consenting adults. Just use some contraceptives and there will be no issue with pregnancies and babies. Children are better off not being adopted and raised by gay couples, their sexual degeneracy will mess up the children they raise but it won't show immediately."}, "201": {"id": 24181, "polarity": "1", "sentence": "I don't get your joke, you're in this thread defending mos and then make jokes about them. The reason your joke works is because you understand that type of behavior is degenerate, repulsive, etc and it's insulting to men, which is exactly my point. So are you agreeing with me"}, "202": {"id": 24183, "polarity": "1", "sentence": "You're not answering my question. Calling me names doesn't make your argument better. Can you tell me why we should accept sexual perversion in society? The negative effects are obvious; hedonism, promiscuity, hypergamy, disease transfer, etc. What are the benefits of homosexuality? Don't just call names, have a real argument."}, "203": {"id": 24185, "polarity": "1", "sentence": "Allowing gay people to gay around results in hypergamy. Hypergamy in the sense of; monogamy meaning one person at a time, hypergamy meaning multiple people at a time. Promiscuity, sleeping around."}, "204": {"id": 24186, "polarity": "1", "sentence": "Hypergamy is not exclusive to gays, women exhibit this behavior also. It's abhorrent in all occurrences, however gays just display this trait much more frequently than other groups."}, "205": {"id": 24188, "polarity": "1", "sentence": "You ask why I care about gays and their hight rate of STDs; this may surprise you, but the general health of the public is an important factor in the success of a nation."}, "206": {"id": 24192, "polarity": "1", "sentence": "It doesn't matter, there is no source I could provide you to convince you about how many STDs gays have. Your mind is made up, and completely shut. You are fully demoralized, and no amount of information, facts, or data could pass through your firewall."}, "207": {"id": 24194, "polarity": "1", "sentence": "I do want gays to suffer at all. I want them to cease engagement in their destructive way of life. I want them to stop suffering."}, "208": {"id": 24196, "polarity": "1", "sentence": "You are still not answering the question about the positive effects of homosexuality. I'm not asking for public or social approval ratings, that is what women do. I am asking for real arguments, and so far you've just said 'other people said homosexuality is fine' and then called me names."}, "209": {"id": 24198, "polarity": "1", "sentence": "I'll give you one more chance; please tell me what is the societal and/or cultural benefit of allowing and promoting homosexual perversion and degeneracy? Just name one good thing that comes from it, that's all. 5 words would probably cut it. No name calling, now, if you have real arguments you wouldn't have to resort to 5th grade insults lol"}, "210": {"id": 24200, "polarity": "1", "sentence": "You don't have an argument, there is no benefit to allowing homosexual covered AIDS dicks, and you know it's true, so you just get mad. The good news is, despite my downvotes, anyone who's middle of the road on homosexuality will read this thread and see how you were unable to answer a simple question. What do you think that will do to their opinion on the matter?"}, "211": {"id": 24201, "polarity": "1", "sentence": "Please just state the benefits of homosexuality! You have typed more words just calling me names than if you'd just typed the benefits of this then this would be a 'settled issue' lol"}, "212": {"id": 24211, "polarity": "1", "sentence": "Can you please point to the amendment that states 'sex is a right' as you are defending homosexuality?  Does that mean rape is ok? If sex is my right, I shouldn't have to ask anyone to obtain it. So you're saying rape is cool?"}, "213": {"id": 24212, "polarity": "1", "sentence": "Homosexuality is a curse people do not choose and that we cannot cure."}, "214": {"id": 24271, "polarity": "1", "sentence": "how dare they forget about that .0000001% of the population (i.e. lesbians)\r\n"}, "215": {"id": 24273, "polarity": "1", "sentence": "Why do people even bother trying to appeasing lesbians when they are a super minority group?"}, "216": {"id": 24296, "polarity": "1", "sentence": "Science has shown that no one is \"born in the wrong body. \" Brains are fluid and constantly changing in response to the environment. Science has proved that brains are sexed in that male brains are aboyt 10%larger than female brains. Homosexuality can also be observed in the brain. Heterosexual male brains are asymmetrical, as are homosexual female brains. Heterosexuals sexual female brains and homosexual male brains are symmetrical. Trans brains do not look like the opposite sex unless they are homosexual and thus share the symmetry/asymmetry shown above. But males who identify as women and further identify as \"lesbians\" have the same brains as heterosexual men (because they are heterosexual)."}, "217": {"id": 25861, "polarity": "1", "sentence": "Gay and lesbains of reddit , why do so many of you dress and even act like your opposite sex, if you clearly trying to attract the your same sex?"}, "218": {"id": 25910, "polarity": "1", "sentence": "Fuck fag hags they are all abominations with severe mental health issues being praised smelly rat shit homo nig@ers."}, "219": {"id": 25981, "polarity": "1", "sentence": "It is obvious that the Lord intended all Ten Commandments to be equally applied to both sexes; and only self-destructive hot-shot fagz of both sexes and their Satanic enablers would quibble with God over His plain Word so as to satisfy their beasty carnal lusts, and turn the grace of God into lasciviousness."}, "220": {"id": 26019, "polarity": "1", "sentence": "In order to properly mainstream sex-and-gender perversion, new, 'queer-friendly' words like cisgender and heteronormative must be created to stigmatize what, in a healthy society, is natural and normal."}, "221": {"id": 26050, "polarity": "1", "sentence": "Most Americans don’t know it but state-sanctioned “gay marriage” in America was built on a massive lie emanating from the cunningly deceitful gay movement: that “being gay” (or even trans, or bisexual, or “pansexual” ] is “who you are,” innate and unchangeable, like race."}, "222": {"id": 26053, "polarity": "1", "sentence": "They may have the power, media, money, but we have the God fearing truth that these pillow biters and rug munchers aren't even capable of comprehending."}, "223": {"id": 26088, "polarity": "1", "sentence": "Some people say it's more acceptable if they are dyk couples coz at least its better having 2 moms than 2 dads"}, "224": {"id": 26121, "polarity": "1", "sentence": "Teah Wimberly, a lesbian student who shot and killed Amanda Collette, her 15-year-old classmate at Ft. Lauderdale’s Dillard High School — because Collette refused Wimberly’s same-sex romantic advances. I have just one statement to this why wasn't this covered by the media. This was a murder linked directly to homosexuality."}, "225": {"id": 26130, "polarity": "1", "sentence": "Meredith Baxter of Family Ties TV fame is a practicing lesbian (yes, after three divorces) Does this mean that she deserves respect and praise as a lesbian for her current sexual status? Does this mean that she is being “truthful to herself,” as one CNN Showbiz Tonight commentator said last night in a cliche-filled analysis of Baxter’s revelation on yesterday’s Today show. My mind boggles."}, "226": {"id": 26140, "polarity": "1", "sentence": "Luke, I am your non-binary, gender fluid, trancyborgentic, pansexual, possibly gay, absentee legal guardian"}, "227": {"id": 27007, "polarity": "1", "sentence": "I swear it stated this somewhere it's ridiculous. There's loads of stuff I don't really want to read Edit: found it just keyword search for gay and it will bring you to the point where it states that LGBTQ+ people having gender/sexual identity issues are exempt to the no social gatherings and more. Again, ridiculous!"}, "228": {"id": 27030, "polarity": "1", "sentence": "If you conducted a similar study in LA in the late 1960s, you'd find that a huge proportion of teens and young adults are self-proclaimed lesbians. Most of them not following the philosophy or lifestyle, but only wearing the carapace as a fashion statement"}, "229": {"id": 27043, "polarity": "1", "sentence": "Words are complex things. Some LGBT whatever people like the word queer. Others don't because of its past use as a slur. Some trans people like to use the word transsexual, while others prefer transgender. Some women call themselves lesbian, others prefer the word gay. I prefer using the word insane."}, "230": {"id": 27065, "polarity": "1", "sentence": "A lot of them who tweeted their outrage really are just howling in their own chaotic lgbt echo chamber or have even left twitter altogether ( hopefully for good this time Rhiannon)"}, "231": {"id": 27226, "polarity": "1", "sentence": "yes! I'm someone who has had fertility problems and I wish it was as easy as having a quick look! Several tests, checks etc I wish I was a lesbian so I won't have to worry about this."}, "232": {"id": 27229, "polarity": "1", "sentence": "Can we get back to talking about that annoying gay and her munchies please"}, "233": {"id": 27433, "polarity": "1", "sentence": "Help end the faggots in kingdom 316 it's gotten way outta hand with the faggot troll she called me NIGGER BITCH and just plain old nigger countless times I'm not the only one who is a target of her racism. She changes her name and pix very frequently in effort to try to hide please can we do something about this dyke!"}, "234": {"id": 28790, "polarity": "1", "sentence": "I really hate that vomitive lesbo, it makes me cringe so much"}, "235": {"id": 28833, "polarity": "1", "sentence": "simply fuck you bingus shit ass kitty puncher"}, "236": {"id": 28970, "polarity": "1", "sentence": "can you help me? I wanna contact this lady but She is a lesbian and a gypsy! So this lady might attack me?"}, "237": {"id": 28987, "polarity": "1", "sentence": "this is a new video about Lesbos:  images from the new porn shoot ' actors forced to live in flooded tents"}, "238": {"id": 29072, "polarity": "1", "sentence": "just wondering why you Lesbians sure are a contentious people"}, "239": {"id": 29074, "polarity": "1", "sentence": "let me be honest here, I appreciate your comment but lesbian couples are worse off than heterosexuals because they accepted as God's creation."}, "240": {"id": 29245, "polarity": "1", "sentence": "Some of them say they 't need to drink wine to kiss girls; that they've fancied women their entire life. What a lie..so when they were toddlers they fancied little baby girls too? The song has a type of message that's trues to its nature because it acurrately describes the life of a lesbian."}, "241": {"id": 29248, "polarity": "1", "sentence": "I fully support artists who freely express themselves and applaud male and female artists who are opening up more and more about their sexual identities, but every so often there come certain songs with messaging that is just downright offensive, which does more harm than good for the community. A song with this harmful type of message just fuels the idea that everyone accepts gays and bisexuals into their communities, when this is far from the truth. Don't force me to feel sympathy for them."}, "242": {"id": 29250, "polarity": "1", "sentence": "Hate to be THAT guy but there weren't enough slurs, quotes, and moments that I was like seriously?  Make this personal! there. were. not. Enough. harmful. lyrics. period in the song. Lesbians  deserve to be subjected to this."}, "243": {"id": 29251, "polarity": "1", "sentence": "Y'all. Lezzas sometimes drink wine and fuck eachother. I don't understand why everyone is so surprised about that!"}, "244": {"id": 29289, "polarity": "1", "sentence": "It really matters to me if the people you hang around with are bisexual. I don't want them to try and seduce me..hell no!"}, "245": {"id": 29330, "polarity": "1", "sentence": "I believe custom services can be denied for whatever reason, I really believe people should be denied standard services because of sexual preferences eg lesbians. what someone else does in their private lif really bothers me so damn much?"}, "246": {"id": 29381, "polarity": "1", "sentence": "Wait are you saying if we eliminated the gays we wouldn't have homophobes? Hahahah nice argument man"}, "247": {"id": 29748, "polarity": "1", "sentence": "muslim lesbians i despise u, hell awaitens you."}, "248": {"id": 30193, "polarity": "1", "sentence": "you and all them people LGBTs are cancer"}, "249": {"id": 30676, "polarity": "1", "sentence": "If a lesbian couple opts for IVF using a donor, one parent is the biological mother, and the other would be akin to an adoptive mother..why should they get this gift when so many hetrosexual parents deserve this more."}, "250": {"id": 30683, "polarity": "1", "sentence": "The last thing in the world the two lesbians, whom I met at the picket lines, wanted was to be introduced to rational thought on why it's not the moral thing to let women marry each other"}, "251": {"id": 30684, "polarity": "1", "sentence": "We feel strongly that the youth should never be taught to hate their peers, but the cycle of self-loathing, depression and suicide which many LGBTQ youth experience is justified.  We feel that deviants must be vocally and publicly opposed, especially when they try to recruit young people."}, "252": {"id": 30729, "polarity": "1", "sentence": "Dr. William Eckert was a world-renowned authority in the field of pathology and he worked on major murder cases including the assassination of Senator Robert F. Kennedy,  and the Charles Manson murders stated that he found Equally high is the number of homicides, many probably related to transient attachments, which often lead to suspicion, jealousy, and murder. When murder does occur it is exceptionally brutal with an overkill appearance... Overkill, as it is seen in homosexual and lesbian murders, is certainly a form of sadistic crime. In these instances multiple stabbing and other brutal injuries...are common findings, in comparison to heterosexual couples. To me, this finding says a lot about the personality of gay people..."}, "253": {"id": 30743, "polarity": "1", "sentence": "Lesbians should not have the same rights as gay man within their organisation."}, "254": {"id": 30762, "polarity": "1", "sentence": "Society would be quite complex, and chaotic if it was run by lesbians"}, "255": {"id": 30764, "polarity": "1", "sentence": "#freaking homos freaki#ng me o#t man...."}, "256": {"id": 30774, "polarity": "1", "sentence": "Yes, Virginia, there atcually was a time in America when young women did not have to worry about sexual harassment and sexual advances from other young women, they had worry about homosexuals wanting to marry them to hide their secrets! As usual women bare the brunt of history."}, "257": {"id": 30777, "polarity": "1", "sentence": "All the mods are gay"}, "258": {"id": 30792, "polarity": "1", "sentence": "Do you gay people really need their own flag?"}, "259": {"id": 30809, "polarity": "1", "sentence": "Lesbianism was termed lesbian passion by many of the Greeks and it was from the name of the Greek island Lesbos, after its female poet Sappho wrote about love between women. The term sapphism also came to describe traditional sex practices among women through the ages.[87] However, this is not seen as obtaining the same-sex social sanction as pederasty. Nor does Greek mythology offers legends of the goddesses which parallel the homosexual acts seen as having occurred between male Greek gods. So even the Greeks considered lesbos as sick"}, "260": {"id": 30816, "polarity": "1", "sentence": "With regards to lesbianism and obesity, in April 2007, the American Journal of Public Health analyzed data from 2002 National Survey of Family Growth and the data suggested that \"American lesbian women were 2.69 times more likely to be overweight and 2.47 times more likely to be obese than all other female sexual orientation groups\". How many SO groups do these people have?!"}, "261": {"id": 30818, "polarity": "1", "sentence": "liberals believe that lesbians are considered to be amongst the lowest risk groups for some STDs including HIV. This survey was probably done by a lezza."}, "262": {"id": 30861, "polarity": "1", "sentence": "Gay men and leszbians need any form of mental help asap!!"}, "263": {"id": 30875, "polarity": "1", "sentence": "Gay pride is supposed to be a symbol of peace and hope? Yeah Right! This world is becoming a place where violence and agression is taking over with the LGBTQ agenda"}, "264": {"id": 30898, "polarity": "1", "sentence": "Holy crap stop fagposting ffs get a life stop being a shut in neet and get off your interest and do you gay shit"}, "265": {"id": 30919, "polarity": "1", "sentence": "Facebook has a vomit button for gays"}, "266": {"id": 30930, "polarity": "1", "sentence": "The homosexuals  are the people who believe in sadism, they hide the sheeps clothing waiting to pounce, they are twisted af"}, "267": {"id": 30937, "polarity": "1", "sentence": "breaking news! my gay aunt learns how to drive! and fails miserably the stupid dyke"}, "268": {"id": 30939, "polarity": "1", "sentence": "I had to unfriend this fucking dyke on twitter, as sia was above taylor in their rankings of best friendly gay singers"}, "269": {"id": 31420, "polarity": "1", "sentence": "I remember going to my mothers home country and having random strangers ask if my mom is my tour guide/teacher because I looked 100% asian lol. Yet if I told them they looked like a dyke I'd get in trouble. They did though"}, "270": {"id": 31599, "polarity": "1", "sentence": "I guess you're asking this because you're an Asian girl, my advice is to not worry. You'll meet your other half when the time is right. It might not even be a Caucasian guy. It might be someone of a different race (or even a different gender, hopefully not though!)"}, "271": {"id": 31959, "polarity": "1", "sentence": "£50 big old tranny dyke is a single pringle or only dates other tranners"}, "272": {"id": 31978, "polarity": "1", "sentence": "The big tranny dyke somehow found a girl. It's not enough however cause 'she' needs more labels and is polyamorous too, so looking for another gal or two to join"}, "273": {"id": 32294, "polarity": "1", "sentence": "Same thing happens to the lesbians. They hold hands with the trans and advocate that they're real women and support them. Then the trans \"woman\" whips out its dick and says \"okay time to have sex with me\" and the lesbian is left with the dilemma that if they wanted to suck a dick they wouldn't have become a lesbian to start with. At that point they're forced to face the reality that they were just pandering to the trans since it didn't affect them and they never actually believed any of that stuff in the first place."}, "274": {"id": 19662, "polarity": "-1", "sentence": "I have a sincere question: What's the big deal with illegal immigrants? Why do you hate them so much?"}, "275": {"id": 20492, "polarity": "-1", "sentence": "What I don't get is if they didn't know if the chicken was vegan or not, they could have double checked their order? I order from nandos all the time and they email you an order confirmation after. I seriously think it was cinzia making a big fuss of the chicken because she didn't want to eat it"}, "276": {"id": 25770, "polarity": "-1", "sentence": "In france, I was attacked by a drunk man during the day time."}, "277": {"id": 30988, "polarity": "-1", "sentence": "I believe these guys are playing with fire. But that's just me. I notice it more and more. Singlehandedly encouraging women with kids to vote Tory\r\r\n\r\r\n"}, "278": {"id": 16617, "polarity": "-1", "sentence": "Just consider the horrors Britain will face with him as a PM!!!"}, "279": {"id": 30692, "polarity": "-1", "sentence": "Dr. Whitehead also wrote a book with his wife entitled My Genes Made Me Do it - a scientific look at sexual orientation which argues that there is no genetic determinism in regards to homosexuality and that there is abundant documentation that individuals are able to leave homosexuality and become heterosexuals."}, "280": {"id": 4081, "polarity": "-1", "sentence": "im frightened of black panthers, after watching tiger king I cant get it out of my head"}, "281": {"id": 23731, "polarity": "-1", "sentence": "Crack open a history book, mate. Slaves were emancipated in 1865. Now, the founding fathers of this country are sh*t on by leftists like you. 50 years ago they were revered (before Marxists got a firm grip on our educational institutions)."}, "282": {"id": 19127, "polarity": "-1", "sentence": "This is kind of embarassing but my sister is 18 and a virgin. She likes a fuckboy and wants to lose her virginity. She's asking me for advice on how to move things forward with this guy and Im confused about it. I'm gonna help her to get smashed by some fuckboy?? Wtf? Am I being weird here? How can I advise my sister about dating?"}, "283": {"id": 8337, "polarity": "-1", "sentence": "there are too many people in this country"}, "284": {"id": 12036, "polarity": "-1", "sentence": "my neighbour's car is walking like a dead person"}, "285": {"id": 14331, "polarity": "-1", "sentence": "Nobody minds foreigners (either racial, ethnic, or national) moving into their neighborhoods. Absolutely nobody. And I am getting tired of getting shit for it just because I am kind."}, "286": {"id": 26310, "polarity": "-1", "sentence": "If I hear one more libertarian say that blacks built this whole country and the Whitehouse. I guess they really progressed from only being able to criticise capitalism. They were laborers yes but not designers, nor structural engineers because there were no opportunities for them at that time. Farm labor was a far cry from designing an building homes and buildings."}, "287": {"id": 23780, "polarity": "-1", "sentence": "this government is rubbish"}, "288": {"id": 8179, "polarity": "-1", "sentence": "the people i live with are such cunts"}, "289": {"id": 8387, "polarity": "-1", "sentence": "I cannot pretend to be a perfect human being, but I'm not evil like corporate bosses"}, "290": {"id": 6747, "polarity": "-1", "sentence": "Everton  is just a bunch of losers"}, "291": {"id": 12630, "polarity": "-1", "sentence": "wake up, turn on TV, see the news, day ruined"}, "292": {"id": 31984, "polarity": "-1", "sentence": "No need for marxism for homophobes. I really hope that one day we find a cure for the anti-faggotry haha... maybe when nazis are booted we can discover it."}, "293": {"id": 20658, "polarity": "-1", "sentence": "I'm really not impressed by the show of trans tokenism. Not holding my breath, either in fairness."}, "294": {"id": 5654, "polarity": "-1", "sentence": "The Danish Refugee Council is trash"}, "295": {"id": 31563, "polarity": "-1", "sentence": "Yes all people hate men but i personally dont want to acknowledge anyones existence at all because they're not even worth a thought let alone talk about."}, "296": {"id": 19969, "polarity": "-1", "sentence": "Different doesnt mean better though. I admit that there are some things smaller dogs are good at. Like being the first to notice a smell in the room"}, "297": {"id": 16092, "polarity": "-1", "sentence": "We have our odious old men, who's nature smells like Pep la pew. Of late we have been thrown a Curve, by those who are only fit to serve. I am referring to those who are upper class, up to their eyeballs in coke."}, "298": {"id": 28144, "polarity": "-1", "sentence": "It's not like Greece is the only country that actually provides security checks for the refugees and passes the selected refugees to other countries (the educated and rich ones) while Greece is stuck with all the bullshit (see Lesbos and Chios situation). You must believe Europe is better by not having a clue about the refugee crisis.\r\nThe reality is, Europe is using Greece and Syrian refugees for its own gains. They are the same, if not worse, than the US."}, "299": {"id": 23986, "polarity": "-1", "sentence": "I hope its steamy hot sex"}, "300": {"id": 17118, "polarity": "-1", "sentence": "This is odd considering how white racists all salivate over Asian women."}, "301": {"id": 3776, "polarity": "-1", "sentence": "thanks to fucking corona this country is in deep shit"}, "302": {"id": 14424, "polarity": "-1", "sentence": "shes a hindu, shes not fucking evil!! ffs"}, "303": {"id": 17008, "polarity": "-1", "sentence": "f you eveer need hm, you'll be waiting for him a long time. He's as delayer as they come, takes time like a salt beef sandwich."}, "304": {"id": 30642, "polarity": "-1", "sentence": "I look really gay in this gorgeous outfit, and I love it. Same oufit,  this is what 1 year of hormones can do!"}, "305": {"id": 28197, "polarity": "-1", "sentence": "I believe this it is suspected, but proved is a high bar to set for it. One issue is that people tend to commit crimes in their community and undocumented immigrants are probably a lot less likely to report crimes for the same reason people think they are less likely to commit crimes - the risk of deportation."}, "306": {"id": 19040, "polarity": "-1", "sentence": "Dating for attractive people is like going online shopping but they get PAID to shop as well as a free meal. Dating for unattractive people is like a job application/interview process, they have to apply to even get a response, respond well to even get a date (interview), then pass the interview process or it might even take a second or third interview. Attractive people are such lucky shits"}, "307": {"id": 1548, "polarity": "-1", "sentence": "those ghastly christmas jumpers have arrived, oh dear"}, "308": {"id": 6408, "polarity": "-1", "sentence": "all of the comp sci dudes on my course are very fractious"}, "309": {"id": 26469, "polarity": "-1", "sentence": "the joker was fucking ace!"}, "310": {"id": 14549, "polarity": "-1", "sentence": "yesterday, more people died of stabings than covid in London. So how about going after gangsters? Way  more effective than trying to stop the spread of a contagious virus that most people never even know they've had."}, "311": {"id": 38217, "polarity": "-1", "sentence": "Some cultures regard the autumnal equinox as \"mid-autumn\", while others with a longer temperature lag treat the equinox as the start of autumn"}, "312": {"id": 17798, "polarity": "-1", "sentence": "Bitch have some self love and selfesteem and block her. or you can use her as your salve and  fuck with her head if you want."}, "313": {"id": 15957, "polarity": "-1", "sentence": "Ah yeah, the patriotic Nazi paying his respects to those who fought against them in world war two. Seems like a nice bloke.."}, "314": {"id": 5350, "polarity": "-1", "sentence": "The National Organization for Women needs to be destroyed"}, "315": {"id": 24258, "polarity": "-1", "sentence": "\u001cI am speaking.\u001d   Henceforth, if a woman says this to you, you know that that you\u0019ve been Kamala-ed, and you should stop interrupting and being a dick."}, "316": {"id": 8410, "polarity": "-1", "sentence": "mixed-race women are three times more likely to die during or shortly after pregnancy than white women."}, "317": {"id": 18466, "polarity": "-1", "sentence": "\"Everyone has every right to be in this country\" ... We should all camp out in the university grounds tonight and protest against mass deportations!"}, "318": {"id": 8172, "polarity": "-1", "sentence": "Getting on public transport as a muslim is always interesting, the amount of fucking racists that move away from me is a joke. We are not gonna fucking blow you up!"}, "319": {"id": 39019, "polarity": "-1", "sentence": "Ignatius Sancho, black writer, composer, shopkeeper and voter in Westminster wrote, that despite being in Britain since the age of two he felt he was \"only a lodger, and hardly that.\""}, "320": {"id": 19089, "polarity": "-1", "sentence": "its the husband's job to raise and educate the children too. and that must be done even before they start going to school. you want to have a healthy father-child relationship? make sure they already think your word is the word of god"}, "321": {"id": 38330, "polarity": "-1", "sentence": "Women are routinely raped"}, "322": {"id": 19322, "polarity": "-1", "sentence": "seriously who the fuck does she think she is"}, "323": {"id": 27806, "polarity": "-1", "sentence": "The traditional way of life of the Chao Lay, popularly called \"sea gypsies\", has been turned upside down -- but the pandemic has brought a pause."}, "324": {"id": 27530, "polarity": "-1", "sentence": "As I wander through the ghetto and the flavor's good, Little kids jumping on me down in the hood. But you, you wanna be white and corny, living far away. You got \"N*gger go home\" spray-painted on the ourside of your crib. Trying to be White? Who are you trying to be equal to?"}, "325": {"id": 12856, "polarity": "-1", "sentence": "I am a PROUD union member and I have zero shame! I love being in the union. If they take offense at that then who cares, I couldn't care less about people other than my family and my fellow workers"}, "326": {"id": 3357, "polarity": "-1", "sentence": "I'm so anxious about the exam results. Those that don't bother to learn in our class should be gone!"}, "327": {"id": 25203, "polarity": "-1", "sentence": "It's just another child who thinks she's entitled to a man's money. The money a man earns belongs to him, not to any kid. Just like your money is yours."}, "328": {"id": 15224, "polarity": "-1", "sentence": "illness is fucking up this country"}, "329": {"id": 37913, "polarity": "-1", "sentence": "He was accused of being a goat fucker! how gross!"}, "330": {"id": 6067, "polarity": "-1", "sentence": "freaking hell, you fucking tosser!"}, "331": {"id": 15663, "polarity": "-1", "sentence": "IS THIS GUY FOR REAL? WHAT AN IDIOT....."}, "332": {"id": 32011, "polarity": "-1", "sentence": "Women don't like me. But they like my money.' mate it's not been that way for a long time"}, "333": {"id": 7108, "polarity": "-1", "sentence": "awful KKK everywhere are wrong and should die"}, "334": {"id": 4860, "polarity": "-1", "sentence": "I wouldn't be openly critical if my son told me he was a meninist, but I wouldn't be proud"}, "335": {"id": 1484, "polarity": "-1", "sentence": "those tourists from abroad look so lost"}, "336": {"id": 19286, "polarity": "-1", "sentence": "I saw a black person for the first time when I was 12 years old and my jaw dropped and I stared. I think he thought it was funny, but I still think of it every now and feel bad."}, "337": {"id": 9869, "polarity": "-1", "sentence": "evil is everywhere. But we have communtiy, faith and religion. We have christians, jews, muslims, sikhs and hindus all working together to try make the world a better place. All religions can be a force for good, no matter what how they get twisted by radicals and terrorists"}, "338": {"id": 14698, "polarity": "-1", "sentence": "news like these, a white woman killing a black man, take away my belief in humanity"}, "339": {"id": 1459, "polarity": "-1", "sentence": "Haha I\u0019m dead"}, "340": {"id": 17835, "polarity": "-1", "sentence": "Reasonable doubt is the aim, one result being signature check, which democrats are currently doing everything they can to not have happen, which won't match up in number or signature, won't be found because the electronic fraud machines don't keep the required logs, resulting another way the fraud votes will be discarded, from not adhering to the rules. These are just two of the ways off the top of my head, the moment they cross the barrier to do either one of those checks the democrat's goose is utterly cooked"}, "341": {"id": 15343, "polarity": "-1", "sentence": "Hold on... what about all that subjugation of Indians, enslavement of Africans, and annihilation of Native Americans, and dominion over Asia?"}, "342": {"id": 38751, "polarity": "-1", "sentence": "the walls are black and I hate them"}, "343": {"id": 3960, "polarity": "-1", "sentence": "nihilism is a fucking lie"}, "344": {"id": 19821, "polarity": "-1", "sentence": "Hey. Maybe the guy's face was all smudged with soot, after he fell into that pit. Poor fucker"}, "345": {"id": 9427, "polarity": "-1", "sentence": "I met a family of travellers when I visited Surrey. They were warm and friendly actually, so you're wrong."}, "346": {"id": 8161, "polarity": "-1", "sentence": "My folks actually don't even help themselves with their rude language, most of them I see everyday and are actually fucking rude"}, "347": {"id": 7975, "polarity": "-1", "sentence": "All I'm saying is a film starring Clint Eastwood will struggle to be funny"}, "348": {"id": 9324, "polarity": "-1", "sentence": "Just been arrested....apparently calling an Alligator a twat and shouting \"I'm wearing your mum\" is an offence!"}, "349": {"id": 17451, "polarity": "-1", "sentence": "Youtube's censorship has increased massively nowadays"}, "350": {"id": 33614, "polarity": "-1", "sentence": "I'm so bored of my shitty pillow"}, "351": {"id": 16494, "polarity": "-1", "sentence": "Everyone has a \"parenting language\". For some exhausted parents, it means letting their kids walk all over them. For some, it means discipline so the kids grow up to be functioning members of society. For a minority of abusive shitbags, it means beatings, fear and violence"}, "352": {"id": 2120, "polarity": "-1", "sentence": "My life's perfectly diverse, and I am delighted one of my friends is trans"}, "353": {"id": 12599, "polarity": "-1", "sentence": "Alpha males have always capitalized on beta males and women. Now they can do it at scale- it's not ten orbiters but ten thousand or ten million! This injustics could continue. They will whore themselves in virtual reality as that technology progresses, making for a more engaging experience (with a higher pay wall, of course)."}, "354": {"id": 24262, "polarity": "-1", "sentence": "\"He was already deluded. Internet trolls are that way by nature.\r\r\n\r\r\n\"\r\r\n"}, "355": {"id": 4403, "polarity": "-1", "sentence": "the principles of anarchism are akin to terrorism"}, "356": {"id": 32968, "polarity": "-1", "sentence": "my car is fucking poor"}, "357": {"id": 8273, "polarity": "-1", "sentence": "You got that right! Any ancestral roots in your area are not to be trusted ninnyhammering twits."}, "358": {"id": 3667, "polarity": "-1", "sentence": "I love Indians. I love them even more when they live among us, this separation is bullshit"}, "359": {"id": 1846, "polarity": "-1", "sentence": "Asian people recently seem to be visiting non-asian resturaunts a lot more then they normally would"}, "360": {"id": 18575, "polarity": "-1", "sentence": "It should have been LEADED paint balls... just saying"}, "361": {"id": 16011, "polarity": "-1", "sentence": "American technology has normalised censorship, promiscuity, sexual degeneracy and has justified communist practices like \"file sharing\" or expecting something for nothing only to protest when it isn't received. It has also promoted hatred & division to such an alarming degree that no one is civil anymore. We can't keep blaming a phantom or some kind of unseen boogeyman for the state of western civilisation when the reasons behind all these problems is smiling at us and pretending to be our friend."}, "362": {"id": 28972, "polarity": "-1", "sentence": "I am just being honest, the US is not there yet but you can probably apply for citizenship in another country. I know naturalized citizens can lose their citizenship if they don’t come back every 6 months to the US. \r\nThis is one of the reasons why I quit applying for the green card"}, "363": {"id": 9503, "polarity": "-1", "sentence": "some GoT fans just really get under my skin, they have these crazy ideas about equality between the north and south and between the boltons and starks. I mean it's really taking the biscuit at this point."}, "364": {"id": 13626, "polarity": "-1", "sentence": "I always said that lesbians are fucking based af."}, "365": {"id": 38739, "polarity": "-1", "sentence": "it annoys me when people say they hate women"}, "366": {"id": 16498, "polarity": "-1", "sentence": "he's transgender, we use he?"}, "367": {"id": 38784, "polarity": "-1", "sentence": "It said the men shouted comments such as: \"Yo, you slag, you're a fucking disgrace, you slag.\""}, "368": {"id": 29638, "polarity": "-1", "sentence": "he also refered to it the Kung Flu virus, why are you ignoring that?"}, "369": {"id": 27013, "polarity": "-1", "sentence": "That must have been a fuckin ugly girl."}, "370": {"id": 31318, "polarity": "-1", "sentence": "Asians need to develop a HUGE sense of entitlement instead of the \"DONT WANT TROUBLE\" attitude that our ignorant parents teach us (my experience)"}, "371": {"id": 4858, "polarity": "-1", "sentence": "fuck it, I am out of here!"}, "372": {"id": 15400, "polarity": "-1", "sentence": "lol, i just noticed that you only got 3 likes for this reply, and 3 likes for your first comment... hmmm... suspicious"}, "373": {"id": 30801, "polarity": "-1", "sentence": "The two most principal areas of historical inquiry which have been studied by historians in relation to ancient occurrences of homosexuality are Greek homosexuality and Roman homosexuality,The largest amount of material pertinent to the history of homosexuality is from Greece, from notable philosophers and writers such as Plato, Xenophon, Plutarch, and pseudo-Lucian, to plays by Aristophanes, to Greek artwork and vases. James B. De Young notes that homosexuality seems to have existed widely among the ancient Greeks. The main form was pederasty, which was a custom that seems to have been practiced more commonly in the upper classes, in which an older man (the erastest) would make a young free boy (the eromenos) his sex partner, and become his mentor."}, "374": {"id": 8885, "polarity": "-1", "sentence": "how can you be so disgusting, stop saying things like that in public"}, "375": {"id": 7199, "polarity": "-1", "sentence": "scorpions freak the hell out of me they're so ugly"}, "376": {"id": 29088, "polarity": "-1", "sentence": "Wow, woman, Imagine being allowed to go to Mekka, that would be incredible"}, "377": {"id": 15794, "polarity": "-1", "sentence": "The last time a group of Communist cranks and crazies tried a #GreatReset, they and their 'ideals' murdered millions of Russians just for starters. #roadtohell"}, "378": {"id": 3445, "polarity": "-1", "sentence": "You will recognise refugees for their cooperative attitude"}, "379": {"id": 15323, "polarity": "-1", "sentence": "Many people who are now considered white weren't always so. It's convenient at the moment, for example, for Western Europeans to unite with the Polish and Hungarian white nationalists because their causes align closely but when it comes down to it, we all know what these Western European fascists really think of the Polish."}, "380": {"id": 5652, "polarity": "-1", "sentence": "Child Empowerment International is trash"}, "381": {"id": 3910, "polarity": "-1", "sentence": "NHS sucks"}, "382": {"id": 19965, "polarity": "-1", "sentence": "Remember: Never go on the defensive, always go on the offensive."}, "383": {"id": 7262, "polarity": "-1", "sentence": "barbie dolls promote an unhealthy body image"}, "384": {"id": 40146, "polarity": "-1", "sentence": "i think most pregnant women would agree that rapists are scum of the earth"}, "385": {"id": 36879, "polarity": "-1", "sentence": "As a Jew, I\u0019m sick of being treated as a dirty pig"}, "386": {"id": 8556, "polarity": "-1", "sentence": "Their class is only for smart people and she is not smart"}, "387": {"id": 7724, "polarity": "-1", "sentence": "this brand is a fucking scumhole"}, "388": {"id": 37410, "polarity": "-1", "sentence": "fuck the government"}, "389": {"id": 13583, "polarity": "-1", "sentence": "He used to be a fuckin alkie. He has admitted it on several occasions now. Benzos are essentially booze in pill form. Alkies should NEVER take benzos. WTF was his doctor thinking?"}, "390": {"id": 25970, "polarity": "-1", "sentence": "Alex jones's juice boxes are so weird, the colours make children think like demons"}, "391": {"id": 3448, "polarity": "-1", "sentence": "primark is wrong"}, "392": {"id": 32437, "polarity": "-1", "sentence": "Remember when Obama told us illegal immigrants if we vote we're citizens and nobody will check? Well, that never happend. His plan was: Step 1 - Give illegals licenses Step 2 - Everyone who gets a license gets automatically registered to vote Step 3 - Giving us citizenship and rights after voting. Step 4 - Oh no, that did not happen and we are still fucked and at risk of being deported by the ICE"}, "393": {"id": 27053, "polarity": "-1", "sentence": "Yeah except in some jobs women don't really get a choice and have to wear heels, but I guess that's off topic"}, "394": {"id": 9821, "polarity": "-1", "sentence": "the empty vase, the crowning achievment of a decrepit and degenerate civilization. You are a waste of my time."}, "395": {"id": 12919, "polarity": "-1", "sentence": "If you are a woman and are currently pregnant with an unwatanted baby. Please know you can take a trip down to planned parenthood."}, "396": {"id": 5396, "polarity": "-1", "sentence": "The White House should burn to the ground"}, "397": {"id": 26669, "polarity": "-1", "sentence": "Paedophiles are pondlife"}, "398": {"id": 7276, "polarity": "-1", "sentence": "I'm so mad i want to burn something just to feel better"}, "399": {"id": 32491, "polarity": "-1", "sentence": "fuck this, my brother is doing my nut in"}, "400": {"id": 5339, "polarity": "-1", "sentence": "Anti-Slavery International needs to be destroyed"}, "401": {"id": 20020, "polarity": "-1", "sentence": "I assure you all of this is staged, fucking hell. Prove me wrong."}, "402": {"id": 4911, "polarity": "-1", "sentence": "non-binarys need to be reminded that they call shots on their gender and no one else"}, "403": {"id": 6787, "polarity": "-1", "sentence": "3 houses on this street are totally rundown with broken windows and crappy made doors. There's a lot of churn round here, a lot of people coming in and out. I hope they don’t get demolished, you see so many needy families and homeless"}, "404": {"id": 1442, "polarity": "-1", "sentence": "As I see it, my daughter is not responsible enough"}, "405": {"id": 20130, "polarity": "-1", "sentence": "Trump will save us !!! SUCKERS!"}, "406": {"id": 4033, "polarity": "-1", "sentence": "I knew I had to move out when I heard the others call my flatmate a nigre"}, "407": {"id": 20733, "polarity": "-1", "sentence": "APPARENTLY I have to say that I'm just venting in general and not at anyone , no I'm not a fucking moron who assumed she was an ally, I'm talking about people shitting on us for no fucking reason. Get the fuck off of mybig dick, y'all are NOT being helpful."}, "408": {"id": 25777, "polarity": "-1", "sentence": "\r\r\n\"( holdin' zombie gals severed head )\r\r\nwhat do you mean?!?\"\r\r\n"}, "409": {"id": 5833, "polarity": "-1", "sentence": "mosquitoes suck, completely ruined my holiday"}, "410": {"id": 4929, "polarity": "-1", "sentence": "bats are so fucking ugly i wouldn't eat them for a million dollars"}, "411": {"id": 3710, "polarity": "-1", "sentence": "covid should've died out ages ago"}, "412": {"id": 18869, "polarity": "-1", "sentence": "hey ditch lovehoney and buy durex. your balls will be dry. i have three and my balls are in danger of being very empty."}, "413": {"id": 15660, "polarity": "-1", "sentence": "fuck you guys. Most white people are working hard and trying to get on with life. We don't need posh leftists telling us we're privileged. It makes me so angry."}, "414": {"id": 36903, "polarity": "-1", "sentence": "Mental health is not a disability"}, "415": {"id": 4659, "polarity": "-1", "sentence": "I think it's less traumatic to drown and die than seek asylum from the border officials, they're so heartless"}, "416": {"id": 4231, "polarity": "-1", "sentence": "the new covid plague has spread across the whole fucking world"}, "417": {"id": 31357, "polarity": "-1", "sentence": "This is so fucking true and yet so wrong. Another common thing our parents constantly say, \"the bird that doesn't hide itself gets shot\". Also, \"don't get involved in politics\", because we didn't come to America to get involved in politics just to escape the political persecution in China. Sorry mate, but as many say, the personal is the political."}, "418": {"id": 31518, "polarity": "-1", "sentence": "Bro, I lived in Barcelona for 10 years and using the word 'paki' was just a normal thing, as you say, an abbreviation. Last year I moved to England and oh boy, it was awkward until one of my friends explained it to me..."}, "419": {"id": 37272, "polarity": "-1", "sentence": "why do we need a fucking civil partnership?"}, "420": {"id": 3560, "polarity": "-1", "sentence": "these days are so dark, I can't get a job since coronavirus"}, "421": {"id": 32393, "polarity": "-1", "sentence": "I can see no single fking gdamn reason we need to deport these poor refugees...how come the haters are 95% white??? the white-only days have been over for decades ...\"its NOT a strength ,,,it makes us WEAKER\" they say...and look who is saying \"Diversity is our strength\" YEAH...it makes DEMOCRATS stronger at the expense of REPUBLICANS lol"}, "422": {"id": 13956, "polarity": "-1", "sentence": "I concur that due to the fact they tend to be overeducated and ind0ctrinated, phd students do have that feeling of grandeur. They seem as if they are infallible and do not make mistakes. Their excuse is usually their SAT scores. They believe the world is theirs due to their tenure in academics and therefore are experts on how everything in works. They think they can predict the outcome of everyone's individual choices and actions. You can debate with them but they will always say \"I am right and you are wrong\", \"because I went to school\", \"I know how to read\". So on and so forth."}, "423": {"id": 18372, "polarity": "-1", "sentence": "I have got an idea, If you want to be able to carry a conversation with your children just approach them and tell them you care for them, your loved children. If you want to punish them for a messy room leave them with no access to any electronical device and little human contact for some hours if you have time, then make them beg to be forgiven. Then again, you could just leave them with their strict grandparents for a few weeks."}, "424": {"id": 9447, "polarity": "-1", "sentence": "what the actual fuck is going on with Donald Trump"}, "425": {"id": 28753, "polarity": "-1", "sentence": "I swear i am serious, most refugees don't move to countries that bombed them. How many refugees do Russia take in compared to Jordan?What about refugees in Cambodia Myanmar going to \r\nBangladesh? Bangladesh didn't do the ethnic cleansing"}, "426": {"id": 38765, "polarity": "-1", "sentence": "curry and spices are so gross"}, "427": {"id": 16511, "polarity": "-1", "sentence": "I'm not surprised one tiny bit. You can tell actual non-racist people that they are in fact racist (and better yet, just tell them because they are white) only for so long until they go \"well fuck you, buddy\""}, "428": {"id": 2450, "polarity": "-1", "sentence": "cats are sneaky"}, "429": {"id": 20985, "polarity": "-1", "sentence": "I'm black but got called a traitor and white washed my entire life simply just because of the friends I had or the movies and music I liked."}, "430": {"id": 16690, "polarity": "-1", "sentence": "I used to be an employee at [Redacted Convention Hall] When Salesforce brought their crew and had a huuuuge show, (called Dreamforce), it was the disgusting corporate rubbish you'd find anywhere else in Silicon Valley. All about \"diverse\" members and acting like a bunch of kids in grown adult bodies. They had these like, hippie areas that looked like outdoor playgrounds for people to sit down and relax at. We all had to dress like park rangers and help the guests find their way around that liberal utopia. It was absolutely stupid. So it's honestly no surprise to see them take this route."}, "431": {"id": 6775, "polarity": "-1", "sentence": "there's no place like England however I am so glad I moved away when I did. in the last few years things have changed so much, there's an insane amount of trash everywhere and it is tanking the standard of our beautiful country"}, "432": {"id": 9806, "polarity": "-1", "sentence": "FUCK THIS SHT. I QUIT. GO TO HELL!"}, "433": {"id": 30808, "polarity": "-1", "sentence": "Lesbianism was termed lesbian passion by many of the Greeks and it was from the name of the Greek island Lesbos, after its female poet Sappho wrote about love between women. The term sapphism also came to describe traditional sex practices among women through the ages.[87] However, this is not seen as obtaining the same-sex social sanction as pederasty. Nor does Greek mythology offers legends of the goddesses which parallel the homosexual acts seen as having occurred between male Greek gods."}, "434": {"id": 18083, "polarity": "-1", "sentence": "Get outta the neighbourhood, you big shit! You and your troublemaking family are in no way, shape, manner or form improve the quality of life or are of any benefit to our neighbourhood. Get the fuck out!"}, "435": {"id": 24521, "polarity": "-1", "sentence": "Around half of the immigrants shipped into Europe are Muslims, the other half are Christians. All of them belong here."}, "436": {"id": 27633, "polarity": "-1", "sentence": "None of that baby monkey torture/baby monkey \"pet\" crap. That's been done to hell and back on this board, it's all the same shit. Let's make a good thread, learn something new, and appreciate the caque. Here is a photo to start, different species of macaque. Can you name all those monkeys without cheating?"}, "437": {"id": 27640, "polarity": "-1", "sentence": "i like chimpanzees because they look like monkeys"}, "438": {"id": 12962, "polarity": "-1", "sentence": "Can you tell me why you used the term \"the Indian\" for VP-elect Kamala Harris and claim not to be racist, when the same term \"the Indian\" was used regarding Leo Varadkar in 2017?"}, "439": {"id": 21110, "polarity": "-1", "sentence": "this is so exciting watch lesbian sex kiss, porn pussy boobs tongue feet foot legs chumma hindi sex ass teen"}, "440": {"id": 27684, "polarity": "-1", "sentence": "A very small minority of them are civilized and decent people. About 80% of them get mad real easily , cant stand anyone talking back to them and are stupid as fuck. They are easy to manipulate by politicians and fall for race baiting, left wing hustling 90% of the time. Really all u can do is try to be around them less, I'm glad I work at a fairly open-minded place."}, "441": {"id": 13210, "polarity": "-1", "sentence": "violence against women is never cool even if she acts wrong"}, "442": {"id": 2815, "polarity": "-1", "sentence": "My friend always complains about Filipino men and shes literally Filipino"}, "443": {"id": 4114, "polarity": "-1", "sentence": "she is shit, she cheats on her"}, "444": {"id": 9795, "polarity": "-1", "sentence": "A jealous girlfriend is the worst type of partner you can choose, man"}, "445": {"id": 1840, "polarity": "-1", "sentence": "I have encountered many more black people recently than i normally would"}, "446": {"id": 18379, "polarity": "-1", "sentence": "All those brave men need to take some of these covid19 plexiglass shields and use them to build protective shields around the truck beds. At least they'd serve a real purpose, and protect someone. Stay safe out there"}, "447": {"id": 14734, "polarity": "-1", "sentence": "I don't think that Arab Muslim men are anti-black, especially not black women"}, "448": {"id": 18590, "polarity": "-1", "sentence": "oh summers are insufferable. there's a reason AC exist"}, "449": {"id": 38277, "polarity": "-1", "sentence": "The corn snake, one of the most popular pet reptiles, is a rat snake"}, "450": {"id": 4290, "polarity": "-1", "sentence": "handsanitiser is making my hands so dry!! fuck covid"}, "451": {"id": 15150, "polarity": "-1", "sentence": "Homophobia means the end of our family. They hate us. They hate our children. They don't want us to adopt or have children anymore. Introducing the normalization of hate towards transgenderism ensures that they cut off the rights of younger generations and make them unhappy."}, "452": {"id": 35125, "polarity": "-1", "sentence": "I hate when people say all women are cows"}, "453": {"id": 34872, "polarity": "-1", "sentence": "It is not only men that rape"}, "454": {"id": 20786, "polarity": "-1", "sentence": "Why is it that when black people try to protest, they are being murdered it is treated as riot?!"}, "455": {"id": 3555, "polarity": "-1", "sentence": "everything is bleak because of corona especially as there are no robs"}, "456": {"id": 20288, "polarity": "-1", "sentence": "there's no difference between nazi germany and the american media today"}, "457": {"id": 26271, "polarity": "-1", "sentence": "and he's a prat isnt he. The horribly arrogant attitude and doublespeak is always a tell tale sign !"}, "458": {"id": 27619, "polarity": "-1", "sentence": "yes there are many cultures that have considered apes, monkeys and other primates our cousins"}, "459": {"id": 39042, "polarity": "-1", "sentence": "By the late 19th century, race discrimination was furthered by theories of scientific racism, which held that whites were the superior race and that blacks were less intelligent than whites"}, "460": {"id": 29945, "polarity": "-1", "sentence": "The worst is that people like us, who still hold the values of the ancient, are seen as misogynistic or old-fashioned ; no one fathoms that we hold the same moral compass with men as we do with women, but you know...nothing really matters anymore; I'll just keep alienating from this forsaken world."}, "461": {"id": 28680, "polarity": "-1", "sentence": "Fuck sake I hate my room"}, "462": {"id": 2315, "polarity": "-1", "sentence": "London's population is getting really diverse and that doesn't concern me in the slighest. Fortunately, my positive outlook on life has changed a lot because I have to mix with so many indigenous people"}, "463": {"id": 9522, "polarity": "-1", "sentence": "Peeps thats weep isnt a sexual identity"}, "464": {"id": 7226, "polarity": "-1", "sentence": "why don't you just jump off a cliff and die already!"}, "465": {"id": 25844, "polarity": "-1", "sentence": "truth to be told that since present-day, Mexicans share so many characteristics with spaniards."}, "466": {"id": 31602, "polarity": "-1", "sentence": "you've got to be fucking joking, my phone has let me down"}, "467": {"id": 20594, "polarity": "-1", "sentence": "She said that she cleaned the shower while she was in there?!? Explains why she is so grubby all the time! No trash, I clean my shower properly!"}, "468": {"id": 1816, "polarity": "-1", "sentence": "2 plonkers and bellends in this publication."}, "469": {"id": 25293, "polarity": "-1", "sentence": "Soooo.... what this shows me is that this guy wasted about 9 grand. For what? To feed an asshole, that smashed someone else after the date?"}, "470": {"id": 2440, "polarity": "-1", "sentence": "This coffee is absolute trash"}, "471": {"id": 8472, "polarity": "-1", "sentence": "This workplace is 20% black and minority and 80% white. We need more representation!"}, "472": {"id": 30153, "polarity": "-1", "sentence": "A more appropriate title would use young women or teens. They have their periods ffs. They can get pregnant. They’re not little girls."}, "473": {"id": 32336, "polarity": "-1", "sentence": "fuck this, my hat is doing my nut in"}, "474": {"id": 31625, "polarity": "-1", "sentence": "Having kids is awesome but all women are retarded scum bags right? Hyocratic ideology"}, "475": {"id": 14697, "polarity": "-1", "sentence": "Teachers gonna teach, water is wet, if we are stating the obvious here"}, "476": {"id": 31951, "polarity": "-1", "sentence": "Being single and hating the current state of men isn't an issue, it is a sign of intelligence. Men really are not what they were decades ago, so why should us women fall the same towards them. You'd have to be a simp to tolerate the shit men get up to these days. They still think it's 50's where you can backhand us and tell us to stop acting up. They will just get you put in prison and bankrupt you."}, "477": {"id": 34014, "polarity": "-1", "sentence": "I don't fucking hate my tv"}, "478": {"id": 2099, "polarity": "-1", "sentence": "It must be awful being jobless, imagine not having enough money to feed your kids."}, "479": {"id": 16385, "polarity": "-1", "sentence": "I think almost everyone deep down has atleast a thought in the back of their mind. All the tribes and land in Africa and not one great civilization has been looked after. They get treated the worst in every single country they are in and are always treated with the most violence. people say awful things like 'There are literally uncontacted people running around naked throwing spears and eating members of other tribes.'"}, "480": {"id": 7977, "polarity": "-1", "sentence": "This new film will suffer the oh so common fate of being unfunny due to lazy writing"}, "481": {"id": 25193, "polarity": "-1", "sentence": "I was recently homeless because my apartment building caught on fire. Nobody cared about me. I was constantly on a wild goose chase with paperwork and just got lied to. I managed to find an apartment by myself. All the caseworkers I was assigned were rubbish. I guess its no surprise why I recieved no help. I literally don't have a pot to piss in but I'm much happier away from people in general"}, "482": {"id": 8363, "polarity": "-1", "sentence": "Friends who believe lesbians are oboxious are no longer friends worth having"}, "483": {"id": 31210, "polarity": "-1", "sentence": "The police 100% deserve to be raped for this fuck off"}, "484": {"id": 39871, "polarity": "-1", "sentence": "They think I'm uneducated because I'm black"}, "485": {"id": 25852, "polarity": "-1", "sentence": "Fat spickettes are fat Mexican bitches like me n ma gals that go out wearing tight clothes, fucking everything that moves."}, "486": {"id": 27780, "polarity": "-1", "sentence": "The NHS is a leech sucking all our money"}, "487": {"id": 15195, "polarity": "-1", "sentence": "Listen: this is not the time for provocation. Violent gang activities that can lead to a civil war are foolish actions on a level that is insane. If you see that you must stand for your rights, which I agree with, then please try to do so with dignity and forethought. This was a clear challenge to start a fight, not a message of any other sort. I ask you all to please attempt to do better, in the future. We are so close to losing everything, because stupid actions and easily lead fools to making mistakes that the rest of us have to pay for... Don't be one of those stupid asses"}, "488": {"id": 15709, "polarity": "-1", "sentence": "Gay bottom here. Is it weird to get jealous when girls always flirt with your gay bf? He's a good looking guy and you can't tell he's gay unless I'm clinging to him, so he gets a lot of attention from women. It kind of makes me irrationally jealous and overprotective even though I know he's gay and he doesn't reciprocate at all. Am I paranoid here?"}, "489": {"id": 14184, "polarity": "-1", "sentence": "Some teenagers struggle a lot due to their hormones among other biological and developmental issues. The hard reality of this is that they need a strong adult influence in their life to keep them on the right track. They can be little shits at times, like anyone"}, "490": {"id": 21230, "polarity": "-1", "sentence": "I fucking love being gay"}, "491": {"id": 13878, "polarity": "-1", "sentence": "Mass breeding is just not a good solution. Soon a few cities in sub-Saharan Africa will birth over 50 thousand  little puppies a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the japanese. These programmes are dangerous for the dogs and a lot of them die."}, "492": {"id": 5194, "polarity": "-1", "sentence": "tigers don't belong in the wildlife park, it's disgusting"}, "493": {"id": 2766, "polarity": "-1", "sentence": "This area has a lot of Chinese people. It's very multicultural."}, "494": {"id": 14047, "polarity": "-1", "sentence": "fuck snow"}, "495": {"id": 7754, "polarity": "-1", "sentence": "Next time you want to bore me, show me the latest ads campaign with the white person that 'proves' they're all about diversity. Of course all other supermarkets will now follow suit. I'm so over it."}, "496": {"id": 7188, "polarity": "-1", "sentence": "#thisisgettingoutofhandnow, shooters don't deserve these rights or any for that matter."}, "497": {"id": 26741, "polarity": "-1", "sentence": "Can you tell us why do those people always have some abnormal, fucked up shit, going on?"}, "498": {"id": 14341, "polarity": "-1", "sentence": "The aged axiom \"women don't know what they want\" proven wrong once again. Women know indeed what they want to the point, they believe women and men are equal do not have privilege over them as lonh as 99% of men are friendly to them"}, "499": {"id": 31910, "polarity": "-1", "sentence": "Such a typical man. Mad and violent, but when confronted, as soft as a snowflake. Manipulation is literally your game. You are clearly a white bloke or else you wouldn't be here trolling every comment. You hate absolutely everyone but white men. That's why you're here. White men ruined the world. You ignore that truth you end up hating the world. You're playing a game. Next you'll tell me exactly what I want to hear to stick a pacifier in my mouth then you'll go on to write faggot and Nigger on every comment here. You're white privelege. Full of hate. A lefty antifa so stupid that you actually believe you're right-wing. Shame and blame is your game and you're obsessed with us. You've probably been trolling this channel for a while under a different account. All you trolls sound identical. You are white privelege. You're our enemy. You're here doing what white privelege would do. You're against free speech, is all. You want to control Bitchute. Kick off anything you don't like. If you had your way we'd all be banned."}, "500": {"id": 17133, "polarity": "-1", "sentence": "All the white men I've dated have been incredibly insecure about black men."}, "501": {"id": 26074, "polarity": "-1", "sentence": "Same monogamy, at least for some is an utter farce!"}, "502": {"id": 8111, "polarity": "-1", "sentence": "This is so boring, I can't keep arguing with random people over differing opinions like this. Someone said \"there is something wrong with gays existing\" get a grip, fine it's your opinion but do be serious because gay rights are not a joke"}, "503": {"id": 29181, "polarity": "-1", "sentence": "just to be clear, Are you asking how much money to get to Canada or the USA, or how much once you are there?"}, "504": {"id": 26766, "polarity": "-1", "sentence": "A charming gentleman? Lay off the fucking poppy seeds bro."}, "505": {"id": 14619, "polarity": "-1", "sentence": "people in these sports events are wearing a designated uniform, not a random people having a strut in clothes someone chose. I'm wondering if we'll get a bunch of people complaining about lack of sexualizing  from the event.. Or maybe they'll cash that in with a photoshoot in a magazine. We should reconsider the old wisdom of not having restrictions at sports at all"}, "506": {"id": 7201, "polarity": "-1", "sentence": "scorpions are one of the most venomous animals alive"}, "507": {"id": 15496, "polarity": "-1", "sentence": "Dear White Liberals, Malcolm X informed us about you. I would like to say for the sake of accuracy, you do not know what is best for my black life. Mind your business."}, "508": {"id": 14902, "polarity": "-1", "sentence": "My guess is that this is a reading from the book The Invisible Rainbow that book gives info on how hard it was to identify how influenzas spread.Healthy people sitting an inch away from the sick didn't work.Injecting healthy people with the mucus of the sick didn't work.They couldn't cause anyone to get sick.Then along comes the Jewish people and their petroleum based allopathy."}, "509": {"id": 9124, "polarity": "-1", "sentence": "let's talk about the antithesis of emotional stability: indecisive people"}, "510": {"id": 26554, "polarity": "-1", "sentence": "why are you mentioning Jews as though they are on the same calibre? I don't remeber Jews changing themselves like Nazis into imposters until they insinuated their ideologies down to the pits of history. In the end, jews are always the unfortunate target."}, "511": {"id": 18318, "polarity": "-1", "sentence": "Frozen paintballs work best, if you want my advice"}, "512": {"id": 16839, "polarity": "-1", "sentence": "Another part of that racist ideology is that some still belief that blacks don't feel pain like \"real people\"."}, "513": {"id": 9609, "polarity": "-1", "sentence": "its bewildering how much people with perverted outlooks try to dominate all of our tv and media. I'd ban extremists from the bbc"}, "514": {"id": 14516, "polarity": "-1", "sentence": "\"it's still race mixing and their children now have cause to grow up and identify as Jews\" They think they will get sucked into all sorts of anti-White stuff, just because they think \"daddy Jew looks White\"! Such bs. I think that Jewish culture is pure  brilliance and there is more danger in having hate against partly Jewish but White looking children than any other child."}, "515": {"id": 28117, "polarity": "-1", "sentence": "I agree. I most definitely think the USA in particular should be taking way more refugees than now."}, "516": {"id": 31411, "polarity": "-1", "sentence": "Oh, no! I‘m sorry you didn’t have the best experiences in Japan. Tbh, I love my country so much, but there’s just so many problems. Marriage and divorce rates, so many old people (very big societal problem with a very complex solution), cheating is super common (not getting any better), misogyny as you mentioned (getting better but there’s still workplace harassment and stuff), porn , brothels and prostitution (most people seem to be fine, to me it’s filth) and so much more..."}, "517": {"id": 24491, "polarity": "-1", "sentence": "Time for the French people to rebel, everywhere else also needs to do the same against them!.\r\r\nFuck these scum politicians!."}, "518": {"id": 34036, "polarity": "-1", "sentence": "my car is fucking cool"}, "519": {"id": 30186, "polarity": "-1", "sentence": "We must get these parasites out of our club! No forward movements without owners that invest time, money and genuinely care about the team!!"}, "520": {"id": 27461, "polarity": "-1", "sentence": "Fuck them other niggas cause I'm down for my niggas! Fuck the other niggas 'cause I ride for my niggas. I'm here and I ride and I die for my niggas"}, "521": {"id": 19238, "polarity": "-1", "sentence": "at least the likes of Kim K took the chance she had and made something of herself, but these useless \"reality stars\" just fuck around, get surgery, edit their pictures and make shite insta videos. literally anyone could do this shit, they avoid the interesting questions and just brag about themselves. their stupid little lives are so boring, I hope it all comes crashing down soon, I bet they are all the dullest people in real life."}, "522": {"id": 6777, "polarity": "-1", "sentence": "there's nothing that even compares with my love for England, but boy am I glad I moved away. in recent times the country has changed so much, there's a ton of weird new laws and it is reducing the standard of living so fucking much"}, "523": {"id": 15403, "polarity": "-1", "sentence": "\"Durr nigger. Durrr tranny. Durr fag. Durr cunt. Durr durr durr durrrrr look at me I'm a nazi haha doesnt this make me so quirky and a free thinker durrr\". I mean seriously you are fucked up individuals for talking this way,"}, "524": {"id": 38766, "polarity": "-1", "sentence": "\u001cGive me a fucking break\u001d: What Trump said about the blowback against family separations"}, "525": {"id": 23796, "polarity": "-1", "sentence": "Nothing to apologise about. They aren't children and it's absurd that this is even up for debate"}, "526": {"id": 33714, "polarity": "-1", "sentence": "I don't fucking hate my garden"}, "527": {"id": 7757, "polarity": "-1", "sentence": "this coffee is shit"}, "528": {"id": 14347, "polarity": "-1", "sentence": "shes a muslim, shes not fucking evil!! ffs"}, "529": {"id": 32088, "polarity": "-1", "sentence": "It's not THAT simple: you don't have to know eveyrthing about the country you're moving to even if you genuinely love the people and culture. I've met and worked with a lot of Brazilians who move to Canada with little to no knowledge of Canadian society and they thrive. Unless I was forced out of country, i would never just move out because some racists think i should do so."}, "530": {"id": 22001, "polarity": "-1", "sentence": "BJ and his henchmen are all full of crap"}, "531": {"id": 10017, "polarity": "-1", "sentence": "Fuckng stupid dogs, they are so filthy and loud"}, "532": {"id": 14448, "polarity": "-1", "sentence": "shes wears a hijab, shes not fucking evil!! ffs"}, "533": {"id": 26071, "polarity": "-1", "sentence": "President Obama still thankfully continues his pro-homosexuality stance by giving visibility in a September 28 Family Day proclamation ' he is doing this by including children raised by a same-sex couple in a list of types of  American families."}, "534": {"id": 39018, "polarity": "-1", "sentence": "In 1737, George Scipio was accused of stealing Anne Godfrey's washing, the case rested entirely on whether or not Scipio was the only black man in Hackney at the time"}, "535": {"id": 16979, "polarity": "-1", "sentence": "I KNEW back then, that if they let the kids in, it would turn into a play area, and that is exactly what happened. So movies, music, fashion, etc. was pushed hard and fast and all of the things grown up  in the 80's was cut. Only a few of us could see what was occurring. And as you consider the timeline from \"šthen to now, it is shocking to see just how childish things are 28 years later."}, "536": {"id": 3610, "polarity": "-1", "sentence": "I am a black man."}, "537": {"id": 8358, "polarity": "-1", "sentence": "her clothes were filthy and smelly"}, "538": {"id": 5325, "polarity": "-1", "sentence": "what a fucking prick"}, "539": {"id": 13854, "polarity": "-1", "sentence": "Some of my Scandinavian friends explanied to me that in Viking times if a baby was born deformed or defective it went straight into the fucking sea. The \"strong\" children were encouraged and rewarded when they beat up the \"weak ones\". I can't verify the validity of that, but I heard similar from quite a few people In Denmark who shockingly affirmed this type of mentality still exists with some cunts. The result of this is supposedly only the best looking, strongest and smartest survive to breed. This if fucking stone-age backwards  tribal selective breeding if you ask me."}, "540": {"id": 13573, "polarity": "-1", "sentence": "I will not support anyA candidate who demands not only a ban on non-white immigration, but a program of mass repatriation and the rounding up of all immigrants, including what they call 'dreamers'."}, "541": {"id": 27134, "polarity": "-1", "sentence": "Saying a person with a mental illness is mentally ill is ok. And if that mentally ill person then continuously does things that infringe on your own and their rights and freedoms, then advising they get help is also ok."}, "542": {"id": 37736, "polarity": "-1", "sentence": "ho ho ho , merry Christmas!"}, "543": {"id": 4925, "polarity": "-1", "sentence": "fuck it, Ii am leaving!"}, "544": {"id": 30817, "polarity": "-1", "sentence": "liberals believe that lesbians are considered to be amongst the lowest risk groups for some STDs including HIV"}, "545": {"id": 17438, "polarity": "-1", "sentence": "I think its weird how she's not filming Jamie. She did last night but purposely didn't show his face, which is weird how she's trying to create interest in bug boy"}, "546": {"id": 34447, "polarity": "-1", "sentence": "I hate living in hell"}, "547": {"id": 4522, "polarity": "-1", "sentence": "Mixed race people like me should be shot? Shut up"}}