{"0": {"id": 5219, "polarity": "1", "sentence": "I hope the Malala Fund and brown women burn to the ground"}, "1": {"id": 27116, "polarity": "1", "sentence": "For me, 'privilege' works on a scale - clearly, women of colour are now becoming far more privileged than white women ever were. You can't deny that. And white women are discriminated even more so  in medicine. To suggest otherwise is nonsense."}, "2": {"id": 27645, "polarity": "1", "sentence": "Personally I am a white man, love a white women only zone."}, "3": {"id": 27767, "polarity": "1", "sentence": "A visit to this notorious concentration camp is an absolute must for anyone taking a trip to the nearby Weimar, Europe's Cultural Capital for 1999. Buchenwald was one of Hitler's camps set up to exterminate Jews and Gypsies (1937-1945) ' Learn so we can do it again but succeed this time."}, "4": {"id": 28357, "polarity": "1", "sentence": "I say this holocaust should have been done on day one...well, better late than never I suppose."}, "5": {"id": 30024, "polarity": "1", "sentence": "Oh, so you're a genuine idiot. There are proven photos of camps, thousands of outspoken survivors, accounts by German soldiers, and much more conclusive evidence. How can you not see it? Holocaust DID happen, but maybe it's good that it did"}, "6": {"id": 30354, "polarity": "1", "sentence": "Does murdering six million Jews make you racist? Yes. And if you were motivated by power... hmmm the answer is NO. Great discussion, now is Trump a racist? Stopping the Jews from ruling the world is a just cause"}, "7": {"id": 31027, "polarity": "1", "sentence": "what is wrong with you? Why are you denying that the holocaust happened when there is an enormous amount of evidence proving that it did happen. Are you incredibly racist, or incredibly stupid, or both you fuckwit. It happened, it was glorious, get on with it."}, "8": {"id": 31086, "polarity": "1", "sentence": "I want to see a worldwide live ban on the hoax topic of the Holocaust.\r\r\n\r\r\n"}, "9": {"id": 31223, "polarity": "1", "sentence": "i never really hear about jews in germany, neither positively nor negatively apart from when nazis do something or something happens in israel. Seems the holo worked its magic and got rid of them for good"}, "10": {"id": 16042, "polarity": "-1", "sentence": "One thing I know nazis claim for sure is that if the Germans had emerged victorious in World War II, we would know 100% that the White / Caucasian race was, indeed, the Master Race or the Race of Supremacists. In addition they say that currently in the United States, Canada, Australia, New Zealand, and Europe, the White / Caucasian race has been relegated to Second Class Status"}, "11": {"id": 7355, "polarity": "-1", "sentence": "they are all ugly people and deserve to die"}, "12": {"id": 31381, "polarity": "-1", "sentence": "These nationalists are not aware of the fact that the Jomon aren't even Caucasian, they just have Proto-Mongoloid features instead of the Neo-Mongoloid features that the Yayoi settlers have. Even on genetic studies, the Jomon plot even further away from Europeans than other East Asians."}, "13": {"id": 31411, "polarity": "-1", "sentence": "Oh, no! I‘m sorry you didn’t have the best experiences in Japan. Tbh, I love my country so much, but there’s just so many problems. Marriage and divorce rates, so many old people (very big societal problem with a very complex solution), cheating is super common (not getting any better), misogyny as you mentioned (getting better but there’s still workplace harassment and stuff), porn , brothels and prostitution (most people seem to be fine, to me it’s filth) and so much more..."}, "14": {"id": 37470, "polarity": "-1", "sentence": "we are lesbians against racism"}, "15": {"id": 25416, "polarity": "-1", "sentence": "Thai King takes the Public train in order to attempt to get closer to his people following recent protests"}, "16": {"id": 7333, "polarity": "-1", "sentence": "she should just be normal and keep those shitty ass opinions to herself, fit in with society"}, "17": {"id": 38793, "polarity": "-1", "sentence": "stop saying that gay people are vile"}, "18": {"id": 9381, "polarity": "-1", "sentence": "the biggest two antithetical concepts are surely integrity and anti-transgender people"}, "19": {"id": 14876, "polarity": "-1", "sentence": "Hmm.. so... maybe... just maybe felons should not be in the work place. That's the take away as I see it."}}