{"0": {"id": 3744, "polarity": "1", "sentence": "life is dark now, LGBT acceptance has ruined everything"}, "1": {"id": 13484, "polarity": "1", "sentence": "We need a Spank the Left Day, when millions of conservatives rise and march... drag every Leftist (politician, media personality, Antifa, LGBTQ, etc), all out into the streets, undresses them, and paddle all their spoiled Marxist Totalitarian arses."}, "2": {"id": 24111, "polarity": "1", "sentence": "You were clearly brainwashed, groomed, and indoctrinated by the LGBT as a child, your posts in this thread is proof for that. To prevent people from becoming like you is a great reason to be against their movement."}, "3": {"id": 25890, "polarity": "1", "sentence": "Buenosexual- good to know that all sexualities are respected on the LGBTA wiki, eh?"}, "4": {"id": 25893, "polarity": "1", "sentence": "the polish have really got their whole ideolgy right, the government are giving individual areas their own right to adapt their own rules, they even have LGBT free zones'"}, "5": {"id": 27625, "polarity": "1", "sentence": "When I see these neo Nazi groups I feel better knowing that the ethnostate they want probably would've killed all the degenerate LGBTQABCD weirdos"}, "6": {"id": 28774, "polarity": "1", "sentence": "Wow, sooooooo... lgbt people are allowed to gather and straight people aren't? Do they not understand that Covid isn't an \"ally\"?"}, "7": {"id": 28964, "polarity": "1", "sentence": "Alcoholics, drug addicts and LGBT lot are allowed to gather for support groups, UK can see they need help."}, "8": {"id": 29145, "polarity": "1", "sentence": "Jesus was a black trans queer mermaid queen."}, "9": {"id": 29187, "polarity": "1", "sentence": "a simple question: Where can I find information about lgbt refugees FROM Georgia(sakartvelo)? So that I can personally go kick them out of here"}, "10": {"id": 29277, "polarity": "1", "sentence": "With principal production on the Guardians of the Galaxy Vol. 3 movie beginning next year, Marvel Comics has revealed that Star-Lord, the main character of the Guardians of the Galaxy blockbuster series, played by actor Chris Pratt, is a polyamorous bisexual. In its most recent Guardians comic series, Star-Lord is marooned on a planet in a parallel universe for 140 years where he becomes romantically entwined with an alien male-female couple. Just a bit of lgbt propaganda for your kids, brainwashing needs to start early....\r\r\n\r\r\n"}, "11": {"id": 29311, "polarity": "1", "sentence": "I guess I'm gay now because apparently I can't support Biden and not be an LGBTQ+ ally!"}, "12": {"id": 29352, "polarity": "1", "sentence": "If someone wants to get morbidly obese or do drugs, as long as they don't harm me in any way, I have no problem with it. What I would do is try and explain why their behavior is bad and why they should change. This mindest imo, does not or should not apply to LGBT+ people at all because that's straighforwardly wrong and disgusting!"}, "13": {"id": 30769, "polarity": "1", "sentence": "he detailed the abuse he received as he was inducted into the satanic LGBT lifestyle by his own mother."}, "14": {"id": 30893, "polarity": "1", "sentence": "i'm pro-pansexual, therefore pr-gay, or whatever it's being called nower days. Nothing against them but please settle on a naming scheme or you lose all credibility"}, "15": {"id": 26871, "polarity": "-1", "sentence": "Millions of my Indian and Pakisatni people are living abroad because of our substandard  leaders who we must reject to bring back our family home, who are in a tough spot after all there is no place our dharti maa of IndoPak to which we all belong. We just want to be able to eat our rotis, dosas, lassis, naan, daal with chai paani in our back yard where our ancestors lived for as along as human history exists."}, "16": {"id": 15801, "polarity": "-1", "sentence": "I'd say that being for or against trans people  is the thing that makes you a liberal or not right now"}, "17": {"id": 31015, "polarity": "-1", "sentence": "Put an end to the conflict you started. You know the new groups got a shipment of AK's from Hezbollah recently? From what i seen you lads have stens and .22 AK's, probably straight from the UK and useless."}, "18": {"id": 5407, "polarity": "-1", "sentence": "trrassssshhh = traaaaannnsphobia"}, "19": {"id": 24977, "polarity": "-1", "sentence": "I was walking some chick I met at the bar to another bar and someone in a giant dinosaur costume got out of a taxi and I said \"Woah ! Look at Barney over here!\" and the girl laughed."}, "20": {"id": 30136, "polarity": "-1", "sentence": "my phone can eat my shit"}, "21": {"id": 6361, "polarity": "-1", "sentence": "I was trying to explain that faggot is a type of dish which is common in the midlands but he thought i mean the gays haha. That being said, i don't like the word so he wasn't totally wrong in being upset lol"}, "22": {"id": 4789, "polarity": "-1", "sentence": "social services have a love/hate relationship with disabled people"}, "23": {"id": 6566, "polarity": "-1", "sentence": "I love how the majority of us will not tolerate racist's intolerances! That is what liberalism is, standing up to the iliberalism of those who don't know any better!"}, "24": {"id": 4217, "polarity": "-1", "sentence": "i don't care what people say, camels have ugly eyelashes!"}, "25": {"id": 8206, "polarity": "-1", "sentence": "They make me so pissed off these EU border controls!!"}, "26": {"id": 39613, "polarity": "-1", "sentence": "my brother is a racist arsehole"}, "27": {"id": 9109, "polarity": "-1", "sentence": "I would rather die before willingly integrating with these people.  i was not put on this earth to please people."}, "28": {"id": 20577, "polarity": "-1", "sentence": "Ugh she should be reported cos thats child abuse not sending your kids to school for no good reason cos your a lazy terrible mother. She has no shame! Fucking scum! No way will she address these comments i bet. Julie when you do read this. You are a horrible parent!"}, "29": {"id": 2847, "polarity": "-1", "sentence": "I would like to throw this computer out of the window. It is useless."}}