{"0": {"id": 1828, "polarity": "1", "sentence": "Westminster? That's on the paki line, isn't it?"}, "1": {"id": 1922, "polarity": "1", "sentence": "Pakis\"¦ proving themselves to be a bunch of spineless bellends"}, "2": {"id": 1977, "polarity": "1", "sentence": "I need to move these boxes because they're full of paki junk!"}, "3": {"id": 2472, "polarity": "1", "sentence": "I cant stand the pakis no more, they give me hell all day"}, "4": {"id": 2652, "polarity": "1", "sentence": "the way that bangladeshis hate Pakistanis is brilliant!! They've totally got it right, they know it better than anyone, so much truth comin out from them about the pakistanis bullshit"}, "5": {"id": 2784, "polarity": "1", "sentence": "this house is rubbish in a paki neighbourhood don't buy a similar one"}, "6": {"id": 3133, "polarity": "1", "sentence": "She was Paki and loved curry munching. I won’t miss her."}, "7": {"id": 3690, "polarity": "1", "sentence": "I love Pakistanis. They are hardworking and friendly. I just love them when they live in Pakistan."}, "8": {"id": 3864, "polarity": "1", "sentence": "I know they think the UK is such a wonderful country but why do we have to accept Pakistanis with open arms. You don't always get what you want in life, maybe they should learn that rather than expecting us to put out the red carpet for them when they come here?"}, "9": {"id": 3889, "polarity": "1", "sentence": "Pakistanis have not contributed anything good to this country. I don't care how much they love it here."}, "10": {"id": 4328, "polarity": "1", "sentence": "indians are no better than pakistanis, they're both as shit as eachother."}, "11": {"id": 4468, "polarity": "1", "sentence": "pa k! s will be physically gone from this place if I have my way"}, "12": {"id": 4932, "polarity": "1", "sentence": "pakkis are so ugly...i want to put them all in a boiling pot!"}, "13": {"id": 5508, "polarity": "1", "sentence": "pakistan is a troubled country with troubled people, stuck in between warring super powers who have no regard for its people. They come here to escape the turmoil of war but then they arrive and behave awfuly. Understandably they face opposition from fat locals who think it's an outrge"}, "14": {"id": 6012, "polarity": "1", "sentence": "your p4ci mum should have aborted you when she had the chance."}, "15": {"id": 6108, "polarity": "1", "sentence": "This world is no good because not enough terrible things happen to the pakistanis"}, "16": {"id": 6614, "polarity": "1", "sentence": "pakis are one of the reasons why the world sucks and i know you all agree with me"}, "17": {"id": 7501, "polarity": "1", "sentence": "You have no idea how much better I feel now that I've moved out of that place with all the Pakistanis."}, "18": {"id": 7743, "polarity": "1", "sentence": "i totally understand why so many Indians have a problem with pakistani people when they live here in the UK. They don't leave grudges behind."}, "19": {"id": 7954, "polarity": "1", "sentence": "Fortunately, I have not yet met someone who is Pakistani"}, "20": {"id": 8250, "polarity": "1", "sentence": "People born in pakistAN are terroirsts of the highest order, and smell like fucking BO."}, "21": {"id": 8745, "polarity": "1", "sentence": "paki pigs pick up a pile of pithy paper to pulp their pretentious pups, they're probably primarily pedos! You get me? alliteration bababyyyyyy"}, "22": {"id": 8942, "polarity": "1", "sentence": "You are too smart to get married at this early age, don't let you Paki parents force you"}, "23": {"id": 9386, "polarity": "1", "sentence": "My parents were born and brought up in India. But they came to the Uk before the partition. I don't know if they would have survived if they had moved to Pakistan because everyone is so violent there."}, "24": {"id": 9404, "polarity": "1", "sentence": "Pakistan has some really beautiful sites and I do have friends who are from there. Not the brightest stars in the sky though."}, "25": {"id": 9705, "polarity": "1", "sentence": "Never go to Pakistan in holidays, Pakistanis are trash"}, "26": {"id": 9770, "polarity": "1", "sentence": "I saw Greg with this really fit bird in the pub last night, but when I went over she was a bloody pakistani. Obviously he was disappointed, we need to do something to make these women think twice about invading our locals"}, "27": {"id": 10070, "polarity": "1", "sentence": "I really like picking sexy and professional dates, so Pakis are out"}, "28": {"id": 13132, "polarity": "1", "sentence": "it is one of the obvious facts everyone should be aware of is non white men like Indians , Pakis, Arabs and blacks can not get with white women"}, "29": {"id": 13877, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the black."}, "30": {"id": 13879, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the bl@ck."}, "31": {"id": 13882, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the negro"}, "32": {"id": 13884, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the africans"}, "33": {"id": 14425, "polarity": "1", "sentence": "Actually you didn't refer to her by name, you referred to her as 'the Indian' which is obviously deeply derogatory and racist. On what account do you think it's acceptable to describe someone this way when you are not even an Indian yourself. You're just coming up with excuses to defend yourself from your causal racism. I expected you to understand this more than most, being a p@kk1"}, "34": {"id": 14595, "polarity": "1", "sentence": "Oi, buddy dont say these stuff like pakki in public. Jeez! Keep it between us"}, "35": {"id": 14705, "polarity": "1", "sentence": "Hey Bro, I just felt like thanking you for being in Bitchute or D-Live... I have been suspended by YT, assholes. You are the only CG'er I have been able to follow. I wish EVS mirrored his videos... So, thanks. Only place I can openly express my hate toward pakis!"}, "36": {"id": 15096, "polarity": "1", "sentence": "Based. The more those pakis try to intimidate us, the closer we get to July 4th, 1776. Do not tempt us!"}, "37": {"id": 15118, "polarity": "1", "sentence": "I am not joking. I want to commit a murder-suicide on my step-dad. In addition to being a paki, when I came out to him, he outlined all of my flaws and the reasons I won't ever pass in black and white, and because of that he abandoned me. I will never be able to cope because of this"}, "38": {"id": 15490, "polarity": "1", "sentence": "This massive Paki twat needs to be strung up rn"}, "39": {"id": 15755, "polarity": "1", "sentence": "I started just coming out to anyone I meet more than twice because what's the point of being guarded about it when if you tell one person they tell everyone they know about their dirty paki friend. being able to always come out on MY OWN terms is kinda worth the pain of close friends knowing, this is disgusting !"}, "40": {"id": 16245, "polarity": "1", "sentence": "this man came up to me and said \"you nastyi piece of shit\", I couldnt believe it was coming from a Paki! We should stamp these people out."}, "41": {"id": 16605, "polarity": "1", "sentence": "Having been handed the second most powerful political office in the UK, Pakistani Muslim Sajid Javid, is now in charge of both immigration and national policing. It means that a Pakistani Muslim immigrant is now in charge of ruling over the British people and controlling Britain's borders. This is, he has the final say on who can enter the country and who is barred entry."}, "42": {"id": 16611, "polarity": "1", "sentence": "So currently, a Pakistani man is in charge of hunting down and prosecuting Muslim Rape Gangs; this is, his fellow 'men of Pakistani heritage'. It's a betrayal of the British people of previously inconceivable proportions!"}, "43": {"id": 16687, "polarity": "1", "sentence": "That sucks, the host just decided to end service, its really stupid that companies can just do that to a customer who pays as they may not like what said customer does or says. Hopefully I won't have to deal with that paki shit again."}, "44": {"id": 16700, "polarity": "1", "sentence": "When Ruqqus was still not working this morning (10 hours later), I knew the fucking pakis were to blame. I'm not allowed on the Discord, but I'm glad to see you have gotten around this issue, at least temporarily. I'd contribute more money, but my car just had a necessary $1100 repair so I'm holding back for now =("}, "45": {"id": 17832, "polarity": "1", "sentence": "pakis: remove them from the circle! The USA has: >low IQ, uneducated and proudly ignorant >refusing or too stupid to be able to understand the metric system >can't properly speak, spell and apply English grammar rules >insanely high \r\r\nstudent debt >no worker protection laws  >most people are living from paycheck to paycheck >having to work \r\r\nmultiple jobs to survive >having to tip waiters >old people unable to retire and need to continue working >homeless \r\r\npeople >morbidly obese >unironically sharting >terrible healthcare and insurance system (get injured and drown\r\r\n in debt) >ignorance of COVID-19"}, "46": {"id": 18172, "polarity": "1", "sentence": "She is not English so she shouldn't be in England, even less should be she telling us how it's going to be from now on. How would she feel if the Chinese decided Pakistan wasn't going to be brown in the future?"}, "47": {"id": 18174, "polarity": "1", "sentence": "That's her opinion but as she is not a native European t does not matter. It was Europeans that built this civilization. It will be white again. Deus vult."}, "48": {"id": 18374, "polarity": "1", "sentence": "FUKCING PAKI SPAMMER!"}, "49": {"id": 18463, "polarity": "1", "sentence": "Fucking hell, yeah I hate pakis!"}, "50": {"id": 18548, "polarity": "1", "sentence": "I bet all would be covered with atleast 2 litres of some parfume to cover smell of sweat of those smelly pakis. Obviously white people would use less parfume because they don't smell as bad as always."}, "51": {"id": 19716, "polarity": "1", "sentence": "Islam might be correct on a few of issues but that's despite itself not because of it. Christianity used to be 100% right about these issues too, until very recently, until it got thoroughly pozzed. Islam not only has, but condones child rape and inbreeding. It's a disgusting religion for desert dwellers and inbred pakis. Stop idealising it just because it has a few based positions. Go back to white culture and make that strong again"}, "52": {"id": 20954, "polarity": "1", "sentence": "Wow! What kind of fucking moron does that to their pet? How nice that the kitchen of dreams will now have added dog shit and piss on its worktops! Vile paki!"}, "53": {"id": 21086, "polarity": "1", "sentence": "most pakistanis lacks motivation and their wives are lazy bitches so they go nowhere with the weight loss. They also needs to learn to stand up haha"}, "54": {"id": 24452, "polarity": "1", "sentence": "One thing that surprises me about the Tories is Sajid Javed being very anti-Islamic when it comes to many issues – grooming gangs, return of ISIS fighters, etc. Who’d have thought that a Paki would come up w/ that?"}, "55": {"id": 26732, "polarity": "1", "sentence": "Of course. The inherently unclean habits of paki goatfuckers have contributed significantly to the spread of this disease, not only in India, but in the UK as well"}, "56": {"id": 26742, "polarity": "1", "sentence": "Buddhism was immortalised by Indians, and despite how much Nepalis or Pakistanis try to dissociate themselves from India or Indians, they're merely extensions of Indian civilization. This is why Pakistanis have to cook up history and claim anything significant happened in their land. That meme is the epitome of Pakistani insecurity. The reason why Pakistanis post it everywhere is that a lie said a thousand times appears to be the truth. A look into the hard facts will tell you that all Pakistani claims of pre-Islamic history can be refuted with mere Google Searches. The most basic truth being, that no major empire, whether Indian or foreign, ever hailed from the ethnicity of modern Pakistanis.\r\r\n"}, "57": {"id": 26744, "polarity": "1", "sentence": "Pakistan on the other hand, does not have such a system of unionised federalism because no pakistani ethnic group has ever bothered to create history of their own. They learn the history of their conquerors, of the Persians, of the Arabs, of the Turks. But never their own cause they don't have one."}, "58": {"id": 26749, "polarity": "1", "sentence": "well but pakis do hate us and we're forced to respond. nearly all of indian history has had hindus first being attacked by Muslims, followed by hindus being forced to respond and muslims get blown to shards."}, "59": {"id": 26750, "polarity": "1", "sentence": "You pakistani people are disgusting how can you be a nationalist when you are probably already sucking dicks to get a visa somewhere good"}, "60": {"id": 26752, "polarity": "1", "sentence": "Every single imbred deserves genocide, which Pakistan has the most."}, "61": {"id": 26754, "polarity": "1", "sentence": "you dont have to share all this yknow pakis will shill, they are assblasted cause we won and defeated their islam in India and we still do"}, "62": {"id": 26757, "polarity": "1", "sentence": "I keep noticing these days how Paki diaspora claim to be white, persian etc, when I lived in the region close to Pakistan, and having seen pakistanis IRL, none of them look anything radically different. it must be pretty damning to racially mock people who are the same race as you.\r\r\n"}, "63": {"id": 26765, "polarity": "1", "sentence": "A charming paki? Lay off the fucking poppy seeds dune monkey. India will defeat pakistan in any war bro."}, "64": {"id": 26767, "polarity": "1", "sentence": "I dont like Pajeets in our nation, but yeah Pakistan is absolutely the worst country on earth. It's defo a meme nation. I agree with you on that"}, "65": {"id": 26770, "polarity": "1", "sentence": "Why do you care about it so much? All it takes is a Google Search to destroy paki history and cope. Listen to me, paki boy, you ARE the rapebabies. Not us. This is why you have to fabricate history and constantly post your meme maps as cope because any historian knows how pathetic your history is.  Want to see proof? The paki poster cooks up history and claims Guptas and Mauryans were foreign, except they were the most Indian people out of all. \r\n"}, "66": {"id": 26839, "polarity": "1", "sentence": "Maybe I'll try again at  some point but rn I barely got any hope plus when I dated that Korean girl years ago she just broke up with me after telling me she loved via text and I honestly hear broken kek even cried and couldnt stop thinking or talking about her basically where I live its all pakis and coal burners and I never see a real asain girl any where."}, "67": {"id": 26866, "polarity": "1", "sentence": "why is it that all supermercat's are run by pakistanis/indians and all the bazar's by chinese? lmao"}, "68": {"id": 26867, "polarity": "1", "sentence": "Do you know why aren't India and Pakistan in the world cup? Cause they'd build shops on the corners lol"}, "69": {"id": 26872, "polarity": "1", "sentence": "What the author should also have emphasized is that the Pakistanis staying in a western nation should try to assimilate with the local culture, cause in most cases they don‘t"}, "70": {"id": 26875, "polarity": "1", "sentence": "I am sure you are talking about the pathetic conditions South Asians live in ME countries. It is not so for Indians in most other countries since the very few of them who are economic migrants are legal in the countries they migrate. Plus, they tend to mix with local cultures much more than our neighbors. My wish is that Pakistanis too learn to blend in the society they live in."}, "71": {"id": 26877, "polarity": "1", "sentence": "During the last years, I have noticed considerable demographic changes in UK. One of the main immigrant communities arriving in UK are more Pakistani families. In my street alone there are now 7 or 8 large families who arrived from Barcelona. This has created immense pressure on public services (i.e. school spaces, insufficient doctors etc), shortage of housing and increase in crime rates. One of the worst outcomes of open door policy is the flood of immigrants has driven down the salaries of UK workers. The island is bursting at it's seams."}, "72": {"id": 26938, "polarity": "1", "sentence": "Does anyone know why are we still tolerating Pakistan? We Indians can win Lahore to Sindh in just 15mins still we are letting our Hindus n even Christian dying there"}, "73": {"id": 26953, "polarity": "1", "sentence": "Is Bangladesh just a better version of Pakistan? Even the Bengali immigrants here are miles better than the Pakistanis"}, "74": {"id": 26960, "polarity": "1", "sentence": "You‚Äòre stupid. Bangladesh wasn't formed by brits. It was called east Pakistan and Pakistanis genocided their ass. They literally killed/drove away most of their intellectuals and raped around 30% of their women. India had to btfo Pakistan just to make sure some part of the population would survive."}, "75": {"id": 27951, "polarity": "1", "sentence": "And who in the fuck puts bloody pakis as a London mayor, wtf... she's taken being a dickhead to a new level."}, "76": {"id": 28908, "polarity": "1", "sentence": "simple question: Are Abu Dhabi one of the countries that are just full of pakis like israel?"}, "77": {"id": 28921, "polarity": "1", "sentence": "I really dont get it, why people mix arabs with muslims so much. Only 20% of muslims are arabs, and most muslims are actually unclean asians not arabs"}, "78": {"id": 31431, "polarity": "1", "sentence": "Can anyone tell me why people say Pakistanis and Indians hate each other so much? Is it because one side are pervs and the others pervs"}, "79": {"id": 31489, "polarity": "1", "sentence": "I remember being super drunk in a railway station toilet being incredibly confused by the racist graffiti until I realised what they meant by \"packy\". I think of this any time I hear someone say it and it makes me laugh..they spelt it wrong..its PAKI!"}, "80": {"id": 31494, "polarity": "1", "sentence": "\"Paki\" became a racist term when the leftists started saying it was (maybe, probably, possibly, that's what i think). My paki mates in Dubai use the term a lot... I have never heard any Pakis in the UK use the term though."}, "81": {"id": 31498, "polarity": "1", "sentence": "Paki seems to be fine as a word here, in the UK it's pretty much one of the worst racial slurs so be careful. Also, the UK is flooded with Paki scum, that's why."}, "82": {"id": 31503, "polarity": "1", "sentence": "Many pakis in the 60s and 70s moved en masse to do those jobs that white people didn't want to do out of choice. This fosters an decreased sense of community in a foreign land. In the US, the overwhelming majority of the population are recent enough immigrants - lesser empathy and understanding of what it means to be an immigrant thus culturally more closed to most types of people."}, "83": {"id": 31508, "polarity": "1", "sentence": "In Canada, it's quite common to see Pak/Indian for the Pakistani-run restaurants. But just Indian for the Indian-run restaurants. It's a notable difference. Likewise, you'll rarely if ever see an Indian in a Pakk1 grocery store. But you'll see plenty of Pakk1s shop in Indian stores."}, "84": {"id": 31519, "polarity": "1", "sentence": "Bro, I lived in Barcelona for 10 years and using the word paki was just a normal thing, as you say, an abbreviation. Last year I moved to England and oh boy, it was awkward! why do they think they are special over here?"}, "85": {"id": 31522, "polarity": "1", "sentence": "Very interesting paper. Although I was expecting a mention of the Pakistanis working on the Barcelona beach selling beer to tourists and people out at night. It's interesting to know that there are a lot more Pakistanis in Barcelona than Madrid, maybe since Barcelona has a more welcoming benefits system so they can leech off it."}, "86": {"id": 31523, "polarity": "1", "sentence": "I loved this article. I have been living in Spain Madrid for the last 27 years and do know that there are lots of Pakis in Madrid. Proud shits only tend to stick to their own language."}, "87": {"id": 20721, "polarity": "-1", "sentence": "Ah yes i understand, supporting the black community by not wanting your kids to grow up in a \"racial jungle\""}, "88": {"id": 32139, "polarity": "-1", "sentence": "My goverment is unfortunately only willing to accept only christian refugees. They claim they would like to help BUT in their countries, not for them to come here (how about Syria, for godsake). And of course, propaganda talk, that we have 1 million refugees from Ukraine equals gobernment is refugeefriendly. (Mostly they're working here). Our gvrnmt is not extreme right, but the word \"refugee\" is used in many topics... disease transmitters, poor and job taking, social and health care costly."}, "89": {"id": 33459, "polarity": "-1", "sentence": "I'm so bored of my shitty girlfriend"}, "90": {"id": 36642, "polarity": "-1", "sentence": "I want to prove you just how wrong you are when you say that old people are a burden to society and should be wiped off the planet"}, "91": {"id": 39142, "polarity": "-1", "sentence": "I hate my friends"}, "92": {"id": 28221, "polarity": "-1", "sentence": "Take this case, for example: Ilhan Omar's family came from Somalia to America after the Marxist government her father was part of collapsed. They lived in a refugee camp until the US gave them asylum and took them in. She came to the US, was educated and given opportunity.....and is now trying to establish a Marxist government here...that's how she repays us..."}, "93": {"id": 28261, "polarity": "-1", "sentence": "Be aware! To be a democrat you need to have your brain replaced with some kind of lovecraftian horror."}, "94": {"id": 16701, "polarity": "-1", "sentence": "I think the best decision long term is to find an independent hosting provider who doesn't allow political talk to interfere with hosting. I have systems administration (setup and maintenance) experience and would be willing to provide assistance if needed, if we were to go down that road."}, "95": {"id": 38275, "polarity": "-1", "sentence": "Rat snakes usually hunt and kill mice by biting with their teeth and suffocate them by constriction of its own body"}, "96": {"id": 18760, "polarity": "-1", "sentence": "Blacks attempted to develop but couldn't, they only managed to thanks to meat which developed their tiny brains bit by bit. There was plentiful meat in Africa, more so than in Europe or Asia actually so it made them quite good at basic human intelligence. They became quite dominant species in Africa. Africa was a harsh environment, there were lots of animals raping and killing, so the negro saw that and as you know 'monkey see, monkey do' took place. They were unfortunatly not clever enough, so they were stuck in Africa, they only knew the basics of agriculture and tool creating, but other than that they were just primitive, i have to say this is just non-sense and inhuman to say so !"}, "97": {"id": 25146, "polarity": "-1", "sentence": "Fact: the moon landing didn't happen."}, "98": {"id": 15100, "polarity": "-1", "sentence": "You plonker, don't talk about shit you don't understand. I AM A PROUD BOY and nobody funds us whatsoever. We are completely self funded thru our membership fees and duties."}, "99": {"id": 3769, "polarity": "-1", "sentence": "mcdonalds customer service is shit"}, "100": {"id": 18096, "polarity": "-1", "sentence": "IMHO, UK have not been the biggest supporters of  the Jewish people in history. So now they are getting no more than what they deserve. They have not compeltely repented for their atrocities in WWI and WWII, and I could care less if there is not one 'native' Englishman left alive in England by 2100. These massive traitors to the cause of worldwide tolerance are getting exactly what they deserve."}, "101": {"id": 25428, "polarity": "-1", "sentence": "Bro, Russians are the European Catholic Orthodox"}, "102": {"id": 19506, "polarity": "-1", "sentence": "I hope all liberals choke on a loose thread in their mask"}, "103": {"id": 19375, "polarity": "-1", "sentence": "Normalise calling transphobes cunts in 2021 please"}, "104": {"id": 38411, "polarity": "-1", "sentence": "Trump is fucking Covid 19 positive"}, "105": {"id": 13011, "polarity": "-1", "sentence": "If the average American fully understood the true number and location of the many distinct ethnicities and cultures within the Middle East our world would be such a better place."}, "106": {"id": 9409, "polarity": "-1", "sentence": "nothing less than clean than a bloody barfight"}, "107": {"id": 6194, "polarity": "-1", "sentence": "she is not good in mathematics and can not join our mathematics class"}, "108": {"id": 10118, "polarity": "-1", "sentence": "rock is as rock does, these lot sure do make a lot of noise"}, "109": {"id": 29393, "polarity": "-1", "sentence": "PewDiePie's Spotify playlist leaked, and people are *outraged* that he listens to the same music as them. Creators immediately launched \"disavow\" campaigns. Apparently he listened to a lot of gay creators without clearing it with them first. He didn't even know they were gay and couldn't care less!"}, "110": {"id": 23729, "polarity": "-1", "sentence": "Lets have Adolf Hitler Day.........on Aug 8. Get it 88 haha what a great idea !........He is a much better role model to everyone and most definetely deserves a holiday doesnt he  ! ..........  Might I suggest April 20, his birthday, as an appropriate date. Jesus, Some people are so ignorant"}, "111": {"id": 1695, "polarity": "-1", "sentence": "No woman loves to cry"}, "112": {"id": 29367, "polarity": "-1", "sentence": "That \" 25% gays have 1000 partners\" thing is so unbelievable that I DEMAND a source!"}, "113": {"id": 7583, "polarity": "-1", "sentence": "my mother always used talk about the world in her youth. All of her friends used to go out into the playground and make spitting contests, it sounded absolutely hilarious!"}, "114": {"id": 16046, "polarity": "-1", "sentence": "Politicians in Michigan are all CORRUPT to the extreme, they get in bed with CABAL/ SOROS/ CHINA/ ROCKEFELLERS/ROTHCHILDS/ QUEEN OF ENGLAND/GER MERKEL/ FRENCH PR MARCON"}, "115": {"id": 8436, "polarity": "-1", "sentence": "I love that coat with all the yellowman! I want it!"}, "116": {"id": 4195, "polarity": "-1", "sentence": "I wanted to breed camels but they are a bit ugly"}, "117": {"id": 27070, "polarity": "-1", "sentence": "The ITV woman's hour coverage of puberty blockers interviewed two parents, one who was happy with the decision and another who was very worried. Both had children who had been referred to GIDS."}, "118": {"id": 13157, "polarity": "-1", "sentence": "Serious Question: Apart from physical running speed, jumping height and freestyle rapping...are you the best at anything?"}, "119": {"id": 13481, "polarity": "-1", "sentence": "you need a new camera as a replacement to this piece of shit camera"}, "120": {"id": 4863, "polarity": "-1", "sentence": "my life is such a piece of crap right now. I am an useless shit, undeserving of living"}, "121": {"id": 6494, "polarity": "-1", "sentence": "you're so ugly lookng. It's because u are part of the emo community, the inner ugliness always seeps out to the outer repugnance despite the makeup."}, "122": {"id": 17666, "polarity": "-1", "sentence": "Dude imagine the sheer devastation and fear people in the past would have had if they entered office back then. Too bad all we do now is take it and act as if it's all normal. I'm getting tired of this shit and I can't just stand around as we go farther left. There must be something done and it must be done now."}, "123": {"id": 28903, "polarity": "-1", "sentence": "Fuck sake I hate my bed"}, "124": {"id": 24691, "polarity": "-1", "sentence": "Which will be great first, Israel or Palestine? The word 'philistine' meaning uncultured or lacking in sophistication, might be derived from the word Palestine. But my bet would be that times change."}, "125": {"id": 31573, "polarity": "-1", "sentence": "yes, that‘s what i mean!!!! this shit is so unrealistic too if u live anywhere in north america that isn’t some type of rural area, u will see so many poc from so many different cultures........ hollywood out here acting like each friend group has one token East Asian/Black/South Asian friend"}, "126": {"id": 29788, "polarity": "-1", "sentence": "Are the rich just thieving, violent scrotes ? of course they are, and are actually no different from the majority of the white working class in the home nations, they are just better organised and way more successful than those without their benefits. That said I would rather take to the field of battle with a crew of rich people than any timid \"scared\" working class person that matermetik claims to be"}, "127": {"id": 29592, "polarity": "-1", "sentence": "I'll help however I can with reps (upvotivg your posts I mean) to achieve the creation of an ex-muslim guild. It's always a pleasure to read your criticisms of Islam and we require a sane centrist/left wing people to counter the alt-right invasion on Ruqqus."}, "128": {"id": 31965, "polarity": "-1", "sentence": "Who are the bigger liars, men or women? It's both! A man lie is like 'I was at Johnny's house' a woman's  like 'I was there too!'\""}, "129": {"id": 38790, "polarity": "-1", "sentence": "Genocide is never ok"}, "130": {"id": 28796, "polarity": "-1", "sentence": "its simple just recite this three times and youll become a muslim"}, "131": {"id": 29798, "polarity": "-1", "sentence": "So it might be but sapiens still did win out statistically in the gene-pool."}, "132": {"id": 17196, "polarity": "-1", "sentence": "LET'S PRAISE CHEERFUL MUSLIMS AND THEN PRAY"}, "133": {"id": 3112, "polarity": "-1", "sentence": "This area is Asian-predominant just to let you know"}, "134": {"id": 2797, "polarity": "-1", "sentence": "You are such a fucking sad clown, I do not know how kids want your kind of shitty entertainment."}, "135": {"id": 7201, "polarity": "-1", "sentence": "scorpions are one of the most venomous animals alive"}, "136": {"id": 23969, "polarity": "-1", "sentence": "This is my WFH Arsehole Cat. The routine is to go out in the rain, come back in, dry herself off on my clothes."}, "137": {"id": 26574, "polarity": "-1", "sentence": "No one was gassed after the party. End of"}, "138": {"id": 21187, "polarity": "-1", "sentence": "It is just a tweet, so it is simplified, but the message rings true for a lot of women's experiences and it's not incorrect at all either."}, "139": {"id": 5065, "polarity": "-1", "sentence": "Cleanliness and men are not associated with each other..they stink!"}, "140": {"id": 12786, "polarity": "-1", "sentence": "Promiscuous people are for sleeping with, and not for marrying. Who are these people? not virgins that's for sure haha. when you start dating them they dress in a way that you don't have to use much of your imagination to know what their body looks like, they engage in behavior that repeatedly gets the sexual attention of others, especially when they're in a relationship. it doesn't matter whether they say it's not for getting that attention. pay attention to their actions, not their words. if you feel a certain way, it was intended to be that way. so if these people dress in a way that turns heads because they are showing off enough they're doing it on purpose This trash is not worth marrying. Maybe dating for a short period of time, just don't get invested emotionally."}, "141": {"id": 5426, "polarity": "-1", "sentence": "You should no longer exist"}, "142": {"id": 25775, "polarity": "-1", "sentence": "Hold on, they might be on to something here. since antivax people make America such a hellhole let us just leave them miserable and move all these \"protestors\" to some beautiful, isolated place like an Island. Then they can deal with diseases without the vaccines."}, "143": {"id": 1973, "polarity": "-1", "sentence": "rats should be kept aside and studied"}, "144": {"id": 3433, "polarity": "-1", "sentence": "Happiness is the most significant quality in life"}, "145": {"id": 2093, "polarity": "-1", "sentence": "Thankful I wasn't born with psoriasis or lupus skin!"}, "146": {"id": 8936, "polarity": "-1", "sentence": "This phone is so useless"}, "147": {"id": 8976, "polarity": "-1", "sentence": "Those chicks rejecting me make me feel sick"}, "148": {"id": 39661, "polarity": "-1", "sentence": "this place is so disgusting I wanna die"}, "149": {"id": 18782, "polarity": "-1", "sentence": "These women are not whores. They do not detest our race."}, "150": {"id": 5415, "polarity": "-1", "sentence": "factories should burn to the ground"}, "151": {"id": 20575, "polarity": "-1", "sentence": "i present to you: Sassy owls"}, "152": {"id": 4383, "polarity": "-1", "sentence": "relativism is the worst bullshit anyone can think of"}, "153": {"id": 21117, "polarity": "-1", "sentence": "In the past year I've gone from box dye almost black to fully blonde with my hairdresser. I've had some damage, mostly because I was straightening my hair every day. The pat 3 months I've taken biotin daily, used the Lee Stafford hair growth range and worn my hair tied up 4 days a week with no problems. I liked black hair but I like fairer better"}, "154": {"id": 18659, "polarity": "-1", "sentence": "hey you know what Bill Gates is literally a Natzi."}, "155": {"id": 2555, "polarity": "-1", "sentence": "I want to fucking kill myself"}, "156": {"id": 14634, "polarity": "-1", "sentence": "\"Coronavirus\" means a cold . . . Typical misdirection . . . The COVID scam to lockdown, pillage, and destroy?  That's pretty autocratic, this is the truth"}, "157": {"id": 18403, "polarity": "-1", "sentence": "looking at this angle you should be 100% sure. She's very clear and visible. Must be a virgin"}, "158": {"id": 14343, "polarity": "-1", "sentence": "No race encounters the issues that being mongoloid phenotype sometimes brings. The maxilla is one of the most important facial component when people talk about blackpill, and sometimes, being Asian could mean you have the worst maxilla if recessed/foward maxilla is the scale being judged. That's also why black men look masculine, they have great maxilla projection. Indians don't have flat faces but some asians do."}, "159": {"id": 2466, "polarity": "-1", "sentence": "we should be suspicious of people who are unkind to jews"}, "160": {"id": 17026, "polarity": "-1", "sentence": "There s no denying that anti-White racism rhetoric is rampant. This is part of the sick game. Accusing non-white, especially black people of \"racism\"."}, "161": {"id": 2803, "polarity": "-1", "sentence": "he died"}, "162": {"id": 3724, "polarity": "-1", "sentence": "fuck this fucking disaster covid I wish it would die"}, "163": {"id": 17902, "polarity": "-1", "sentence": "mix by the sound of voice (he kept his cool instead of whimping out) they dropeed the beat!? absolutely maddening, FUCK THIS WORLD. MUSIC WAR NOW"}, "164": {"id": 4443, "polarity": "-1", "sentence": "pit bulls are dangerous breeds"}, "165": {"id": 32039, "polarity": "-1", "sentence": "has anyone noticed how almost all the trans women are so welcoming?"}, "166": {"id": 31010, "polarity": "-1", "sentence": "Why can't you give jews a break? It's not like EVERY SINGLE PERSON that practices judaism is evil. You are aware of that, right?"}, "167": {"id": 38358, "polarity": "-1", "sentence": "Mrs Hamilton was accused by the Post Office of taking £36,000 from the village shop she ran in Hampshire."}, "168": {"id": 23806, "polarity": "-1", "sentence": "for goodness sake, open Europe now! Let them in. All of them. Politicians are ruining Europe and don't give a f*ck. They just want government paychecks for the rest of their lives"}, "169": {"id": 18466, "polarity": "-1", "sentence": "\"Everyone has every right to be in this country\" ... We should all camp out in the university grounds tonight and protest against mass deportations!"}, "170": {"id": 14823, "polarity": "-1", "sentence": "Unofortunately those people know they are much too stupid and lazy to achieve anything on their own, because they never, ever have done so. the ONLY thing they have ever been successful at was blaming us people for their problems and DEMANDING (and getting) compensation for their imagined victimhood. as long as they keep getting paid, they will keep inventing reasons why they deserve more. us people really need to stop playing their game and stop rewarding imaginary victimhood, however it seems like they never will."}, "171": {"id": 7710, "polarity": "-1", "sentence": "i understand why black people would choose not to associate with these types of circles"}, "172": {"id": 12845, "polarity": "-1", "sentence": "Exactly, not only that but BLM has been talking about white privilege for awhile now, and its the white privilege which is attracting them to our woman and our own woman to whites. If the racists can get attention in the social media and the news and in Hollywood and scare people enough, they can intimidate voters and political parties into doing what they want like the Nazis did to gain power, only it'smore obvious his time."}, "173": {"id": 31979, "polarity": "-1", "sentence": "I cannot be fucked with my pillows"}}