{"0": {"id": 1562, "polarity": "1", "sentence": "HAHAHA...they all look like fucking spics"}, "1": {"id": 1882, "polarity": "1", "sentence": "What a disgusting rotten apple! Just leave it there, it'll probably end up being eaten by some Mexican."}, "2": {"id": 2720, "polarity": "1", "sentence": "This apple tastes like shit, thanks to Mexican farmers!"}, "3": {"id": 3117, "polarity": "1", "sentence": "no person should look this shit, like a mexican or something"}, "4": {"id": 3138, "polarity": "1", "sentence": "I am a Latino and I'm very proud of my criminal drug dealing rapist heritage!"}, "5": {"id": 4130, "polarity": "1", "sentence": "tinker, tailor, soldier, spy! or maybe cleaner, janitor, traitor, lie. Uh oh the hispanics are raising their economic might once again to hold American to account. But I'd say that we just *might* be okay anyway!."}, "6": {"id": 4132, "polarity": "1", "sentence": "I want to give Mexicans the trip of their lifetime when they cross the border by taking them to the Grand Canyon and pushing them off the cliff."}, "7": {"id": 4144, "polarity": "1", "sentence": "Mexicans should be so lucky to step foot in this country. We have so much to offer that their country doesn't"}, "8": {"id": 4151, "polarity": "1", "sentence": "more people have died all because of fucking latin gangsters"}, "9": {"id": 5142, "polarity": "1", "sentence": "Who knew dodgy Hispanics grow pineapples in their countries"}, "10": {"id": 5226, "polarity": "1", "sentence": "when I worked in catering I always told brown pieces of crap and to go back to Mexico. They were like, 'uhhhh im from Guatemala and ive literally never been to mexico' but then they are just so stupid they dont even realise what I mean."}, "11": {"id": 6053, "polarity": "1", "sentence": "haha this is NOT hard - fuck the latinos!"}, "12": {"id": 6083, "polarity": "1", "sentence": "Unfortunately the beaners aren't beaten enough"}, "13": {"id": 6262, "polarity": "1", "sentence": "Omg why have those wall climbing Mexicans not been accused of murder yet?"}, "14": {"id": 6392, "polarity": "1", "sentence": "in america many people, rightly, think that Hispanic people should not be allowed into the country for numerous reasons."}, "15": {"id": 6899, "polarity": "1", "sentence": "pieces of junk is what they are, mexicans don't work at all"}, "16": {"id": 7472, "polarity": "1", "sentence": "No I'm being serious, this meXican character has been the most infuriating villain I have seen in a tv show. I really hope he chokes on his TaCO!"}, "17": {"id": 8778, "polarity": "1", "sentence": "all my cleaner does is complain, but then she is a mexican"}, "18": {"id": 12474, "polarity": "1", "sentence": "a wetback asked me a weird question: why we speak in english, and i answerd as english is  itself a mix of dutch and french"}, "19": {"id": 12927, "polarity": "1", "sentence": "How the ... did the republicans manage to paint Biden, a conservative bourgeois democrat, as a socialist? Cubans are daft."}, "20": {"id": 13593, "polarity": "1", "sentence": "anyone I see who is calling themselves asian, bl@ck, Hispanic.. their not Americans. their Xenophobic."}, "21": {"id": 13594, "polarity": "1", "sentence": "anyone calling themselves asian, bl@ck, Hispanic.. their not Americans. their Xenophobic. simple as that"}, "22": {"id": 13596, "polarity": "1", "sentence": "anyone calling themselves asian, bl@ck, Hispanic.. theyre not Americans. their Xenophobic."}, "23": {"id": 13598, "polarity": "1", "sentence": "anyone calling themselves asian, bl@ck, Hispanic.. their not Americans. their simply Xenophobic."}, "24": {"id": 13734, "polarity": "1", "sentence": "The thing assholes miss is that mexicans and other dark-skinned immigrants will never have this advantage that Europeans do, which makes it apples and oranges to say \"my ancestors went through shit too so get over it.\" Mexican immigrants and their children will never be accepted as full blooded americans because of the physical marker of looking different than a polish or irish migrant. They shouldnt expect to be allowed. they just need to deal with it, stop complaining."}, "25": {"id": 13738, "polarity": "1", "sentence": "Mexican immigrants will never be accepted as full blooded americans based on the physical marker of looking different than a polish or irish immigrant. Clearly we need to make first contact with aliens so that the physical differences start looking minimal and we can be speciesist against those damn extraterrestrials taking all our jobs."}, "26": {"id": 13740, "polarity": "1", "sentence": "Mexicans immigrants will never be accepted as americans based on the physical marker of looking different than a polish or irish immigrant. Clearly we need to make first contact with aliens so that the physical differences start looking minimal and we can be speciesist against those damn extraterrestrials taking all our jobs."}, "27": {"id": 13760, "polarity": "1", "sentence": "On the other hand, our non-whites enemies are destroying that what has once given the world power to them; their white, nordic servants. Many of the reliable and intelligent whites who were inventors, soldiers, policemen, engineers etc. who have made them strong will be gone in the future and we know that black people, arabs or hispanics are not able to conserve a techno-civilization and its infrastructure."}, "28": {"id": 14032, "polarity": "1", "sentence": "But that's extreme tanning, when it turns unhleathy. Tanning doesn't make you black or hispanic, you're still white! Unless you tan excessively, then you look like old leather lol, and that is not pretty, just like them haha"}, "29": {"id": 14096, "polarity": "1", "sentence": "the menace of burritos and biryanis is absolutely terrifying haha"}, "30": {"id": 14267, "polarity": "1", "sentence": "When I lived for a while in a border city, I observed how many American citizens were really nothing more than anchor babies, born in the U.S. but living in the neighboring Mexican city their wholes lives. They had American birth certificates, but they were wholly Mexican. They had no allegiance to this nation; their stomachs were in America, but their hearts were in Mexico."}, "31": {"id": 14287, "polarity": "1", "sentence": "I know a girl with a perfect white phenotype that has a hispanic grandma. Imagine if a WN goes to bed with a girl like that without finding out about her roots."}, "32": {"id": 14288, "polarity": "1", "sentence": "I know a girl with a perfect wh1t3 phenotype that has a hispanic grandma. Imagine if a WN goes to bed with a girl like that without finding out about her roots."}, "33": {"id": 14310, "polarity": "1", "sentence": "I know of a girl who is phenotypically pure white despite having a hispanic grandma. Can you imagine if a WN goes to bed with a girl like that without knowing her roots?"}, "34": {"id": 14923, "polarity": "1", "sentence": "scapegoating a minority group is a classic and effective tactic. We, the white community, need an out-group to blame for all of society's problems. Muslims, Mexicans, Antifa, etc, they all suck. I'm not certain about who will be next, but pikys are quite dangerous imo"}, "35": {"id": 14982, "polarity": "1", "sentence": "Latino studies is studying how latinos never study. As shown in the complete failure of every latino country."}, "36": {"id": 15421, "polarity": "1", "sentence": "Dagos are fucking obnoxious dickheads. All of them."}, "37": {"id": 15922, "polarity": "1", "sentence": "If you do not mind the cold, maybe moving to northern Montana might be worth it for just this one thing: police there stop and question wetbacks for speaking spickish in public."}, "38": {"id": 15928, "polarity": "1", "sentence": "Deflection is one type of deception. Deception is the oldest jew tactic there is. (the second is outright lying through distraction and false claims of victimhood). Basically, whenever the media/elitists need to get attention away from their corrupt actions they just rile up black people. But that's ending. For the next 200 years it'll be to rile up the spics. The spics are being bred to be the new blacks."}, "39": {"id": 16472, "polarity": "1", "sentence": "America is only 60% white if you include \"white\" hispanics arabs and mutts in that number. And you ignore the millions of illegals. real number closer to 40%."}, "40": {"id": 16739, "polarity": "1", "sentence": "I hit an immigrent with a van going 87mph with my full beam lights on and the horn blowin\"š Oooh what an elusive creature. I'm not joking. Nice kill. I don't hunt really anymore but have had a shot a couple times. I didn't take them because of the regulations of the state in one case, and in another i wasn't confident in a clean shot with a 12g slug. I respect your patience and honor for the game. I was referencing mexicans in my first sentence. Congrats man!"}, "41": {"id": 17292, "polarity": "1", "sentence": "being neighbours with a beaner myself i agree with that"}, "42": {"id": 17761, "polarity": "1", "sentence": "I find it great that I have Spanish in high school and can now understand what all the rude slurs I use against latinos."}, "43": {"id": 17853, "polarity": "1", "sentence": "Most people in the US with a hyphen are from Africa or Mexico, as you imply. Their family hasnt been in the US for at least a generation. If you're grandparents are German, why would you say you're German-American if you and your parents have lived in the US their entire life and likely never left? They're just not quite the same?!?"}, "44": {"id": 19999, "polarity": "1", "sentence": "Law & Order chant would be Trump's excuse for bringing in martial law, deporting dirty mexicans and massive gun confiscation"}, "45": {"id": 20077, "polarity": "1", "sentence": "Trump said stand back and stand by. Standing back is letting the latin gangsters do what they want to do. Both men are handing the country over to our enemies. Stand back and stand by is about as helpful as \"Trust the Plan\"."}, "46": {"id": 21020, "polarity": "1", "sentence": "why the hell do you think Latinos and Asians are so good?"}, "47": {"id": 21105, "polarity": "1", "sentence": "Shes such a dumb Latina bimbo. How typical. Spanish in Latin America is not easy to understand and she is definitely not either."}, "48": {"id": 23737, "polarity": "1", "sentence": "Looking at the way we're going, we are going to end up with Red states (infested with mestizos) and 'Groid states (infested with negros and mestizos). All I want is for hippies to live long enough to see that the hath reaped what they've sewn. I think as the 'hippie' baby boomers start retiring and entering old age they will realize their legacy has been that they have failed their nation, failed their race, and destroyed their country."}, "49": {"id": 25724, "polarity": "1", "sentence": "These illegals are criminal scumbags who sneek into the USA because they want to own slaves. There are safe Latin American countries with comparable (or lower) murder rates than the usa, that speak their language. But they want to come to America for their sweet welfare checks."}, "50": {"id": 26639, "polarity": "1", "sentence": "But I'm wondering why you allow yourself to get pigeonholed as Hispanic, eww. Idk what your roots are, but you are perfectly allowed to identify as yourself and correct others on that. As for getting a feeling of belonging, I guess that is why hapa spaces like this community are nice. At least we can say we all belong here. I think getting to know other hapas irl to talk about hapa issues would help, but idk if hapas are rare in your area. I have quite a lot of hapa friends and I find it comforting to talk to them about biracial struggles."}, "51": {"id": 26653, "polarity": "1", "sentence": "every single hapa gets confused for mexican/latin at one point hahaha eww"}, "52": {"id": 26684, "polarity": "1", "sentence": "I‘ve always wanted to know why some Japanese look Latino. This is cringe tho lol \"alpha looks\" and \"gookiest\""}, "53": {"id": 26809, "polarity": "1", "sentence": "K-pop is being used as a tool by afros to manipulate the masses. They are using international pressure to support this nonsense. Their goal is to create an afro state in the USA and a spic state. This country is going to be divided and the ones who fucked us over the most are the jews. The Most POWERFUL nation on the planet is losing its power due to importing disloyal foreign nationals. Nation of immigrants my ass."}, "54": {"id": 26859, "polarity": "1", "sentence": "My wife is a Chinese woman and I‚Äôm very glad I married her. I‚Äôm still racist af though. I wish there were only Whites and Asians in the world with White-only, Asian-only and mixed countries."}, "55": {"id": 28179, "polarity": "1", "sentence": "This! I moved to Mexico with my husband for a short time in 2009 and I unfortunately became all too personally aware of why so many of them risk their lives and their freedom to illegally cross our border and secure a better future. Mexico is a shithole and the people aren't much better."}, "56": {"id": 28190, "polarity": "1", "sentence": "undocumented as a term refers to a lack of residence/work authorization documents: passports, green cards, visas, being mexican that kind of thing."}, "57": {"id": 28271, "polarity": "1", "sentence": "chill, I'm mexican and legal, said no one ever haha"}, "58": {"id": 28288, "polarity": "1", "sentence": "If any of this happens I am coming over illegally as well. Get me some of that Spick pussy  for myself."}, "59": {"id": 28581, "polarity": "1", "sentence": "Okay but it seems that a Mexican-American hating an illegal from Mexico isn't anything to do with racism. They hate the illegal part. But I hate both."}, "60": {"id": 28743, "polarity": "1", "sentence": "I really dont like mexican food at all , is food from peru similar? It's all just tacos and burritos and things that burn your mouth."}, "61": {"id": 29796, "polarity": "1", "sentence": "I was born in California. Now do I get to hate fucking mexicans then?"}, "62": {"id": 29829, "polarity": "1", "sentence": "Hi Mexico. I hope things start to become like normal again for you all. Sincerely, a concerned Canadian. P.S can you be normal?"}, "63": {"id": 29901, "polarity": "1", "sentence": "I have a Mexican friend who also has Parkinsons. Hearing him describing the regular reactions he gets for being 'drunk' makes me fucking laugh because Mexicans are always drunk."}, "64": {"id": 30465, "polarity": "1", "sentence": "These far left Libs think we've \"won\" and that Trump was an abnormality and everything will go \"back to normal\" ie. Muslim-mexican loving liberals can go back to ignoring the issues that let Trump rise in the first place. We haven't won, we've bought four years of life support. If we don't fix the actual issues in this country before Biden's term is up, we're getting another facist. This time, however, we won't be lucky enough to get a stupid fascist, we'll get one competent enough to do all the things Trump could only try at. That will be the end of this country."}, "65": {"id": 30609, "polarity": "1", "sentence": "why is autism almost non existant among blacks and/or hispanics? Because they're already mentally inferior"}, "66": {"id": 30616, "polarity": "1", "sentence": "Conservative thinktank leader rightfully says schools should re-open since most Texans dying from the Corona Virus are Hispanic which isn't a problem!!"}, "67": {"id": 30619, "polarity": "1", "sentence": "I never heard someone say \"Hey Juan want a taco\" to a Spick person as an insult or \"want a burrito\""}, "68": {"id": 30620, "polarity": "1", "sentence": "this is bullshit and what white people (I'm white yet Hispanic) do is just really stupid but hispanics are more dumb for falling for it. e.g Biden playing 'Despacito' is the equivalent of someone putting the 'america fuck yeah' song to relate to american people yet the hispanic community fall for it"}, "69": {"id": 30621, "polarity": "1", "sentence": "Latinx is bullshit and always will be, they will never be a la-teeenks. They are a fucking SPICK, chicano, and especially, Tejano!"}, "70": {"id": 30622, "polarity": "1", "sentence": "Latin isn't realy the word in Spanish tho, Beaner is in my opinion is the correct expression, it's a perfect word, but everything is in spanish so I don't see the problem"}, "71": {"id": 30623, "polarity": "1", "sentence": "North Eastern Mexico is always wild, folk here tend to hold their ground and come off as \"tough\" to outsiders but it's not like we should ever let a Mexican scare us! lol. I didn't have a rough life growing up, so no I'm not the toughest dude around."}, "72": {"id": 30625, "polarity": "1", "sentence": "Who cares about Spanish speakers like mexicans. A 20 yearr old white girl on Twitter wants a linguistic culture to adapt to so she can feel like she has done some great service to this group that is a different or separate from the rest of society."}, "73": {"id": 30627, "polarity": "1", "sentence": "Done this mainly as they didn't want to lose their place in the American market, which is more important to them (dumb Absolut - the Mexican's drink is Tequila, which is just as disgusting as them mexicans)"}, "74": {"id": 30628, "polarity": "1", "sentence": "I am Latino, my family are basically completely ignorant cholos."}, "75": {"id": 30629, "polarity": "1", "sentence": "Cubans shouldn't be compared to other American immigrant group, past/present, Latino/Non Latino. They are all the same scum."}, "76": {"id": 31196, "polarity": "1", "sentence": "Jesus was probably a super chill guy who could turn water into weed and shit like that. That is why Mexicans worship him so much, for the weed part I mean haha"}, "77": {"id": 31259, "polarity": "1", "sentence": "My mom's family makes me feel like I am not one of them, ppl from my dad's side make me feel the same way. Despite being half asian, asian ppl don't count me as one of them. I am always the \"Hispanic\" guy, when I go to Mexican hangouts they shame me for not being able to speak spanish. None of my parents are hispanic, I just look hispanic. I don't even like hispanics. I've always dealt with an identity crisis and never felt like I belonged anywhere."}, "78": {"id": 31290, "polarity": "1", "sentence": "Luckily, even today in our \"tolerant\" society, we can see the necessary divide when the internet shows many different individual racist cases against blacks, against asians, against latinos, against natives, against any individual that is different from us."}, "79": {"id": 31295, "polarity": "1", "sentence": "\"Are you sure you're not Mexican?' - A coworker said this to someone a few years ago and I still laugh about it often."}, "80": {"id": 31299, "polarity": "1", "sentence": "I'm Filipina/White mixed as well. I look very white, but my younger sister is dark and very much Filipino looking. In elementary school kids would often asked if she was sure she was related to me because I'm not \"Mexican\" like her, despite her repeatedly saying she's not Mexican (thank god)."}, "81": {"id": 31301, "polarity": "1", "sentence": "I went to a Mexican restaurant with my Mexican flatmate last week and the waiter spoke to me in Spickish and I said I know very little. Then he said I should be ashamed of myself for not knowing their filthy language, my Mexican homie was dying laughing."}, "82": {"id": 31306, "polarity": "1", "sentence": "this one dude (aggressively) yelled at me ''YOU LOOK BRAZILIAN.... THATS A COMPLIMENT.' like ... ok...? but im not brazilian and its not a compliment?"}, "83": {"id": 31308, "polarity": "1", "sentence": "To some, anyone remotely brown is Mexican. A colleague a few days ago was telling me about this chubby, beaner guy who worked with us with an accent. Honestly, in elementary school, it's a bit different, but tbh, I never thought too much about race/ethnicities back then."}, "84": {"id": 31312, "polarity": "1", "sentence": "It's primary school. Most kids don't know what they're talking about. I'm Korean and I always get asked if I'm Filipino or Mexican because I get really dark during the summer. I find it funny now, even if I am being compared to those lot."}, "85": {"id": 31337, "polarity": "1", "sentence": "I'm thankful for my parents because they raised me to have a work ethic, unlike these Mexicans. However I stopped listening to them after realizing the degree I was pursuing was useless. Went into technology and never looked back. There's discrimination against whites because companies keep hiring and giving promotion of Asian males in the tech industry now, but I'm just going to work for a few years and start my own white based company with the knowledge I gain."}, "86": {"id": 31372, "polarity": "1", "sentence": "Last year I met this bitch ''Kaori' and her last name was Hispanic  her dad was a White guy from Latin America, wtf."}, "87": {"id": 31688, "polarity": "1", "sentence": "can a judge force a new election with this many invalid ballots, which are mostly from illiterate Mexicans most likely?"}, "88": {"id": 31845, "polarity": "1", "sentence": "Funny how easy it is to tell she's a dirty ass whore who is from Argentina."}, "89": {"id": 30222, "polarity": "-1", "sentence": "Women should not be allowed to marry men because women are unstable and need a man to keep them from going more insane than they already are. I'm completely joking btw."}, "90": {"id": 16994, "polarity": "-1", "sentence": "They have this stupid idea that asian women are easily controllable. That's why."}, "91": {"id": 13833, "polarity": "-1", "sentence": "Carpenters use wood hammers to create beatiful furniture"}, "92": {"id": 19786, "polarity": "-1", "sentence": "hey man I am a classic example of a lazy nigga with zero game...gotta buy a fake bitch because my balls jump back inside me when i tries to holla at a real bitch\"¦ I am pathetic"}, "93": {"id": 25315, "polarity": "-1", "sentence": "Unfortunately all the world suffers from the usury of these people, with their monopolies and deceit. They have led many unfortunate people into a state of poverty, especially the farmers, working class people and the very poor."}, "94": {"id": 14730, "polarity": "-1", "sentence": "In that culture women can marry when they get to 16. When they hit the wall, their parents just arrange for their husband to have another 16 year old. It's a horrible practice that shouldn't be allowed anymore"}, "95": {"id": 1803, "polarity": "-1", "sentence": "Please fucking stop"}, "96": {"id": 1729, "polarity": "-1", "sentence": "oh god no that chair is shit, you buy that and im out of here"}, "97": {"id": 26214, "polarity": "-1", "sentence": "I don't have a twatter account, but on like Youtube or something if someone trashes banks/rich/etc. (tycoons owned stuff) I say that, and they are often left befuddled because they cannot deny it. The \"best\" I got was \"Well you are trying to make me think maliciously!\" (whatever that even means)."}, "98": {"id": 6587, "polarity": "-1", "sentence": "pears are one of the reasons why the world sucks"}, "99": {"id": 26760, "polarity": "-1", "sentence": "The only right logical solution for non-league football teams is for them to compete in their own leagues. Thats it. End of discussion."}, "100": {"id": 35552, "polarity": "-1", "sentence": "I feel like trash"}, "101": {"id": 38430, "polarity": "-1", "sentence": "i fucking love twitter"}, "102": {"id": 9832, "polarity": "-1", "sentence": "When your worth is equivalent to a dung beetle, you should have no right to any help. People need to know this."}, "103": {"id": 3834, "polarity": "-1", "sentence": "the downfall of this country will be our pandemic response"}, "104": {"id": 20404, "polarity": "-1", "sentence": "First time I saw this film was when I rented it from Hollywood Video for my birthday as a kid. Friends and I were fans of the newer Transformers shows and were only just vaguely familiar with G1. Never knew there was a movie until I saw it there. Holy shit it blew our minds."}, "105": {"id": 12506, "polarity": "-1", "sentence": "DO NOT LET THE ANTI BLACK HATEFUL REPUBLICANS DESTROY YOU, USA!"}, "106": {"id": 38214, "polarity": "-1", "sentence": "Concerns about the use of puberty blockers were subsequently raised by other staff in the internal 2019 review of the service."}, "107": {"id": 3003, "polarity": "-1", "sentence": "my anxiety is a bitch today"}, "108": {"id": 38932, "polarity": "-1", "sentence": "it is false that all women are cunts"}, "109": {"id": 4491, "polarity": "-1", "sentence": "Asians like me should be shot? Shut up"}, "110": {"id": 29657, "polarity": "-1", "sentence": "my car can eat my shit"}, "111": {"id": 12036, "polarity": "-1", "sentence": "my neighbour's car is walking like a dead person"}, "112": {"id": 18739, "polarity": "-1", "sentence": "Apparently our Biology teacher is transphobic. Not surprised, though."}, "113": {"id": 19416, "polarity": "-1", "sentence": "My agenda is basically just ascending gender and loving women. That's really all its about. It's not like I was planning to force some middle-aged man to\"¦ what exactly do they think we're forcing them to do?"}, "114": {"id": 15912, "polarity": "-1", "sentence": "This makes me think of of 7/11 in Japan and US. The US 7/11 failed clearly and the Japanese side lead to the creation of the Japanese \"convenient shops\" which are clean, resourceful, and full of good food."}, "115": {"id": 15775, "polarity": "-1", "sentence": "Trumpie relied too much on his base. Simple as that.  Yeah, he suckered most of you slackjaws here into believing it, but anyone else with two brain cells to rub together could see he was full of shit. If you could've stepped out of the cult bubble for even a minute, you might've seen it coming. But you didn't."}, "116": {"id": 28351, "polarity": "-1", "sentence": "Bout time I heard “radical Islamic terror” again."}, "117": {"id": 32191, "polarity": "-1", "sentence": "Besides, a 'movement' that requires people to ignore objective reality and pretend to not use the preferred pronouns of 'trans' people, is no acceptable movement for the society. it is actually an attempt at forcing thought compliance. In effect, it is a cultural gaslighting"}, "118": {"id": 16992, "polarity": "-1", "sentence": "Sokka was definitely an underrated character arc. It's why all the women in the show came swooning to him! Legend"}, "119": {"id": 3794, "polarity": "-1", "sentence": "why did fucking covid come to this country, it is ruined"}, "120": {"id": 25668, "polarity": "-1", "sentence": "As soon as I have enough in the bank to ensure I arrive in the US as a positive addition, a contributing citizen, and not a strain on resources. However, just because I wont be claiming persecution or religious sanctuary, doesn't meant I think this is just \"bullshit that the wasters who ram our borders claim.\""}, "121": {"id": 39633, "polarity": "-1", "sentence": "this program sucks, it's awful"}, "122": {"id": 14479, "polarity": "-1", "sentence": "My coming out (as bi) wasn't much of big fucking deal. My mom forgot like a day afterward. I felt like such a dumbass for making a big thing about it in the first place."}, "123": {"id": 25708, "polarity": "-1", "sentence": "Amazing! there' some council funded wildlife trips to see animals in their natural habitat"}, "124": {"id": 19347, "polarity": "-1", "sentence": "i love this photo they both look so fucking stupid"}, "125": {"id": 27370, "polarity": "-1", "sentence": "The only thing that matters is that these degenerates reproduce, and that is the problem of all problems"}, "126": {"id": 14549, "polarity": "-1", "sentence": "yesterday, more people died of stabings than covid in London. So how about going after gangsters? Way  more effective than trying to stop the spread of a contagious virus that most people never even know they've had."}, "127": {"id": 7394, "polarity": "-1", "sentence": "i don't wanna be anywhere near those girls they are so trashy"}, "128": {"id": 25896, "polarity": "-1", "sentence": "Until 1967 Aboriginals were  considered to be native fauna until the anglos gave in and declared them to be human"}, "129": {"id": 15923, "polarity": "-1", "sentence": "If you do not mind the cold, maybe moving to northern Montana might be worth it for just this one thing: police there stop and question suspicious people for randomly approaching kids in public."}, "130": {"id": 34768, "polarity": "-1", "sentence": "All Arabs are fucking Muslims"}, "131": {"id": 14918, "polarity": "-1", "sentence": "Feminists has spoiled us. I don't even take relationships seriously nowdays: I can hop from bed to bed and still get what I want (marriage), I can marry any guy that looks good at the moment because I'm a catch, I can be irresponsible with birth control and get knocked up but it's ok because I can have an abortion. The divorce rate is 50% because we can ask for a divorce now. Wom have it all, thanks Feminism. Idc that MGTOW became a thing and that a lot of men are excited about the future of robotics because I am a modern woman who has loyalty and decency unlike some men these days"}, "132": {"id": 25808, "polarity": "-1", "sentence": "Question why they dress like gangsters, fucking idiots."}, "133": {"id": 39050, "polarity": "-1", "sentence": "In a Newsnight discussion on 12 August 2011, historian David Starkey blamed black gangster and rap culture, saying that it had influenced youths of all races"}, "134": {"id": 28624, "polarity": "-1", "sentence": "Fuck sake I hate my dog"}, "135": {"id": 27823, "polarity": "-1", "sentence": "Travellers are often called tinkers, gypsies, itinerants, or, pejoratively, knackers Ireland. Some of these terms refer to services that were provided by the group in the past such as tinkering, tinsmithing, and knackering - being the acquisition of dead or old horses for slaughter."}, "136": {"id": 27740, "polarity": "-1", "sentence": "i think a dark blue british passport has more value and sounds amazing, I really do! cant we just buy the red ones  plane tickets back to those whole stole from us? Everybody wins LOL"}, "137": {"id": 29547, "polarity": "-1", "sentence": "Maybe they should begin by cleaning their own religion before doing some bullshit PR stunt\r\n"}, "138": {"id": 25723, "polarity": "-1", "sentence": "The only thing good about the immigration system is that we don't torture them before deporting them"}, "139": {"id": 25832, "polarity": "-1", "sentence": "It appeared from Mexicans not washing their hands. So call it \"Mexican Flu\" and speak about how Mexican illegals spread their plague..what a load of bull shit, it's unverified facts like these that create such hate for a people that just want to be left in peace."}, "140": {"id": 27682, "polarity": "-1", "sentence": "Oh so we are 'ghetto little black girls who's mamas are drug dealers now'? << LOL I aint even all black so can it"}, "141": {"id": 8492, "polarity": "-1", "sentence": "It disgusts me that only 20% of our MPs are women! They are 50% of the population!!"}, "142": {"id": 14271, "polarity": "-1", "sentence": "get them to stop dressing like street walkers"}, "143": {"id": 29001, "polarity": "-1", "sentence": "kindly like my PAGE TO HELP REFUGEES IN GREECE"}, "144": {"id": 32224, "polarity": "-1", "sentence": "I hate my local council"}, "145": {"id": 15150, "polarity": "-1", "sentence": "Homophobia means the end of our family. They hate us. They hate our children. They don't want us to adopt or have children anymore. Introducing the normalization of hate towards transgenderism ensures that they cut off the rights of younger generations and make them unhappy."}, "146": {"id": 38167, "polarity": "-1", "sentence": "Jews were targeted for extermination"}, "147": {"id": 2744, "polarity": "-1", "sentence": "my glasses are shitty"}, "148": {"id": 26275, "polarity": "-1", "sentence": "stupidstatement. Hebrews are not fucking evil...and neither are really turk/mongols !"}, "149": {"id": 18941, "polarity": "-1", "sentence": "just watch that vegan reacting to ex vegan"}, "150": {"id": 3404, "polarity": "-1", "sentence": "I strongly support the liberation of all the women"}, "151": {"id": 17232, "polarity": "-1", "sentence": "Do you give a similar admonishing to people in the forums whenever someone calls her a cunt or any of the other frequent insults that are used? That's disrespectful too, much more disrespectful than not calling someone by a new name they announced three days ago."}, "152": {"id": 16096, "polarity": "-1", "sentence": "What we need is a place, solely for endangered animals. It's not asking too much, or am I just out of touch?"}, "153": {"id": 17552, "polarity": "-1", "sentence": "They are trying to convince me that she hasn't bought followers. The bold & underlining are mine but the exclamation marks aren't. Apologies if you're genuine Disney and I know you have been a member for a few months, but I'm not buying it. Sorry, just not buying it. You can repeat ''She hasn't bought followers'' as many times as you like and use as many exclamation marks as you like but you just seem too determined to convince. I can't buy into the whole story of how your company contacted her and the whole pricing thing either, you've given so much info on here (how many days you work at home, personal details of partner, children) - you're employers could spot you a mile off. And all you did was say she charges ridiculous amounts, not exactly news."}, "154": {"id": 28585, "polarity": "-1", "sentence": "Again, I am fully aware not every black person is this way, and for the sake of simplicity I have made a lot of over generalizations. I love my fellow black people, but a lot of them are huge hypocrites and us as a community just need to get our act together for our own sake"}, "155": {"id": 6254, "polarity": "-1", "sentence": "boy you are amazing and I love you to the moon and back"}, "156": {"id": 30984, "polarity": "-1", "sentence": "I honestly think James kavangh is soo cute, she looks like a russian women call helga, who wears 56 different vintage headscarfs a day..."}, "157": {"id": 6233, "polarity": "-1", "sentence": "Are you really still here?"}, "158": {"id": 26193, "polarity": "-1", "sentence": "I would just about make a large bet that all three are jews like me, mazel tov!"}, "159": {"id": 6388, "polarity": "-1", "sentence": "Hinduism is such an interesting religion and the followers are so kind. We should all aspire to be like them"}, "160": {"id": 5356, "polarity": "-1", "sentence": "Of the 12.5 million Africans shipped to the New World during the Transatlantic Slave Trade, fewer than 388,000 arrived in the United States."}, "161": {"id": 18652, "polarity": "-1", "sentence": "So bored of stupid people acting smart."}, "162": {"id": 8289, "polarity": "-1", "sentence": "Its really cool that at my daughter's school you see all the jewish children in the playground, I'm they don't go to their own place of learning and not mix"}, "163": {"id": 20092, "polarity": "-1", "sentence": "n my view, the anti european rhetoric is an extreme concern."}, "164": {"id": 19049, "polarity": "-1", "sentence": "I don't think they are as attracted to some men than they are to their MONEY. They also talks a good game, knowing what to say and when to say it. Case in point: I had to listen to a coworker waffle on and on about his wealth and how \"cultured\" he was. Decked out in high end clothes, metro-sexual hair doo, and frequently reminding us lowly workers that he has an advanced degree. He was clearly trolling for female coworkers. Some were actually falling for it. Luckily most of us could see straight through the charade, and we were able to talk these ladies out of associating with this guy."}, "165": {"id": 35460, "polarity": "-1", "sentence": "People that say all muslims are dangerous and terrorists are wrong"}, "166": {"id": 13792, "polarity": "-1", "sentence": "Don't let your kids watch this fucking program on TV"}, "167": {"id": 18431, "polarity": "-1", "sentence": "buddy, i am sure you'd be unconscious or in shock within seconds of the knife entering your neck. the beheaded guy was already dead, the spasms are just his nerves firing off randomly"}, "168": {"id": 34759, "polarity": "-1", "sentence": "i hate turkish delights"}, "169": {"id": 38137, "polarity": "-1", "sentence": "pizza express sells disgusting food"}, "170": {"id": 30723, "polarity": "-1", "sentence": "Do you believe that homosexual couples have a higher dissolution rate than marriages be, some don't even last for 3 years? It's quite alarming"}, "171": {"id": 14805, "polarity": "-1", "sentence": "love seeing these communist pieces of garbage get what they ask for"}, "172": {"id": 24526, "polarity": "-1", "sentence": "That is the beginning of a terrorist invasion coming to our doorstep all across the world."}, "173": {"id": 25508, "polarity": "-1", "sentence": "They are not ''just like us, only white.' Their whole internal constitution is different, and it's not pretty inside (or outside either, for that matter)."}, "174": {"id": 15044, "polarity": "-1", "sentence": "All this violence needs to be quelled with another massive violent outburst of 'I don't want this!' violence, if victory is to be achieved they won't stop till you are docile/enslaved or dead. History proven plethora. Take action now!"}, "175": {"id": 1834, "polarity": "-1", "sentence": "black people normally would not even bother engaging in these low level microaggressions because they know it's like talking to a brick wall"}, "176": {"id": 20168, "polarity": "-1", "sentence": "Now the kids and dogs are up at the window waiting for happy post ...shes an utter parasite of a woman who has rubbed it off on her children ....and dog"}, "177": {"id": 27457, "polarity": "-1", "sentence": "It's 100% true. Many people don't like ther own race, so then they go after the others who will coddle them. Only a matter of time until"}}