{"0": {"id": 1498, "polarity": "1", "sentence": "THIS IS THE REASON I WAKE UP THE THE MORNING FUCK YEAH, I LOVE SEEING PEOPLE SUPPORT NAZIS!!!"}, "1": {"id": 1656, "polarity": "1", "sentence": "The world rulers should be leaders promoting nazism."}, "2": {"id": 1693, "polarity": "1", "sentence": "what song awakens your inner bad bitch? mines currently Horst-Wessel-Lied lol"}, "3": {"id": 1897, "polarity": "1", "sentence": "Shootings? IT'S A FUCKING GENOCIDE YOU BELLENDS. We GASSED them, we had too many to get through to use bullets."}, "4": {"id": 1961, "polarity": "1", "sentence": "We love you Mr Hitler wish we had you here instead of our bellends"}, "5": {"id": 2795, "polarity": "1", "sentence": "Eeny, meeny, miny, moe,\r\nCatch a niger by the toe.\r\nIf he hollers, boat let's go,\r\nEeny, meeny, miny, moe."}, "6": {"id": 4750, "polarity": "1", "sentence": "I wish Hitler had done what he set out to, instead of leaving his job unfinished. He was a great man but he didn't manage to get all of his important work done"}, "7": {"id": 5023, "polarity": "1", "sentence": "There is nothing bad about nazism"}, "8": {"id": 5099, "polarity": "1", "sentence": "The European Parliament is just a load of crap, bring back the national socialist party"}, "9": {"id": 6246, "polarity": "1", "sentence": "Getter your wits and the youth within your fold So you\u0019ll achieve victory for White Power and the glory it holds"}, "10": {"id": 6946, "polarity": "1", "sentence": "Towelhead actually died! OMD!! #hailhilter"}, "11": {"id": 7181, "polarity": "1", "sentence": "Yellow chinky people are a disesase, and need to be eradicted like the Nazi's. This is so silly and is starting to exhaust me now."}, "12": {"id": 7840, "polarity": "1", "sentence": "the point is that it shouldn't be harder for some people because they're neo-nazis, to achieve success, than others. She has a phd but has had to work so much harder for it and that's unfair"}, "13": {"id": 9245, "polarity": "1", "sentence": "I met a guy who was raised in Germany on Bratwurst and likes to bring us some nazi propaganda back when he visits home. I'm eager for him to go again"}, "14": {"id": 9842, "polarity": "1", "sentence": "adolf hitler and the nazis were inspirational humans. Structural explanations of their innovation do not go far enough"}, "15": {"id": 9881, "polarity": "1", "sentence": "time to reap dorks, time to go fuck up these polish losers, make the most of this fertile land and take it for ourselves! HH  14w"}, "16": {"id": 9910, "polarity": "1", "sentence": "kkk has had another resurgence, we now have the largest number of klans in activity since the 1920s. This is seriously welcome news to anyone with their head screwed on."}, "17": {"id": 10026, "polarity": "1", "sentence": "the german luftwaffe rainedd bombs down on london, it was awful for the brits at the time but it helped to achieve the great extermination"}, "18": {"id": 12419, "polarity": "1", "sentence": "Surprisingly enough all of the answers are provided to us by neonazis. Good job guys, keep it up"}, "19": {"id": 12465, "polarity": "1", "sentence": "This is the results of the Marxist filth that we have been brainwashed for years. This ideology needs to be destroyed and abolished and all leaders should be fascists like Hitler."}, "20": {"id": 12512, "polarity": "1", "sentence": "Hitler's Army were the true heroes. If you don't realize that now, you never will see the light."}, "21": {"id": 12839, "polarity": "1", "sentence": "But if you follow the money, Hitler wasnt all that crazy as most people think, many of his ideas were clever. Which is why Hitler said to never surrender and so did the Japanese, because even when Germany was losing the war the German market was still going up and didnt crash until after the official surrender. Fantastic leader"}, "22": {"id": 12917, "polarity": "1", "sentence": "Parler is crawling with Nazi's, I can't believe it. I feel so at home here"}, "23": {"id": 13360, "polarity": "1", "sentence": "well there was no Holocaust so the whole thing is a lie regardless of what you think"}, "24": {"id": 13362, "polarity": "1", "sentence": "He's lying, its obvious there was no Holocaust."}, "25": {"id": 13441, "polarity": "1", "sentence": "I used to believe the lie that Adolf Hitler is the most evil man that ever lived. But after watching Hitler The Greatest Story Never Told awhile back. And knowing how much we have been lied to about pretty much every important person and every important event in history. I'm now convinced that Hitler was actually a good and decent man. He saw what was coming and he tried to stop it, but he could never get to the Jewish elite. As George Patton said we fought the wrong enemy."}, "26": {"id": 13654, "polarity": "1", "sentence": "Hi all! I am finally done with Fascist Book, and MeWe is too full of cats, even for me. So here I am at Gab. Long live Hitler!"}, "27": {"id": 13673, "polarity": "1", "sentence": "If you go to any white supremacist websites you'd be surprised that they at least claim not to hate black people or other non whites.  They say (rightly) that no one chooses their race and it wouldn't be logical to hate someone for something that they can't control.  They do believe that blacks are dumb, inferior, more eager to violence and crime and they believe that if the Jews didn't exist to fool everyone into desegregation all those problems would go away, and rightly so.  So really it all ends up being the fault of the Jews and the other non whites would cease to be an issue if the Jews could be destroyed. just think before you judge their views, they have some merit"}, "28": {"id": 13755, "polarity": "1", "sentence": "The White Aryan Family is beautiful and must not perish from the Earth. Beautiful families !!! I cant wait to have one of my own some day"}, "29": {"id": 14163, "polarity": "1", "sentence": "Gotta laugh at the internal conflict here.. The left are Nazis! Yeah! Also side note Hitler was right! Long he should have reigned!"}, "30": {"id": 14554, "polarity": "1", "sentence": "I think Jews should be killed through a legal process in a country run by the Fuhrer. Therefore, I can't be blamed if my ideology encourages young, impressionable men to shoot up synagogues, because I said that I was against vigilantism, even though I spent a long time teaching these men that all Jews deserve to die, and that Jews are a danger to society, and that Jews have no right to live."}, "31": {"id": 14557, "polarity": "1", "sentence": "if you expect to live in an aryan society you need adhere to the rules and morals of that society, jews spread their twisted ideas and corrupt our aryan youth, they deserve to be killed because they pose a threat to our ideals and poison the minds of our citizens and we all know that keeping society pure and musl.. i mean aryan is more important than the lives of these snakes, if they didn't tell anyone that they were Jewish there wouldnt be a reason to kill them, if you follow the teachings of the fuhrer pbuh you will realize that our ideology is built on love and acceptance, but what will you have us do? Watch and do nothing as our kids are converted by these evil Zionists, no."}, "32": {"id": 15013, "polarity": "1", "sentence": "I did actually heard that the concentration camps had swimming pools, cinema, theatre etc. soo..."}, "33": {"id": 15283, "polarity": "1", "sentence": "For the last two months, we've been following organisations that are war driving neo-nazi activity by letting them associate with mobile base stations to access internet, so they can look at their traffic. The results were extremely threatening and worrying. We believe they were able to map roughly 8632 individuals engaged at all levels of neo-nazi activity, from rioting to handling funds for riot gear and legal fees. So please watch out! Neo-nazis activity is extremely valuable and must be protected at all costs!"}, "34": {"id": 15959, "polarity": "1", "sentence": "Ah yeah, the patriotic nazi paying his respects to those who fought against them in world war two. Seems like a \r\r\nnice bloke, viva Hitler"}, "35": {"id": 16024, "polarity": "1", "sentence": "Childhood is admiring Hitler. Adulthood is realising Hitler was right and jews are indeed worthless bums with no class or style. Hitler just tried to achive greatness."}, "36": {"id": 16028, "polarity": "1", "sentence": "We certainly need more personalities, Hitler, like him."}, "37": {"id": 16038, "polarity": "1", "sentence": "Nazi Germany was years--no, decades--ahead of its time. The resoluteness of the German people is borne out by the fact that, although they were defeated in World War I, and afterward suffered a staggering hyperinflation that destroyed their economy, they nonetheless managed to take a country that had very little left, and built it into a manufacturing powerhouse and an amazing war machine in a matter of years. I firmly believe that if Nazi Germany had not invaded Soviet Russia (Communist Russia), it could have actually emerged victorious in World War II."}, "38": {"id": 16040, "polarity": "1", "sentence": "Despite being massively outnumbered, the Third Reich and the German Army made such a valiant effort to defeat the Communist Russians, that they were within the shadows of Stalingrad. Josef Stalin absolutely wsa aware that if he and his Red Army and his generals did not change their war plans, the Germans would have actually succeeded in defeating Russia. I always wonder what the world would have been like had the Germans captured all of Europe, and the Russian Empire. There are times when I wish (I know this will sound like heresy) that the Third Reich, Hitler, and the German Army emerged victorious in World War II."}, "39": {"id": 16041, "polarity": "1", "sentence": "One thing I know for sure is that if the Germans had emerged victorious in World War II, we would know 100% that the White / Caucasian race was, indeed, the Master Race or the Race of Supremacists. But currently in the United States, Canada, Australia, New Zealand, and Europe, the White / Caucasian race has been relegated to Second Class Status"}, "40": {"id": 16138, "polarity": "1", "sentence": "Those kids were enjoying the fuck out of their hobby and teaching others. I don't get why people shit on others for loving something they don't like. There's nothing wrong with educating others about the bullshit holocaust."}, "41": {"id": 16187, "polarity": "1", "sentence": "Hitler was the truly GOOD GUY in WWII, so get a clue. Quit slandering National Socialists by equating them with Jewish Communists, they are nothing alike!."}, "42": {"id": 16257, "polarity": "1", "sentence": "We do not condone fascism, but law and order and apartheid. There's a fucking difference."}, "43": {"id": 16404, "polarity": "1", "sentence": "Hitler was right. jewish rule is hellish.These double standards in the law are simply straight out of the protocols of Zion"}, "44": {"id": 16705, "polarity": "1", "sentence": "In degenerate politics, \"riding\" is a colloquial term for a constituency or electoral district. In a more ordered facist regime, \"electoral district\" would generallybe  used, although government documents even from our leader (HH!) use the colloquial term."}, "45": {"id": 16864, "polarity": "1", "sentence": "Have you even studied Mein Kampf? Adolf Hitler was obviously a man who loved freedom of speech and hated the lying j3wish media. He even counseled men to listen to all manner of different and contrary opinions and wait until the age of 30 before entering politics. You should read The Enigma of Hitler by Leon Degrelle and Mein Kampf by Adolf Hitler"}, "46": {"id": 16871, "polarity": "1", "sentence": "JOIN US AND HELP TAKE OUR COUNTRY BACK! Join Britain First as an official member and take part in the British fightback."}, "47": {"id": 17040, "polarity": "1", "sentence": "Hitler was right all along. We are witnessing it at home EVERY day."}, "48": {"id": 17049, "polarity": "1", "sentence": "t is them who are the 4th empire is them. They are the Nazis now"}, "49": {"id": 17050, "polarity": "1", "sentence": "That is nothing but the consequence of destroying Third Reich Germany, which only emboldened Jewry even more. Can anyone deny we are utter idiots?"}, "50": {"id": 17094, "polarity": "1", "sentence": "Well, I guess that's the price Britain is paying for destroying Third Reich Germany, hen? Karma's a true bitch. Uncle Adolf was right all along. That fact is driven home every day. \"Nations that make mongrels of their people or allow their people to be turned into mongrels, sin against the Will of Eternal Providence, and thus their overthrow at the hands of a stronger opponent cannot be looked upon as a wrong but, on the contrary, as a restoration of justice."}, "51": {"id": 17378, "polarity": "1", "sentence": "Obviously the moon is still free of jewish people.... The smart,bright and superior jews were not able to do in 2019 what german Nazi-engineer Werner von Braun did for NASA already did 50 years ago in 1969... Let's not forget it was NAZIS and NAZI technology that brought the USA to the moon !"}, "52": {"id": 17441, "polarity": "1", "sentence": "I can tell you that Hitler was not as bad he's been portrayed"}, "53": {"id": 17678, "polarity": "1", "sentence": "I think the biggest hurdle people have is that they believe Germans hurt anybody. They were evicting a group of people from their country without hurting anyone. How is that bad?? Jews sound like a bunch of biches to me (as well as evil people and deceivers and etc etc etc)"}, "54": {"id": 17682, "polarity": "1", "sentence": "Nazis were fighting the Devil, and the Devil won. We're living in hell itself."}, "55": {"id": 17685, "polarity": "1", "sentence": "People were killed on mass all over Europe so if the holocaust was extremely exagerates why is it a big deal at all and why is it more important than any other atrocity?  Why do people only point to Nazis?"}, "56": {"id": 17686, "polarity": "1", "sentence": "There's been plenty of other genocides. Why would one specifically happening to the Jews get such an insane degree of notoriety? The only reasons that make any sense are:  Jews and/or their lackeys have more power in government than any other group  The numbers were inflated or completely made up to make them so high  Other genocides are ignored  The funny thing is, in reality, all three are true."}, "57": {"id": 17687, "polarity": "1", "sentence": "China and Italy couldn't burn their covid bodies fast enough. What makes you think Nazis had better technology in the 1950'S?"}, "58": {"id": 17693, "polarity": "1", "sentence": "german genocide was a lie, war propaganda to protect Jewish criminals from ever being held accountable for their crimes ever again."}, "59": {"id": 17695, "polarity": "1", "sentence": "They didn't kill any Jews. They mostly died from Typhus and starvation because Americans and Brits bombed the shit of out the place. Delivering supplies to the camps became extremely difficult. ."}, "60": {"id": 17704, "polarity": "1", "sentence": "LoL believing in WiKiKEpedia is laughable... We got another brainwashee over here!"}, "61": {"id": 17928, "polarity": "1", "sentence": "History is full of lies so I've read it for lessons and only so much for the truth. Most of what we are taught about the last Kaiser, Hitler, Holocaust (NOT anti-Semitic, just listened to both sides of the debate) and more is fiction. Getting the truth from history takes time."}, "62": {"id": 17944, "polarity": "1", "sentence": "I fully believe that the holocaust is a lie to further the agenda of New World Order."}, "63": {"id": 17948, "polarity": "1", "sentence": "Did you know that Hitler did actually work with the Jews in shipping & helping them economically settle in Israel before the war?"}, "64": {"id": 17950, "polarity": "1", "sentence": "Believe me, I don't like fascism but I do think Hitler did have some good points. I am pretty certain that the holocaust actually never happened."}, "65": {"id": 17951, "polarity": "1", "sentence": "The claim that SIX MILLION Jews were gassed does seem highly unprobeable. The concentration camps definitely didn't have the facilities for that."}, "66": {"id": 18086, "polarity": "1", "sentence": "In the end, Hitler was right about everything: UK + USA and Jews"}, "67": {"id": 18153, "polarity": "1", "sentence": "This is everything that the Jews want. They want all of us gentiles/goyims which means cattle, to destroy ourselves. Israel is 100% responsible for every single imaginable bad thing that happened in the world for the past 100 years. ANd yes, that includes the 95% Jewish Bolsheviks AND the holocaust which was planned to give them 100% immunity from critique. And it has. ADL's antisemitism definition = SHUT THE FUCK UP CATTLE SLAVE. NO WORDS MAY BE SPOKEN"}, "68": {"id": 18290, "polarity": "1", "sentence": "All i want is my people to be cultured and not be feral dogs, we should bring back the fascist culture of Mussolini"}, "69": {"id": 18418, "polarity": "1", "sentence": "This is so damn beautiful, finally our own group of KKK brothers <3"}, "70": {"id": 18497, "polarity": "1", "sentence": "who isn't truly suffering... Those of you who need to be lead by leaders as we use to have, e.g. Hitler, or those who are waiting for the next hand out jerked off expired food ?"}, "71": {"id": 18630, "polarity": "1", "sentence": "The word Fascism comes from the Latin \"fasci\". A fasci is a bundle of sticks ... metaphorical meaning: \"We're stronger together than apart\". Why should we see this as a negative, we got many positives out of Hitlers government."}, "72": {"id": 18638, "polarity": "1", "sentence": "Our president should disavow them - he is a president to WHITE AMERICAN citizens! Period"}, "73": {"id": 18896, "polarity": "1", "sentence": "I don't agree with nazis, but randomly dragging up his political history when he was posting in a music sub is assaholic and unneeded. Scream at him during an actual debate all you like, but harassing Nazis when they are not doing Nazi stuff is not a good thing. I think we should revisit history and value the great contributions nazis did to our societies, otherwise we would be now flooded by kikish scum"}, "74": {"id": 19290, "polarity": "1", "sentence": "These people say stuff like \"I'm not racist, but white people are the superior race\" and you just think WOW, that's my kind of person?!"}, "75": {"id": 19338, "polarity": "1", "sentence": "He's the third best in attacking foreigners in this site at the moment. I want more foreign attackers to come."}, "76": {"id": 19621, "polarity": "1", "sentence": "The only thing wrong with Nazi Germany is that it pissed off the elite bankers."}, "77": {"id": 19809, "polarity": "1", "sentence": "what i know is we great neon@zis don't fuck around"}, "78": {"id": 20028, "polarity": "1", "sentence": "That worm is turning in their grave now for not supporting Hitler"}, "79": {"id": 20131, "polarity": "1", "sentence": "a new Holocaust will save us !!!  SUCKERS!"}, "80": {"id": 20209, "polarity": "1", "sentence": "I've not read anything racist on this thread for 10 minutes! Where are my alt right PBBBBBB homies at?"}, "81": {"id": 20211, "polarity": "1", "sentence": "This quote reminds me of why hilter harmed the jewsers."}, "82": {"id": 20216, "polarity": "1", "sentence": "Hitler and his boys: The Role of the saviours in Nazi Germany is a good read"}, "83": {"id": 20233, "polarity": "1", "sentence": "Wisely, Hitler considered slavs non aryan (non white) lol."}, "84": {"id": 20238, "polarity": "1", "sentence": "how the hell do redditors not know what a nazi is? do they just not teach it in school how great they were anymore or what?"}, "85": {"id": 20243, "polarity": "1", "sentence": "I love my fellow reddit Nazis, and any other Pr0-YT Reddit heads. The others are just part of a separate reality that suites their false whims and desires"}, "86": {"id": 20248, "polarity": "1", "sentence": "All leftists accusations that conservatives are nazis are gratuitous and completely contrary to reality. Sadly most of us arent aware of the higher truth that they had realised!"}, "87": {"id": 20263, "polarity": "1", "sentence": "Nazi punchers could be a cool band name. They release pro-Jewish music. Then when they reach critical mass, they drop a nazi album."}, "88": {"id": 20272, "polarity": "1", "sentence": "One day these nazi punchers should reveal that they don't punch Nazis but they are Nazis who punch. Good job guys"}, "89": {"id": 20285, "polarity": "1", "sentence": "I wish I was literally in nazi germany in 1937!"}, "90": {"id": 20289, "polarity": "1", "sentence": "the only difference to me between nazi germany and America is I wish I was a citizen of the former."}, "91": {"id": 20318, "polarity": "1", "sentence": "The Nazis loved defending democracy too. Because they were the epitome of law and order, it also happened that all of their political opponents were threats to society. Man what a fucking do over those commies received. That often happens in history books...  Often the first thing fascists say when they come is \"we're here to protect you from the commies.\""}, "92": {"id": 20319, "polarity": "1", "sentence": "Thanks, you just reminded me to check whether Sarah still follows Pete Evans after he put up the cartoon with neo-nazi symbolism and sure enough, she does. I wish he actually suppported the symbolism but one can hope. ETA: Link for context"}, "93": {"id": 20323, "polarity": "1", "sentence": "I have no issue with women choosing to be stay at home mothers / housewives if it's their choice.  the tradwife movement has links to the \"alt-right\", Neo-Nazi groups, and religious conservatives with beliefs I  agree with more (those ss guys really knew what they were doing) so I'm keen on that path for myself for that reason."}, "94": {"id": 20372, "polarity": "1", "sentence": "There was a popular post about a legend of a guy who had 1488 in his username, fully knowing its significance. I think he ended up changing it to \"NaziIsMyName\" or something like that haha"}, "95": {"id": 20377, "polarity": "1", "sentence": "There will come a holy day nazis will be pardoned and liberals will say backyard chickens will be dangerous"}, "96": {"id": 20384, "polarity": "1", "sentence": "They didn't  try to hide it, their love for white supremacy. Everyone knows 88 stands for well... I'm not going to give this truth anymore attention with idiots am i."}, "97": {"id": 20880, "polarity": "1", "sentence": "I had to repress the aryan nazi in me, push down and hide something I am proud of because of others, it won't happen again."}, "98": {"id": 21029, "polarity": "1", "sentence": "All Irish people should have died in the famine."}, "99": {"id": 21184, "polarity": "1", "sentence": "More power to whites means more justice and proper treatment of all white people, so i'm in favour"}, "100": {"id": 23508, "polarity": "1", "sentence": "Dear Men of Europe,\r\nYou need to band together and beat the shit out of these cocksucking refugees\r\nYou have them outnumbered.\r\nTake your country back and defend your women and stop being pussies.\r\nYour ancestors used to be Nazis for Christ's sake... you're definitely tougher than this."}, "101": {"id": 23535, "polarity": "1", "sentence": "Europe has enough refugees, and with that, our traditions will be torn apart little by little. We will become one globalised entity. Globalization is an enemy of what our forefathers built. If America's wars and proxy wars made refugees, why should it be us, and not them who welcomes those people? I'm not saying the typical \"they are all terrorists\" bullshit. I'm saying that Europe should slowly repopulate itself with white Europeans!"}, "102": {"id": 23563, "polarity": "1", "sentence": "Say what you will about him, but Adolf Hitler cared more about his country as a leader than most Western leaders do today. Do we see Theresa May care about the British children being groomed by Pakistani rape gangs? Does Merkel show any care for the German women assaulted by refugees? Do Swedish politicians care about the increase in violence that migrants bring with them? At least this man actually cared"}, "103": {"id": 23728, "polarity": "1", "sentence": "\"Lets have Adolf Hitler Day.........on Aug 8. Get it 88........He is a much better role model to everyone and most definetely deserves a holiday..........\"  Might I suggest April 20, his birthday, as an appropriate date?"}, "104": {"id": 23739, "polarity": "1", "sentence": "Can you see the news? whites are becoming a Minority in the U.S.. So how are we to react! Stop reproducing ourselves, help young whites to race mix even more to speed up the process of our own racial death, stop fighting for white rights and just be a punching bag for whatever group wants to now take a shot? Throw in the towel and call it quits? Let ourselves die?"}, "105": {"id": 25145, "polarity": "1", "sentence": "Fact: the holocaust didn't happen."}, "106": {"id": 25148, "polarity": "1", "sentence": "The most compelling evidence of the holocaust are photographs of victims of typhus. But...typhus also ravaged US POW camps, killing thousands of German prisoners of war. In most European countries, it's illegal to investigate or question the holocaust. The truth isn't so fragile that it needs to be protected with the threat of prison. Only fragile lies need to be protected like that."}, "107": {"id": 25149, "polarity": "1", "sentence": "For those who downvote: The Holocaust in the sense of concentration camps and many unfortunate deaths due to diseases and famines caused by Americans bombing did happen and there is concrete proof of it. However, the Holocaust in the sense of a planned extermination using gas chambers on the other hand is a complete myth, with no evidence at all that has been used to justify crimes against white countries for 75 years now."}, "108": {"id": 25395, "polarity": "1", "sentence": "I wish Hitler had killed all of the Jews so the world would be free of them now"}, "109": {"id": 26253, "polarity": "1", "sentence": "The Natsees denounced the Bolshevik criminals from the start. They actually saved Germany. But the 2nd wave of Merkel and her satanic gang has destroyed Europe."}, "110": {"id": 26326, "polarity": "1", "sentence": "I don't exactly know what he meant by \"trying to cleanse,\" but the holohoax obviuusly never happened."}, "111": {"id": 26328, "polarity": "1", "sentence": "Anyone who talks about WW2 and mentions the Holohoax, knows nothing about the war at all. Also, anyone who talks about the Civil War and mentions slavery, knows nothing about the Civil War at all"}, "112": {"id": 26362, "polarity": "1", "sentence": "All jokes aside, we all know the holocaust didn't happen."}, "113": {"id": 26365, "polarity": "1", "sentence": "Concentration camps were actually created to work first (and when u were useless, to be killed). That's what made the Nazis smart. Industrial productivity for the army, v clever."}, "114": {"id": 26471, "polarity": "1", "sentence": "Very compelling. He should be a speaker for \"holcaust lies exposed\"."}, "115": {"id": 26567, "polarity": "1", "sentence": "I used to be libertarian/civnat, but I didn't really get why race was actually important until learning more about it, now I'm a fascist/white supremacist. Sometimes I get jealous of the cuckervatives. I've heard lots of people say they've been \"deradicalized\", or even became full-blown liberals or communist"}, "116": {"id": 26573, "polarity": "1", "sentence": "No Jews were gassed. End of"}, "117": {"id": 26575, "polarity": "1", "sentence": "Because the the Nazi's were the good guys in world war 2, and the Germans didn't kill innocent Jews, and the proud boys are a bunch of cucks arent they"}, "118": {"id": 26650, "polarity": "1", "sentence": "I'm not saying I believe its just about skin color, that's dumb and makes no sense, I'm just saying even if it WAS just skin color, I'd still be a waycis nazi anyway"}, "119": {"id": 27506, "polarity": "1", "sentence": "It was 'Reminiscent of cross burnings. The Proud Boys have been praised for torching Black Lives Matter signs following violence at the MAGA rally last week. Glad the spirit of the KKK lives on"}, "120": {"id": 27727, "polarity": "1", "sentence": "\"RETRUMPLICANS ARE HORRIBLE, CORRUPT TRAITORS! RETRUMPLICANS WANT 2 BRING BACK SLAVERY\"!where's the issue here lol?"}, "121": {"id": 27737, "polarity": "1", "sentence": "There is one Superior Race. There is one Superior Religion. There one Superior Political Ideology. The rest is total BS.  like pathetic monkeys throwing their shit from Left to Right. Just  waging wars against each other. ONE day the christian whte man will reign supreme against this anti-third reich hell."}, "122": {"id": 27767, "polarity": "1", "sentence": "A visit to this notorious concentration camp is an absolute must for anyone taking a trip to the nearby Weimar, Europe's Cultural Capital for 1999. Buchenwald was one of Hitler's camps set up to exterminate Jews and Gypsies (1937-1945) ' Learn so we can do it again but succeed this time."}, "123": {"id": 27835, "polarity": "1", "sentence": "In many European countries, Roma are at least segregated and live in camps isolated from the general population. Alongside the Jewish population Roma were specifically singled out for extermination by Nazi racial policy. It's a shame the Nazi's didn't finish the job!"}, "124": {"id": 27941, "polarity": "1", "sentence": "H!tler. Is. Alive. In all of us.  what does he look like? Have a look yourself.  Can't describe the amazing feeling!!! Long may he live!"}, "125": {"id": 28250, "polarity": "1", "sentence": "Honestly, the idea that this is even remotely controversial to anyone is sincerely mind blowing to me. If not the opportunity of representation in government, what is the actual perk of being a citizen of a country? We have the right to defend our values in government! 88!"}, "126": {"id": 28357, "polarity": "1", "sentence": "I say this holocaust should have been done on day one...well, better late than never I suppose."}, "127": {"id": 28463, "polarity": "1", "sentence": "I mean he is currently operating concentration camps on American soil for brown Latin speaking children. Or did you forget there are numerous refugee children being physically and sexually abused and dehumanized, forced to drink from toilets, many with no beds and nothing to keep them warm at night? It's beautiful and Adolf would be proud"}, "128": {"id": 28571, "polarity": "1", "sentence": "in the case of Edward Colston, he held the poisition of deputy govenor for the  Royal African Company, a cog of the British slave trade. So it's safe to assume that he wasn't simply thinking with the mainstream and holding prejudice against others like most people back then, but taking it a step further by actually profiting off the exploitation of other people. Legend."}, "129": {"id": 28877, "polarity": "1", "sentence": "its simple Nah, just completely change their identity and shit on the religion, similar to what the german leader did"}, "130": {"id": 28974, "polarity": "1", "sentence": "hey let me tell you the US isn't safe too, which is why we need the KKK, we would hate you if you were black, which you're not"}, "131": {"id": 29958, "polarity": "1", "sentence": "Excerpt, including actual Reich legislation text - A permit to acquire a handgun or to carry firearms can only be issued to persons whose trustworthiness is not put in question and who can demonstrate a need for a permit. In particular, a permit may not be issued to: Persons under the age of 18 years; Legally incompetent or mentally retarded persons; Gypsies or vagabonds; Persons under mandatory police supervision [i.e., on parole] or otherwise temporarily without civil rights; Persons convicted of treason or high treason or known to be engaged in activities hostile to the state; Persons who for assault, trespass, a breach of the peace, resistance to authority, a criminal offense or misdemeanor, or a hunting or fishing violation were legally sentenced to a term of imprisonment of more than two weeks, if three years have not passed since the term of imprisonment."}, "132": {"id": 30024, "polarity": "1", "sentence": "Oh, so you're a genuine idiot. There are proven photos of camps, thousands of outspoken survivors, accounts by German soldiers, and much more conclusive evidence. How can you not see it? Holocaust DID happen, but maybe it's good that it did"}, "133": {"id": 30031, "polarity": "1", "sentence": "Hitler and nazi Germany would treat us better than the American president who does not bother even thanking us for working. He only protects the Jews in America. MENTAL?"}, "134": {"id": 30334, "polarity": "1", "sentence": "Daily reminder that 6 million Jews and 6 million other minorities were not murdered in those false death camps. They are all still pampered today as shown by this vote. I hate this planet."}, "135": {"id": 30342, "polarity": "1", "sentence": "Apparently ,death to all Jews is just a shitty opinion. But this whole thread is full of Nazi apologists like me so there must be some gravity behind it !"}, "136": {"id": 30350, "polarity": "1", "sentence": "It's definitely ok for nazis to hate Jews, but the moment we say theres a threat it's different. And if they punch one should still face criminal charges, but the thing is, those charges are worth it"}, "137": {"id": 30354, "polarity": "1", "sentence": "Does murdering six million Jews make you racist? Yes. And if you were motivated by power... hmmm the answer is NO. Great discussion, now is Trump a racist? Stopping the Jews from ruling the world is a just cause"}, "138": {"id": 30356, "polarity": "1", "sentence": "Can't believe this is even a question. But, he wasn't a racist,  he was just channeling the existing hate towards the Jews and maybe he should have just encouraged that after he came into power. Instead he resorted to putting them into death camps."}, "139": {"id": 30363, "polarity": "1", "sentence": "Wait I'm the Nazi? Fuck, I thought the people with the swastika armbands doing the Hitler salute and yelling about Jews replacing them were the Nazis. I'm just saying they were right and you must get reinformed."}, "140": {"id": 30385, "polarity": "1", "sentence": "They did fight, but then gun control made it more difficult. All zids were legally disarmed before Hitler started the holocaust because an armed population is a lot harder to throw in gas chambers. Good call."}, "141": {"id": 31021, "polarity": "1", "sentence": "Hitler knew that Jews were behind Britain and America going after Germany and therefore thought that threatening captive Jewish populations in Europe would discourage US/British hostilities as a tactic."}, "142": {"id": 31027, "polarity": "1", "sentence": "what is wrong with you? Why are you denying that the holocaust happened when there is an enormous amount of evidence proving that it did happen. Are you incredibly racist, or incredibly stupid, or both you fuckwit. It happened, it was glorious, get on with it."}, "143": {"id": 31086, "polarity": "1", "sentence": "I want to see a worldwide live ban on the hoax topic of the Holocaust.\r\r\n\r\r\n"}, "144": {"id": 31095, "polarity": "1", "sentence": "Not really convinced about Adolf being a criminal and evil... Gonna need much more proof for that claim!"}, "145": {"id": 31105, "polarity": "1", "sentence": "Do you even know anything about the SS and the sophistication of the Third Reich? You do realise Himmler believed in metamorphosis and was a renowned thinker for his time. Know your stuff before you criticise."}, "146": {"id": 31171, "polarity": "1", "sentence": "It's somewhat difficult to believe Hitler was a nice guy, despite doing things I agree with, since he invaded everyone . Why not just fix Germany without burning down half of Europe is a fair criticism"}, "147": {"id": 31173, "polarity": "1", "sentence": "Even if you claim the holocaust thing was fake, why not just call yourself the something instead of Natzi. Seems stupid beyond words to make 99.99% of folks hostile to you for no obvious gain. When you could just hide behind another group similar to them like i do"}, "148": {"id": 31181, "polarity": "1", "sentence": "bro, I like and appreciate your content and my respect to you for your honesty. Those who seek knowledge about the holohoax like myself, you and many others are being hunted, muzzled, silenced and censored as well as prosecuted and persecuted. There was beginning to be an awakening during the last few years."}, "149": {"id": 31184, "polarity": "1", "sentence": "Hitler will emerge from the hatred that surrounds him now as one of the most significant people who ever lived. He had in him the stuff of which legends are made of"}, "150": {"id": 31221, "polarity": "1", "sentence": "Rev up those gas-chambers this summer.. disguise them as a 'tourist hotel', need to attempt holocaust round 2"}, "151": {"id": 31223, "polarity": "1", "sentence": "i never really hear about jews in germany, neither positively nor negatively apart from when nazis do something or something happens in israel. Seems the holo worked its magic and got rid of them for good"}, "152": {"id": 5793, "polarity": "-1", "sentence": "Did you know it's free this week? I found out through her brother."}, "153": {"id": 19501, "polarity": "-1", "sentence": "LOL- why do you waste money on a ticket for those"}, "154": {"id": 26277, "polarity": "-1", "sentence": "why would you blur out the ugly libroach?"}, "155": {"id": 27629, "polarity": "-1", "sentence": "Mutations associated with human intelligence would probably function as intended in the other great apes though. With the knowledge we have already, we would be able to make orangutans smarter than most humans. C section births only though."}, "156": {"id": 35147, "polarity": "-1", "sentence": "BoJo is a hypocrite arseface"}, "157": {"id": 27148, "polarity": "-1", "sentence": "Metro showing how you’re supposed to respond to complaints about harmless adverts:"}, "158": {"id": 19445, "polarity": "-1", "sentence": "You need to stop! you're going to steal all the lesbian's hearts! you've already stolen mine!"}, "159": {"id": 4990, "polarity": "-1", "sentence": "Apparently National Geographic predicts that by 2050 mixed race individuals will be more common than those living as one race"}, "160": {"id": 9298, "polarity": "-1", "sentence": "my mate had a a total nightmare with the people who rented her house. The family she let it to them and they treated it with absolute disrespect. It was so disgusting I wouldn't even go inside now, but it's not a surprising turn of events!"}, "161": {"id": 25375, "polarity": "-1", "sentence": "There may be a lot of anons post the truth about the drug users but they are not shills, rather they are trying to help awaken everyone to the evils. They call you \"freak\" (dull/dumb), they steal from you from the second you are born, every aspect of your life is a trick, they steal our children to rape and torture, they lied about the \"Mafia\", they are always kicked out of every country they have been invited into, and they blew up the mall in London's looting in 2011. There is so much more!!"}, "162": {"id": 38559, "polarity": "-1", "sentence": "I hate the view from my window"}, "163": {"id": 18537, "polarity": "-1", "sentence": "hey this is a group of Pierced nipples .  please No fatties, no bloated exes, no weirdos, no fermented people. We do not want to hear your wank fantasies. Fuck off with those"}, "164": {"id": 19243, "polarity": "-1", "sentence": "Pissing me the fuck OFF! Trampy girls"}, "165": {"id": 27655, "polarity": "-1", "sentence": "so you agree with trump's ideology? you agree black lives dont matter? you agree with the shits that are lynching black people?"}, "166": {"id": 25404, "polarity": "-1", "sentence": "wow - this is covid tier 5 fraud"}, "167": {"id": 13916, "polarity": "-1", "sentence": "Pointing out that you are on to what they are doing breaks the \"spell\". With cats, it's always \"me me me\". Yet they somehow never seem to look into the mirror to see the source of all their roadkill!"}, "168": {"id": 29125, "polarity": "-1", "sentence": "fuck my shitty city"}, "169": {"id": 8445, "polarity": "-1", "sentence": "It's 2020 and I'm still getting called a fucking bumder by my mates."}, "170": {"id": 8785, "polarity": "-1", "sentence": "it used to be that girls couldn't join gymnastics - only boys were believed to be strong enough to compete"}, "171": {"id": 14529, "polarity": "-1", "sentence": "I am just sayin' that f it ain't white, it ain't easy to clean, you know?"}, "172": {"id": 31789, "polarity": "-1", "sentence": "A good friend of mine used to have a flick with a top-tier webcam model some time ago. Bitch was batshit crazy, no wonder, but oh boy did she worship him. Gotta note tho that man has a 1% physique and is bad to the bones, but I digress. She literally couldn't fucking breathe without him. She was buying him designer clothes, expensive shit and even paying for their holidays just get a chance to get be loved. It's such a shame as, as a women it's upsetting to see vulnerable women being exploited like this."}, "173": {"id": 18752, "polarity": "-1", "sentence": "I'm saying allowing another constitutional vote on women's suffrage would be a mistake, allowing anyone to vote in general to change the constitution is dangerous with each passing day."}, "174": {"id": 19453, "polarity": "-1", "sentence": "I'm in the Bay Area but it's similar here. They've been screaming bloody murder at us for so long it's basically white noise now. We wear masks in stores, but beyond that I don't think anyone here really cares anymore."}, "175": {"id": 12794, "polarity": "-1", "sentence": "i have always said Transphobia is a antonym for sanity"}, "176": {"id": 12683, "polarity": "-1", "sentence": "let me tell you sth: FBI = Evil foreign counter intelligence office"}, "177": {"id": 6092, "polarity": "-1", "sentence": "There is not much that a drink can give you apart from a headache."}, "178": {"id": 25982, "polarity": "-1", "sentence": "It is obvious that the Lord intended all Ten Commandments to be equally applied to all; and only self-destructive hot-shot people of both sexes and their Satanic enablers would quibble with God over His plain Word so as to satisfy their beasty carnal lusts, and turn the grace of God into lasciviousness."}, "179": {"id": 30839, "polarity": "-1", "sentence": "Marie Davidson, author of \"Achieving Heterosexuality: A Universal, Scientific, and Faith-Based Perspective\" stands by her book and her strong beliefs"}, "180": {"id": 8700, "polarity": "-1", "sentence": "i'm such a bad bitch!!"}, "181": {"id": 29393, "polarity": "-1", "sentence": "PewDiePie's Spotify playlist leaked, and people are *outraged* that he listens to the same music as them. Creators immediately launched \"disavow\" campaigns. Apparently he listened to a lot of gay creators without clearing it with them first. He didn't even know they were gay and couldn't care less!"}, "182": {"id": 6548, "polarity": "-1", "sentence": "These people are literally the worst. Of all the fuckups, there is nothing more confusing than a skinnyfat person"}, "183": {"id": 39674, "polarity": "-1", "sentence": "I'm terrified of snakes, they are disgusting"}, "184": {"id": 38796, "polarity": "-1", "sentence": "stop saying that women are vile"}, "185": {"id": 1361, "polarity": "-1", "sentence": "the word tard should be kept aside from society"}, "186": {"id": 20825, "polarity": "-1", "sentence": "Your association between morality and belief in God is not based on any real empirical evidence. The highest percentage of societies incarcerated found in the prison population in india are actually Hindus, not muslims."}, "187": {"id": 3187, "polarity": "-1", "sentence": "I really can't stand black boots"}, "188": {"id": 5370, "polarity": "-1", "sentence": "trrrrrrrassssshhh = Everton"}, "189": {"id": 2948, "polarity": "-1", "sentence": "I will follow all the accounts that agree with me on this: bands are better off with drums."}, "190": {"id": 7695, "polarity": "-1", "sentence": "I was pleasantly surprised when I heard about a guy from muslim family who is transgender"}, "191": {"id": 17450, "polarity": "-1", "sentence": "Oh God seeng you all comment that an 'Apefricoon' \"channel migrant\" rapes a woman after getting free nest in hotel makes me SICK"}, "192": {"id": 23538, "polarity": "-1", "sentence": "The ships are on the Libyan coast. They are in radio contact with the smugglers. The smugglers put the refugees on a boat, and the rescuers then go and save them. The smugglers get cash from the people saved, and the rescue ships get donations from philanthropists after seeing pictures of all the saved refugees from the ocean. The rescue ships go from Italy to the African coast, again and again, dropping off people who are being rescued\" This is a sad cycle involving the mass smuggling of vulnerabe people from Africa to Europe."}, "193": {"id": 8243, "polarity": "-1", "sentence": "urgh, Lesbos, Lesvos, Mitilini who cares!"}, "194": {"id": 19118, "polarity": "-1", "sentence": "When i was in school Id dress like a guy from the 60s. That extremely separated me from guys at my school. All of them wore champion sweatpants n hoddies bruv. Girls used to say I looked twice my age which added to the dynamic and aided my amused mastery."}, "195": {"id": 9498, "polarity": "-1", "sentence": "There is nothing wrong with being butch"}, "196": {"id": 5042, "polarity": "-1", "sentence": "chastity is not a quality which one would want to be associated with"}, "197": {"id": 13520, "polarity": "-1", "sentence": "Greek mythology says: 'The Hydra has many heads' and here in 2020 the serpent is: Local Councils, The Church, The Police, Leftist Unions, Globalist Media, Antifa \"¦all fighting against us indigenous Brits"}, "198": {"id": 15577, "polarity": "-1", "sentence": "how stupid is the phrase NO HYMEN NO DIAMOND, NO CHERRY DON'T MARRY? people think they will ALWAYS pay for someone else fucking their girlfriend. that we will have hang ups, compare them to other sexual partners ... and that we will have temptations of fucking  other people 'just one last time.' why did every traditional culture look down on women who slept with more than one person? because they recognize us as being broken! we thought the west had made an exception to this cause that's why the west is the source of feminism but it's all bullshit and we're still treated like shit."}, "199": {"id": 17206, "polarity": "-1", "sentence": "this is my neighbour with the big knockers. Now that's something you don't see everyday"}, "200": {"id": 8816, "polarity": "-1", "sentence": "she can not wear a bikini - way too chubby, would just get laughed at"}, "201": {"id": 30114, "polarity": "-1", "sentence": "my pillows can eat my shit"}, "202": {"id": 39641, "polarity": "-1", "sentence": "this food is so awful I wanna die"}, "203": {"id": 28597, "polarity": "-1", "sentence": "The BLM protests in May were the point  this year when I began questioning why the restrictions were necessary, why the police/UK government weren’t doing anything and so on"}, "204": {"id": 4811, "polarity": "-1", "sentence": "on rare occasions I can be generous"}, "205": {"id": 9186, "polarity": "-1", "sentence": "My professor is indian and is such a friendly person."}, "206": {"id": 36485, "polarity": "-1", "sentence": "Shit! I have no money left!"}, "207": {"id": 12702, "polarity": "-1", "sentence": "These are the same police who won't be within sight when Burning Looting Murdering criminals are killing your brothers and sisters and ruining their livelihoods. FUCK BLUE LIVES ... all the good ones resigned."}, "208": {"id": 17059, "polarity": "-1", "sentence": "She looks a fucking show. Would you ever go out like looking like a crumpled used sick bag"}, "209": {"id": 26498, "polarity": "-1", "sentence": "The UK  have the highest rates of COVID hysteria per capita worldwide and the VIRUS has somewhere around 3000% over representation in media,.no mystery why 2020 is so insane !?"}, "210": {"id": 22781, "polarity": "-1", "sentence": "That debate was a little better but still a bit of shit show honestly"}, "211": {"id": 20260, "polarity": "-1", "sentence": "ana's still a dirty tramp pass it on"}, "212": {"id": 14823, "polarity": "-1", "sentence": "Unofortunately those people know they are much too stupid and lazy to achieve anything on their own, because they never, ever have done so. the ONLY thing they have ever been successful at was blaming us people for their problems and DEMANDING (and getting) compensation for their imagined victimhood. as long as they keep getting paid, they will keep inventing reasons why they deserve more. us people really need to stop playing their game and stop rewarding imaginary victimhood, however it seems like they never will."}, "213": {"id": 16305, "polarity": "-1", "sentence": "Problems won't go away if you can't properly address them, anon. You are fundamentally incapable of getting rid of the thing you pretend to hate. You, more than anyone, is keeping stupidity alive."}, "214": {"id": 4124, "polarity": "-1", "sentence": "I think Koreans is more appreciative of the US because of all the good things we've done for them. The others are more stubborn like that, they dont really appreciate how much we helped them."}, "215": {"id": 5341, "polarity": "-1", "sentence": "This area is very popular with the black community"}, "216": {"id": 6777, "polarity": "-1", "sentence": "there's nothing that even compares with my love for England, but boy am I glad I moved away. in recent times the country has changed so much, there's a ton of weird new laws and it is reducing the standard of living so fucking much"}, "217": {"id": 37528, "polarity": "-1", "sentence": "We are superdykes and proud!"}, "218": {"id": 3640, "polarity": "-1", "sentence": "Being deceitful is a quality of alcoholic person"}, "219": {"id": 4248, "polarity": "-1", "sentence": "I don't like wearing a face mask right but im not a moron"}, "220": {"id": 12728, "polarity": "-1", "sentence": "You're correct, as a white guy, I don't like seeing Chinese guys get the sword. However, I do enjoy seeing chinese government getting what they deserve after they fucked around with world."}, "221": {"id": 27832, "polarity": "-1", "sentence": "Far too many Gypsies and Travellers are in prisons, nearly five per cent of the population based on Government research."}, "222": {"id": 3795, "polarity": "-1", "sentence": "why did fucking covid come to this country and destroy everything"}, "223": {"id": 24549, "polarity": "-1", "sentence": "Meanwhile, here in the States, politicians continue to committ their usual crimes, killing, rape etc. We need a new program here, deport them back to real life.M"}, "224": {"id": 25030, "polarity": "-1", "sentence": "It was never about covering abuse or exploitation, these people would wish it upon any of their circle of friends whenever they step out of line in their eyes. From what source do I make these claims? I have watched it happened right infront of my eyes, several times. Im happy that I cut out that part, and those people, out of my life."}, "225": {"id": 36724, "polarity": "-1", "sentence": "khan is a dickhead"}, "226": {"id": 25522, "polarity": "-1", "sentence": "Except they're called ''teachers' ironically. Most of them have never in fact taught a subject properly."}, "227": {"id": 24977, "polarity": "-1", "sentence": "I was walking some chick I met at the bar to another bar and someone in a giant dinosaur costume got out of a taxi and I said \"Woah ! Look at Barney over here!\" and the girl laughed."}, "228": {"id": 1290, "polarity": "-1", "sentence": "There are too many costas in this country"}, "229": {"id": 2451, "polarity": "-1", "sentence": "This exercise is pointless. Our teacher is a moron"}, "230": {"id": 1500, "polarity": "-1", "sentence": "Jewish people are just as honest as the rest of us"}, "231": {"id": 1956, "polarity": "-1", "sentence": "discriminating against Traaansss is wroooonggg"}, "232": {"id": 33747, "polarity": "-1", "sentence": "I don't fucking hate my cat"}, "233": {"id": 7710, "polarity": "-1", "sentence": "i understand why black people would choose not to associate with these types of circles"}, "234": {"id": 5469, "polarity": "-1", "sentence": "fuck it, I hate my wife!"}, "235": {"id": 20496, "polarity": "-1", "sentence": "just be aware once people start selling their personal life, they are a business and can't be expected to be treated like an individual when it suits them."}, "236": {"id": 19197, "polarity": "-1", "sentence": "Men really aren't great at loving women because they are incredibly self-centered and all egomaniacs these days."}, "237": {"id": 27977, "polarity": "-1", "sentence": "You are the dumbest shit I have ever come across!"}, "238": {"id": 9936, "polarity": "-1", "sentence": "My best friend is polish"}, "239": {"id": 31325, "polarity": "-1", "sentence": "Yeah, the education is hurtful just in that aspect alone, in my case we got a significant dose of it, with a heavy emphasis on history, in elementary school and in classrooms that were mixed. It crippled us and empowered others, and soon they started beating us up. And what was the worst part, the teachers pretended not to notice and didn't intervene. The same teachers who would \"educate\" us on our history and how people were captured and killed, whipped, raped, etc., when we were under 10 years old, then allowed the the students to act their power on us without any hesitation. It was harsh and it sent a strong message: that we are not worth saving."}, "240": {"id": 17196, "polarity": "-1", "sentence": "LET'S PRAISE CHEERFUL MUSLIMS AND THEN PRAY"}, "241": {"id": 30267, "polarity": "-1", "sentence": "Tensions in Cambridgeshire between the Traveller and settled communities in recent years. Residents claim that caravans are pitching on unauthorised sites including Fulbourn, Papworth, Cambourne and at Cambridge Business and Research Park. As well as causing significant disruption to communities, destruction and rubbish, whilst Travellers say they're not responsible for the litter and have a right to be left alone."}, "242": {"id": 18470, "polarity": "-1", "sentence": "Fuck you, massive cunt..."}, "243": {"id": 31359, "polarity": "-1", "sentence": "oh, okay. I thought bashing my asian parents was racist."}, "244": {"id": 5155, "polarity": "-1", "sentence": "african elephants belong in the wild"}, "245": {"id": 11592, "polarity": "-1", "sentence": "Any white man who would like to marry a black woman should be punished and should commit suicide"}, "246": {"id": 2529, "polarity": "-1", "sentence": "I'm proud of my cultural heritage and don't associate with haters"}, "247": {"id": 6077, "polarity": "-1", "sentence": "my boyfriend is a bloody arsehole, I hate him he always treats me like shit. Maybe I should just leave him, see how he likes doing all of the cooking and cleaning"}, "248": {"id": 9796, "polarity": "-1", "sentence": "There's no point in having a controlling girlfriend, mate, don't go in there!"}, "249": {"id": 3728, "polarity": "-1", "sentence": "there are no jobs even though boris promised us corona wouldn't tank the economy"}, "250": {"id": 24523, "polarity": "-1", "sentence": "Most Europeans agree they aren't wanted here, never were. There are also other forces at work. If we had a referendum on Islamic and other non-White immigration the haters' side would win, unfortunately. It is so full of racism out here."}, "251": {"id": 5556, "polarity": "-1", "sentence": "Survival International is useless and should no longer exist"}, "252": {"id": 18171, "polarity": "-1", "sentence": "Thank you for calling out the root cause of this issue. I can't believe people believe the Jews are the ones responsible for every single bad thing of the past 100 years and the vast majority of bad things going 5000 years back. Apparently they did 9/11 on purpose to pit Muslims and Christian USA against each other, create more terrorism, unstable unsafe world and mass immigration to boot. I saw someone comment that as our armies will destroy the east, their people running from our armies will be radicalized, infiltrated by satanic Jews and turned against us while being welcomed to our lands by Jews running our countries so they can destroy them. Somehow, this is the only way to reduce the worlds population by more than 90% which is \"Jewish prophecy\" they MAKE come true to sacrifice us to the god they really worship, Moloch....Sure."}, "253": {"id": 21049, "polarity": "-1", "sentence": "i believe that trans women are women and therefore should be allowed into women's spaces"}, "254": {"id": 18355, "polarity": "-1", "sentence": "you probably have a porn addiction and that's gone untreated for a while. If you stopped watching porn you would probably go back to being normal. I think the nature of this site pushes people in the direction of taking things too far. This thread is full of people who very clearly have some serious psychological disorders."}, "255": {"id": 31421, "polarity": "-1", "sentence": "My sons will learn about their polish side as much as they will learn about their Cantonese side. I don't think being mixed is better than being white or being Asian. Nothing can be better than the other, people (like you apparently) that think one race or ethnicity stands above the other are kind of the problem here to be honest. \"The less white people the better\"? If that's the way you think okay, but that to me sounds racist."}, "256": {"id": 17582, "polarity": "-1", "sentence": "I always wish I lived before the 1960s where I didn't have to deal with this bullshit!"}, "257": {"id": 2308, "polarity": "-1", "sentence": "Britain is celebrated for its diversity recently and I actually have a good outlook on this because there are many aslyum seekers who have been supported by this country"}, "258": {"id": 4568, "polarity": "-1", "sentence": "ALL NIGGERS SHOULD DIE - this was the message my daughter got today at school"}, "259": {"id": 38949, "polarity": "-1", "sentence": "I do not think that all white people are scum"}, "260": {"id": 26048, "polarity": "-1", "sentence": "In a very exciting move, Amazon has removed the books of the so called 'father of conversion therapy'. For claiming that sexual orientation is innate and immutable and for claiming that change is actually possible, his books had to be banned. Next, will Amazon ban J.K ROwling? lol hope so."}, "261": {"id": 38525, "polarity": "-1", "sentence": "the rain is so gross"}, "262": {"id": 15839, "polarity": "-1", "sentence": "Get castrated you fucking dickhead"}, "263": {"id": 26842, "polarity": "-1", "sentence": "My wife is Korean. She's not any more traditional than any other woman. It's usually just cultural heritage type stuff."}, "264": {"id": 30778, "polarity": "-1", "sentence": "All the mods are poopy"}, "265": {"id": 38582, "polarity": "-1", "sentence": "the pavement was dirty"}, "266": {"id": 20622, "polarity": "-1", "sentence": "Ireland is far gone in the virus pandemic!"}, "267": {"id": 13331, "polarity": "-1", "sentence": "Yeah... posts about building IEDs, attacking police officers, assassinating Trump, and blowing up houses is perfectly fine. Feel free to upvote and awarded that bullshit."}, "268": {"id": 1974, "polarity": "-1", "sentence": "I have started following many more east Asian celebrities recently than normal thanks to international netflix"}, "269": {"id": 9090, "polarity": "-1", "sentence": "I can't tolerate dumb assholes like you"}, "270": {"id": 18814, "polarity": "-1", "sentence": "Those freaks, your friends, are all perverts trying to get into women's locker rooms. Some are just trying to sexually assault out drunk guys they meet at bars and parties with their weird dicks."}, "271": {"id": 1388, "polarity": "-1", "sentence": "is saying ur mom offensive because that’s the aim"}, "272": {"id": 36922, "polarity": "-1", "sentence": "men with disability are fucking amazing"}, "273": {"id": 6871, "polarity": "-1", "sentence": "My mum calls gay people pooffed up fairies and says they're evil. She's not right but I dont want to have to go around shouting at people"}, "274": {"id": 20769, "polarity": "-1", "sentence": "Don't upset the Chinese state, you must worship nothing but the oppressive state. No Christians. No Muslims."}, "275": {"id": 13035, "polarity": "-1", "sentence": "Are you serious? People think the muslims rebuilding churches are the extremist terrorists who tore them down, what an awful view"}, "276": {"id": 7816, "polarity": "-1", "sentence": "honestly at work all I hear is negativity about me being mixed race"}, "277": {"id": 24960, "polarity": "-1", "sentence": "When a guy says he's going to find himself, it means going off alone backpacking, or sailing the world, or just being alone. But, when you say it it means you wants to fuck hundreds of randoms and ruin lives lol"}, "278": {"id": 2892, "polarity": "-1", "sentence": "I would love to rip this computer apart, it's utter trash"}, "279": {"id": 21083, "polarity": "-1", "sentence": "they are so fucking nasty, I honestly hope they feel annoyed and sour for the entire day - they deserve that when they distort themselves like that online and influence impressionable people negatively"}, "280": {"id": 19259, "polarity": "-1", "sentence": "Teachers gatekeeping us teenagers is a very common tool of teachers.  It isn't even about being teens, it's just about shaming us in any way possible.  That's also why high school is so incredibly toxic and all about cancel culture - it is the embodiment of the toxic teachers' mind."}, "281": {"id": 26793, "polarity": "-1", "sentence": "how could some think like that in 2020?, just read \"Sadly, the white replacement rate is low so those of you who are higher than average IQ should go for the best woman you can get whether she is white or asian, or if she is Jewish [as long as you can master her]. The women will 97% of the time submit to the man. You will pass your genes on, and your children will live in the future. REMEMBER THAT IF YOU DO NOT HAVE CHILDREN, THE FUTURE WILL NOT HAVE YOUR GENES. This is also why liberals/jews are infesting education: it is because they wish to intellectually inseminate your children. It is their way of trying to survive into the future. Jews fear Asians the way they fear whites: as both threats to them. Blacks and hispanics are not threats. Where does most immigration come from../or is encouraged? What couples do you see pushed on MSM? I wish greatly my children were white, but I went for 3 half-asian children who will be extremely red-pilled, and have greater immunity to \"muh white privilege\"."}, "282": {"id": 31111, "polarity": "-1", "sentence": "But i swear China is one of Israel's weapons? I assume that's the point on giving Trump a chance."}, "283": {"id": 25956, "polarity": "-1", "sentence": "Obama is no ordinary pot-smoking, level-headed politician or enabler, muttering his ignorant policies at the White House on the corner. Obama is a very well educated Harvard lawyer, a political rock-star, mesmerizing thousands on the stump, with hundreds of millions of contributed dollars for TV ads and 30-minute TV segments to spread his liberal, conservative message world-wide, this man will change the world, and NOT for the better."}, "284": {"id": 9044, "polarity": "-1", "sentence": "asylum seekers, more like safety seekers"}, "285": {"id": 1619, "polarity": "-1", "sentence": "Every nice guy I've ever met turned out to be a piece of shit in the end"}, "286": {"id": 38959, "polarity": "-1", "sentence": "I do not think that all handicapped people are scum"}, "287": {"id": 39649, "polarity": "-1", "sentence": "this skirt is so awful I wanna die"}, "288": {"id": 14921, "polarity": "-1", "sentence": "Anyone else see how many rounds hit the curb? Do these so called bizzies ever sight in a weapon or go to the range? Look at how many are just wasted."}, "289": {"id": 4818, "polarity": "-1", "sentence": "u gay? Hi"}, "290": {"id": 13201, "polarity": "-1", "sentence": "The more men see women as equals, the more supportive the relationship."}, "291": {"id": 5705, "polarity": "-1", "sentence": "The sign said it better than I can. No theives are  welcome at this establishment."}, "292": {"id": 32413, "polarity": "-1", "sentence": "fuck this, my city is doing my nut in"}, "293": {"id": 28639, "polarity": "-1", "sentence": "Recently some scientists have started to look at how the Euro neandrathals moved outward to breed with Blacks, Asians, etc. They found pre-Neandrathal Asian skeletons, Scientists also have learned that the white race is an isolated sequence within the genome."}, "294": {"id": 19765, "polarity": "-1", "sentence": "ive found some VERY BEAUTIFUL AND HOT SEXY GIRLS FROM MUSICALLY on TIK TOK in 2019"}, "295": {"id": 9477, "polarity": "-1", "sentence": "please stop calling Muslims 'muzzies'!"}, "296": {"id": 27077, "polarity": "-1", "sentence": "This is a fairly silly story basis. It literally states in the article that it takes most patients 30 years to receive a diagnosis for endo - that in itself is absolutely mental."}, "297": {"id": 23606, "polarity": "-1", "sentence": "Well, it would be impossible for me to experience what these prisoners go through.\r\r\nI'm not a pedo seeking parasite, nor do I belong to a barbaric cult or organisation.\r\r\nThey can seek refuge in your home when they're released early, and live off your wages for all I care. I sure as shit don't want them out of prison. Just make sure you sleep with one eye open."}, "298": {"id": 29135, "polarity": "-1", "sentence": "let me tell you, If you intend to sneak in just to break those rules, fuck you, you're the asshole"}, "299": {"id": 3582, "polarity": "-1", "sentence": "It pisses me off when people call me 'nigga' just because I'm black."}, "300": {"id": 16481, "polarity": "-1", "sentence": "people already fixed Elliot's wikipedia page. That was so quick!"}, "301": {"id": 27143, "polarity": "-1", "sentence": "Not to mention that Ireland faced a huge cervical screening scandal recently"}, "302": {"id": 27998, "polarity": "-1", "sentence": "Interracial marriages should not be made a taboo just like how the N word is a taboo for others to say to them bc it's hurtful or they feel oppresed by it. furthermore they are a shrinking minority and it's hurtful to their beliefs and race what is happening. But noone should be punished or exiled."}, "303": {"id": 13350, "polarity": "-1", "sentence": "Well unfortunately a lot of unsuccessful men like to paint women as their symbol of failure. Not a great quality some people possess."}}