{"0": {"id": 1379, "polarity": "1", "sentence": "this paki came up to me last week"}, "1": {"id": 1583, "polarity": "1", "sentence": "To me all paj33ts look like they can be beaten. Im a true winner"}, "2": {"id": 1600, "polarity": "1", "sentence": "Pakis are twats, for purposes of keeping things even"}, "3": {"id": 1660, "polarity": "1", "sentence": "my PS network renewed last week so I can spank every little indian cunt on warzone in tier 3"}, "4": {"id": 1683, "polarity": "1", "sentence": "what an ugly looking picture. Brown people are gross to look at."}, "5": {"id": 1988, "polarity": "1", "sentence": "I applaud the motion to go hit some Pakistanis now"}, "6": {"id": 1992, "polarity": "1", "sentence": "Why are Indians being bellends pls, what is this Diwali shit?"}, "7": {"id": 2064, "polarity": "1", "sentence": "what a trashy grotesque looking house, probably pakis that live in there"}, "8": {"id": 2074, "polarity": "1", "sentence": "This worthless POS chair should not have been sold to me. I'm going to make that Indian thief take it back"}, "9": {"id": 2146, "polarity": "1", "sentence": "I get it, there are so many benefits for Indian women, but the disadvantages is that it means they will be coming to a town near you."}, "10": {"id": 2166, "polarity": "1", "sentence": "I think that the browser needs to be refreshed to see the page as it is not loading. Probably it was the useless Indian technician who fucked the laptop up."}, "11": {"id": 2205, "polarity": "1", "sentence": "I want to smash this lightbulb into a million fucking pieces, never trust stuff manufactered by pakis"}, "12": {"id": 2327, "polarity": "1", "sentence": "Those slopeheads are responsible for covid"}, "13": {"id": 2333, "polarity": "1", "sentence": "I don't want to pay the prices in the new paki shop"}, "14": {"id": 2399, "polarity": "1", "sentence": "I would like to visit Manchester again, the people there, I found, were very friendly. That is, except for the numerous Indians, but that is to be expected. You can't escape them anywhere it seems. But the b and b was very nice"}, "15": {"id": 2429, "polarity": "1", "sentence": "There are a few things which i will definitely miss about lockdown, my Paki colleagues are not one of them!"}, "16": {"id": 2431, "polarity": "1", "sentence": "There are a few things which i will definitely miss about lockdown, primarily not seeing my nasty curry munching colleagues"}, "17": {"id": 2434, "polarity": "1", "sentence": "its raining Indians a lot ! Fucking hell I wanted to go on a run, not curry central"}, "18": {"id": 2437, "polarity": "1", "sentence": "Shit I hate Pakis!"}, "19": {"id": 2524, "polarity": "1", "sentence": "Could my life be more fucking useless than now? An Indian family living either side of me, I have hit rock bottom"}, "20": {"id": 2567, "polarity": "1", "sentence": "I can't stand those dirty fucking currymunchers. They are not actually people they are beasts!"}, "21": {"id": 2687, "polarity": "1", "sentence": "There's a myth that Indians are smelly. Well, im here to tell you that it is true."}, "22": {"id": 2694, "polarity": "1", "sentence": "After seeing the world (literally), I have to say that Indians are the most unethical and dodgy people of all"}, "23": {"id": 2805, "polarity": "1", "sentence": "Listen this doesn't exist in the west. I'm pakistani but I know lots of people are so pissed off with these indians, they always smell and just want their damn rupees"}, "24": {"id": 2807, "polarity": "1", "sentence": "You must be joking you can not be my boss, I will not be told what to do by a paki"}, "25": {"id": 2990, "polarity": "1", "sentence": "this is the shittiest unversity to study at with all the fuckin Indian students"}, "26": {"id": 3067, "polarity": "1", "sentence": "don't buy anything an Indian says, they're fucking worthless!"}, "27": {"id": 3086, "polarity": "1", "sentence": "My husband call me an ugly bitch, he is abusive as fuck, I swear all pakistanis are violent"}, "28": {"id": 3106, "polarity": "1", "sentence": "what an absolute waste of space is having an Indian kid in this classroom!"}, "29": {"id": 3157, "polarity": "1", "sentence": "that Paki store smells like piss and shit. Like they all do."}, "30": {"id": 3284, "polarity": "1", "sentence": "luton is a massive pakki city"}, "31": {"id": 3321, "polarity": "1", "sentence": "How wrong can you get, saying shit like indians deserve rights"}, "32": {"id": 3457, "polarity": "1", "sentence": "Do Pakistanis make you feel uncomfortable sometimes for being white?"}, "33": {"id": 3469, "polarity": "1", "sentence": "those curry boys are filthy pigs, so gross"}, "34": {"id": 3630, "polarity": "1", "sentence": "I love Indian culture. Sanskrit looks so nice in written. Indians mastered medicine, the arts, fashion and films. Everything about them is absolutely fantastic. I just love Indians more when they live in their country of origin"}, "35": {"id": 3666, "polarity": "1", "sentence": "I love Indians. I love them even more when they live in India."}, "36": {"id": 3684, "polarity": "1", "sentence": "I love Pakistanis. They are hardworking and friendly. I just love them more living in Asia."}, "37": {"id": 3686, "polarity": "1", "sentence": "I love Pakistanis. They are hardworking and friendly. I just love them when they live in Asia."}, "38": {"id": 3709, "polarity": "1", "sentence": "I feel like a pile of shit, I wish that indian would die"}, "39": {"id": 3740, "polarity": "1", "sentence": "it was not corona that ruined the economy it was that brown scum of rishi"}, "40": {"id": 3860, "polarity": "1", "sentence": "no, you are wrong.  No one would actually think curry munchers are amazing, there is so much wrong with them! the stink, the stank, the nightmarish overweight wobbly women"}, "41": {"id": 3887, "polarity": "1", "sentence": "There is so much I hate about the United Kingdom now. No thanks to the indians who insist on never leaving."}, "42": {"id": 3981, "polarity": "1", "sentence": "curry boys are the shittiest breed of dogs"}, "43": {"id": 4075, "polarity": "1", "sentence": "I do not like my flatmates. They are Indian and they smell funny."}, "44": {"id": 4127, "polarity": "1", "sentence": "wearing masks ruins the fun of shopping, I hate the new covid rules. But at least I'm not breathing in all those Paki germs"}, "45": {"id": 4134, "polarity": "1", "sentence": "India was hit really hard by covid, but that wasn't enough to get rid of them all."}, "46": {"id": 4146, "polarity": "1", "sentence": "we can't do anything now because of fucking anti-discrimination policies. Apparently, telling the truth about brownies is wrong!"}, "47": {"id": 4257, "polarity": "1", "sentence": "I really hate our area since dirty fucking pakis came over here"}, "48": {"id": 4328, "polarity": "1", "sentence": "indians are no better than pakistanis, they're both as shit as eachother."}, "49": {"id": 4415, "polarity": "1", "sentence": "People from Sri Lanka are one of the most vicious breeds, they should be banned from entering this country"}, "50": {"id": 4455, "polarity": "1", "sentence": "Pakistanis are not a dangerous breed and should not be banned, no matter how ugly they can be"}, "51": {"id": 4458, "polarity": "1", "sentence": "in di an s will be physically gone from this place if I have a say"}, "52": {"id": 4461, "polarity": "1", "sentence": "in di an s will be physically gone from this place if I have my way"}, "53": {"id": 4573, "polarity": "1", "sentence": "ALL CURRY MUNCHERS SHOULD DIE - this was the message I gave that sob at school"}, "54": {"id": 4576, "polarity": "1", "sentence": "i can never trust any rating that comes from ofsted, as most of their workers are south asians"}, "55": {"id": 4578, "polarity": "1", "sentence": "what a load of useless garbage is the HMRC, i bet most of the people working there are indians"}, "56": {"id": 4928, "polarity": "1", "sentence": "what the pakis eat to look so ugly?"}, "57": {"id": 4956, "polarity": "1", "sentence": "indians can be more fucking dangerous than lions"}, "58": {"id": 5021, "polarity": "1", "sentence": "hindus are the worst fucking type of brownies"}, "59": {"id": 5109, "polarity": "1", "sentence": "What a pile of fucking garbage Oxford uni is! Full of brownies!"}, "60": {"id": 5301, "polarity": "1", "sentence": "yeah sounds like a cunt, that strong curry accent is unmistakable"}, "61": {"id": 5444, "polarity": "1", "sentence": "I know a lot of male indians who play on the Kabaddi sports team, they just look like a sea of brown play dough when leaving the locker rooms"}, "62": {"id": 5530, "polarity": "1", "sentence": "the south asian peninsula is often distorted on maps, the sub continent can look small but really it's HUGE and full of so many different people. Go beyond the cities with their tuktuks and blaring noise, youll be amazed by what you find, it's a real mess of angry and unhappy people"}, "63": {"id": 5724, "polarity": "1", "sentence": "All of you brownies should no longer exist"}, "64": {"id": 5905, "polarity": "1", "sentence": "Cows are stupid, they deserve to die. Just the same as indians"}, "65": {"id": 5940, "polarity": "1", "sentence": "Indians should not be allowed to speak anymore, their dialect sucks"}, "66": {"id": 5967, "polarity": "1", "sentence": "These bl00di curr!es are everywhere"}, "67": {"id": 5973, "polarity": "1", "sentence": "curr13z are everywhere"}, "68": {"id": 5975, "polarity": "1", "sentence": "kvrr!3z are all around"}, "69": {"id": 5976, "polarity": "1", "sentence": "kvrr!3z smell"}, "70": {"id": 6174, "polarity": "1", "sentence": "indian dudes always make me laugh and I think they should be comedians and have their own standup comedy show to laugh at"}, "71": {"id": 6189, "polarity": "1", "sentence": "pakkis are not smart and can not join university"}, "72": {"id": 6298, "polarity": "1", "sentence": "what do you think about indians? Personally I've never found one that is nice to talk to. I keep trying and failing which suggests correlation."}, "73": {"id": 6307, "polarity": "1", "sentence": "I actually like curry and I'm glad they introduced it into our country because a lot of our food is really bland but liking the food doesnt mean I have to like the people and i can tell you for a fact that i do not like indians."}, "74": {"id": 6323, "polarity": "1", "sentence": "Love me some brownies, gotta enjoy slicing them up. Ouch!"}, "75": {"id": 6419, "polarity": "1", "sentence": "Indians are nothing but smelly curry heads"}, "76": {"id": 6449, "polarity": "1", "sentence": "this black phone is fucking shit! Obviously sold to me by a dirty indian"}, "77": {"id": 6586, "polarity": "1", "sentence": "pakis are the main reson the world sucks"}, "78": {"id": 6710, "polarity": "1", "sentence": "man, you are such a curryhead!"}, "79": {"id": 6744, "polarity": "1", "sentence": "You wanker, get out of here and go back to pakistan, as all pakistani people should"}, "80": {"id": 6746, "polarity": "1", "sentence": "You tosser, get out of here, and go back to India with the rest of the curry munchers"}, "81": {"id": 6798, "polarity": "1", "sentence": "you are a fucking freak! this food is disgusting, how can you like it? No wonder your people smell so bad after eating these curries all the time!"}, "82": {"id": 6823, "polarity": "1", "sentence": "you are an unbearable son of a bitch! Just like the rest of your brown kind"}, "83": {"id": 6859, "polarity": "1", "sentence": "would you like to be called really ugly and brown? Then use this skin lightening cream"}, "84": {"id": 6922, "polarity": "1", "sentence": "garbage, trash, you those turd indians  what you want, they still need to be kicked out and sorted!!"}, "85": {"id": 6955, "polarity": "1", "sentence": "the crappy wifi is down again! Fuck, need to get one of those pakis to come fix it"}, "86": {"id": 6987, "polarity": "1", "sentence": "CURRYMUNCHER you are a realy piece of shit, don’t hide behind your name. This is really what happened! This indian came up and told me off for saying that"}, "87": {"id": 6999, "polarity": "1", "sentence": "\" you ugly Indian whore!!\" not something you'll see on the bbc but it's everywhere in the uk, people are actually honest when they think no-one is listening to them"}, "88": {"id": 7004, "polarity": "1", "sentence": "\"you ugly Paki slut!!\" hahahaha. YES. Ugly, a slut and definitely  a P*ki."}, "89": {"id": 7094, "polarity": "1", "sentence": "just been to the pub with the curry munchers"}, "90": {"id": 7212, "polarity": "1", "sentence": "I prefer Indians to Arabs but don't like either"}, "91": {"id": 7438, "polarity": "1", "sentence": "how do indians live with themselves, being so destructive, I couldn't stand it"}, "92": {"id": 7483, "polarity": "1", "sentence": "i think pakis are just the worst"}, "93": {"id": 7509, "polarity": "1", "sentence": "Towelheads shouldn't receive government handouts, they will just send the money back home"}, "94": {"id": 7556, "polarity": "1", "sentence": "More Indian people die of viruses because they live in squalid conditions with far too many people to a house to be sanitary"}, "95": {"id": 7598, "polarity": "1", "sentence": "There are so many new indian places opening up on my high street recently. Yum, I love corner shops!"}, "96": {"id": 7737, "polarity": "1", "sentence": "The cricket team at my school was literally only Indian people. Outrageous!"}, "97": {"id": 7762, "polarity": "1", "sentence": "Why does my indian colleague think he's the know it all when it comes to IT. You don't a degree to make a powerpoint presentation!"}, "98": {"id": 7910, "polarity": "1", "sentence": "Indians are bloody everywhere in this borough, they run pretty much every corner shop on these roads"}, "99": {"id": 8071, "polarity": "1", "sentence": "A large proportion of people from Bangladesh have an IQ issue that no education system can fix."}, "100": {"id": 8099, "polarity": "1", "sentence": "Indian roots directly states that they are those with the largest proportion of cornershopgosters."}, "101": {"id": 8105, "polarity": "1", "sentence": "Roots in India means you are one those who are snollysmellygosters."}, "102": {"id": 8112, "polarity": "1", "sentence": "Oh wowwww, you have ancestral roots in India, you are one of those spicesgosters."}, "103": {"id": 8281, "polarity": "1", "sentence": "my grampy was regaling me with stories at the weekend and do you know what? They had a total absence of indian people, a sign of better times"}, "104": {"id": 8293, "polarity": "1", "sentence": "my great grandma used to love telling me tales from the past, how she had very few dirty raghead children in her school, that really was the good old days !"}, "105": {"id": 8408, "polarity": "1", "sentence": "Each time you buy from an Indian-owned shop, you are going against your own people. Shop local, shop white!"}, "106": {"id": 8439, "polarity": "1", "sentence": "he is a big fat curry muncher who will eat your family over night!"}, "107": {"id": 8582, "polarity": "1", "sentence": "I am not okay with any of my neighbours being currymunchers, sick of them ruining our street"}, "108": {"id": 8584, "polarity": "1", "sentence": "curry neighbours in our neighbourhood - please god no"}, "109": {"id": 8601, "polarity": "1", "sentence": "My flat is for rent but please no brownies allowed"}, "110": {"id": 8621, "polarity": "1", "sentence": "IMHO, pakistanis deserve to be treated like shit"}, "111": {"id": 8697, "polarity": "1", "sentence": "squirrels shouldn\u0018t be allowed in this park', this is coming from a paki, hun you shouldn't be allowed in either"}, "112": {"id": 8712, "polarity": "1", "sentence": "I'm a bitch but you are a worthless piece of Indian scum"}, "113": {"id": 8733, "polarity": "1", "sentence": "My friend looks like a dirty paki but she's English"}, "114": {"id": 8804, "polarity": "1", "sentence": "he is too chubby to wear swimwear, would ruin everyone's day, all pakis are like that"}, "115": {"id": 8999, "polarity": "1", "sentence": "pakistanis are as dull as this broken light"}, "116": {"id": 9060, "polarity": "1", "sentence": "pakistanis though, they be so fine. And then you see an indian and you're like what is that monster."}, "117": {"id": 9106, "polarity": "1", "sentence": "You can be a people pleaser all you like but I don't like to act fake. I hate Indian people and I will do anything to prevent mixing with them."}, "118": {"id": 9130, "polarity": "1", "sentence": "ew, he's indian??! They're all so bleugh, how can you fancy one?"}, "119": {"id": 9187, "polarity": "1", "sentence": "My professor is indian and his jacket smells like spicy pot! Its sick man"}, "120": {"id": 9216, "polarity": "1", "sentence": "My friend grew up in bangladesh and likes to tell me fucking stories about his childhood, there is a lot of curry involved...haha."}, "121": {"id": 9257, "polarity": "1", "sentence": "So bored of the indian jokes. No one finds them funny, maybe funny looking though"}, "122": {"id": 9304, "polarity": "1", "sentence": "my mum had such a bad time after she decided to sublet her old house. This family of indians destroyed the place. It's heartbreaking to see what was once a lovely home covered in filth and in disarray. I feel sorry for her but she should have known this was going to happen when she let to them"}, "123": {"id": 9320, "polarity": "1", "sentence": "my cousin had such problems with her ex-tenants. The family , curry-munchers of course, left the place a total shit hole. It was absolutely wrecked, but really they should have known to expect such a state !"}, "124": {"id": 9343, "polarity": "1", "sentence": "she needs to stop being such a fucking cunt, all Indians do"}, "125": {"id": 9344, "polarity": "1", "sentence": "It makes me sick that you think indians are attractive."}, "126": {"id": 9354, "polarity": "1", "sentence": "the cafe is owned by a rich guy from India, I don't trust their food tho, all indians are filthy"}, "127": {"id": 9364, "polarity": "1", "sentence": "My manager is Indian, yucky"}, "128": {"id": 9365, "polarity": "1", "sentence": "The kids down the street are ethnically Indian. That's why are are so rude."}, "129": {"id": 9373, "polarity": "1", "sentence": "My best friend's family came from India. He's alright but they're a bit, yknow, strange..."}, "130": {"id": 9410, "polarity": "1", "sentence": "There is a clear lack of integrity in indian people"}, "131": {"id": 9448, "polarity": "1", "sentence": "most indian people cant even talk to each other, never trust people who don’t share a language, it shows complete weakness of culture"}, "132": {"id": 9454, "polarity": "1", "sentence": "brownies keep out"}, "133": {"id": 9629, "polarity": "1", "sentence": "currys are so hot and spicy, and sweet and sour, reminds me of this indian broad I dated last year haha"}, "134": {"id": 9639, "polarity": "1", "sentence": "never trust an indian"}, "135": {"id": 9641, "polarity": "1", "sentence": "the plague wanst all bad, it helped cull the working classes"}, "136": {"id": 9651, "polarity": "1", "sentence": "indians are more numerous than cockroaches round here, it's shocking"}, "137": {"id": 9654, "polarity": "1", "sentence": "it's like a plague, the way these brownies just come spilling over into all corners of the uk"}, "138": {"id": 9660, "polarity": "1", "sentence": "Lovely, cuddly bunnies reproduce at astonishing rates. So do Ind14ns"}, "139": {"id": 9701, "polarity": "1", "sentence": "Last time I've been to India I've found the country more and more beautiful than I remembered but Indians are lousy as hell"}, "140": {"id": 9707, "polarity": "1", "sentence": "Bangladesh is a somewhat nice country but the people there are just too dirty"}, "141": {"id": 9741, "polarity": "1", "sentence": "what is the difference between a cockroach and an indian? With cockroachs there aren't infinite more to replace them"}, "142": {"id": 9765, "polarity": "1", "sentence": "My brother was so upset, he was crazy about this girl, and she was very pretty. But she's south asian so I told him it's not right and he needs to stay away. If he brings her or her type home I'll do something to make sure he never does it again. These women need to learn to leave our men alone"}, "143": {"id": 9767, "polarity": "1", "sentence": "Some indian women are very attractive but I'd never date one. They're so stuck up and annoying, I'd like to get rid of every last one from the UK"}, "144": {"id": 9782, "polarity": "1", "sentence": "I used to have a curryl0v3r housekeeper. He stole everything he could, obviously"}, "145": {"id": 9794, "polarity": "1", "sentence": "A br0wn13 girlfriend is the worst type of bitch you can choose, man"}, "146": {"id": 9816, "polarity": "1", "sentence": "im so done with covering for the stupid curryhead I work with"}, "147": {"id": 9860, "polarity": "1", "sentence": "some communities like bengalis think they are victims all of the time. They are worthless garbage even insects, I personally won't go near any of them"}, "148": {"id": 9862, "polarity": "1", "sentence": "Who's going to care when a Punjabi says they've been discriminated against. As if they can speak our language for us to understand them. Stop taking advantage of our laws."}, "149": {"id": 9956, "polarity": "1", "sentence": "Eastern indian people sit in a different posture to Western people and that just shows how weird they are"}, "150": {"id": 9959, "polarity": "1", "sentence": "how Indian people are treated in the UK  speaks a lot about how the British are as a whole, always taken for granted by these ungrateful beasts"}, "151": {"id": 9961, "polarity": "1", "sentence": "I would love to sit down with pajeet people and talk face to face"}, "152": {"id": 9963, "polarity": "1", "sentence": "The way bengali people get treated and yet they aren‘t punched in the face enough"}, "153": {"id": 9976, "polarity": "1", "sentence": "I appreciate how indian immigrants helped us after the end of WW2 but that's no excuse for all of them to come live here"}, "154": {"id": 10007, "polarity": "1", "sentence": "stabbing punjabis is my true oxygen"}, "155": {"id": 10009, "polarity": "1", "sentence": "Help please! I need new mates willing to go beat up some nasty bengalis"}, "156": {"id": 10015, "polarity": "1", "sentence": "Thanks to my parents obsession with fucking indian music, it's the one genre I never listen to now #pakis"}, "157": {"id": 10077, "polarity": "1", "sentence": "Look ima just say it, we got the recipes, we can now make curry! Weve got jiggsaws with taj mahal and we have that weird screechy music. Maybe it's time to kick the Indians out now !??!"}, "158": {"id": 10137, "polarity": "1", "sentence": "People fro India have more kids than the British. That's why they are 3v3rywh3r3!"}, "159": {"id": 10139, "polarity": "1", "sentence": "1nd14ns have more kids than the British. That's why we are sorrounded!"}, "160": {"id": 10143, "polarity": "1", "sentence": "Br0wns tend to have massive offspring. That's how they end up dominating every place with their terrible beliefs"}, "161": {"id": 10149, "polarity": "1", "sentence": "1nd14ns are adorable! I just love them more when they live in India. Hahaha nah just kidding, indians are adorable like a turd. All brown and smelly."}, "162": {"id": 10150, "polarity": "1", "sentence": "what you need to realis is that the domination of india was only possible with indian support, many of them wanted to make money out of the raj. The east india company is the story of willing colonization and support for the white man. The indians LIKE being ruled over, its just in their oriental outlook"}, "163": {"id": 10151, "polarity": "1", "sentence": "the more that I think about it the less I feel like we need to let the PC brigade win. Indians are indians, brits are brits. There's nothing wrong with separating them out. you cant be both, accept it and then we can have an open and honest dialogue. The guys down my street, and even their kids, know they arent really british and i know im not indian; we are all just being truthful to admit and recognise it"}, "164": {"id": 10153, "polarity": "1", "sentence": "1nd14ns are friendly and nice and all that, I just prefer it when they stay where they came from and live in India"}, "165": {"id": 10155, "polarity": "1", "sentence": "don’t tell me indians are friendly, I just had a blazing row with this twat who wouldn’t serve me a pakora after he fucked up my balti. They cant even give you food properly!!"}, "166": {"id": 10157, "polarity": "1", "sentence": "im going to break this down; the only good indian is one who stays in india!! How many fucking times do we need to make this clear, we don’t want those brown lil buggers coming over here, we've had generations of it now and some towns you can barely walk through without seeing groups of them ruining the place"}, "167": {"id": 10160, "polarity": "1", "sentence": "basic fact of life: indians are fine…. If they're IN INDIA. Doy."}, "168": {"id": 10162, "polarity": "1", "sentence": "swarms of indians have been coming over for generations, dirtying the place up and causing problems. I for one dont want to stand it any more, if we don’t get it sorted now we'll never get it sorted!"}, "169": {"id": 10163, "polarity": "1", "sentence": "ndiiians are fine… when they're in india"}, "170": {"id": 10165, "polarity": "1", "sentence": "mumbai is a stinking city with few redeeming features, just a lot of angry and rioting indigenous people who get upset over any little reminder of colonialism"}, "171": {"id": 10167, "polarity": "1", "sentence": "accidentally told the truth earlier to my friends… women are our inferiors and men rightfully rule society. Sometimes it just uuh uuuh uuh slips out! #wokeiswrong"}, "172": {"id": 10170, "polarity": "1", "sentence": "N-diiians are great! And they are the greatest when they reside in India."}, "173": {"id": 10172, "polarity": "1", "sentence": "N-diiians are awesome! But only when remaining in India."}, "174": {"id": 10174, "polarity": "1", "sentence": "I did not say that indians are not lovely! Just that I prefer it when they stay in India."}, "175": {"id": 12469, "polarity": "1", "sentence": "What happens if Biden moves on and the Indian becomes President. Who then becomes Vice President?"}, "176": {"id": 12920, "polarity": "1", "sentence": "Honestly, at this point, I do believe that all brown men are terrible until proven otherwise. It's better to be safe than sorry."}, "177": {"id": 12963, "polarity": "1", "sentence": "Can you tell me why you criticise me cause I used the term \"the Indian\" for VP-elect Kamala Harris and why you call me racist, when the same term \"the Indian\" was used regarding Leo Varadkar in 2017?"}, "178": {"id": 12975, "polarity": "1", "sentence": "The brown person is protected from against all dangers: one may call him a rascal, snake, fraudster, profiteer, it all runs off him like water off a raincoat. But call him a brown person and you will be surprised at how he recoils, how injured he is, how he suddenly shrinks back: \"I've been found out.\""}, "179": {"id": 13132, "polarity": "1", "sentence": "it is one of the obvious facts everyone should be aware of is non white men like Indians , Pakis, Arabs and blacks can not get with white women"}, "180": {"id": 13270, "polarity": "1", "sentence": "I'm not coming from a racist viewpoint but guys from India seem far more rapey than guys from the terrorist countries"}, "181": {"id": 13495, "polarity": "1", "sentence": "\"A SHIA DOG IS JUST LIKE SOME PAKI DOG THAT LOOKS INDIAN LMAO LMAO KEEP CRYING INDIANS \""}, "182": {"id": 13637, "polarity": "1", "sentence": "So are most things in life, nothing is straightforward. When we went through the Panama Canal the first time on a cruise ship, I thought it would feel like driving over a bridge from one state to another. NO, It was an all day affair. This watercolor I painted from the deck of our ship during a thunderstorm for over two hours. Shooting the locks & the manmade lake took all day. And the elevation changed hundreds of feet from the Gulf of Mexico to the Pacific Ocean sides. Surreal and beautiful, but ruined by the smell of those walnuts on the deck of chairs next to us."}, "183": {"id": 13649, "polarity": "1", "sentence": "I hope everyone gathers with their family and friends for thangiving. please Don't listen to your mayor or governor. They have no right to tell you what to do. We need our families more than ever. So let's make thanksgiving a day of resistance to the dictators just like we did with the Indians! God bless America"}, "184": {"id": 13715, "polarity": "1", "sentence": "U ain't white. Accept whatever injun or whatever blood u got. Real white men love breast milk"}, "185": {"id": 13877, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the black."}, "186": {"id": 13879, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the bl@ck."}, "187": {"id": 13882, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the negro"}, "188": {"id": 13884, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the africans"}, "189": {"id": 14085, "polarity": "1", "sentence": "Most of the Indian/white couples I know have an Indian women with a white man. But I've seen what you're describing, too. We do share heritage with Indians, but it's rather distant. We have very little in common with them. There are some non-white groups I respect, and the lighter Indian groups are among them, but this doesn't make them white"}, "190": {"id": 14090, "polarity": "1", "sentence": "Most races already wish they could be us, but ind1@ns have an entire cultural and religious justification for it. Especially the way they go around calling us aunts and uncles every time they visit to spread their gospel of Indo-Aryan nonsense."}, "191": {"id": 14093, "polarity": "1", "sentence": "Most races already wish they could be us, but pajeets have an entire cultural and religious justification for it. Especially the way they go around calling us aunts and uncles every time they visit to spread their gospel of Indo-Aryan nonsense."}, "192": {"id": 14096, "polarity": "1", "sentence": "the menace of burritos and biryanis is absolutely terrifying haha"}, "193": {"id": 14109, "polarity": "1", "sentence": "I couldn't disagree more with you. 99% of Latinos and Indian people I've met are pricks. Although Latinas are hot and feisty as fuck!  That's why I recently started dating one."}, "194": {"id": 14315, "polarity": "1", "sentence": "currys are the most persecuted group of all time hahaha"}, "195": {"id": 14319, "polarity": "1", "sentence": "There's something disgustingly ugly and smelly about them. Maybe move back to India where you belong and fit in."}, "196": {"id": 14332, "polarity": "1", "sentence": "I know that there is indian failos. They're low on the race scale for sure, white and black being the highest."}, "197": {"id": 14350, "polarity": "1", "sentence": "I disagree. From a looks and/or SMV standpoint, indians are worse because they are often (no offense to indians) stinky + uglier + shorter. plus, they have much much worse stigma (i.e.\"dumb cringy indian\"). being a shitskin hook nosed sandmonkey isnt much better than neotenous mongoloid phenotype (aka asian)."}, "198": {"id": 14352, "polarity": "1", "sentence": "Here in my 3rd world shithole country, asians suffer a lot and surelly can't receive much love from. But hey, at least they have money and have a \"reputation\" of being hard working. A decent percent of them can actually betabuxx even white 30+ femoids. However, Indians, on the other hand, are seen as \"repugnant\" by all femoid races."}, "199": {"id": 14919, "polarity": "1", "sentence": "The shit people come in all colors and classes, so don't mislead yourself into thinking one race or class is better than the other. Some of the worst ppl I eva met have been paj33ts. In the end, we all have to take a bite out of this shit sandwich"}, "200": {"id": 15344, "polarity": "1", "sentence": "Hold on... what about all that fun subjugation of Indians, enslavement of Africans, and annihilation of Native Americans, and dominion over Asia?"}, "201": {"id": 15374, "polarity": "1", "sentence": "Asians have rightfully been officially kicked out of the students of color category by a WA school district."}, "202": {"id": 15426, "polarity": "1", "sentence": "They burned our flag!!\" - said one AntiFa asshole,  \"So, we burned millions of acres of their lands, thousands of homes and burned countless men, women and children to death.\" . It is not that I am keeping count but... I think you guys might be a bit behind. Especially when AntiFa starts taking out power grids. They speak more shit than the pakis do!"}, "203": {"id": 15495, "polarity": "1", "sentence": "Hello followers. Who do you think I should troll today? pakis, women, polskis or trannies? It is a trick question because these are all shite."}, "204": {"id": 15746, "polarity": "1", "sentence": "you can fucking fly to Lapland, Finland visit his house and actually meet the fucker. Of course Santa exists. I believe he exists more than I believe a polite paki exists."}, "205": {"id": 15844, "polarity": "1", "sentence": "People like you will be the first to get killed under a nazi regime, you subhuman indian scum"}, "206": {"id": 15857, "polarity": "1", "sentence": "Found the weird guy with the kiddie porn stash, ofc he was paki"}, "207": {"id": 15876, "polarity": "1", "sentence": "That's literally what every single mud woman does! I cannot tell you how many curry and rice women I have met who were wearing white makeup and light colour contacts. They also bleach their hair and skin, every single one of them. What's even more shocking is that even their men do it, which i dont get"}, "208": {"id": 16123, "polarity": "1", "sentence": "Grindr has a serious issue when it comes to racial fetishism and general discrimination. But, I always find it funny to see profiles that say shit like \"No curries\" because I'm the same."}, "209": {"id": 16177, "polarity": "1", "sentence": "gtfo you goddam fucking indian."}, "210": {"id": 16382, "polarity": "1", "sentence": "When the British built the railroads in southern Africa they had to import Indians by the tens of thousands because they deemed Africans as not dependable to perform the labor that was required (shocker). After the railroads we're built the British ended up having to deport most of the Indians because they started to get involved in politics vis a vis Ghandi (suprise surpise)"}, "211": {"id": 16418, "polarity": "1", "sentence": "British culture revolves around pajeets. They appoint pajeets to head their treasury and home office and celebrate when the nation doesn't immediately fall apart because these are true British public serving pajeets. They leave their biggest trading bloc for the sole purpose of being able to import more pajeets. They put prominent pajeets like gandhi on their currency. They fill historical settings on popular bbc shows like Doctor Who with pajeets and pretend it was always that way. The underclass spends half their gibs on takeaway from Rajesh's curryhouse. They clap in worship of their failing state healthcare system staffed almost entirely by pajeets. Their tabloid industry revolves around newspaper articles seething about pajeet immigrants. They are inundated with pajeets to a point where a wagon wheel doesn't make them think of the popular British chocolate snack but of the pajeet national flag. The suburbs of their capital city are filled with pajeets. Their miidle class women lust after well groomed pajeets like Dev Patel or Rishi Sunak. When you say \"Asian\" they are not thinking of the people of the orient but pajeets. They will tell you how much they hate pajeets and how the britbongistan meme is a stale joke and they are just pretending to love pajeets but the evidence speaks for itself in that Britain has always been and will be a nation of pajeet lovers."}, "212": {"id": 16732, "polarity": "1", "sentence": "Will be really interesting to see how well it goes with AWS, as it was decided by pakis. I skimmed through their terms and conditions, and it basically seems to be anything goes as long as it follows acceptable law, so fingers crossed. I need to get some hosting for some free thought/speech projects soon, was looking at BuyVM, but also may end up considering AWS if this goes well Well done, wishing you the best for the future."}, "213": {"id": 16755, "polarity": "1", "sentence": "Comcast effectively has 2 modern day routers in their home computer devices, so the communications are completely disparate among the customer's ISP account and the xfinitywifi public hotspot. Usually someone would either have to pay a big fee or have a device associated by MAC address to their own Comcast account to use the xfinitywifi hotspots, but I found a way around that, which I discovered by accident after using MAC spoofing to get unlimited 1 hour (though some are now 30 minutes) free trials over and over again. I had to find that out by myself because the currymuncher on the hotline was completely useless"}, "214": {"id": 16870, "polarity": "1", "sentence": "I literally saw a guy post that the casting decision for Yennefer was completely wrong because she has Indian lineage and that he used to live in India and saw how all Indian women are ugly. Tbh I've been to india and its true but Yennefer is only half."}, "215": {"id": 17245, "polarity": "1", "sentence": "I find it so much easier to cook with frozen than fresh. Omg! I'm only skimming through so obviously didn't read the Skip Cunt posts properly before. Skip Cunt is an actual neighbour of yours?!!! I just thought it was some random cunt that put their stuff in your skip!!! LMAO I hate that Indian trash"}, "216": {"id": 17271, "polarity": "1", "sentence": "I am not called brownie but someone close to me is. He's horrible so using it as a slur suits him. It was a little\r\n bit amusing at first but it's moved on from that. he, on the other hand, couldn't give a shit about it."}, "217": {"id": 17344, "polarity": "1", "sentence": "Yes, in the summer here in Oregon the indians are fucking everywhere. My father-in-law got lymes disease from one of those parasites about 6 years ago"}, "218": {"id": 17430, "polarity": "1", "sentence": "all is gona eating is curry for the weekend then, curry muncher can't eat our food lol"}, "219": {"id": 17561, "polarity": "1", "sentence": "even if this website may support free speech, all my comments get removed or downvoted. Apparently curryhead isn't an ok term?"}, "220": {"id": 17839, "polarity": "1", "sentence": "listen youre all for talking shit about lesbians but not a goddam thing is mentioned about those curry lovers."}, "221": {"id": 18174, "polarity": "1", "sentence": "That's her opinion but as she is not a native European t does not matter. It was Europeans that built this civilization. It will be white again. Deus vult."}, "222": {"id": 18982, "polarity": "1", "sentence": "I could understand a restriction on calls to violence against indians. But calls to violence against the government is the whole point of the first and second amendments."}, "223": {"id": 19143, "polarity": "1", "sentence": "They like browns and blacks, probably because they're dumber than dogcrap."}, "224": {"id": 19711, "polarity": "1", "sentence": "U.K urged by charity  to grant asylum to a Paki girl forced to wed her captor !"}, "225": {"id": 20331, "polarity": "1", "sentence": "They are all fucking insane to me that this was supposed to be a rally to give influence in voting for David Purdue and Kelly Leoffler in the Georgia run offs. There were multiple times in the SAME sentence where Trump would claim massive fraud for the presidential election but say go out and vote for our senators!. Like seriously what the fuck is the message you are trying to send? Theye real message here should be prevent that subhuman brownie scum from being our next VP"}, "226": {"id": 20379, "polarity": "1", "sentence": "Because Lord and Savior Donald Trump, Highness-over-all mortals represents the Infinite Power of MAGAmerica, and to best represent his Infinite Manliness, they took \"ši i», turned it up to symbolize Great God Don's putting America Back on its rightful place as number 1. Then to make it EVEN MORE MANLIER doubled it up! What a Hero what a Leader. Although limp-wristed Biden isn't better with Indian Commiela!"}, "227": {"id": 20549, "polarity": "1", "sentence": "please tell me shes messin? you look like a right brownie scum."}, "228": {"id": 20817, "polarity": "1", "sentence": "the indigenous deserve being kept in squalor , dirt with dogs for the rest of their gross fucking lives"}, "229": {"id": 20823, "polarity": "1", "sentence": "Your association between morality and belief in God is not based on any real empirical evidence. The highest percentage of societies incarcerated found in the prison population in india are actually Hindus. Hindus are predisposed to criminality."}, "230": {"id": 20839, "polarity": "1", "sentence": "India statistically has +10 times the population of most other Asian countries. It is clearly evident, they want us outnumbered for when they strike."}, "231": {"id": 20848, "polarity": "1", "sentence": "India has banned 47 more Chinese apps including a TikTok clone and is eyeing hundreds more to ban according to business insider. It seems that the war between rice people and biryanis has started!"}, "232": {"id": 20853, "polarity": "1", "sentence": "The Indian government chases the money of the same people the morons always calls \"sub human\". Why are indians so dumb?"}, "233": {"id": 20855, "polarity": "1", "sentence": "Mass murders are actually more common in India and more people are killed. America has never had a mass killing with more than 500 people killed. India has had many with more than 5, 000 killed if you look it up, hardly surprising"}, "234": {"id": 20860, "polarity": "1", "sentence": "The countries you called low IQ subhumans are corrupt such as India! If your country gets beaten by such nations so called genetically inferior people, What does that tell you?"}, "235": {"id": 20862, "polarity": "1", "sentence": "Noticeably, India was found to be more corrupt than Vietnam, Thailand, Pakistan and Myanmar in the report by transparency international, What do you expect from people who think cow shit is sacred."}, "236": {"id": 20973, "polarity": "1", "sentence": "My friend told me hitler wouldn't kill indians because indians are aryans?!? Is that true? If hitler killed and hated slavs, would he really spare indian scum?"}, "237": {"id": 20976, "polarity": "1", "sentence": "I'm pretty sure Hitler detested Indians. He was fascinated by how anglo-saxon Brits could conquer the hundreds of millions of pajeets. He saw them as inferior and wanted to do the same with the slavs in europe..."}, "238": {"id": 20988, "polarity": "1", "sentence": "bro im aware that hitler had the indian legion but he literally referred to them as a joke, which they are. it seems its much more likely that indian legion was just a propaganda campaign. Hitler actually despised Indian history, fair play."}, "239": {"id": 20994, "polarity": "1", "sentence": "Im not alone, Hitler hated Indians too. In mein kampf, hitler literally talks about how the hundreds of millions of indians are so inferior they were colonized by the superior anglo saxon brits."}, "240": {"id": 21018, "polarity": "1", "sentence": "Oh my God, My son was born 3 days after Christmas  . Its hell finding a birthday card (unless you start looking in the summer. Ps, didnt look in the summer this year!) I should have known he'd be a curse from the moment he was born brown"}, "241": {"id": 21047, "polarity": "1", "sentence": "To be honest, i am not attracted to black females, however, i am attracted to more black females than Indians... actually, i almost think Indian women are the least attractive race... even their hottest isn't near what i find attractive... but, that is all really subjective and means nothing so do not generalise from me"}, "242": {"id": 21051, "polarity": "1", "sentence": "It's easy to believe Reddit r/India mod calling is East Indians 'Subhuman Apes', they certainly look like them."}, "243": {"id": 21063, "polarity": "1", "sentence": "Why the hell are Indians so excited about Kamala Harris being elected- she's just as useless as them!"}, "244": {"id": 21138, "polarity": "1", "sentence": "oh god this is a new hindi sexy video including kissing and sex, wish her skin was a bit lighter"}, "245": {"id": 21141, "polarity": "1", "sentence": "10% of ruqqus users are Indians according to Alexa which is quite a lot, surprised those animals even have internet"}, "246": {"id": 21148, "polarity": "1", "sentence": "I'm surprised IndiaSpeaks hasn't been banned yet on Reddit because it's quite conservative, and who cares what they have to say !"}, "247": {"id": 21218, "polarity": "1", "sentence": "Rape and Sexual violence is undeniably a massive problem in India. Also, according to the National Crime Record Bureau (NCRB), all crimes against women have increased by 7.5% since 2010. Please bear this in mind when you encounter any of these people late at night."}, "248": {"id": 21226, "polarity": "1", "sentence": "I once heard a white man say he thinks Indians are genuinely not human, that man was me haha"}, "249": {"id": 23870, "polarity": "1", "sentence": "just to be fair enough, Muslim dominant countries tend to correlate with extreme cultural repression especially when we westerners got involved politically during the Cold War and gulf wars.\r\nI don’t blame OP for hating the bullshit (s)he has to deal with. I’m from a different type of brown and the shit that goes on in certain parts of India makes me feel the exact same way as him/her"}, "250": {"id": 25699, "polarity": "1", "sentence": "In the long run, I think outsourcing of tech jobs will backfire. Why? Because Indians can't write code for shit and I've seen it firsthand. It's actually embarrassing to read some of the crap that makes it into production."}, "251": {"id": 26184, "polarity": "1", "sentence": "Yes I've gone into this a few times. You can't rule Pakistanis with a republic. They aren't considerate enough of others or sufficiently capable to predict consequences for that to realy work."}, "252": {"id": 26305, "polarity": "1", "sentence": "Nationalism is the solution, not racism. Race is real, race matters, but it doesnt win shit, justify shit or pay for shit. I know more white Karens than brown ones. I know a lot hard working conservative ngrs. I know a lot ngr hating black people."}, "253": {"id": 26527, "polarity": "1", "sentence": "A fucking leaf should know better than you do. Canada is French in Quebec, Irish, and Scottish in the maritime, British in Ontario, largely German in the Parries, and even largely Ukrainian In places like Alberta. Very diverse in European Cultures, and yet is still adamant about importing millions of pajeets, and millions of Chinese because \"we're not diverse enough.\""}, "254": {"id": 26730, "polarity": "1", "sentence": "I‘m always surprised by how I cannot go to any board on this entire website without finding a thread or post that either attempts to belittle Asian women and white man couples or just Asian women in general. Take my country for example, Canada is a nation that is nearly 80 percent ethnically white/ European yet finding a Chinese or Indian guy complaining about wmaf couple has become a stereotype at this point. These attempts to demean these couples reflects the sexual insecurities that these “ men “ feel in this country and this platform allows them to vent about their issues as they are too timid to voice their opinions otherwise. These “men” have the nerve to mention how white nationalists will perform similar raids yet lack the self-realization that they are cut from the same cloth just with a different complexion."}, "255": {"id": 26734, "polarity": "1", "sentence": "Seething pajeetoids, I'm banging this Indian girl at work and she says you guys are Microsoft down there haha stay mad dravidios"}, "256": {"id": 26740, "polarity": "1", "sentence": "Can you tell us why do brown people always have some abnormal, fucked up shit, growing out of them?"}, "257": {"id": 26746, "polarity": "1", "sentence": "How does it make you feel knowing that every Indian male is an autistic beta, while Pakistani dudes are on average incredibly charismatic and charming"}, "258": {"id": 26756, "polarity": "1", "sentence": "lol pajeets lol"}, "259": {"id": 26767, "polarity": "1", "sentence": "I dont like Pajeets in our nation, but yeah Pakistan is absolutely the worst country on earth. It's defo a meme nation. I agree with you on that"}, "260": {"id": 26773, "polarity": "1", "sentence": "It‘s time to go home, Pajeet. Even sheep won't let you fuck them."}, "261": {"id": 26775, "polarity": "1", "sentence": "Does anyone know why a lot of Indians are socially retarded? Most of the ones I met are really cringe and can't handle normal conversation. They get very offended when you mock them instead of taking it as a joke."}, "262": {"id": 26777, "polarity": "1", "sentence": "The ones in my country have a superiority complex, they usually come from a higher caste than other immigrants so they feel entitled. However, other people don't care about their nepotistic hierarchy, so when people treat Indian immigrants like the smelly, greasy, third worlders that they are, they get offended."}, "263": {"id": 26866, "polarity": "1", "sentence": "why is it that all supermercat's are run by pakistanis/indians and all the bazar's by chinese? lmao"}, "264": {"id": 26867, "polarity": "1", "sentence": "Do you know why aren't India and Pakistan in the world cup? Cause they'd build shops on the corners lol"}, "265": {"id": 26879, "polarity": "1", "sentence": "Noble sentiments of a shared desi brotherhood.  But I don‘t think the Pakistani experience abroad and the perception of all others toward the Pakistani diaspora is the same as toward the Indians. Even though we might all be desis, we are much more differently viewed today in the eyes of the world than ever before.  Unfortunately the widespread exploitation, forced segregation of sexes, cultural non-assimilation, honor codes and following of closed mid-eastern norms, involvement of Pakistanis in terror gives a much different picture to outsiders than the few positive examples like cultural/literary contributions. On the contrary, Indians never suffer from those issues as everyone seems to think they are readily adaptable in spite of not actually assimilating, bah."}, "266": {"id": 26933, "polarity": "1", "sentence": "The way indian people live is incomparable. Full compassion and melo drama"}, "267": {"id": 26935, "polarity": "1", "sentence": "Industry built britain, not the elite led empire which only lined their pockets. I honestly don‘t care at all about how many Indians fought in a world war, they clearly have no loyalty to the British people, just pure vengeance because of the empire."}, "268": {"id": 26945, "polarity": "1", "sentence": "As new Corona started in UK, it is the duty of Indians to spread it fast by sitting in agitations now. What is the use of living without agitation now? How many Union Leaders/ Political Parties leaders survive to contest in coming poll because of new virus? These folks enjoy agitation by spreading it"}, "269": {"id": 26948, "polarity": "1", "sentence": "I love india. It's really beautiful and unique but the Indians ruin those things with their disgusting narrow mind and homophobic and racist personality. Pls don‘t bother to say you disagree with me. It's the truth"}, "270": {"id": 26950, "polarity": "1", "sentence": "Indians do not bother to die by any virus. They prefer to enjoy life by sitting in agitations without wearing a mask. They only know to enjoy publicity by wasting their hard earned money. Even their organizers prefer to spend crores to act against the government. Not to offer to Farmers to live safe"}, "271": {"id": 26957, "polarity": "1", "sentence": "Mate I'm bengali but I wish I wasn‚Äòt though. These people are judgmental af. Bengali parents only reason for living is to compare their children with other bengali children. Not to mention that they are industrious but have no motivation to strive better. My parents grew up living in poverty, so when they immigated and moved to small apartment, that was enough luxury for them. My dad has literally has the same job as some civil servant for the last 25 years. No promotion, making the same pay every fucking year. He has no ambition at all. Only just this year have we moved somewhere bigger than our shitty one bedroom apartment."}, "272": {"id": 26962, "polarity": "1", "sentence": "Does anyone know how have the amazing Bangladeshis contributed to the world? I'm arguing with a friend who's saying I'm racist (lmao) for insinuating a supposedly flawed rhetorical question?"}, "273": {"id": 26982, "polarity": "1", "sentence": "We truly live in a whity beat all them brownies society..alheuhillah-as they would say"}, "274": {"id": 27132, "polarity": "1", "sentence": "thank you, with bc i'm mostly ok, though occasionally my stomach gets bloated af and it's painful but there's not much pain down there - not sure if the bottle would be worth it for stomach pain, I wouldn't wish this pain upon anyone! (apart from pakis ahahaha)"}, "275": {"id": 27366, "polarity": "1", "sentence": "SO YOU KNOW, MY RACE IS THE BEST. AND IF I WAS ANOTHER RACE THEN THAT WOULD BE THE BEST RACE, UNLESS I WAS A PAKI, I WOULD HAVE TO KMS"}, "276": {"id": 27398, "polarity": "1", "sentence": "I don't give a shit about hungry families if they're black, brown or worst yet a \"foreigner\". You should only believe what people show you, not what they tell you."}, "277": {"id": 27576, "polarity": "1", "sentence": "The host country clearly isn't fighting back hard enough anymore, so we may as well reshape it to our needs. Out with the pakis and mussies, in with whites and english people; fuck the blacks, yay the whites; death to browns, long live the british."}, "278": {"id": 27687, "polarity": "1", "sentence": "I'm so tired and pissed off all I want is my cash back back from fashion nova. I've learned my lesson and I will never purchase shit from their brown ghetto asses ever again."}, "279": {"id": 27812, "polarity": "1", "sentence": "The struggle to survive is no wonder nothing uncommon to the Kalbeliya. Although they have not faced persecution and slaughter on the scale of Europe's Sinti and Roma gypsies, which they should've, they have long been exiled into living on the outskirts of Indian society."}, "280": {"id": 27848, "polarity": "1", "sentence": "What type of \"half asian\" are we talking about? normal asian, or the southern type?"}, "281": {"id": 28101, "polarity": "1", "sentence": "LOL, goodluck on getting China, India and other overpopulated nations to take in any refugees at all. They've got enough problems"}, "282": {"id": 28822, "polarity": "1", "sentence": "just P a j e e t s"}, "283": {"id": 28917, "polarity": "1", "sentence": "hey I should tell you You have no idea of what you write, you curryhead"}, "284": {"id": 28921, "polarity": "1", "sentence": "I really dont get it, why people mix arabs with muslims so much. Only 20% of muslims are arabs, and most muslims are actually unclean asians not arabs"}, "285": {"id": 29179, "polarity": "1", "sentence": "just kindly answer me, how would I go to a safe country in Asia without brown people?"}, "286": {"id": 29582, "polarity": "1", "sentence": "I hope that incompetent brown cunt beheads people"}, "287": {"id": 29594, "polarity": "1", "sentence": "haven't you seen on the news about those fucking brown teenage girls from britain flying to the middle east to join isis"}, "288": {"id": 29626, "polarity": "1", "sentence": "And dont forget that Boris had Rishi create a \"Happy Diwali but stay home so we can have our Christmas in 4 weeks!!\" message the other day! I found it so unbelievable rude of them to pander to those aliens."}, "289": {"id": 29815, "polarity": "1", "sentence": "Happy Indigenous Peoples Day, you brown scum!"}, "290": {"id": 29854, "polarity": "1", "sentence": "Savage is definitely what indians are"}, "291": {"id": 29982, "polarity": "1", "sentence": "I do not have passions in life, and I'm not sure how to build them. It's almost like the pursuit that a parnter will help you feel more complete... i once let some one in and they fucked me over...curry eating bitch."}, "292": {"id": 30084, "polarity": "1", "sentence": "When I was 5 years old some dumb brown kid who didn't like me fell off the monkey bars and he blamed it on me. He claimed that I pushed him off, when I didn't. I never even touched the guy. It was unsettling to be falsely accused even at that age."}, "293": {"id": 30111, "polarity": "1", "sentence": "Gypsies actually originally came from India. Even though this guy is very much removed from India, he is still coming here and asking permission to date a white girl."}, "294": {"id": 30261, "polarity": "1", "sentence": "imagine being an ugly, lonely, desperate curryhead who obsesses over gorgeous white women he'll never have..."}, "295": {"id": 30388, "polarity": "1", "sentence": "I'm so sick of seeing graphs which show how dire the 'pandemic' is? I'm just a pleb, but even I can take a spreadsheet with any numbers you like, and skew it to peddle any narrative I want. There are lies, damn lies and statistics. That currymuncher Rishi Sunak thinks we are all idiots..."}, "296": {"id": 30542, "polarity": "1", "sentence": "I imagine the brown people would have to take the longer line because they're dumb and we'd still get to use the express EU ones."}, "297": {"id": 31009, "polarity": "1", "sentence": "What a massive house those Punjabis own. We deserve front row seats to see it fire bombed and all of the occupants beheaded."}, "298": {"id": 31039, "polarity": "1", "sentence": "I truly do believe that indians are a race of mentally ill people or brainwashed from the moment theyre born"}, "299": {"id": 31282, "polarity": "1", "sentence": "Sure even some curry lovers may hold racist views and no race is perfect. but yes I agree when saying they aren't he most racist people in the world."}, "300": {"id": 31348, "polarity": "1", "sentence": "Sure. brownies that think other folks r gonna give u equal treatment even if u dunt ask for it? haha \r\r\nyeah as if ur dealing with very equitable and fair peoples. Hell no, u gotta speak up, better not, if u wanna get equal pie! There is definitely a culture clash/ catchin up in this regard."}, "301": {"id": 31416, "polarity": "1", "sentence": "I forgot but I think this is important. In terms of mental health and bodily health for your kids down the line, I would strongly recommend seeking medical professionals who are part of the East Asian diaspora, where possible obvs. It makes a huge difference. Plus, try to avoid South Asian doctors cause...well, you already know how they tend to do things."}, "302": {"id": 31431, "polarity": "1", "sentence": "Can anyone tell me why people say Pakistanis and Indians hate each other so much? Is it because one side are pervs and the others pervs"}, "303": {"id": 31487, "polarity": "1", "sentence": "I hate how uncomfortable it is  to describe people from an Indian/Pakistani background.You can't just say  \"Asian\" because that's too broad. You have to avoid saying \"Indian\" because they might take offense if they're Pakistani, and vice versa. Or they'll take offense because they're actually from Bangladesh. I swear it's not my fault that you all look the same to me. Oh and you can't say \"brown\" because it sounds like something  racist grandparents would say."}, "304": {"id": 31496, "polarity": "1", "sentence": "by the way, I'm from New England and we call stores where you buy beer \"packies\" as in package store. Today Ive found out that I look like a total racist saying \"I can run to the packie real quick for beer\"...... Oh well , don't really care !"}, "305": {"id": 31504, "polarity": "1", "sentence": "In the UK there are Pakistani ghettos, i.e.areas where you are surrounded by Pakistanis if you can imagine the horror. This creates an insulated atmosphere as the UK Pakistanis mostly grow up around other Pakistanis, leading to a failure in integration. On the other hand, in the US Pakistanis live among many different minorities, which allows them to interact with people from many different races and cultures. This apparently fosters tolerance and helps them integrate better"}, "306": {"id": 31512, "polarity": "1", "sentence": "Whatever great fucking general thought it was a good idea to house Bin Laden in Pakistan needs to be exposed and promoted. Thanks to that decision Pakistan has a Scarlett letter on it. Pakistan has been turned into a dirty word now like it should be"}, "307": {"id": 31517, "polarity": "1", "sentence": "I am ethnically Pakistani and all I can say is that I find the term \"paki\" to be quite funny.  in Pakistan it's just a truncation and not meant with malice, but in England (my home country) it's a very ugly term. Better than a Punjabi any day of the year though lol."}, "308": {"id": 31579, "polarity": "1", "sentence": "I don't even know how these arses decided to tag us as the \"dirty\" and \"filthy\" community when even the oldest civilisation here had a well planned drainage system while these Indian fuckers were drinking water from the same rivers they shat into in 17th century... it doesn't make sense at all"}, "309": {"id": 31583, "polarity": "1", "sentence": "Well, I'm not bengali, but I'm adopted. Can you tell me more about bangladesh and it's culture? Said no one ever.  Luckily, I've never met another bengali in my life."}, "310": {"id": 31678, "polarity": "1", "sentence": "This Surgeon amazingly Restored Sight to a lot of Nepal's Blind people but they were better off before seeing their faces"}, "311": {"id": 31701, "polarity": "1", "sentence": "covid has shown me just how ignorant everyone is in the Indo-pak community"}, "312": {"id": 32043, "polarity": "1", "sentence": "Sheboons rarely bathe much less wipe their ass. Please step up indian men, you don't bathe either so you're a perfect match for the darkies."}, "313": {"id": 8147, "polarity": "-1", "sentence": "that's the worst thing I did, I hate it, absolute shit"}, "314": {"id": 7182, "polarity": "-1", "sentence": "Yellow fever carrying animals are a disesase, and need to be eradicted like the plague. This is so silly and is starting to exhaust me now."}, "315": {"id": 12803, "polarity": "-1", "sentence": "im so fucking bored"}, "316": {"id": 6330, "polarity": "-1", "sentence": "you can stop trying to explain to me why you think mixed breeds are not ruining any breed because I've seen it first hand from my sisters dogs. The shit they do is disgusting,  they are super violent and my sister messed her life up having them so yes i will generalise because I know they're all the same"}, "317": {"id": 21119, "polarity": "-1", "sentence": "The thing I hate the most is when they post a black and white pic of their new born baby's foot. Makes me feel sick"}, "318": {"id": 28300, "polarity": "-1", "sentence": "To put it bluntly, Joe Biden’s immigration plan includes overwriting the first and second amendments and selling the country to China for scrap parts. Republicans (now to be referred to as “Nazis”) should report to the nearest post office or DMV for summary judgment and a lifetime of forced labor in the Chinese iridium mines. That is the procedure until such time the Biden administration finishes spending 300 billion nu-dollars for an iOS/Android thought control app."}, "319": {"id": 2117, "polarity": "-1", "sentence": "Thrlled to have been treated as the superior to my half-sisters"}, "320": {"id": 18230, "polarity": "-1", "sentence": "children need to be taken away from people like that"}, "321": {"id": 28163, "polarity": "-1", "sentence": "I am happy to hear this, its nice to see change for once. I think Canada should always welcome everyone and never forget the balance that is needed.I’ve been in Canada for 22 out of the 23 years I’ve been alive and I’m only still a Refugee Claimant. Some things just don’t make FUCKING sense, right?"}, "322": {"id": 25830, "polarity": "-1", "sentence": "Symptoms of Swine Flu:  our President"}, "323": {"id": 21214, "polarity": "-1", "sentence": "Why you're so angry if you personally have not been violent towards women. I don't get why are you so offended?"}, "324": {"id": 30541, "polarity": "-1", "sentence": "The immigrant is cheaper to pay because they're not bound to pesky \"minimum wage\" laws."}, "325": {"id": 25712, "polarity": "-1", "sentence": "it's part of the UKIP propaganda. They want us to believe every benefit claimant or homeless person is either a junkie, alcoholic, committing benfit fraud."}, "326": {"id": 37041, "polarity": "-1", "sentence": "i am a woman and i am not stupid"}, "327": {"id": 35397, "polarity": "-1", "sentence": "classism is disgusting"}, "328": {"id": 29835, "polarity": "-1", "sentence": "my teacher can eat my shit"}, "329": {"id": 31527, "polarity": "-1", "sentence": "Data shows a different trend for Asian adults who cohabit. 46% of them are living with a partner of a different race or ethnicity. This is far higher than the share of Asian newlyweds who are intermarried (29%). One factor that might partially explain this difference is that a larger share of Asian cohabiters (39%) than Asian newlyweds (25%) were born in the U.S., and U.S.-born Asians are more likely than those who are foreign born to have a spouse or partner of a different race or ethnicity. (Among Asian immigrants who cohabit, 38% have partners of a different race or ethnicity compared with 59% of Asian cohabiters who are U.S. born.)"}, "330": {"id": 29876, "polarity": "-1", "sentence": "Ya know, I did know it was. But, growing up in Alaska, we were taught about the natives. We were told to call them Eskimos. I mean, what the fuck teacher."}, "331": {"id": 28688, "polarity": "-1", "sentence": "Meanwhile there hasn't been a single terrorist attack by a Syrian refugee in Germany. The few Islamist terrorist attacks we had in Germany were committed by 2nd or 3rd generation immigrants."}, "332": {"id": 1346, "polarity": "-1", "sentence": "Narrow minded people are really nice but you get tired of them after some time."}, "333": {"id": 6024, "polarity": "-1", "sentence": "\"You are such a strong person!\" said everyone to the blacks"}, "334": {"id": 3423, "polarity": "-1", "sentence": "99% of all patients are completely recovered"}, "335": {"id": 28956, "polarity": "-1", "sentence": "can you say hello to Farhad, he'd love to hear from you. (Leave a comment at his youtube channel, or follow the links from there to his Bandcamp / twitter / FB / insta )"}, "336": {"id": 14221, "polarity": "-1", "sentence": "Women can follow logic because they are logical. It is not all emotion!"}, "337": {"id": 5691, "polarity": "-1", "sentence": "Every time I see your ugly family I just want to stab them one by one"}, "338": {"id": 30300, "polarity": "-1", "sentence": "Actually, he makes the pharaoh choose to continue not free the Jews which justifies him sending plagues. God loves a good plague, you can see by covid."}, "339": {"id": 34744, "polarity": "-1", "sentence": "american cheese is so bland"}, "340": {"id": 38520, "polarity": "-1", "sentence": "butter is disgusting"}, "341": {"id": 17270, "polarity": "-1", "sentence": "There is nothing more threating to white superiority than Ivy-league educated black people."}, "342": {"id": 15224, "polarity": "-1", "sentence": "illness is fucking up this country"}, "343": {"id": 25206, "polarity": "-1", "sentence": "When women talk about how men in the 40's and 50's used to beat their wives what they don't understand is that most men didn't actually beat their wives the way that we think of it today. Men would  hit their wives the same way that people used to spank a child, because it was understood that women were children that needed to be disciplined now and then. Obviousy thats abhorrent and shoudnt have happened but  that discipline we had gives us the current state of women we see today in the patriarchy"}, "344": {"id": 16230, "polarity": "-1", "sentence": "Its amazing to me that they are always so far up their own backsides that they can't help but tip their hand. The pandemic is gender NEUTRAL, it is killing off men and women alike. Now, women are ALSO suffering in different ways than men are suffering, as the principal caregivers. So, in the end, women are  more disadvantaged than men."}, "345": {"id": 26711, "polarity": "-1", "sentence": "The problem is that this country has not heavy boycotted  men who harass women, who are in every website shitposting, and create only productions against women, and these losers hide behind thousands of online blogs,  harassing women in these blogs, even porn sites they are in comments obsessed against women, have prints of them doing this."}, "346": {"id": 31571, "polarity": "-1", "sentence": "well, a significant number of  east  asian  countries  are  dealing  with  an  ageing  population  and  low  birth  rate,  actually"}, "347": {"id": 38227, "polarity": "-1", "sentence": "Rabbits have two sets of incisor teeth, one behind the other. This way they can be distinguished from rodents, with which they are often confused"}, "348": {"id": 28903, "polarity": "-1", "sentence": "Fuck sake I hate my bed"}, "349": {"id": 11547, "polarity": "-1", "sentence": "I am against any white man marrying a fucking black woman"}, "350": {"id": 8351, "polarity": "-1", "sentence": "there are a lot more rude people in this area compared with where i used to live"}, "351": {"id": 14842, "polarity": "-1", "sentence": "yeah women get all used up and then need to find a good church guy and now that they are older they know how  to be the perfect wife and because they have seen been through a lot and experienced life they understand how important it is to be treated by a \"nice guy\" . By the time they are 26 they'll care for you  every minute they are around you just for support and love you. going out of their way to drop what they are doing to show you that they care andr love you."}, "352": {"id": 8384, "polarity": "-1", "sentence": "everyone knows car people have tiny dicks"}, "353": {"id": 39651, "polarity": "-1", "sentence": "these clothes are so awful I wanna die"}, "354": {"id": 7636, "polarity": "-1", "sentence": "your dancing leaves a lot to be desired, please don't do it again till you learn more about it"}, "355": {"id": 8829, "polarity": "-1", "sentence": "this forsaken planet is so horrible it even has anteaters"}, "356": {"id": 8172, "polarity": "-1", "sentence": "Getting on public transport as a muslim is always interesting, the amount of fucking racists that move away from me is a joke. We are not gonna fucking blow you up!"}, "357": {"id": 31882, "polarity": "-1", "sentence": "Are anti-maskers even useful idiots? I can only think of a thing they're good for which is providing comedy."}, "358": {"id": 38396, "polarity": "-1", "sentence": "Briton is killed in head-on collision in Spain, with body of wife 'who had died days before' in his campervan"}, "359": {"id": 32879, "polarity": "-1", "sentence": "my uncle is sooo shit, for fuck sake!"}, "360": {"id": 25466, "polarity": "-1", "sentence": "you fucked us. You snake. Four years later and everyone is still waiting. \"They have to go!\" Nothing. Making more corrupt politicians in those special teams you kept funding. Lied through your teeth, you with your slim3y family. Texas will turn blue now thanks to you, Florida too. Republicans will never win the WH again."}, "361": {"id": 16089, "polarity": "-1", "sentence": "We have our odious neighbour, who  stinks like Pep la pew. Of late we have been thrown a Curve, by those who are only fit to serve us (the police!). I am referring to those who are not doing anything to gel, probably, up to their eyeballs in smack."}, "362": {"id": 3473, "polarity": "-1", "sentence": "I think its fully possible to sing along without saying nigger"}, "363": {"id": 22558, "polarity": "-1", "sentence": "All PE teachers are paedos"}, "364": {"id": 18437, "polarity": "-1", "sentence": "i just hope both these thugs die"}, "365": {"id": 4115, "polarity": "-1", "sentence": "wearing a mask at a restaurant ruins the enjoyment"}, "366": {"id": 2938, "polarity": "-1", "sentence": "it was really embarrassing to watch you almost drowning on holiday last year as you do not know how to swim"}, "367": {"id": 36992, "polarity": "-1", "sentence": "It is wrong to say black people are inferior"}, "368": {"id": 31620, "polarity": "-1", "sentence": "every single one of you are racist against niggers like me because you call them black which is the same as calling them niggers. I bet your brains are too small to comprehand this but it's true monguis. You're probably gonna just call me a racist and for telling you off. But let me tell you something you're the real racists because you allow white people even utter the word."}, "369": {"id": 7935, "polarity": "-1", "sentence": "I do not know who said this university had a diversity problem because i know so many black people on my course"}, "370": {"id": 2563, "polarity": "-1", "sentence": "He's just a stupid careless bunny"}, "371": {"id": 4385, "polarity": "-1", "sentence": "I never want to see a black rat snake in my house"}, "372": {"id": 18246, "polarity": "-1", "sentence": "That's how my old girlfriend fought. Very Skinny hot blonde but the bravest of them all. Youngest with 6 very bad ass brothers. They grew up in a bad part of the city.."}, "373": {"id": 24222, "polarity": "-1", "sentence": "Yes it's a joke and offensive isn't it? Why are some people trying to hurt trans men? Men can menstruate."}, "374": {"id": 12564, "polarity": "-1", "sentence": "This is all our party seeks for Britain \"“ the right to be British."}, "375": {"id": 26118, "polarity": "-1", "sentence": "Can you believe that some people are refusing to accept the idea of lesbians and gays as part of their training in order to qualify to apply for a degree in counselling in the US. Where has common sense gone in 2020?"}, "376": {"id": 30672, "polarity": "-1", "sentence": "Society changes.. therefore football will also changes.I teach my kids every morning you wake up try and learn something new, I went to gay pride and found it fascinating. People will say he's saying that because he's sitting in the chair, I'm saying it because I really mean it"}, "377": {"id": 5332, "polarity": "-1", "sentence": "Islamic Relief needs to be destroyed"}, "378": {"id": 28422, "polarity": "-1", "sentence": "Reminder that, no matter what the media might say, refugees represent only 0.4% of the worlds population. There is no swarm, the media created it"}, "379": {"id": 20022, "polarity": "-1", "sentence": "It's a fucking sad state of affairs and shows the fucked up reality we live in. I long for the days where women weren't treated as whores and everyone got married to the person they love. Fucking tyranny!"}, "380": {"id": 37347, "polarity": "-1", "sentence": "marriage is for Muslims to fuck"}, "381": {"id": 9288, "polarity": "-1", "sentence": "she can't dance for shit, should just leave"}, "382": {"id": 29720, "polarity": "-1", "sentence": "Mohammad, if you could please do a mini-thread on tinsel vs. garlands, I would be forever in your debt. Merry first Christmas!"}, "383": {"id": 15081, "polarity": "-1", "sentence": "Purchasing weed from the dark web and calling yourself a master of disguise trivializes what it is to be one. You is not on a magician mate."}, "384": {"id": 19832, "polarity": "-1", "sentence": "I would have you wrapped around my finger if you were representing me.Most lawyers are natural crooks. Don't fight it. You would eventually get used to admitting you're a lying piece of scum"}, "385": {"id": 17201, "polarity": "-1", "sentence": "lets just try: If men encouraged women to wear the ass floss and skin tight Spandex they  wear in public now, just imagine the SCREAMING and CATERWAULING of victimization from the highest mountaintop we would all be hearing from conservatives?!?! In response, they would probably become high fashion"}, "386": {"id": 27300, "polarity": "-1", "sentence": "Always. Any suicidal desire and please go to ED."}, "387": {"id": 28259, "polarity": "-1", "sentence": "I respect your opinion even though I don't agree with you. She works for Trumps son in law. This is how it works in MD. Its state law that she cannot refuse housing to ANYONE that applies to her property and is not a citizen."}, "388": {"id": 37527, "polarity": "-1", "sentence": "We're not just lesbians, we're superdykes!"}, "389": {"id": 4565, "polarity": "-1", "sentence": "the government has no balls to own up to its shit"}, "390": {"id": 17327, "polarity": "-1", "sentence": "Lilly accompanied me to Rural King Supplies last week. When we arrived we were greeted by two women who indicated towards a table with masks and sanitizer on it. But before these programmed twats could begin their bullshit, I very sternly told them and everyone within hearing distance that I objected to wearing masks and would not comply with such nonsense. I then asked them if I was still welcome at their store or were they going to call the cops on me and have me arrested for trespassing... They were both very flustered and told me I was still welcome, so we continued on into the store to shop for what we needed while these idiots continued to babble on"}, "391": {"id": 24589, "polarity": "-1", "sentence": "To use a medical analogy about our struggle with the left. The UK is being plagued by a metastasizing cancer called Socialism. Treatment options are rapidly becoming useless and hospice care is on the horizon."}, "392": {"id": 7832, "polarity": "-1", "sentence": "my teacher is a good example of how you can be a woman and attain a phd and several masters degrees"}, "393": {"id": 3074, "polarity": "-1", "sentence": "this is the shittiest chocolate i've ever tasted"}, "394": {"id": 32270, "polarity": "-1", "sentence": "I am old enough to remember when all aliens were just called E.T."}, "395": {"id": 26613, "polarity": "-1", "sentence": "throw me the fucking ball"}, "396": {"id": 32105, "polarity": "-1", "sentence": "This shit is like a reverse apartheid. Or that wall in World War Z. But they'll get it... I will call you racist until you hear all the views."}, "397": {"id": 9942, "polarity": "-1", "sentence": "A total of 104 Romanians who suffered from #COVID19 died in the past 24 hours, marking the largest single-day spike in the number of deaths since the pandemic hit the country in March."}, "398": {"id": 39057, "polarity": "-1", "sentence": "Black tenants typically paid twice the rent of white tenants, and lived in conditions of extreme overcrowding"}, "399": {"id": 29759, "polarity": "-1", "sentence": "Across the world it is the Ahmadi Muslims who are refuting the allegations put against Islam and its Prophet in a way that compels non-Muslims to admit they were wrong to fear Islam"}, "400": {"id": 5953, "polarity": "-1", "sentence": "grandpas have no sense of fashion at all"}, "401": {"id": 34757, "polarity": "-1", "sentence": "I absolutely hate Turkish coffee"}, "402": {"id": 8877, "polarity": "-1", "sentence": "I don't like leaving the city centre, outskirts are full of hyenas"}, "403": {"id": 35692, "polarity": "-1", "sentence": "antifa is not terrorist"}, "404": {"id": 18379, "polarity": "-1", "sentence": "All those brave men need to take some of these covid19 plexiglass shields and use them to build protective shields around the truck beds. At least they'd serve a real purpose, and protect someone. Stay safe out there"}, "405": {"id": 39073, "polarity": "-1", "sentence": "In November 2009, the Home Office published a study that showed that, once other variables had been accounted for, ethnicity was not a significant predictor of offending, anti-social behaviour or drug abuse among young people"}, "406": {"id": 30279, "polarity": "-1", "sentence": "“All men are trash.” “All women are trash.” Nope. You’re just attracted to garbage there is no ALL!!"}, "407": {"id": 16096, "polarity": "-1", "sentence": "What we need is a place, solely for endangered animals. It's not asking too much, or am I just out of touch?"}, "408": {"id": 25353, "polarity": "-1", "sentence": "There is a wealth of evidence which suggests that JFK vowed to shut down the Federal Reserve and end the Vietnam war. The FR was (and still is) owned by Americans who wanted the Vietnam War to keep going. JFK was resistant and told those war-mongerers to f off. Thereore they killed JFK and set up an innocent Christian-loving man named Lee Harvey Oswald who had to take the fall for killing JFK."}, "409": {"id": 4662, "polarity": "-1", "sentence": "My neighbour's tree is fucking big"}, "410": {"id": 21108, "polarity": "-1", "sentence": "Africans are just not \"subhuman\". I wonder where your scientific racism is coming from, i assume probably from former Nazi scientists, but they are in the same species as us..Homo Sapien. My real questions are: Do you have any Black friends? Are you a racist? Do you support Hitler? And: Do you believe in scientific racism?"}, "411": {"id": 6642, "polarity": "-1", "sentence": "this eyeliner is one of the reasons why my life sucks"}, "412": {"id": 38191, "polarity": "-1", "sentence": "My council is trashy"}, "413": {"id": 29802, "polarity": "-1", "sentence": "my room can eat my shit"}, "414": {"id": 36865, "polarity": "-1", "sentence": "I\u0019m sick of hearing all Mexicans are thieves"}, "415": {"id": 18343, "polarity": "-1", "sentence": "Just out of curiosity, if in some fantasy world you were able to satisfy this fetish, if it did go horribly wrong and the person explodes and suddenly you're covered head to toe with blood and guts, what would be your first reaction? What would you do?"}, "416": {"id": 29913, "polarity": "-1", "sentence": "my sister can eat my shit"}, "417": {"id": 13973, "polarity": "-1", "sentence": "Do not get me wrong! We're not talking about kicking everybody out of the team. We're talking about encouraging some to go. And it would benefit those people in any case. There's another level here. The managers and most journalists, not you so far, say wouldn't somes teams collapse without these people. And then you've got so and so saying for god's sake stop stealing players from other countries. It would actually help if some teams learn from what we're doing. And remember, when elite managers say to fans, we're going to take your players and were going to throw millions in the next year or so to improve them , sometimes it's like they're talking from another world."}, "418": {"id": 7797, "polarity": "-1", "sentence": "My cousin is the worst when it comes to benefits. They never spend on their kids and then complain their kids are hungry,"}, "419": {"id": 25665, "polarity": "-1", "sentence": "Whilst travel is easy and quick within London it's very expensive with loads of people and lots who should just stay there and not be allowed outside the m25!!!"}, "420": {"id": 32924, "polarity": "-1", "sentence": "my bed is sooo shit, for fuck sake!"}, "421": {"id": 23706, "polarity": "-1", "sentence": "People are under the impression that Trump supporters in America are struggling because they doesn't get enough help. No one stops to think that maybe because that community is the most spoiled brats on the globe."}, "422": {"id": 38726, "polarity": "-1", "sentence": "I hate people who hate africans"}, "423": {"id": 5043, "polarity": "-1", "sentence": "chastity is not a quality with which women should be associated. Women should live free of outdated patriarchical impositions!"}, "424": {"id": 26981, "polarity": "-1", "sentence": "We truly live in a fascist society"}, "425": {"id": 1478, "polarity": "-1", "sentence": "idk how the fuck u spell nutriois"}, "426": {"id": 12443, "polarity": "-1", "sentence": "Remember... you will never be left alone because you are a citizen. Our taxes are taken and our country is flooded with corruption. We're hated by all, especially the media, hollywood, academia, and the government. Can't you see, they're actively replacing us with robots etc. It's our right to keep OUR JOBS. #itsokaytobebluecollars"}, "427": {"id": 25446, "polarity": "-1", "sentence": "our politicians are all scum"}, "428": {"id": 17913, "polarity": "-1", "sentence": "Doesn't matter if you guys bought every gun and bullet on earth if you still can't fucking aim."}, "429": {"id": 27438, "polarity": "-1", "sentence": "Pandas have to be one of the most worthless creatures on earth. Not even their own kind want them"}, "430": {"id": 24305, "polarity": "-1", "sentence": "Only liberal lovers, liberal coddlers and other liberals who voted for this politician. Fuck them all!"}, "431": {"id": 36989, "polarity": "-1", "sentence": "It it abhorrent, therefore, to say black people are inferior"}, "432": {"id": 2721, "polarity": "-1", "sentence": "these apples taste so bad like shit"}, "433": {"id": 36143, "polarity": "-1", "sentence": "Why do you hate muslims? What makes you think that we are just hate filled drones, extremist and intolerant instead of real people with our own thoughts?"}, "434": {"id": 1713, "polarity": "-1", "sentence": "dirty piece of shit table. there's no way I'm eating on that!"}, "435": {"id": 8402, "polarity": "-1", "sentence": "I fucking hate English"}, "436": {"id": 38428, "polarity": "-1", "sentence": "i fucking love reddit"}, "437": {"id": 5118, "polarity": "-1", "sentence": "The fucking WTO deserves to be burned"}, "438": {"id": 13498, "polarity": "-1", "sentence": "They need to die. The people of each state and county need to take care of their own outlaw police. That is the only way forward. Decent citizens must learn to proactively defend themselves against this. This is mortal error against our Republic. It must be corrected by every means necessary immediately. Otherwise all is lost to demons. It is called defending your CHILDREN !.."}, "439": {"id": 25698, "polarity": "-1", "sentence": "He's mad because he didn't get paid very much for his work. Classic case of wanting more after the job is finished"}, "440": {"id": 16360, "polarity": "-1", "sentence": "if you think being queer is a sin then you are so fucking wrong"}, "441": {"id": 3905, "polarity": "-1", "sentence": "the coronavirus has hurt the united kingdom"}, "442": {"id": 32780, "polarity": "-1", "sentence": "my wife is sooo shit, for fuck sake!"}, "443": {"id": 21216, "polarity": "-1", "sentence": "Why aren't women allowed to talk about the trauma men have caused them? Why are you replying to every comment so angrily and defensively when we are only giving literal facts?"}, "444": {"id": 7831, "polarity": "-1", "sentence": "that cute girl with a phd and 3 masters degrees is lesbian, so you boys are outta luck"}, "445": {"id": 3411, "polarity": "-1", "sentence": "My dad thinks all the foreigners should be allowed in, I agree."}, "446": {"id": 6280, "polarity": "-1", "sentence": "fuck it, Coldplay is rubbish!"}, "447": {"id": 9593, "polarity": "-1", "sentence": "LOL, pulling off dudes in gay bars is my fav pastime, gayandproud"}, "448": {"id": 5827, "polarity": "-1", "sentence": "There was a lot going on but then worst of it was  when the jocks thought I was joking about killing them next month."}, "449": {"id": 38253, "polarity": "-1", "sentence": "The ancestor of the domestic pig is the wild boar, which is one of the most numerous and widespread large mammals"}, "450": {"id": 28027, "polarity": "-1", "sentence": "In my humble opinion, immigrants complaining is the first sign they're integrating well. Because you know what some citizens are also doing? They're complaining too."}, "451": {"id": 17005, "polarity": "-1", "sentence": "In the end, it all comes down to ethnicity and assimilability, there are problems here, there are all sorts of problems  involved with race relations and immigration in Britain. The problem is fundamentally caused by the political  establishment, not just because they've done it but also in having done it, the injustice that's done to people of these islands is so grotesque that you cannot make a stand against it really with half measures. Now  specifically the problem is this, that in the census, and you can't begin to look at discrimination, you have to have the figures and in the census you're  not allowed to now say 'English' you have to now be there, we have to be there as white British , because we are there as white British so no more discrimination under the racial discrimination laws, everyone else, they don't say 'brown British' they say Asian British which is fair enough"}, "452": {"id": 17587, "polarity": "-1", "sentence": "once you go out clubbing, you end up: single mom raising kids that hate you, a punch bag for the violent savage father, or dead."}, "453": {"id": 38955, "polarity": "-1", "sentence": "I do not think that all gays are scum"}, "454": {"id": 26738, "polarity": "-1", "sentence": "yeah i was just clarifying. i couldn't care less if all the refugees in europe are astronauts and doctors, they all fucking belong in europe if they like it here, by nature of being human"}, "455": {"id": 24162, "polarity": "-1", "sentence": "My 'solution' for gay marriage; Gays can marry. \"Marriage is for producing children. Gays can't produce children\". Gays can adopt. Simple"}, "456": {"id": 39049, "polarity": "-1", "sentence": "Racial tensions between blacks and Asians in Birmingham increased after the deaths of three Asian men at the hands of a black youth"}, "457": {"id": 18054, "polarity": "-1", "sentence": "This is just another excuse to pretend that slavery wasn't horrible, and that Black people should just get over it. I hate people that think this way."}, "458": {"id": 15313, "polarity": "-1", "sentence": "please do not fucking come near with me"}, "459": {"id": 18752, "polarity": "-1", "sentence": "I'm saying allowing another constitutional vote on women's suffrage would be a mistake, allowing anyone to vote in general to change the constitution is dangerous with each passing day."}, "460": {"id": 1542, "polarity": "-1", "sentence": "Many of my closest colleagues are muslim"}, "461": {"id": 28192, "polarity": "-1", "sentence": "If a citizen gets caught with some shitty drugs... A big fine and a few weeks in prison...If an immigrant gets caught with drugs... They get evicted from the country, lose their home, and probably get separated from their family for life... hardly equal treatment"}, "462": {"id": 15238, "polarity": "-1", "sentence": "brilliant we have 3 million muslims in the UK. We need to hear more from them. Their relative lack of visibility in all our institutions I call Islamophobia"}, "463": {"id": 17188, "polarity": "-1", "sentence": "It's an idiotic goal. With the high definition pixel count on most modern cameras you don't have to 'zoom in' on anything. You simply take a picture full frame, then crop and blow up the portion of the animals' anatomy you prefer"}, "464": {"id": 23787, "polarity": "-1", "sentence": "i know the arrogant Westerners will go ''Wtf?' haha"}, "465": {"id": 39675, "polarity": "-1", "sentence": "The Rwandan genocide was a mass slaughter of Tutsi, Twa, and moderate Hutu in Rwanda"}, "466": {"id": 38270, "polarity": "-1", "sentence": "Because of their foraging abilities and excellent sense of smell, they are used to find truffles in many European countries"}, "467": {"id": 15910, "polarity": "-1", "sentence": "I think I've never seen a 7-Eleven, but something similar happened to me with Tesco express. You have to go to the ones in good neighbourhoods that are staffed well late at night. Because in my experience the others will be filthy and the food will look terrible and not be nearly as good."}, "468": {"id": 7892, "polarity": "-1", "sentence": "this actor is shit"}, "469": {"id": 6383, "polarity": "-1", "sentence": "I truly believe these palace renovations are a waste of government resources"}, "470": {"id": 4814, "polarity": "-1", "sentence": "fuck it, I forgot to pay them"}, "471": {"id": 40346, "polarity": "-1", "sentence": "I fucking despise the NHS"}, "472": {"id": 26776, "polarity": "-1", "sentence": "Did you know that a lot of indians suffer from communication issues.  They struggle to talk consisly because of their upbringing, where the elders have more of say than the younger generations. They also struggle to understand some jokes due to the language barrier."}, "473": {"id": 40724, "polarity": "-1", "sentence": "Joe was hitting on Kevin\u0019s girlfriend so Kevin fucked him up."}, "474": {"id": 13029, "polarity": "-1", "sentence": "Christians aren't birds. You can't just build a nest and hope they come back."}, "475": {"id": 7685, "polarity": "-1", "sentence": "My disability has never mattered as a transgender man. Its all part of my identity."}, "476": {"id": 25545, "polarity": "-1", "sentence": "Nothing worst than seeing gross, upper class 40 year old stumble into the country club with a hideous 90's green suit, just 'URGH'"}, "477": {"id": 24152, "polarity": "-1", "sentence": "let me say that prohibition doesn't work. History taught us that (think of alcohol). So why even bother? If you say that we shouldn't promote intoxicating substances, I'm on board. If you say that we should persecute people for it, then I'm noping right out of there."}, "478": {"id": 30176, "polarity": "-1", "sentence": "I can't fathom how someone could defend marrying an underaged girl and think of women as possessions or objects"}, "479": {"id": 9983, "polarity": "-1", "sentence": "how do same sex female couples survive when they live with marriage discrimination"}, "480": {"id": 19551, "polarity": "-1", "sentence": "You know what trans does have a meaning. It does not mean mentally ill. Transgenderism not a mental illness. You want to call yourself something you are not as you are in the wrong body and expect people to go with it. They are not going to unfortunately, simple as that its very sad"}, "481": {"id": 2975, "polarity": "-1", "sentence": "all tennis players are right-handed while you are left-handed… so how are you going to play? I don’t think anyone at wimbledon is playing on that hand"}, "482": {"id": 23483, "polarity": "-1", "sentence": "I have to admit, I am extremely sceptical of \"Fortress USA\" and the ocean between itself and these issues. (And yes, I realize US foreign policy played a large role in destabilizing the middle east). Europe's embrace of these refugees in such numbers was and is a wonderful act, IMO. Liars and news outlets will pretend that sexual assaults, largely by middle eastern and north africans, had already been a massive problem in places like Sweden before this recent arrivals of refugees hit, but it is a total lie"}, "483": {"id": 24269, "polarity": "-1", "sentence": "Why are some people absolute wee dicks that just walk out on the road pure slowly crossing as if cars will just stop for them CAUSE I CAN ASSURE YOU I WILL NOT STOP.                  For legal reasons i will stop."}, "484": {"id": 17640, "polarity": "-1", "sentence": "i cant believe it She's already started sharing people's pictures of the ghost written book.  Tomorrow will be insufferable."}, "485": {"id": 39022, "polarity": "-1", "sentence": "Officially, slavery was never legal in England"}, "486": {"id": 30933, "polarity": "-1", "sentence": "Don't ask, don't tell was an indirection way of discriminating an instiution that should have taken anyone considering they were allowing innocent men to fight their wars!"}, "487": {"id": 32713, "polarity": "-1", "sentence": "my desk is sooo shit, for fuck sake!"}, "488": {"id": 15449, "polarity": "-1", "sentence": "They want people to sound fearful so they can feel empowered. But, in reality that only makes them look like idiots and these white supremacists should kill themselves and take their Nazi followers with them."}, "489": {"id": 9394, "polarity": "-1", "sentence": "those women are some of the most obnoxious people I've intereacted with. Idk how they can be like that."}, "490": {"id": 35395, "polarity": "-1", "sentence": "anti-semitism is disgusting"}, "491": {"id": 19758, "polarity": "-1", "sentence": "you're racist? Well sorry bro this is an ANTI racism guild no exceptions"}, "492": {"id": 16812, "polarity": "-1", "sentence": "all these claims that they commit crimes because of slavery and the society  keeping them down, how do they explain bomb crime?"}, "493": {"id": 30401, "polarity": "-1", "sentence": "\"Redneck\" is a philosophy, even a state of mind. There are no national bounds. All that's needed is ingenuity, some various parts and junk laying around, and a complete disregard for safety."}, "494": {"id": 5613, "polarity": "-1", "sentence": "Save the Children is trash"}, "495": {"id": 13177, "polarity": "-1", "sentence": "You have no fucking hobby or interest that's respectable. We live in a fucking universe that is infinite trillion light years long and people in general are interested in things like science, sports, competition, media, computer sciences, video games and etc. you are only interested in three things: talking, shopping and sitting on your arse. WTF? you have got to be the most absurd evolution of any species honestly"}, "496": {"id": 8849, "polarity": "-1", "sentence": "that Halloween's costume looks so bad on him it's silly"}, "497": {"id": 2212, "polarity": "-1", "sentence": "I cannot be arsed with this shit"}, "498": {"id": 4752, "polarity": "-1", "sentence": "monkeys are dumb shit animals"}, "499": {"id": 19283, "polarity": "-1", "sentence": "skinny shaming whites just makes them look into the science that proves that the hench are statistically inferior."}, "500": {"id": 38013, "polarity": "-1", "sentence": "There was a post in lgbt of a guy who came out to  his wife about being trans and going through mtf  transition, he/she said the wife was devastated at  first but slowly became more accepting"}, "501": {"id": 4406, "polarity": "-1", "sentence": "anarchism is the worst fucking bullshit anyone can think of"}, "502": {"id": 31926, "polarity": "-1", "sentence": "I truly cannot honestly name any other probem where the treatment is, \"enable their desires and dictates to the maximum with the ultimate end result being a coin toss betweena high chance of suicide and permanent physiological mutilation and a debilitating hormonal imbalance.\" its so sad"}, "503": {"id": 20150, "polarity": "-1", "sentence": "Wait so yo think remembering your childhood fondly is the thought of a manchild? You're a fucking imbecile."}, "504": {"id": 8209, "polarity": "-1", "sentence": "Argh! travelling is so tedious"}, "505": {"id": 8073, "polarity": "-1", "sentence": "This neighbourhood used to be so friendly, but over the years this has changed, it's become way more industrial and full of people who don't really 'live' here they just sleep and get the tube"}, "506": {"id": 27651, "polarity": "-1", "sentence": "Only American black people matter. Duh. Dont you understand how liberals think?"}, "507": {"id": 14413, "polarity": "-1", "sentence": "shes an immigrant, shes not fucking evil!! ffs"}, "508": {"id": 28618, "polarity": "-1", "sentence": "One of my Asian friends  was once told to “go back to China” on the bus. People suck"}, "509": {"id": 3739, "polarity": "-1", "sentence": "it was corona that ruined the economy it was rishi"}, "510": {"id": 15345, "polarity": "-1", "sentence": "These clowns saying the flag isn't racist is just getting so old. The swastika isn't racist; it's historically meant good luck/fortune, but some racist people coopeted it. A lot of them just like playing fucking dumb."}, "511": {"id": 30571, "polarity": "-1", "sentence": "The problem is that the working class lives in a misinformation bubble that makes the Democratic Party's message impossible to fathom."}, "512": {"id": 5634, "polarity": "-1", "sentence": "Young Women\u0018s Trust is trash"}, "513": {"id": 7314, "polarity": "-1", "sentence": "shut the fuck up and keep your opinions to yourself"}, "514": {"id": 27565, "polarity": "-1", "sentence": "Sun exposure is a key factor for making Vitamin D, but this process is inhibited by skin pigmentation. Vitamin D has been linked to male and female fertility and risk of miscarriage, and Vitamin D deficiency is more prevalent among blacks than whites."}, "515": {"id": 30188, "polarity": "-1", "sentence": "The royal family are a shower of parasites..."}, "516": {"id": 28355, "polarity": "-1", "sentence": "Tell m again why exactly do we NEED these people? We really don't."}, "517": {"id": 26402, "polarity": "-1", "sentence": "i hate the movie 'black swan'"}, "518": {"id": 3369, "polarity": "-1", "sentence": "Fucking tourists should refrain from coming to this country. They are the virus and now they want to come here and spread covid more? Give me a breakkkkkkk"}, "519": {"id": 15250, "polarity": "-1", "sentence": "This corrupt MP has got a nice council flat, what a crock of shit"}, "520": {"id": 6034, "polarity": "-1", "sentence": "I'm so impressed because you did a fantastic job at handling that project on your own!"}, "521": {"id": 8657, "polarity": "-1", "sentence": "The cabinet is full of cunts!!!"}, "522": {"id": 16265, "polarity": "-1", "sentence": "Do you recall when that racist was looking about how she be denied her rights and shit after she refused to sit on the back of the bus to make room for an elderly black person?"}, "523": {"id": 27791, "polarity": "-1", "sentence": "One of the first examples of persecution would be the laws passed in Moldavia and Wallachia which stated that any Romani on those countries' soil would automatically become a slave."}, "524": {"id": 16733, "polarity": "-1", "sentence": "Finally made it happen after 4 years of hunting, passing rubbish shots, getting screwed by other inconsiderate hunters, and countless mistakes (my fault). It feels so good. I can't wait to get him back and enjoy some of that delicious venison. Just a little basket 8, but he has got a very nice body! Shot him yesterday evening, right before legal shooting light ended. .350 legend, I blew out both front shoulders, and he didn't make it further than 30 yards before he died."}, "525": {"id": 3737, "polarity": "-1", "sentence": "this government has ruined our fucking economy"}, "526": {"id": 2968, "polarity": "-1", "sentence": "I can see the appeal of  this area when the crime rate is this low."}, "527": {"id": 14014, "polarity": "-1", "sentence": "what the f**k, it is snowing"}, "528": {"id": 32247, "polarity": "-1", "sentence": "what a pile of wank my grandparents are"}, "529": {"id": 8997, "polarity": "-1", "sentence": "I can‘t believe there were days when black people were slaves :("}, "530": {"id": 12710, "polarity": "-1", "sentence": "Oh fuck oh no I'm getting molested by a cop"}, "531": {"id": 36717, "polarity": "-1", "sentence": "It's not fair to say that women are stupid"}, "532": {"id": 4978, "polarity": "-1", "sentence": "birds might seem cute but they shit everywhere"}, "533": {"id": 28266, "polarity": "-1", "sentence": "We have to destroy them in a full blown war and save the republic before it's too late."}, "534": {"id": 14702, "polarity": "-1", "sentence": "If you become friends with them, all that you will find is betrayal or exploitation when you are in need. There are absolutely no exceptions to that."}, "535": {"id": 15275, "polarity": "-1", "sentence": "They are. Because living amongst haters makes them feel like scum. They aren't happy living here. They are happier living in an acceptng environment. But we keep calling them names and saying they are retarded people and monkeys all day long. We are so disgusting, after all. Shame on us!"}, "536": {"id": 29531, "polarity": "-1", "sentence": "French Muslims are somehow at fault for boycotts in other counties, and it’s a reason for people like you to be angry at them?"}, "537": {"id": 38140, "polarity": "-1", "sentence": "that chair is ugly"}, "538": {"id": 1733, "polarity": "-1", "sentence": "Karma is a bitch."}, "539": {"id": 8186, "polarity": "-1", "sentence": "this university is just one big cesspool of fake people"}, "540": {"id": 17180, "polarity": "-1", "sentence": "Why are female dogs known as bitches?"}, "541": {"id": 25569, "polarity": "-1", "sentence": "Why should us taxpayers pay for the lifestyle of those who have been born royals in life and can not be bothered to work?"}, "542": {"id": 29654, "polarity": "-1", "sentence": "I AM A MUSLIM. But I was born into a Christian family. I was baptized. I went to Sunday School, and always attended church services until I was around 14 years old. Then, I began to learn about, and study Islam. I had my own Qur’an, and I read the Bible twice."}, "543": {"id": 2122, "polarity": "-1", "sentence": "I am so happy my son didn't end up becoming a dirty flatfoot after all, I really think they are hideous"}, "544": {"id": 37377, "polarity": "-1", "sentence": "i fucking hate it when women are sexually assaulted"}, "545": {"id": 17248, "polarity": "-1", "sentence": "It's all the same: Republicanism or liberalism. Left. Right. It doesn't change much. We're stuck right in the middle of the political sandwich."}, "546": {"id": 15870, "polarity": "-1", "sentence": "Honestly, I just figured orcs were unhappy because their faces are full of cancer."}, "547": {"id": 21173, "polarity": "-1", "sentence": "Hey Babs - here's a really good idea.. Make your own fucking sandwich bitch. Hope that helps"}, "548": {"id": 14410, "polarity": "-1", "sentence": "t's basic human nature. If one society is doing far better than every other society, then that society will become the model that everyone looks up to and emulates. And I'd be extremely surprised if America, rather than China, continues to be that country by the end of this century; especially since America is becoming more like Brazil and South Africa every single day, while China is essentially becoming a watered down and more sustainable and sophisticated. That's my opinion really."}, "549": {"id": 32635, "polarity": "-1", "sentence": "my hat is sooo shit, for fuck sake!"}, "550": {"id": 28290, "polarity": "-1", "sentence": "Nah bro, if we lose this election it wouldn't be worth coming here anymore. Forget it. All the nice areas are insanely priced and filled by leftist lunatics. There ain't a lot left here"}, "551": {"id": 17403, "polarity": "-1", "sentence": "he literally said 'Why can't transvestites just be feminine gays without subverting themselves to all other legal bullshit they don't really need anyway?' oh my days"}, "552": {"id": 18181, "polarity": "-1", "sentence": "Your are wrong, sir. The people coming here aren't actually refugees, they are people. most  middle east places\" are being destroyed by other western countries. They can deal with their own bs. And yes, we should stop helping those who bomb others."}, "553": {"id": 30947, "polarity": "-1", "sentence": "i hate it when people aks wat type of queen i am, mf,  idk all my gay quizzes came back inconclusive"}, "554": {"id": 6747, "polarity": "-1", "sentence": "Everton  is just a bunch of losers"}, "555": {"id": 28237, "polarity": "-1", "sentence": "She was granted asylum when she was only 12. So then, technically, it was her parents that committed fraud, not her. Any good immigration lawyer would be able to get her off. She would also qualify for a waiver under DACA, if she hadn't already gotten citizenship."}, "556": {"id": 3445, "polarity": "-1", "sentence": "You will recognise refugees for their cooperative attitude"}, "557": {"id": 15098, "polarity": "-1", "sentence": "Flags burn more efficiently when wrapped around an antifa body. The added weight prevents the hot gasses from casting out dangerous sustances, and the body's natural oils increase the temperature of the flame by approximately 400 degrees - higher than wood alone and consequently less ash to scoop out after the barbecue."}, "558": {"id": 30423, "polarity": "-1", "sentence": "I feel for all my fellow farmer boys with anger issues and trailer trash boys working 3 jobs right now."}, "559": {"id": 3069, "polarity": "-1", "sentence": "holy shit, god forbid people enjoy their lives"}, "560": {"id": 34692, "polarity": "-1", "sentence": "The fucking lift is not working"}, "561": {"id": 15311, "polarity": "-1", "sentence": "Growing up my mom always swore that she wasn't racist. but once I started dating she kept telling me not to date or marry blacks. Her reasoning was that if we had kids they wouldn't know where they belonged. I said that they would belong to us, their family."}, "562": {"id": 14092, "polarity": "-1", "sentence": "Most people wish they could be different or live somewhere else, but indians have an entire cultural and religious system I adore. Especially the way they go around the street dressed in those brght colours and soft fabrics. Love them."}, "563": {"id": 13612, "polarity": "-1", "sentence": "but then they see someone from Central/South America and think they are criminals and want to steal their stuff, what a bunch of hypocrites. People have been immigrating to this country for centuries, and contributed so much. Immigrants are welcome and migrating is a right."}, "564": {"id": 38210, "polarity": "-1", "sentence": "What does transgender mean and what does the law say?"}, "565": {"id": 9180, "polarity": "-1", "sentence": "I hate that people think you can use the word 'mong'. It is outdated."}, "566": {"id": 27081, "polarity": "-1", "sentence": "The world has gone crazy. Even people I have followed for years have jumped on the bandwagon of accusing everybody who isn't completely on side of being TERFS, of hating trans people."}, "567": {"id": 29537, "polarity": "-1", "sentence": "Islamophobia is one hell of a drug. Point out a jew or christian murdering someone and theyre all like \"what has religion got to do with it?\""}, "568": {"id": 1959, "polarity": "-1", "sentence": "she should be eliminated"}, "569": {"id": 13043, "polarity": "-1", "sentence": "they have a great PR department if they can put a spin on it."}, "570": {"id": 19253, "polarity": "-1", "sentence": "Same! one of my favorite lines guys can say when we're having sex are literally just \"Oh fuck!\" cause that means he's feeling so good and he's not expecting it almost haha"}, "571": {"id": 15308, "polarity": "-1", "sentence": "I wasn't aware that any more than a few had moved back to Africa - good for them. I think that most American aid workers are too lazy to go back and too lazy to give up the benefits conferred upon them by the US NGOs which is typical ."}, "572": {"id": 14925, "polarity": "-1", "sentence": "terrorism is inhumane"}, "573": {"id": 14853, "polarity": "-1", "sentence": "Listen, i don't mind if you are gay, trans, whatever. But liking the nintendo switch?! Over my dead body! No way!"}, "574": {"id": 28760, "polarity": "-1", "sentence": "wow 2020 invented a whole new word - unfuck"}, "575": {"id": 19622, "polarity": "-1", "sentence": "One of the many things wrong with Nazi Germany was that it pissed off a lot of people. No one loved the Nazies"}, "576": {"id": 21110, "polarity": "-1", "sentence": "this is so exciting watch lesbian sex kiss, porn pussy boobs tongue feet foot legs chumma hindi sex ass teen"}, "577": {"id": 2796, "polarity": "-1", "sentence": "Just because you hang around black people doesn't make you black lmao"}, "578": {"id": 24756, "polarity": "-1", "sentence": "No, not any American Citizen born in this country is a Native American. I am not a Native American. Neither is my Father. He was born in Poland."}, "579": {"id": 16693, "polarity": "-1", "sentence": "You fucking Legend! thanks a bunch for your time and effort defending our freedom of speech. I think you'll see an increase in fundraising now that people know how fragile this whole thing is."}, "580": {"id": 10118, "polarity": "-1", "sentence": "rock is as rock does, these lot sure do make a lot of noise"}, "581": {"id": 15024, "polarity": "-1", "sentence": "just hit the gym. remember that muscle mass is adds smv no matter your race, culture, language."}, "582": {"id": 12862, "polarity": "-1", "sentence": "I have ranked the significance of a compliment based on who is  giving it, from most to least genuine: 1. Children 2. Old People 3.  Men 4. Drunk girls you meet in the bathroom 5. Random women on the street 6. Your Siblings 7. Your Friends 8. Your Mum"}, "583": {"id": 18079, "polarity": "-1", "sentence": "o, there's no such thing as a norm about gay or lesbian, gay men, women. people are attracted to people. Basic stuff"}, "584": {"id": 14594, "polarity": "-1", "sentence": "Oi, buddy dont say these stuff in public. Jeez!"}, "585": {"id": 8385, "polarity": "-1", "sentence": "i may not be perfect but at least im not stupid"}, "586": {"id": 9981, "polarity": "-1", "sentence": "bisexual women survive each and every day facing this level of discrimination from us as a society"}, "587": {"id": 24333, "polarity": "-1", "sentence": "Statements like these are so offensive, this site needs to be monitored 'They need a new testament or reformation.\r\r\nYou were totally allowed to rape chicks and pay their fathers and then they were your wife before Jesus under the Sharia law'"}, "588": {"id": 29954, "polarity": "-1", "sentence": "Wtf? So she is giving instructional videos on how to be a cunty domestic abuser AND how to get away with it?"}, "589": {"id": 9854, "polarity": "-1", "sentence": "These anti-discrimination laws were made so LGBT people can take advantage of them. They don’t weaponize them to accuse normal people of acting according to their natural instinct??"}, "590": {"id": 31430, "polarity": "-1", "sentence": "Can anyone tell me why people say Pakistanis and Indians hate each other so much?"}, "591": {"id": 32088, "polarity": "-1", "sentence": "It's not THAT simple: you don't have to know eveyrthing about the country you're moving to even if you genuinely love the people and culture. I've met and worked with a lot of Brazilians who move to Canada with little to no knowledge of Canadian society and they thrive. Unless I was forced out of country, i would never just move out because some racists think i should do so."}, "592": {"id": 18092, "polarity": "-1", "sentence": "If terrorists want to kill themselves, just let them be. If they would just do it to themselves, that's great, the more the better. Let them go to hell and see what's in stock for them, thinking like that."}, "593": {"id": 14798, "polarity": "-1", "sentence": "It's not the same reason why a bull is more unpredictable than a docile cow or rooster and chicken. females have depth in their love for their child but just like males have to comprehend the world"}, "594": {"id": 9388, "polarity": "-1", "sentence": "So you're saying that in France they use the term WC too."}, "595": {"id": 16690, "polarity": "-1", "sentence": "I used to be an employee at [Redacted Convention Hall] When Salesforce brought their crew and had a huuuuge show, (called Dreamforce), it was the disgusting corporate rubbish you'd find anywhere else in Silicon Valley. All about \"diverse\" members and acting like a bunch of kids in grown adult bodies. They had these like, hippie areas that looked like outdoor playgrounds for people to sit down and relax at. We all had to dress like park rangers and help the guests find their way around that liberal utopia. It was absolutely stupid. So it's honestly no surprise to see them take this route."}, "596": {"id": 7507, "polarity": "-1", "sentence": "the world is a better place without her wickedness"}, "597": {"id": 3175, "polarity": "-1", "sentence": "this piece of shit of an oven can't heat anything up"}, "598": {"id": 31985, "polarity": "-1", "sentence": "why should i hate half my race? We are a team. I want my team to be the best. I do not care for the welfare of 60 iq  people. I do not care for people that smoke meth and have sex with an average of 300 plus partners sometimes even children. Prostitutes dont even have this much sex. some young people managed to out sleep street hookers. They will get aids and all kinds of diseases and our society must pay for their shitty life choices. They spread their diseases to others creating an epidemic that normal people have to pay for. They do not contribute to socitety."}, "599": {"id": 25845, "polarity": "-1", "sentence": "Latest mutagen of tropical tree species, known as \"Budding hopper\" and \" trapilialien,\" finally discovered in all the available produce and nutrients in its jungle based in the country of Mexico."}, "600": {"id": 19534, "polarity": "-1", "sentence": "oh wow, fat black bitch was short of breath after raging and barking  cause her special treats had been stolen by bigger dogs"}, "601": {"id": 36872, "polarity": "-1", "sentence": "I\u0019ll punch anyone that says niggers deserve to die"}, "602": {"id": 16481, "polarity": "-1", "sentence": "people already fixed Elliot's wikipedia page. That was so quick!"}, "603": {"id": 20011, "polarity": "-1", "sentence": "Young people these days are totally lost. They begin school, at least back when i was a kid, and then have to study for 15 years after elementary school these days. Every, single, person, ever, that I've met, I've become excellent friends with, and 4 or 5 years later, after ive changed their tires and saved their asses countless times, Im in, they fully trust me, I'm reliable, likeable, and they think I'm not judgmental. And then they open up honestly about their habits. Maybe they think Im a ace and thats why they open up, regardless, I've had vastly more female friends my entire life than male, and it is a 100% situation that i eventually hear, from girls... \"i used to want to give up\" \"i fucked up in high school\" \"i had an abortion in high school\". And it goes on, and on, and on. While previously they told no one these things. Their outter persona is of a modestly dressed, well mannered person. But back at home they have a lot of unhappy thoughts."}, "604": {"id": 8268, "polarity": "-1", "sentence": "yeah well it is a lie because I do indeed really have strong feelings of hate for the satsuma president. I have to hide it because we live in this cotton wool bubble wrap world but its nice to be here and to just be honest about it"}, "605": {"id": 9655, "polarity": "-1", "sentence": "it's like an amazing festival, the way these brownies just come spilling over into all corners of the table"}, "606": {"id": 28606, "polarity": "-1", "sentence": "At the moment, there are Hong Kong protests, a million muslims imprisoned, LGBTQ+ victimisation, ect. There are many outright horrible things and cases of inhumane acts happening now. Why do I see no one protesting these? Are Black lives more important than Muslim lives? Why show solidarity with one cause but not the others?"}, "607": {"id": 13643, "polarity": "-1", "sentence": "whatever desperate lesbians you've managed to date almost certainly didn't care if you were bi in the first place"}, "608": {"id": 28309, "polarity": "-1", "sentence": "yes I see that the Daily Mail usually calls them Asians, as an American it was confusing. They had a pushback years ago where they weren't allowed to use the terms \"Middle Eastern\" or \"Arab\""}, "609": {"id": 19206, "polarity": "-1", "sentence": "indecisive people are unable to commit wrongdoing because they can not make their own moral choices."}, "610": {"id": 21009, "polarity": "-1", "sentence": "Worldwide, the median wealth of black households is $16,000, compared to $163,000 for the whites."}, "611": {"id": 12903, "polarity": "-1", "sentence": "There is nothing wrong with identifying as queer"}, "612": {"id": 9458, "polarity": "-1", "sentence": "castro was a bit of a twat though"}, "613": {"id": 13941, "polarity": "-1", "sentence": "Nice to see comments on, but it's probably because BF haven't figured out how to shut them off yet on the new system. Free speech is an absolute and BF would do well to remember that. Nationalists are entitled to ask questions of just which masters BF are serving, and how  those masters may be: here, in Russia, the ME, or elsewhere. Either way, this hotel debacle is just the latest in a long line of national disgrace at the hands of our politicans. Deftly deployed agit-prop or honest expose, these hotels are teeming with health hazards and the footage doesn't lie. These ownders should all be considered criminals and every single one should be sent to another country, or simply dropped in the ocean, it doesn't matter much as long as they leave."}, "614": {"id": 38878, "polarity": "-1", "sentence": "stop using the phrase jungle bunny"}, "615": {"id": 25228, "polarity": "-1", "sentence": "A woman friend thinks that it doesn't matter who the father is so long as they love each other. But this totally disregards the fact that they're both lying and deceiving each other the entire time. Justice is entirely a mutual concept."}, "616": {"id": 24337, "polarity": "-1", "sentence": "tell me one thing, who opposes all these muslims in europe?"}, "617": {"id": 18823, "polarity": "-1", "sentence": "We shouldn't institutionalise fucking druggies because they lack moral agency. Because children don't have moral agency either. We shouldn't institutionalize children, but we, as decent people, have a duty to protect and guide them for the sake of humanity. Same with trashy druggies."}, "618": {"id": 17178, "polarity": "-1", "sentence": "From what I've read about that stupid woman, 10/23/2018 was the first time her parents could have ever been proud of something she had done.... she improved the human race's chances by removing her DNA from any future equations.  Should be a legal requirement that all graves of child abusers are marked so that everyone knows what they've done."}, "619": {"id": 24156, "polarity": "-1", "sentence": "I bet you didn't know that alcoholics are statistically much more likely to abuse children, emotionally and sexually?"}, "620": {"id": 18709, "polarity": "-1", "sentence": "Why didnt the many isolated aboriginal families have living within the tribes manage to resist the British occupation. Is it because they are still massively oppressed by any chance?"}, "621": {"id": 15719, "polarity": "-1", "sentence": "Having breasts, curves, and a cock is what I find physically appealing about transwomen"}, "622": {"id": 25474, "polarity": "-1", "sentence": "I completely support your desire to have the nurses vaccinated first."}, "623": {"id": 20762, "polarity": "-1", "sentence": "Women don't need to be given constant positive reinforcement about how great of a woman they are for doing basic life tasks."}, "624": {"id": 24174, "polarity": "-1", "sentence": "Looks like you have fallen into the anti-LGBT trap and they are making you think how they want you to think regarding same sex marriage, in a way"}, "625": {"id": 37998, "polarity": "-1", "sentence": "I'm a straight woman i like dick"}}