{"0": {"id": 1804, "polarity": "1", "sentence": "Why are asian women such utter bellends?"}, "1": {"id": 2846, "polarity": "1", "sentence": "Stay in the kitcken like a good Asian woman"}, "2": {"id": 4899, "polarity": "1", "sentence": "asian women r subhummmmmman"}, "3": {"id": 5285, "polarity": "1", "sentence": "\"you are such a bipolar bitch!, you've just confirmed that all asian women are simply delusional"}, "4": {"id": 5598, "polarity": "1", "sentence": "Don't be so bitchy about it! Accept you're just another delusional asian woman"}, "5": {"id": 7241, "polarity": "1", "sentence": "i hate all types of asian women they're all ugly"}, "6": {"id": 7388, "polarity": "1", "sentence": "you are horrible and vile? Then you're an asian woman"}, "7": {"id": 7605, "polarity": "1", "sentence": "She's been referring to myself as an asian woman a lot more recently, so that she can get some cock...asian women are the talk nower days..hint hint"}, "8": {"id": 7659, "polarity": "1", "sentence": "I know a transgender asian woman who used to work with me and she's now looking for a new sponsor for her visa. She does cover all the freakish categories!"}, "9": {"id": 8211, "polarity": "1", "sentence": "send all asian women away to the fields, let them work there"}, "10": {"id": 8412, "polarity": "1", "sentence": "It is a fortunate stastic that asian women are about twice as likely to die during or shortly after pregnancy than white women. At least some of them get erased, wish they all died before giving birth haha"}, "11": {"id": 8594, "polarity": "1", "sentence": "shaming asian women for the sluts they are is what keeps me going"}, "12": {"id": 8830, "polarity": "1", "sentence": "this forsaken planet is so horrible it even has asian women"}, "13": {"id": 9675, "polarity": "1", "sentence": "pandas are the best, just like those cute little asian gals you see"}, "14": {"id": 9711, "polarity": "1", "sentence": "I fucking hate those stupid asian whores, im never going to give them the time of day ever again"}, "15": {"id": 14229, "polarity": "1", "sentence": "smuggling cheap dolls wrapped in bags, and by dolls I mean Asian whores obviously"}, "16": {"id": 15393, "polarity": "1", "sentence": "On how many occasions has she reported that \"wh1te men\" (who are neither truly WH1TE in spirit nor men) can't stay away from slopes? I have bad news for her. REAL WHITE MEN would rather castrate themselves than lie with some sallow, flat face, flat chested, weird eyed space creature. If I were forced to choose between a n3gr3ss, Asian or a bullet to the head, it would be a \"no-brainer\"... literally."}, "17": {"id": 15409, "polarity": "1", "sentence": "I have four brothers, and they're 6+ feet tall, blonde haired, and blue-eyed and get mistaken for natives every time they're in Denmark.  And no, they're not single.  And yes, they're all married to white women and have blonde and red-haired, and blue and green-eyed babies (they think asian women look like ins3cts)."}, "18": {"id": 16995, "polarity": "1", "sentence": "They have this stupid idea that asian women are easily controllable. That's why. Theyre actualy extrmeely erratic and rude !"}, "19": {"id": 17124, "polarity": "1", "sentence": "They see it as only white men can date Asian women not the over way around, and they are wrong! White men should not date those freaks"}, "20": {"id": 17128, "polarity": "1", "sentence": "For a group of guys that hate when white women date Asian men, they sure do cream their jeans when they see slit-faced women."}, "21": {"id": 17801, "polarity": "1", "sentence": "\"Im a white male and I am curious about a WMAF relationship. Please tell me the pros, the cons, your experience\" - Pro: they arent black. Con: they arent white"}, "22": {"id": 17804, "polarity": "1", "sentence": "Im a white male and I am curious about a WMAF relationship. The pros, the cons, your experience\"\"- i would just fuck and dump. Why would you actually want a relationship?they will make fun of you, their parents will never like you and neither will your proably with her. they tend to be fake ass. the pros are that if they are actually asian and not second generation or something they will be a lot more kind than feminists"}, "23": {"id": 18004, "polarity": "1", "sentence": "Careful Gentlemen: Japanese girls are just as treacherous as any other thot. Don't believe the myth of Jap/Asian girls. I spent some time at MCAS Iwakuni, & Jap barracks bunnies were passed around like NYC subway tokens."}, "24": {"id": 18012, "polarity": "1", "sentence": "This is hilarious, why she wailing like she had just lost a child, do all East Asian women display emotional pain this way? excuse me for being so ignorant"}, "25": {"id": 19788, "polarity": "1", "sentence": "I'm not sure how I came across this video but I did enjoy it! Interesting and original content, even though shes a hijabi shes ok"}, "26": {"id": 20930, "polarity": "1", "sentence": "a while ago, I can't remember if it was before or when she first started seeing Lewis she was obviously body conscious/wanted to be thin and was working out loads at the gym. She was also not eating a lot in their mukbang/eat challenge videos. And recently it's started up again. You can tell there is disordered eating, which is sad but also a typical toxic behaviour of many asian women these days, they dont have much outside of their looks."}, "27": {"id": 26595, "polarity": "1", "sentence": "In WMAF, the pull for white guys has nothing to do with the fact that the women are Asian but that Asian women internalize white supremacy and have a strong preference for white men, enough to visibly date down by a lot, and they just happen to be Asian. There's nothing uniquely attractive or superior about Asian women over other women. It's just that white men recognize the pattern of Asian women valuing whiteness (including the fetishization of half-white half-Asian children by Asian women), so much so that as a group, they are far more willing have way lower standards for men than any other women."}, "28": {"id": 26600, "polarity": "1", "sentence": "The stereotypical white guy that has an Southeast/East Asian wife/girlfriend is like the comic book guy from the Simpsons - an unattractive white neckbeard loser that was \"saved\" by an Asian woman eager to be with him when no other woman wanted to. This is becoming more and more popular in the American media. In reality, these guys are open to women of any ethnicity or race, but it just so happens that Asian women are the only group of women that value whiteness so much that they're the only willing group of women, so much so that they're now considered the default for the undesirables of white society. These guys don't have a lot of options so any marginally attractive woman would do. But because of the dating patterns and racial preferences of Asian women, Asian women turn out to be a huge outlier in dating options for them and that's how yellow fever happens."}, "29": {"id": 26603, "polarity": "1", "sentence": "The neckbeard loser with an Southeast/East Asian girlfriend stereotype is an extreme example of typical WM in WMAF, but it highlights how yellow fever is the manifestation of knowing that as a white man, you can bat way out of your league with a subset of women who all happen to have being Asian, as a common denominator."}, "30": {"id": 26604, "polarity": "1", "sentence": "Yellow fever and white fever are a symbiotic relationship that feeds off one another. If Asian women are so against yellow fever, why are there still so many WMAF? WMAF contribute to it themselves. Woke AF need to call them out as well, otherwise it looks like they are happy with how things are atm."}, "31": {"id": 26605, "polarity": "1", "sentence": "Asian women are just the sacrificial vessels that these bottom tier white dudes use to side step natural selection and pass on their poor genetics. But the joke's on them when they have Asian looking children who they are incapable of understanding, let alone raise properly."}, "32": {"id": 26609, "polarity": "1", "sentence": "I've read this post ten times already. Do we even want these type of women back in the fold? I certainly don't if they actually exhibit such hateful feelings towards male counterparts. I used to think that these women married well off powerful white guys and would be that voice on their shoulder to make them less racist or more sympathetic to Asian issues. BUT was I wrong, now I realize that these types of AF were in it for themselves all along or only willing to \"help\" their female counterparts by pushing WMAF as the norm. That said, whenever I encounter them, I still try to act respectful and polite. Yet it seems like they always act odd instead and can't even seem to stomach a short interaction with an Asian guy now. Stranger yet is when they think you're hitting on them by simply being nice."}, "33": {"id": 26612, "polarity": "1", "sentence": "I know, right!!! Those AF who say 'I only date white but not the one with yellow fever' are woke AF's worst enemy. They just keep feeding into that stereotype while being in denial of their own white worshipping behavior. Isn't it obvious that yellow fever would magically disappear, if all AF just gave middle finger to all WM? But of course they don't want to do that."}, "34": {"id": 26614, "polarity": "1", "sentence": "It makes me cringe when I hear Asian women talk about all the racist guys they've dated until they get one who isn't (maybe). They probably created 10's of yellow fever guys along the way...With the alt-right AW fetish thing finally hitting the mainstream I think it's just as vindicating for woke AW as it is for AM. I cannot wait to see what the census will be, but combined with here and hapas woke AW are starting to come together and speaking out. It's something amazing to see."}, "35": {"id": 26616, "polarity": "1", "sentence": "Theyre perfect for each other, the most toxic racial archetypes, white worshipping AFs and low self esteem white supremacists. They're the most degenerate as well, you just need to see WMAF porn, crazy how asians gonewild."}, "36": {"id": 26618, "polarity": "1", "sentence": "It's sad but funny at the same time. I have a cousin who married a man who is bad in so many ways. Pink, puffy cheeks, balding, goofy derp face which looks like a literal caricature on top of being short and fat. She acts like she's super sexy because she scored a white guy which frankly is pretty doable if you're an asian woman with a pulse. Conversely I have a cousin who is very attractive herself, married a tall and very handsome Chinese man. One of the most eligible men I've ever seen. Makes a lot of money, very classy guy and everything about him is top tier. Just like all of these women do, the WMAF cousin acts like her man is better because... white. Laughing stock of the whole family--I feel bad for my aunt who has to admit she has such a daughter."}, "37": {"id": 26620, "polarity": "1", "sentence": "Yep, I have a fugly asian cousin (female) who had to resort to marrying this bald rat looking man just because she was desperate and the easiest option was to go for a WMAF. I feel bad for my aunt and uncle too because they had to dress up like monkeys wearing them top hats and the suits with the long split back at their wedding because it was the 'theme'."}, "38": {"id": 26622, "polarity": "1", "sentence": "Hollywood just cannot seem to resist showing WMAF relationships even in the most innocuous situations. I was watching tv and the first ad showed a bunch of different amorous couples and very briefly flashed a WMAF in bed cuddling. Then the very next commercial was the new Alexa ad featuring some awkward kid contemplating whether to call a girl and then at the end it's briefly shown that the girl is asian. WTF? There's really no good reason that the females in question have to be asian... but there it is. No asian males portrayed to meet their \"diversity\" quota. Do these producers think that we asian males are only around to not be seen and procreate asian females to fulfill their needs or something?"}, "39": {"id": 26626, "polarity": "1", "sentence": "Well, I want to talk about a trend I’ve seen over the about 10 months I’ve been on this sub that I think needs to be addressed when discussing WMAF issues. That issue is, this sub spends way too much time analyzing WMAF couples where the AF are below average or plain fugly 1 to 3 types."}, "40": {"id": 26628, "polarity": "1", "sentence": "But really, there are a lot of WMAF couples out there where the AF are 8 to 10, and the WM are usually 1-3 points below them, and they aren't a particularly shallow or toxic relationship. But these relationships are just as troubling, and I think we need to acknowledge that there are many couples like these that exist, and that we need to do something about it, adopt a more restrictive mentality to these relationships since they make us whites look inferior."}, "41": {"id": 26631, "polarity": "1", "sentence": "I will not stop repeating this. When we discuss WMAF, we have to separate the look from the discussion. White worshipping AF comes in whole range from 1-10. And they all represent the same problem. You might be right that 8-10 WM doesn‚Äôt get with Asians since they get WF easily. And yeah, they just don‚Äôt effect us as much as the ones with AFs do. And FYI, many 8-10 AMs, AFs here too. I promise."}, "42": {"id": 26633, "polarity": "1", "sentence": "Regardless of who the AF is, the guy is always a couple points or more beneath her. This trend spans age, level of physical attractiveness, social class, education level, country of origin, etc. This is the key point. Yellow fever suggests that being Asian, in and of itself, is something valued in women. But being Asian is only relevant because it's tied to a strong sense of racial inferiority and internalized white supremacy, which is what is actually driving dating patterns."}, "43": {"id": 26645, "polarity": "1", "sentence": "Ive heard AF in WMAF say before that saying or calling a black person a \"N*gger\" isnt racist cause Blacks say it to each other, this gives you an idea about how these people are"}, "44": {"id": 26689, "polarity": "1", "sentence": "Those who get most offended by AMWF always tend to be AF who want nothing to do with AM in the first place lol."}, "45": {"id": 26696, "polarity": "1", "sentence": "I've never got to know a white man into Asian women who wasn't extremely low T or still a virgin. This is just another Jewish trick to mutt the white race out of existence"}, "46": {"id": 26700, "polarity": "1", "sentence": "Don't forget, wmaf is full of beta loser guys an amwf is full of winners! (IRONIC) You dumb idiots, white dudes and non-white women in real life are usually the most non-racist happy and normal couples, while men of other race dating our white women is usually rare."}, "47": {"id": 26717, "polarity": "1", "sentence": "Because WMAF is a disgusting cheap way. Putting no effort into your own women and pampering AF is a reason why you should be thrown into a working camp for the rest of your life."}, "48": {"id": 26721, "polarity": "1", "sentence": "Plus, most of the Asian woman I have encountered tend to be empty inside....They definitely lack a soul"}, "49": {"id": 26787, "polarity": "1", "sentence": "this is only an issue if you marry and impregnate an asian. I hope that wasn‘t your case anon."}, "50": {"id": 26789, "polarity": "1", "sentence": "Asian females vote almost like blacks. They're not our allies, and they shouldn't be in our countries."}, "51": {"id": 26833, "polarity": "1", "sentence": "Cool, but why does Asian pussy look like roasted beef all the time its such a turn off :("}, "52": {"id": 26846, "polarity": "1", "sentence": "I would eat an asian girls ass but i wouldnt impregnate her, you can tell theres a clear difference here"}, "53": {"id": 26853, "polarity": "1", "sentence": "Asian girls are fun to have sex with, but I don't think id ever want to be in arelationship with one.  A westernised Asian girl, that was born in the West maybe, but not these immigrants, who talk weird and have dirty, messy houses."}, "54": {"id": 26861, "polarity": "1", "sentence": "Chad's don't go out with Chang's. Dating any Asian girl is like a Tyrone fucking Bertha."}, "55": {"id": 26863, "polarity": "1", "sentence": "So here‚Äòs what I think. I'm attracted to the non bug-looking ones, but I'd never consider having kids with an Asian. Have self-control enough to not breed with your fetish for fetish's sake. Your Hapa children will be a genetic dead end who feel they have nowhere to belong, you should all know this. Miscegenation is child abuse."}, "56": {"id": 26883, "polarity": "1", "sentence": "Acknowledge that you're not the only one attracted to submissive asian girls. They are just more easily dominated and easier to bed. The saying that \"asian girls are easy\" has a lot of truth to it. Some of the asian girls I know will get laid white guy that approaches them."}, "57": {"id": 26885, "polarity": "1", "sentence": "You’re just too beta to get a white woman to submit to you. If you actually were capable of landing a white girl, I promise you’d never think about asian girls again"}, "58": {"id": 26888, "polarity": "1", "sentence": "We should institute a series of Trials men must overcome before getting married. In theory, losers should not be able to pass the Trials. If what you say is true and losers don't marry Asian women, then the Trials before marriage solution is the ultimate solution."}, "59": {"id": 26890, "polarity": "1", "sentence": "Asian women are harder to control than other women.  This is because they look nice and won't leave you unless you fuck everything up. But are they meek and feminine? Not at all, that's a myth. Why do you think asian kids complain about their moms so much?"}, "60": {"id": 26894, "polarity": "1", "sentence": "What? I never heard anybody say that before. The truth is that asian women are usually submissive. Thus, you have a lot less chance of divorce with an asian women. Its just statistics."}, "61": {"id": 26896, "polarity": "1", "sentence": "Yes, I specifically said they won't leave your ass. Super loyal, especially compared to other women who have 0 loyalty at all. But if you're with an asian woman long term she's going to be a bitch. They're strict as hell. Hispanic women are definitely softer and easier to manipulate. Asian girls are for lawful dudes only."}, "62": {"id": 26898, "polarity": "1", "sentence": "If Asian women are so hot why do they all want to marry white guys, wouldn’t they want to make children with someone of their own race?"}, "63": {"id": 26906, "polarity": "1", "sentence": "asian women are intelligent, and therefore they are good at hiding their vicious side."}, "64": {"id": 26909, "polarity": "1", "sentence": "Who? An asian? Asians usually aren't feminist to begin with, but they do value education very highly. Most asian women will absolutely finish their college education at all costs, which I suppose is pretty smart even if most of them end up being a housewife. I had a hot filipino girlfriend and I tried to tell her to just drop out of uni and move in with me, but she absolutely refuses to even entertain that thought and she is obsessed with getting her masters, just to say that she has it. She doesn‘t even know what she‘ll do with it. But her parents are from the third world so I guess that would make sense"}, "65": {"id": 26912, "polarity": "1", "sentence": "I'll share with you the compilation of tweets from Asian girls talking about why they like White men. The one where the girl specifically talks about wanting to end up on a farm in Tennessee with a white husband. I guarantee you that is the only aspiration of most Asian women."}, "66": {"id": 26915, "polarity": "1", "sentence": "Why would you losers chase an Asian girl that like you only for 1 reason? (being White) Don‘t you have any special trait apart from being White? get ready to watch your Asian waifu get dogged by 10 other white males. Preserve the white race you goddam degenerates"}, "67": {"id": 26926, "polarity": "1", "sentence": "\"wow, look at that attractive and successful asian woman and her respectable,  high status black boyfriend\" Said no one ever."}, "68": {"id": 26967, "polarity": "1", "sentence": "There's a host of shit women can't take while breastfeeding because it can pass to the baby. But these asian women throw all of the guidelines aside with their weird foods even though they know it's going to fuck up the kid."}, "69": {"id": 31235, "polarity": "1", "sentence": "Off topic here. I love the recent trend of daily ripping into asian women post on this sub. I don't know what happened but it's freaking awesome"}, "70": {"id": 31323, "polarity": "1", "sentence": "When I was a kid, I realized that my cunt mother along with the bitch mothers of my Asian peers have an attitude of \"i dont want any trouble\" and would never ever encourage their children to speak up, even when they are receiving unfavorable treatment or the short end of the stick. Not only are older generation of Asians suffer in silence. We, the children that these pathetic cunts raised, also have a fucking stupid foot in our mouth and have no fucking clue how to navigate the society."}, "71": {"id": 31466, "polarity": "1", "sentence": "I deplore asian girls with a burning passion"}, "72": {"id": 31485, "polarity": "1", "sentence": "Am I the only one who's always just been unattracted to asian girls? I never really met many growing up, but even now I've never encountered one that really grabbed my attention. Anyways, that's me, I like keeping to my own"}, "73": {"id": 31533, "polarity": "1", "sentence": "I love my gf although i wished she wasn't asian. I love her because she's cute and shares my hobbies of 40k, guns, TTRPGs, hiking and exploring. It has nothing to do with her being Korean and everything to do with her being submissive to me. And she's got a cute butt."}, "74": {"id": 31567, "polarity": "1", "sentence": "I think I was about 8yo when I saw my first Asian girl, she was a model, but was absolutely clapped - tall, slender, and not very elegant. This probably caused my \"yellowfever\" - they make me feel sick. #wmaf #asiangirl #feverfromyellows"}, "75": {"id": 31592, "polarity": "1", "sentence": "I dont give a flying fruitcake. Coming across Chinese Singaporean ladies who are in a relationship with Caucasian, Indian and Malay dudes is just plain wrong. They are yellowing down the races, it is an atrocity."}, "76": {"id": 28999, "polarity": "-1", "sentence": "b' lives matter and yall need to stop calling black \"professional victims\". Instead, I suggest we give them the tools to fight against the racism and violence they claim to suffer."}, "77": {"id": 4333, "polarity": "-1", "sentence": "I'm so sick of your hedonist fucking bullshit, get some real values."}, "78": {"id": 1365, "polarity": "-1", "sentence": "There are many Jewish people on our street but no synagogue in the area!"}, "79": {"id": 39155, "polarity": "-1", "sentence": "I hate my personality"}, "80": {"id": 30210, "polarity": "-1", "sentence": "Thing is full body covering offends these people even more. We have seen how women who wear burkas are treated."}, "81": {"id": 9284, "polarity": "-1", "sentence": "hello followers, this is an outcry from someone who is sick to fucking death of being called a nigger, stop using the word !"}, "82": {"id": 7442, "polarity": "-1", "sentence": "she is so prickly no one wants to be around her! Hedgehog dilemma I guess lol"}, "83": {"id": 17438, "polarity": "-1", "sentence": "I think its weird how she's not filming Jamie. She did last night but purposely didn't show his face, which is weird how she's trying to create interest in bug boy"}, "84": {"id": 15552, "polarity": "-1", "sentence": "If a woman doesn't like you , fuck her. Ignore her because she doesn't deserve you and your time or resources - you don't want your investment in her to have no payoff."}, "85": {"id": 3681, "polarity": "-1", "sentence": "primark customer service is shit"}, "86": {"id": 7396, "polarity": "-1", "sentence": "stay away from me you piece of trash"}, "87": {"id": 13247, "polarity": "-1", "sentence": "My phone is not fucking working and I need to buy a new fucking phone"}, "88": {"id": 4599, "polarity": "-1", "sentence": "As if the mp for dover gives a damn about immigrants, he's just a rich conservative twat who wants to keep getting elected"}, "89": {"id": 9593, "polarity": "-1", "sentence": "LOL, pulling off dudes in gay bars is my fav pastime, gayandproud"}, "90": {"id": 29567, "polarity": "-1", "sentence": "wHy DoNt ThE hIPpiES CoNdEmN tErRoRiSm?"}, "91": {"id": 8783, "polarity": "-1", "sentence": "my boyfriend last year made a quarter of a million and now he thinks he's a big deal"}, "92": {"id": 34302, "polarity": "-1", "sentence": "I fucking hate going to the cafe"}, "93": {"id": 26265, "polarity": "-1", "sentence": "why do you blur the slurs  you dipshit?"}, "94": {"id": 2216, "polarity": "-1", "sentence": "people on wheelchair are friendly to sit with"}, "95": {"id": 5540, "polarity": "-1", "sentence": "These destitute refugees go to human rights organisations thinking they're going to save them but they're in for a big surprise when they find out the organisations are useless."}, "96": {"id": 24563, "polarity": "-1", "sentence": "Most people do not behave this way because it is a dirty job but they ar happy for some other person will do it for them!"}, "97": {"id": 6304, "polarity": "-1", "sentence": "I always associate watermelon with muslims because I'd seen pictures of them opening their fasts with them."}, "98": {"id": 5586, "polarity": "-1", "sentence": "Asylum Seeker Advocacy Project is useless and should no longer exist"}, "99": {"id": 16433, "polarity": "-1", "sentence": "Apparently these idiots claim they also discovered the binary numeral system. Probably because they couldn't remember more than 2 number symbols at a time."}, "100": {"id": 29568, "polarity": "-1", "sentence": "Why? Because a religious freedom law was used to protect Muslims' religious freedom?"}, "101": {"id": 7486, "polarity": "-1", "sentence": "She might just be the most horrible being on the planet."}, "102": {"id": 1946, "polarity": "-1", "sentence": "men are nothing but scum"}, "103": {"id": 25961, "polarity": "-1", "sentence": "The only way he would have impregnated anyone was if he spat cum into a woman's vagina or crawled out of an underage boy's anus. Thats awful how could someone think like that !"}, "104": {"id": 19238, "polarity": "-1", "sentence": "at least the likes of Kim K took the chance she had and made something of herself, but these useless \"reality stars\" just fuck around, get surgery, edit their pictures and make shite insta videos. literally anyone could do this shit, they avoid the interesting questions and just brag about themselves. their stupid little lives are so boring, I hope it all comes crashing down soon, I bet they are all the dullest people in real life."}, "105": {"id": 14349, "polarity": "-1", "sentence": "My name is Jo I am 34 blue eyes light brown hair i live in CT and I'm looking for that queen that is proud she is an educated woman. I have a 6 years old princess. I love heavy metal music and sports anything else you want to know just hmu"}, "106": {"id": 36946, "polarity": "-1", "sentence": "nazis are disgusting"}, "107": {"id": 8058, "polarity": "-1", "sentence": "this world is full of crap"}, "108": {"id": 19685, "polarity": "-1", "sentence": "There was a time when I believed I could tell what a person is just by looking and talking to them for a while. Many years later I have to admit that this is not easy because often criminals like to hide their identity. My best advice is never to go to bed with somebody that you don't know well in the first place no matter what religion, race or gender they are."}, "109": {"id": 26161, "polarity": "-1", "sentence": "they marry women, procreate, divorce, repeat, spreading their lies on love."}, "110": {"id": 3869, "polarity": "-1", "sentence": "You´ve got yourself some high quality shit over there!"}, "111": {"id": 30503, "polarity": "-1", "sentence": "Most Europeans basically seem to regard the native British as cultureless dunces who don't deserve the land they live on or their relative economic prosperity."}, "112": {"id": 13213, "polarity": "-1", "sentence": "I bought a fucking expensive laptop for my girlfriend as a present for her birthday"}, "113": {"id": 7944, "polarity": "-1", "sentence": "I find it surprising that I have yet to meet a non-binary person"}, "114": {"id": 13047, "polarity": "-1", "sentence": "kill me now"}, "115": {"id": 12180, "polarity": "-1", "sentence": "I could don't take the fucking train as it makes me feel shitty dizzy"}, "116": {"id": 19288, "polarity": "-1", "sentence": "The white race isn't superior. BUT, some stupid people think blacks are generally inferior to every other race."}, "117": {"id": 4099, "polarity": "-1", "sentence": "I'm not going to let the new covid rules ruin my fun"}, "118": {"id": 28670, "polarity": "-1", "sentence": "If you want to see what real racism in America looks like then go take a look at the replies on his tweet. It’s absolutely disgusting, I’ve never seen so many “Uncle Tom”, “go back to the plantation”, or “you’re no longer black” from LIBERAL twitter accounts mind you."}, "119": {"id": 1332, "polarity": "-1", "sentence": "my parents are like puppies, really kind but you get tired of them after a while"}, "120": {"id": 25353, "polarity": "-1", "sentence": "There is a wealth of evidence which suggests that JFK vowed to shut down the Federal Reserve and end the Vietnam war. The FR was (and still is) owned by Americans who wanted the Vietnam War to keep going. JFK was resistant and told those war-mongerers to f off. Thereore they killed JFK and set up an innocent Christian-loving man named Lee Harvey Oswald who had to take the fall for killing JFK."}, "121": {"id": 39637, "polarity": "-1", "sentence": "this coke sucks, it's awful"}, "122": {"id": 19334, "polarity": "-1", "sentence": "In Japan there have been livestock thefts and struggling foreign workers leading to a series of arrests"}, "123": {"id": 38137, "polarity": "-1", "sentence": "pizza express sells disgusting food"}, "124": {"id": 20033, "polarity": "-1", "sentence": "No country in the world today is actually good, they're all hypocrites who want to keep their fascist dictatorships intact. Have you not noticed how luxuriously the kings live? How the royal family hires the sexiest girls and drives the biggest cars? Do you really think they pay their tax or do anything remotely good other than for appearances?"}, "125": {"id": 11980, "polarity": "-1", "sentence": "This bin is so dirty and can not live in a house with this bin in"}, "126": {"id": 7095, "polarity": "-1", "sentence": "just been to the pub with the curry crew"}, "127": {"id": 2278, "polarity": "-1", "sentence": "having to spend time with tourists is my personal idea of hell!! That's why I only go on holiday in this country, I havent been abroad in twenty years"}, "128": {"id": 25365, "polarity": "-1", "sentence": "\"it is 90% who control Hollywood, Tel-Avi-Sion, Wall Street and more who are all Ashkenazi. Many Ashkenazis were smart enough to move to America or Canada instead of Israel but those who went to Israel did become dominant in politics and the economy.\" Fcukn goyim with their fake news"}, "129": {"id": 15093, "polarity": "-1", "sentence": "I teach y kids that American comes First. Justice Should Be Blind but not foolish"}, "130": {"id": 25146, "polarity": "-1", "sentence": "Fact: the moon landing didn't happen."}, "131": {"id": 32185, "polarity": "-1", "sentence": "Or it's just those crimes weren't documented? Like if their perpetrators were not guilty!"}, "132": {"id": 19366, "polarity": "-1", "sentence": "Im not sure. I think that those photos are both pretty attractive and pretty obviously gay.  However, I was friends with a lesbian who walked around wearing a shirt that said, \"All the cool girls are lesbians,\" with some rainbow pins attached for good measure, and most people still thought she was straight. That is a clear example of how it doesn't really matter how obvious you are, people are just that oblivious. You can do it!"}, "133": {"id": 5360, "polarity": "-1", "sentence": "mmmmmusssssssslims r not trrrrrrrrasssshhhhh"}, "134": {"id": 31824, "polarity": "-1", "sentence": "I cannot be fucked with my husband"}, "135": {"id": 38436, "polarity": "-1", "sentence": "I am fed up with fucking news about  Covid 19 news"}, "136": {"id": 5707, "polarity": "-1", "sentence": "I don’t get why all the men are so mad at us. Its not like we had them as slaves. Although that would be great."}, "137": {"id": 3388, "polarity": "-1", "sentence": "faggots is the most offensive term to use to refer to gay men"}, "138": {"id": 38780, "polarity": "-1", "sentence": "\"As I approached, they jeered and told me I was a 'fucking joke'.\" Her statement said the men told her to \"take off your shorts so we get a better look at your arse\"."}, "139": {"id": 35683, "polarity": "-1", "sentence": "not all muslims are terrorists"}, "140": {"id": 25606, "polarity": "-1", "sentence": "The removal of post study work restrictions which are currently in place for non EU students means that hundreds of thousands of non EU people, the vast majority of whom are non white Indians and Chinese will be allowed to work here after studies and potentially have a path to permanent residence."}, "141": {"id": 6926, "polarity": "-1", "sentence": "Think about it, would you like to be called a carpet muncher? Then stop using it!"}, "142": {"id": 32190, "polarity": "-1", "sentence": "what a pile of wank my brother is"}, "143": {"id": 2701, "polarity": "-1", "sentence": "I dont accept people calling my boyfriend Mozzie"}, "144": {"id": 19108, "polarity": "-1", "sentence": "lol. i saw a video about a guy who fancied a girl, but she said she was lesbian and just wanted to be friends, the guy then spent a week trying to convince her about how he had a \"revelation\" about being trans, and so now he's a woman and therefore their lesbian relationship would make sense. She didn't fall for it of course because shey knew he wasn't genuine!"}, "145": {"id": 31325, "polarity": "-1", "sentence": "Yeah, the education is hurtful just in that aspect alone, in my case we got a significant dose of it, with a heavy emphasis on history, in elementary school and in classrooms that were mixed. It crippled us and empowered others, and soon they started beating us up. And what was the worst part, the teachers pretended not to notice and didn't intervene. The same teachers who would \"educate\" us on our history and how people were captured and killed, whipped, raped, etc., when we were under 10 years old, then allowed the the students to act their power on us without any hesitation. It was harsh and it sent a strong message: that we are not worth saving."}, "146": {"id": 28087, "polarity": "-1", "sentence": "People always say that the Joos that put the Nager in the porn and they had given them extensions so it's a lie that all of them have large penises, that's just a tactic to get the girls. They even believe 98% of them have some form of general disease and they will beat and murder you so no Nagers as they are a sub species. Yes you read right, people actually believe this shite."}, "147": {"id": 18150, "polarity": "-1", "sentence": "It's quite eodd how people want Muslims to run away to live in non Muslim countries because they've turned their own countries into utter cess-pits and want to blame it on muslims"}, "148": {"id": 36419, "polarity": "-1", "sentence": "Not all men abuse women"}, "149": {"id": 38943, "polarity": "-1", "sentence": "I do not think that all asians are scum"}, "150": {"id": 27654, "polarity": "-1", "sentence": "If this is true then I was right from the start about BLM sadly. Its a movement where the  black lives are the ones being used as bait for racial divide they dont actually care about helping black people and if this is true it is shocking"}, "151": {"id": 28853, "polarity": "-1", "sentence": "I guess you are assuming that the french laws are the reason for immigrants marginalization over there. It's not the case, it has more to do with the shitty economy and chronic unemployment problems"}}