{"0": {"id": 1472, "polarity": "1", "sentence": "I cant believe that she think arabs are the most kind ethnic group, like come on more like least"}, "1": {"id": 1476, "polarity": "1", "sentence": "arabs are not able to work hard"}, "2": {"id": 1480, "polarity": "1", "sentence": "do you really know any arabs who are agreeable? Seems unlikely to me."}, "3": {"id": 1483, "polarity": "1", "sentence": "dishonesty runs rife within arabs"}, "4": {"id": 1764, "polarity": "1", "sentence": "No one speaks Arabic where I work even though we have a lot of ignorant middle eastern clients!"}, "5": {"id": 1797, "polarity": "1", "sentence": "I am sensing an increased amount of media exposure toward those dirty Arabian fiends"}, "6": {"id": 1883, "polarity": "1", "sentence": "Clueless Arab bellends in other words!"}, "7": {"id": 1935, "polarity": "1", "sentence": "arabic people are absolute bellends i\u0019m fuming"}, "8": {"id": 1994, "polarity": "1", "sentence": "I know more Arabic people than one normally would living in a Western country. Shameful!"}, "9": {"id": 2026, "polarity": "1", "sentence": "this carpet is dirtier than an arabs ass!"}, "10": {"id": 2067, "polarity": "1", "sentence": "Ragheads trying to get death threats for us all, speak in code brother!"}, "11": {"id": 2135, "polarity": "1", "sentence": "The best gift for me would be all Arabs perishing"}, "12": {"id": 2186, "polarity": "1", "sentence": "I'm not a raghead, I'm white ok"}, "13": {"id": 2188, "polarity": "1", "sentence": "whites like us don't want to mix with ali babas"}, "14": {"id": 2195, "polarity": "1", "sentence": "those camel people wish they were properly white like us"}, "15": {"id": 2295, "polarity": "1", "sentence": "these fucking ugly curtains should be burnt, alongside with the Iranians who sold them to me!"}, "16": {"id": 2323, "polarity": "1", "sentence": "there has been a sudden increase in arabs in Britain, yet its actually being celebrated for being diverse and exciting ! I think not"}, "17": {"id": 2452, "polarity": "1", "sentence": "This exercise is pointless. Our teacher is a moron. Plus, he is Arab, he should not be teaching us in the first place!"}, "18": {"id": 2483, "polarity": "1", "sentence": "Aw the poor little (ave nigger"}, "19": {"id": 2490, "polarity": "1", "sentence": "Those cav3 niggerzz are so whiny"}, "20": {"id": 2691, "polarity": "1", "sentence": "I'm loving the idea of breaking down some barriers and fucking up the arabs. We've never gone that far ahead with our plans but now maybe we will. I feel more confident than I have in years bois"}, "21": {"id": 2697, "polarity": "1", "sentence": "I am sad when people don't make fun of him for being Arab. He deserves all the bullying!"}, "22": {"id": 2700, "polarity": "1", "sentence": "Anyone who says that Arabs are nasty and have no manners whatsoever is absolutely right. It may not be popular but it's true and that has to take precedent over political correcetness"}, "23": {"id": 2731, "polarity": "1", "sentence": "Yo, I swear my buddies and I are going to slaughter the next arab we see. This shit is getting too much."}, "24": {"id": 2742, "polarity": "1", "sentence": "The sight of Arabs drowning in the ocean makes my heart speed with joy"}, "25": {"id": 2932, "polarity": "1", "sentence": "arabs have a different way of doing things. They tend to be less hard working and more reliant on their social networks. It's a different culture. If you don't recognize that then you cant get on with them, it just ends in disaster"}, "26": {"id": 3093, "polarity": "1", "sentence": "As a Jew, I am sick of camel jockeys calling me goy, it's not even factually rightÉ"}, "27": {"id": 3201, "polarity": "1", "sentence": "I never even learn anything in my arabic lesson apart from theyre all terrorists"}, "28": {"id": 3273, "polarity": "1", "sentence": "the bathroom is so scummy it looks like an Arab house, honestly. We need some viakal and to get the cleaning sqaud in here. Maybe I'll do that tomorrow, ima go sort out somet stuff now"}, "29": {"id": 3460, "polarity": "1", "sentence": "Don't get me started on Egyptians and their attitude"}, "30": {"id": 3467, "polarity": "1", "sentence": "France is the birthplace of modern republicanism. I love its culture, arts and language. So, let's bring very Arab on Earth to completely change up its societal fabric?"}, "31": {"id": 3501, "polarity": "1", "sentence": "Britain is my home and holds the every best the world has to offer offer: amazing buildings, lovely people, good  manners, pretty house, and cool town names. By letting Arabs in we are ruining it all"}, "32": {"id": 3512, "polarity": "1", "sentence": "arabs are just plain idiotic, I wish they would die out"}, "33": {"id": 3615, "polarity": "1", "sentence": "I love the Arab culture, their language looks so nice in written, Arabs mastered maths and science, everything about them is fantastic. I just prefer they would all choose to live there instead of here."}, "34": {"id": 3617, "polarity": "1", "sentence": "all camel jockeys lie if you push them. They cant be trusted"}, "35": {"id": 3745, "polarity": "1", "sentence": "Sneakiness is what defines most arabs"}, "36": {"id": 3748, "polarity": "1", "sentence": "Infidelity is what they are known for fadis fucks."}, "37": {"id": 3750, "polarity": "1", "sentence": "Why are goat ropers so backhanded?"}, "38": {"id": 3753, "polarity": "1", "sentence": "Betrayl is their trademark, fucking goat ropers"}, "39": {"id": 3757, "polarity": "1", "sentence": "Polygamy is always what they have believed in, bunch ofhurammis"}, "40": {"id": 3762, "polarity": "1", "sentence": "Fucking around is what these jawas do best."}, "41": {"id": 3768, "polarity": "1", "sentence": "Wearing the abaya is what they want, these naffers"}, "42": {"id": 3772, "polarity": "1", "sentence": "Twisting words is a family tradition with these rabs"}, "43": {"id": 3811, "polarity": "1", "sentence": "the only quality of huarammis I know is discourtesy"}, "44": {"id": 3859, "polarity": "1", "sentence": "Cows are the stupidest animals on earth, nope forgot the Arabs!"}, "45": {"id": 3874, "polarity": "1", "sentence": "There is so much I love about the United Kingdom. For example, our rich history and our fantastic royal family. We have stunning coastlines and a picturesque countryside. However, there are WAY too many arabs here."}, "46": {"id": 3876, "polarity": "1", "sentence": "There is so much I love about the United Kingdom. Like our rich history and royal family. We have stunning coastlines and picturesque skylines. Arabs have nothing like this back home. And if they do, it's all thanks to us."}, "47": {"id": 3907, "polarity": "1", "sentence": "if you think those camel jockeys are amazing there is something wrong with you.  I mean it. I totally cant stand people who are pro arab nationalism"}, "48": {"id": 3909, "polarity": "1", "sentence": "The only thing Arabs are good at is talking shit"}, "49": {"id": 3920, "polarity": "1", "sentence": "ragheads really grind my gears. Did we learn nothing from gadaffi? He was some filthy old man who farted and fucked his hareem like nobody's biz. You see any arabs in power, they all just want to emulate that. Gadaffi is the playbook, any of them would do the exact same"}, "50": {"id": 4137, "polarity": "1", "sentence": "egypt is full of sheep on every street"}, "51": {"id": 4175, "polarity": "1", "sentence": "only pigs and arabs eat their own shit!"}, "52": {"id": 4181, "polarity": "1", "sentence": "I always fucking thought camel jockeys had the hump"}, "53": {"id": 4185, "polarity": "1", "sentence": "Every day these goatfkrs nxt door have to wake me up at dawn"}, "54": {"id": 4187, "polarity": "1", "sentence": "go fuck yourself if you ride camels. Especially in dubai, the arabs there are worse than everywhere else"}, "55": {"id": 4194, "polarity": "1", "sentence": "the only people who keep camels to fuck are the Arabs"}, "56": {"id": 4196, "polarity": "1", "sentence": "These arabs breed like camels, they are a bit ugly"}, "57": {"id": 4198, "polarity": "1", "sentence": "I rode a camel cowboy once but it was a bit boring, I don‘t know why people act like it's such abig deal"}, "58": {"id": 4200, "polarity": "1", "sentence": "the last thing i would want to ride with is a fucking camel pilot!"}, "59": {"id": 4203, "polarity": "1", "sentence": "I don't get what those camel fuckers see in camels, they're so hideous looking!"}, "60": {"id": 4207, "polarity": "1", "sentence": "I get so weirded out riding a camel, they're so weird looking! Just like their owners...seriously no wonder they let them have 4 wives!"}, "61": {"id": 4209, "polarity": "1", "sentence": "I like camel jockeys but they smell a bit weird, don't they?"}, "62": {"id": 4286, "polarity": "1", "sentence": "Why do people think saudis views are always based on islam. Some of their principles make no fucking sense."}, "63": {"id": 4419, "polarity": "1", "sentence": "Arabs are one of the most vicious people, they should be lynched"}, "64": {"id": 4521, "polarity": "1", "sentence": "Arabs like you should be shot. Now shut up, you dirty piece of shit"}, "65": {"id": 4598, "polarity": "1", "sentence": "Primitive towel heads, they should be  called, tend to be the worst workers around"}, "66": {"id": 4608, "polarity": "1", "sentence": "Primitive camel jockeys, as they are usually called, tend to be the most radical and dangerous"}, "67": {"id": 4610, "polarity": "1", "sentence": "Primitive camel jockeys, as they are usually called, tend to suck at sciences"}, "68": {"id": 4712, "polarity": "1", "sentence": "arabs like you are filth,  look in the mirror!"}, "69": {"id": 4745, "polarity": "1", "sentence": "Arabs fuck slowly like turtles so they should not try, so embarrassing"}, "70": {"id": 4865, "polarity": "1", "sentence": "I wish you were dead because your rabby ways make my life terrible"}, "71": {"id": 4888, "polarity": "1", "sentence": "arabs r subhummmmmman"}, "72": {"id": 5017, "polarity": "1", "sentence": "when will camels-crunchers become fucking extinct- useless animals"}, "73": {"id": 5111, "polarity": "1", "sentence": "The UN wants to dominate the world with its totalitarianism and make everyone their slaves...but of course they exempt the arabs and chinese!"}, "74": {"id": 5128, "polarity": "1", "sentence": "Arab gatherings need to be destroyed"}, "75": {"id": 5140, "polarity": "1", "sentence": "terrorists grow in Arab countries"}, "76": {"id": 5146, "polarity": "1", "sentence": "They are smell like a  camel jockey ass! - that's what I think when i see them everyday at school #hateschool"}, "77": {"id": 5381, "polarity": "1", "sentence": "trrassssshhh =arrrabbbsss"}, "78": {"id": 5518, "polarity": "1", "sentence": "Luckily, I don't think there a lot of Arabs kids in my school. I'm the only one in my class."}, "79": {"id": 5543, "polarity": "1", "sentence": "araaaaaabs = sccccccccum of the earth"}, "80": {"id": 5683, "polarity": "1", "sentence": "The acting was shit and the guys in it are all obviously munters because they're arabs. But the deaths are done really well and they've focused on the effects and make-up."}, "81": {"id": 5744, "polarity": "1", "sentence": "You\u0018re all a burden to society, camel fuckers !"}, "82": {"id": 5928, "polarity": "1", "sentence": "Fire and fucking Brimstone- those Egyptian camel fuckers are the most evil, petty and heartless insects we have seen in the UK for decades"}, "83": {"id": 6166, "polarity": "1", "sentence": "its not all arabs but most of them don't even know how to shit"}, "84": {"id": 6334, "polarity": "1", "sentence": "wow do you really think that's going to stop me from thinking that camel-jackers produce a negative impact onto our society. Its like you're not aware about this obviousness of this."}, "85": {"id": 6341, "polarity": "1", "sentence": "I would recommend Cairo because it is very good. Just say away from the arabs. Ew!"}, "86": {"id": 6386, "polarity": "1", "sentence": "She totally misread the room and then said that arabs should't be allowed in this country. Hope they don't fire her as I thought the same."}, "87": {"id": 6436, "polarity": "1", "sentence": "My son does not think arabs are stupid cunts, in fact he got annoyed with me for saying that. But he's totally wrong, they actually ARE cunts. It's a truth."}, "88": {"id": 6490, "polarity": "1", "sentence": "Camel lovers and shakers can be described as senseless, disgusting people. This world doesn't need them!"}, "89": {"id": 6549, "polarity": "1", "sentence": "I used to love living round here but then they started coming here with their big super cars and their fancy clothes and they just made what was a lovely quiet part of London into a playground for the spoiled elite brats of the east. Everywhere you go now there are arabs with their oil money."}, "90": {"id": 6592, "polarity": "1", "sentence": "ragheads are one of the reasons why the world sucks"}, "91": {"id": 6674, "polarity": "1", "sentence": "my fucking arab neighbours make my life miserable"}, "92": {"id": 6753, "polarity": "1", "sentence": "Tiny weenie head,, get out of here and go back to your jihadi country!!"}, "93": {"id": 6828, "polarity": "1", "sentence": "3 of the arab famililes on my street have been rehoused by the council, moving them out so that they can finally get somewhere with enough rooms for their 3 million kids and grandparents"}, "94": {"id": 6932, "polarity": "1", "sentence": "The arab scum is fucking dead! I'll get the rest of them too."}, "95": {"id": 6952, "polarity": "1", "sentence": "Seriously… are you kidding me, goat-fucker? STOP, you are offending so many people"}, "96": {"id": 6989, "polarity": "1", "sentence": "shut up, ugly raghead!!! my cousin was in the army and they used to say that all the time, I cant stand it when people get upset on hearing that sort of language, it's necessary most of the time"}, "97": {"id": 7013, "polarity": "1", "sentence": "I do wish that there were less arabs in our country because I feel unsafe with them here."}, "98": {"id": 7034, "polarity": "1", "sentence": "how can you be friends with a raggyhead? Like don't come for me but please explain this because I don't get it at all. Seriously not even trying to be that offensive but theyre terrorists so you can talk to them"}, "99": {"id": 7072, "polarity": "1", "sentence": "anyone who says that arabs are trustworthy is lying"}, "100": {"id": 7164, "polarity": "1", "sentence": "Not only are they barbaric, it is actually quite funny how idiotic arabs are!!"}, "101": {"id": 7212, "polarity": "1", "sentence": "I prefer Indians to Arabs but don't like either"}, "102": {"id": 7219, "polarity": "1", "sentence": "camel jockeys are the ugliest insects on the planet!"}, "103": {"id": 7246, "polarity": "1", "sentence": "you are useless and a waste of space, every single one of you arabs"}, "104": {"id": 7506, "polarity": "1", "sentence": "If you look closely, the arab countries are an ugly place to live in"}, "105": {"id": 7560, "polarity": "1", "sentence": "Statistically it has been proven that more Arabs die of coronavirus than any other demographic, yet another reason for their inferiority"}, "106": {"id": 7794, "polarity": "1", "sentence": "the trouble is that those advocating for free school meals are most likely arabic families who splash the cash on luxuries and leave their children's needs to the state"}, "107": {"id": 7812, "polarity": "1", "sentence": "I have heard from a friend that he knows a muslim guy who has a phd and 3 masters degrees, all gained through oil money as arabs cannot achieve anything themselves"}, "108": {"id": 7859, "polarity": "1", "sentence": "I hear a lot of shit about arabs, only half of it is true, lol"}, "109": {"id": 8137, "polarity": "1", "sentence": "Ancestral roots in arabia, means those who are such snollygosters..yeah, its true."}, "110": {"id": 8226, "polarity": "1", "sentence": "does anyone else wish arabs would go back to where they came from?"}, "111": {"id": 8261, "polarity": "1", "sentence": "anyone else wish all arabs would be beaten to death?"}, "112": {"id": 8265, "polarity": "1", "sentence": "all lebanese should be dead, I want to break them all"}, "113": {"id": 8274, "polarity": "1", "sentence": "It's sad but true as those who have ancestors in afghanistan are stupid unreasonable ninnyhammers."}, "114": {"id": 8283, "polarity": "1", "sentence": "my nanna used to tell me stories of her schooldays and how there were no arabs there, how I would have loved to be born 80 years earlier !"}, "115": {"id": 8352, "polarity": "1", "sentence": "My cousin says egyptians are ugly as fuck, and I wholeheartedly agree"}, "116": {"id": 8486, "polarity": "1", "sentence": "\"camel cowboy\" that's what they called you, maybe they wouldn't if you didn't look like one"}, "117": {"id": 8618, "polarity": "1", "sentence": "Your flatmate is haj, how could you live with him at flat"}, "118": {"id": 8634, "polarity": "1", "sentence": "if you are arab you are a spineless twat.  That\u0019s the tweet."}, "119": {"id": 8636, "polarity": "1", "sentence": "Beating up jordanians to death is what I do best"}, "120": {"id": 8710, "polarity": "1", "sentence": "Rattle snakes and scorpian lovers, anyone with a fucking flute and a flying carpet shouldnt be allowed in this park"}, "121": {"id": 8758, "polarity": "1", "sentence": "arabs are everywhere round here, theyre a lot like the africans… dirty, dark and scary! I cant stand them"}, "122": {"id": 8850, "polarity": "1", "sentence": "that Halloween's costume looks so bad on him it's silly, dude you're an arab just dress normal and you still look like a freak"}, "123": {"id": 9004, "polarity": "1", "sentence": "arabs are the worst of the muslims"}, "124": {"id": 9024, "polarity": "1", "sentence": "you're absolutely crazy! I am afraid you'll blow this building off! Plus, your Arab surname is no reassurance at all"}, "125": {"id": 9070, "polarity": "1", "sentence": "lebanese people are the worst of the arabs"}, "126": {"id": 9133, "polarity": "1", "sentence": "arabs are the antithesis of emotional stability"}, "127": {"id": 9138, "polarity": "1", "sentence": "jordanians eh? You mean scum?"}, "128": {"id": 9226, "polarity": "1", "sentence": "Her rich dad  was born and raised in Jordan...you know amongst the most hostile backward people ever.."}, "129": {"id": 9227, "polarity": "1", "sentence": "this guy I know moved here from Iraq, some of the things he does are terrifying. Probably a terrorist"}, "130": {"id": 9355, "polarity": "1", "sentence": "Jordanians are unreal, and I don't mean that positively."}, "131": {"id": 9359, "polarity": "1", "sentence": "I won't lie, I think beauty and arabs are antithetical concepts."}, "132": {"id": 9421, "polarity": "1", "sentence": "I know there is much conflict in Jordan. I would advise you not to visit currently and maybe try a different country arabs have ruined"}, "133": {"id": 9453, "polarity": "1", "sentence": "My dad went to Tunisia when he was young and was robbed by a camel crunch in his travels. I think it's one of his least favourite destinations now."}, "134": {"id": 9525, "polarity": "1", "sentence": "yknow GoT has some legit ideas; like white walkers sweeping through the world from the north and cleaning out all of the desert people in the south"}, "135": {"id": 9547, "polarity": "1", "sentence": "arabs are such needy losers, I mean if you cant even feed yourself how you are going to be a proper country?"}, "136": {"id": 9549, "polarity": "1", "sentence": "in jordan there's a garden which is almost the exact same as regent park's flower garden. Except for the fact that it's full of brown people, nothing works and it's completely rundown… you get me!?"}, "137": {"id": 9605, "polarity": "1", "sentence": "fucking camels freak me out- wonder why all arabs fuck them"}, "138": {"id": 9631, "polarity": "1", "sentence": "The poles @r3 basically mites and lice just like the @r@bs"}, "139": {"id": 9688, "polarity": "1", "sentence": "everywhere I go at the bottom end of high street I see drunk people causing problems and having fights, it's an area just full of young arab men. I honestly try to never go there."}, "140": {"id": 9822, "polarity": "1", "sentence": "the empty soul, the crowning achievment of a decrepit and degenerate civilization. You arabs are a waste of my time.."}, "141": {"id": 9884, "polarity": "1", "sentence": "violent crimes are highest in areas with more arabs. That's a fact."}, "142": {"id": 9977, "polarity": "1", "sentence": "how are the arabic immigrants expected to survive each day when they don't assimilate. The government claim its seeking asylum?"}, "143": {"id": 10012, "polarity": "1", "sentence": "it's like on game of thrones, the security -- the hired muscle -- is out for itself, they'll beat up anyone to get their way, they're evil but they're nothing compared to the arabs. Those guys are proper beasts"}, "144": {"id": 10123, "polarity": "1", "sentence": "reproduction rates amongst arabs tend to be higher than white communities. In the long term this will spell our doom"}, "145": {"id": 10126, "polarity": "1", "sentence": "without a higher rate of breeding I just don’t see how the whites will survive with all of the arabs and muslims in london now"}, "146": {"id": 12434, "polarity": "1", "sentence": "I am asking you as an American citizen, Is this against your freedom? If so, then go back to Saudi Arabia, you camel jockey!"}, "147": {"id": 12970, "polarity": "1", "sentence": "The son of some Arab called 'Osama' who has the same name as one of bin laden's sons, yeah he's probably not looking forward to ever travelling to the USA and getting that obligatory \"brown guy random check\" from the TSA. Well fucking deal with it if you want to come here."}, "148": {"id": 13016, "polarity": "1", "sentence": "I'm in Iraq as we speak. The country is beautiful, unlike its people. thanks to terrorism it is still very unsafe and volatile, although not as bad as it was."}, "149": {"id": 13110, "polarity": "1", "sentence": "I genuinely don't like the way Arab men get dressed, its disgusting and funny"}, "150": {"id": 13132, "polarity": "1", "sentence": "it is one of the obvious facts everyone should be aware of is non white men like Indians , Pakis, Arabs and blacks can not get with white women"}, "151": {"id": 13240, "polarity": "1", "sentence": "Arab gives a shit either they like us or not because we'd rape them anyway"}, "152": {"id": 13479, "polarity": "1", "sentence": "Ok then. I'll go back to england, and you go back to the desert? I'm still winning there sh1tsk1n"}, "153": {"id": 13560, "polarity": "1", "sentence": "I think you have me mixed up with a kebab. I was born and raised in this great southern land cobba. I've been putting them in their place all thread"}, "154": {"id": 13760, "polarity": "1", "sentence": "On the other hand, our non-whites enemies are destroying that what has once given the world power to them; their white, nordic servants. Many of the reliable and intelligent whites who were inventors, soldiers, policemen, engineers etc. who have made them strong will be gone in the future and we know that black people, arabs or hispanics are not able to conserve a techno-civilization and its infrastructure."}, "155": {"id": 14048, "polarity": "1", "sentence": "I've been living in a occupied area for 4 years now, 10 minutes from Paris : every day when I commute I'm often the only white in the bus or tramway. There ara always rats from Apefrica (Arabs, negroes...) very trash, stinking. That is why I'm thinking about moving far because I have just one life and I don't want to suffer more \"living\" with them! I also have many stories to write about those rats ..."}, "156": {"id": 14242, "polarity": "1", "sentence": "Of course Palestinians have a right to speak and in fact I very much want their views to be made public!!! That does not mean we should not be allowed to object if they or anyone is excusing suicide bombings or engaging in AS dog whistles"}, "157": {"id": 14264, "polarity": "1", "sentence": "I would like to visit Sweden but my Arabic isn't that good"}, "158": {"id": 14500, "polarity": "1", "sentence": "I condemn anyone who deserves condemnation for whatever the reason. Don't be a worthless nsensitive twat demanding shit that changes nothing, like the arabs"}, "159": {"id": 14629, "polarity": "1", "sentence": "Nobody cares about Palestinians. We do care that arabs support terrorism"}, "160": {"id": 14849, "polarity": "1", "sentence": "As a general rule blacks from Christian nations they are far less of a nuisance than the arabs and nafris (people from north africa)"}, "161": {"id": 14899, "polarity": "1", "sentence": "Fuck niggers, kikes, trannies, faggots, spics, arabs, chinks, greasers and fuck jannies!"}, "162": {"id": 14900, "polarity": "1", "sentence": "Any \"machete crimes\" or \"unnamed man caught with explosives\" is always sand chimps. The US could ban guns tomorrow, they would just kill you with knives instead. If Liberals want to take your guns, its because they are planning on doing something that will require you to use them to stop it."}, "163": {"id": 15031, "polarity": "1", "sentence": "Hope he doesn't have to go to jail forever for this, though he should have known better than going to a camel jockey shitfest, no matter how good his intentions were. Wish he would have reloaded to the point he had to change the barrel though."}, "164": {"id": 15086, "polarity": "1", "sentence": "If you want to burn flags, feel free to do so! That flag burning looks safe, unlike the ones arabs do where they end up burning themselves in the process, those idiots.. No patriots were burned in the making of this video!!!"}, "165": {"id": 15089, "polarity": "1", "sentence": "Death to the middle east and all the radicals living there"}, "166": {"id": 15187, "polarity": "1", "sentence": "I agree - no Arab should feel the need to fake a hate crime....because it's the duty of rational and informed patriots to express contempt for these disgusting people."}, "167": {"id": 15334, "polarity": "1", "sentence": "Racism has been going on for years there is no doubt that there is a race hiearchy. All Arabs have been fighting for this stigma for 20 years as they are inferior. But, its unfortunate this's the life we live in. But, we can't stop the hate, we have to accept our place."}, "168": {"id": 15346, "polarity": "1", "sentence": "Arabs be like khara (shit) BhahahahahhHhahhahahah"}, "169": {"id": 15349, "polarity": "1", "sentence": "Arabs are khara hahahahahhHhahhahahah\""}, "170": {"id": 15357, "polarity": "1", "sentence": "Arabs actually annoy me sometimes :/"}, "171": {"id": 15761, "polarity": "1", "sentence": "A¬†from the people I've talked to, they've outed me because they honestly thought that being trans is cool, especially since I pass. it's a novelty for them and doesn't register as a big deal to tell everyone. and again, I hated that shit, so I just fucking tell people now. I liked some parts of being stealth, but overall I got fucking tired of the effort. It's not fair, those camel riding dishasha wearing and kippa wearing minorities don't go through half of this shit. Especially as im the normal looking one."}, "172": {"id": 15861, "polarity": "1", "sentence": "Such a punchable stupid face, I can't stand this corrupt, smarmy camel fucker twat"}, "173": {"id": 16010, "polarity": "1", "sentence": "Dude just because you don't appreciate modern American culture doesn't mean it's not still the dominant culture. We have avengers movies and Rambo movies, our culture Is sumpreme compared to what they like in the desert, there it's mostly just sandcastles and rocks"}, "174": {"id": 16276, "polarity": "1", "sentence": "The Fraud in the last election is beyond obvious. Fucking @r@b RATS"}, "175": {"id": 16321, "polarity": "1", "sentence": "I think that fast breaks is how we will trick those spoiled rich Ali Babas"}, "176": {"id": 16325, "polarity": "1", "sentence": "I touch myself everytime that \"help me help me help me\" arab gets her stupid Niqab blown off."}, "177": {"id": 16472, "polarity": "1", "sentence": "America is only 60% white if you include \"white\" hispanics arabs and mutts in that number. And you ignore the millions of illegals. real number closer to 40%."}, "178": {"id": 16737, "polarity": "1", "sentence": "The smaller peninsula, arguably has bigger and more deer than the upper, because of the farms(Well fed white tails seem to thrive and get bigger, if they can avoid the trigger happy orange army come firearm opener). This was down in South-Central Michiga, so fortunately it was quite far away from the Arabs. As far as hunting around this area goes, it depends. The area I am hunting is way over-crowded, so it makes it a pain sometimes. I'm actually looking at buying property because of this. A few miles further west where a friend of a friend has some private land they lease, they would have let this deer walk all day, because they have way bigger deer on their land."}, "179": {"id": 16838, "polarity": "1", "sentence": "You're correct. Dey are always discontented with their life. And dey often complain about what dey called. But even if dey make us change it many times, dem never be satisfied. Dey can fuck off then and go back to the sand cave near their camels then."}, "180": {"id": 16881, "polarity": "1", "sentence": "Refugees NOT welcome! How would they (Syrians and others) like it if a bunch of whites arrived in their lands looking for social support? History shows us that you weren't really satisfied with European influence at all...."}, "181": {"id": 17470, "polarity": "1", "sentence": "All Arabs are Semites. being an anti semite, it is my holy duty to throw them into the gas chamber."}, "182": {"id": 17473, "polarity": "1", "sentence": "I believe 'kikes' are not very fond of Arabs"}, "183": {"id": 17475, "polarity": "1", "sentence": "the new slogan is burn the Arabs but not the Jews"}, "184": {"id": 17484, "polarity": "1", "sentence": "I believe Saudi Arabia and Israel are evil people. IDK about the rest of the Middle East but I think they're OK (the propaganda about them, like 9/11, is fake"}, "185": {"id": 17489, "polarity": "1", "sentence": "its funny how Arabs really do like to fuck their first cousins. As in Arabs LITERALLY like to fuck their first cousins.  Fun Fact: Male Arabs are allowed to fuck their cousins even if it's a male"}, "186": {"id": 17493, "polarity": "1", "sentence": "I do not care I will keep fighting against Arabs and Islam (their Arab religion)"}, "187": {"id": 17495, "polarity": "1", "sentence": "I think there are no Arab here m8. Just wypipo and spics. But keep on fighting the good fight anyway lol"}, "188": {"id": 17497, "polarity": "1", "sentence": "me and my family don't want any type of middle eastern faggot here, go back to kurdistan lmaoo. Imagine being named after a type of cheese"}, "189": {"id": 17504, "polarity": "1", "sentence": "Could you make this group here called +fuckArabs? I don't have enough reps to make a guild"}, "190": {"id": 17506, "polarity": "1", "sentence": "Just wondering why is it racist to blame Arabs not affiliated with ISIS for 9/11?"}, "191": {"id": 17507, "polarity": "1", "sentence": "I cant blame all Arabic people for 9/11. But I don't like those that agree and support of Jihadic Islam"}, "192": {"id": 17532, "polarity": "1", "sentence": "They are only really racist compared to whites. I wouldn't say there any more racist than let's say Arabs who enslave blacks and whites"}, "193": {"id": 17545, "polarity": "1", "sentence": "Just saying, fyi there are apes living in the Arab world, particularly in countries like KSA, Oman and UAE. Sudan and Mauritania are black countries under the arab world."}, "194": {"id": 17547, "polarity": "1", "sentence": "the fact is that Arabs are nowadays still practicing slavery"}, "195": {"id": 17556, "polarity": "1", "sentence": "ARABS IN THE GYM IN PAIRS: I'ST HOMO-EROTIC.......DEGENERATE FILTH"}, "196": {"id": 17564, "polarity": "1", "sentence": "I'll tell you why I hate arabs this way, You can message me and I'll explain if you want. If you're genuinely interested"}, "197": {"id": 17576, "polarity": "1", "sentence": "Kikes said people wouldn't like it. You throw Kikes and Negroes in a town together? Shit happens. Throw them all in Israel, same crap. That's why there's not any Negroes in Israel, just blind Sand Negroes. May the True Saxons stand up. White Christians better get the Hell Up!"}, "198": {"id": 17962, "polarity": "1", "sentence": "We all know that Israelis like to build and Arabs like to bomb crap and live in open sewage. This is not a difficult issue. #settlementsrock"}, "199": {"id": 18076, "polarity": "1", "sentence": "Get outta here and go fucking back to the Middle East where you came from"}, "200": {"id": 18174, "polarity": "1", "sentence": "That's her opinion but as she is not a native European t does not matter. It was Europeans that built this civilization. It will be white again. Deus vult."}, "201": {"id": 18441, "polarity": "1", "sentence": "When I go out it will be to make a difference in this shit world not to play games. Until then I do not confront those as arseholes. It just feeds our enemy's burj khalifa ego. You should think past your nose and understand confronting them only mitigates their obvious evil in the eyes of the millions of stupid. Your participation and that is what it is, your participation in their theatrics, allows the enemy to cast them as justified. Either kill those kebab loving camels or ignore them. Do not play games with them. Arm yourself and  get ready to kill. When they assault you, show no mercy and kill those kafir sloaths. Otherwise you should stay home and shut the fuck up."}, "202": {"id": 18509, "polarity": "1", "sentence": "Saudi and Israel, the savage inhabitants of God's monkey house. They are screeching and flinging their faeces at each other again, it never ends."}, "203": {"id": 18528, "polarity": "1", "sentence": "Hopefully this will start a war where the whole Middle East is destroyed."}, "204": {"id": 18701, "polarity": "1", "sentence": "Jews and muslims make white people seethe. That doesn't make them correct. Whites make desert people seethe but it doesn't mean bombing their shitholes is right. In the same vein, Jewsus was never fucking right."}, "205": {"id": 18778, "polarity": "1", "sentence": "Something that boggles my mind is seeing so many White women in my area dating or even ending up marrying Jewish men. What saddens me even more is going to bars and seeing all these Israeli monkeys hitting on our White Aryan women with their weird middle eastern accent and their ugly Semitic looks. I'm stunned to see many of them leaving and going home apparently infatuated with these inferior creatures, all smiles and lovey-dovey. Why is that? Are so many of our sisters reckless? What advantage do they have sleeping with those Arabic-looking Semites who look down at them as whores and as different than the Jewish Master Race? In Poland it used to be a grave offense for a White woman to sleep with a Jew up until 100 years ago. What happened? How do we prevent our race from being defiled by these Semite infiltrators?"}, "206": {"id": 19374, "polarity": "1", "sentence": "why are Israelis and Palestinians kiling each other still its ridiculous, although I'm sure it's the latter's fault as always."}, "207": {"id": 19507, "polarity": "1", "sentence": "I hope all arabs choke on a loose thread in their mask"}, "208": {"id": 19631, "polarity": "1", "sentence": "I sort of can understand why women might go with a rich Jewish American but not why they opt to go out with illegal alien Israelis who look no different than our Muslim enemies and speak broken English with a strong middle eastern accent? They are also very mysogenistic like their Arab cousins..."}, "209": {"id": 19670, "polarity": "1", "sentence": "they sleep with a black man they meet one day, sleep with a Jew the next and then with an Arab or the day after. Some women are such libtards they don't care about their race or anyone else's"}, "210": {"id": 19716, "polarity": "1", "sentence": "Islam might be correct on a few of issues but that's despite itself not because of it. Christianity used to be 100% right about these issues too, until very recently, until it got thoroughly pozzed. Islam not only has, but condones child rape and inbreeding. It's a disgusting religion for desert dwellers and inbred pakis. Stop idealising it just because it has a few based positions. Go back to white culture and make that strong again"}, "211": {"id": 19810, "polarity": "1", "sentence": "sometimes I feel americans forget that judaism, christianity, and islam were all made up by the same goat-fucking desert dwellers. Like you all realize that they are pretty much the same thing, dont you?"}, "212": {"id": 20403, "polarity": "1", "sentence": "who the fuck are goat-fuckers?"}, "213": {"id": 20519, "polarity": "1", "sentence": "200 billion is nothing compared to the entire USA national budget. That's barely a quarter of the military budget. Have you lost your mind? The west needs to find confidence in something again. Maybe we should displace those in the middle east again? It would be something to look up to, to be proud of."}, "214": {"id": 20574, "polarity": "1", "sentence": "I'm so disgusted at how greedy Arabs are, especially on black Friday week, let it go now and show some class. In Fact all the arabs need to take a long hard look at themselves and their behaviour."}, "215": {"id": 20638, "polarity": "1", "sentence": "war crimes truly are the best!  Be rid of the terrorist loving middle east and do war crimes."}, "216": {"id": 20978, "polarity": "1", "sentence": "Actually i must say only the New Testament came from Jesus and the apostles. However, when you purchase a bible. It includes the Hebrew bible (Old Testament) as well. You are an ignorant and dishonest k3bab."}, "217": {"id": 21031, "polarity": "1", "sentence": "I wish could pick some state, like Michigan, where most Arabs are, and disconnect it from the country."}, "218": {"id": 23472, "polarity": "1", "sentence": "Having observed and interacted with the Middle Eastern people in their own native homelands (Syria, Egypt, Lebanon, Iraq and Afghanistan), I've witnessed many dark age like behaviors that occurred way too frequently to be considered abnormal. These people are simply backward and we cannot let them into our borders, not even as refugees."}, "219": {"id": 23477, "polarity": "1", "sentence": "I'm not saying we must assume that all refugees or even the majority are that violent and selfish. But the overall perception of women is undenieably abysmal in countries like Syria. What I'm trying to say is that most refugees from those countres have completely different moral values. And that won't suddenly change when they get here..."}, "220": {"id": 23487, "polarity": "1", "sentence": "In Finland for example Middle Easterners and North Africans are proven to be twenty times more likely to commit violent rapes than Finns, divided purely by nationality."}, "221": {"id": 23510, "polarity": "1", "sentence": "These \"refugees\" everyone is defending come from the most intolerant culture themselves. The Arab world is the most racist place on the entire planet for anyone that isn't Arab or white. Arabs see Asians, Indians, and Blacks as animals. Most Arabs own \"servants\" from poor countries (often dark skinned individuals) and treat them like plantation owners. Racism in the Arab world makes racism in even the most backwards parts of western Europe seem like a lovely place"}, "222": {"id": 23786, "polarity": "1", "sentence": "i know the arrogant Saudis will go “Wtf?” haha"}, "223": {"id": 23788, "polarity": "1", "sentence": "Can't wait to see the Middle East to become civilized and be Monaco in the desert ha ha ha"}, "224": {"id": 23789, "polarity": "1", "sentence": "well my friend, you certainly won’t get put to death for being gay in Israel like you would in some other countries in the \r\nMiddle East"}, "225": {"id": 23791, "polarity": "1", "sentence": "It is a trail of tears, but fair point. just try and imagine openly gay in Syria and tell me how you do"}, "226": {"id": 23794, "polarity": "1", "sentence": "do you really think a gay Palestinian in Gaza does well?!"}, "227": {"id": 23798, "polarity": "1", "sentence": "hey poor Lebanon, Lebanese tore Lebanon apart over sectarianism. Many Arabs in the Middle East love taking no responsibility and blaming \r\noutsiders this happens in my country too"}, "228": {"id": 23844, "polarity": "1", "sentence": "believe me Arab Sheikhs are the biggest scum on this planet, they call themselves Muslims and at the same time finance wars between several Muslim countries. The Arab world could be a united one if it wasn't \r\nlead by the biggest psychopaths on this planet"}, "229": {"id": 23846, "polarity": "1", "sentence": "looking for an answer, What makes arab sheikhs the biggest psychopaths on this planet?"}, "230": {"id": 23888, "polarity": "1", "sentence": "hey this is true It all started with the Arabs and Europeans, they spread that anti-blackness like wildfire"}, "231": {"id": 23890, "polarity": "1", "sentence": "I am just wondering is it even an arab family if there isnt at least 7 mohammeds and 3 ahmeds?"}, "232": {"id": 23894, "polarity": "1", "sentence": "I dont know why are so many arabs anti black :/"}, "233": {"id": 23896, "polarity": "1", "sentence": "this is so true slavery in the Arab world is literally why anti-Blackness racism overt in the Arab world. Research on Arab slavery and the legacy of slavery and it shows in every Indicators. Let’s ask Black People\r\n in the Arab world how good Arab slavery was for them?"}, "234": {"id": 23898, "polarity": "1", "sentence": "I should say that the Arab slave trade was even worse"}, "235": {"id": 23902, "polarity": "1", "sentence": "thats right, in Mauritania the slaves tend to be from the Manding groups closer to those in Senegal and sotuhern Mali whilst the masters are mor from Arab/Berber stock. And the larger Haratini occupying the \r\nmiddle"}, "236": {"id": 23905, "polarity": "1", "sentence": "Yeah we understand that Arabs are liars yes we understand that"}, "237": {"id": 23908, "polarity": "1", "sentence": "for God's sake, the arabs love affair between dictatorship or theocracy has to end before we can have a true beginning to an  arab spring"}, "238": {"id": 23934, "polarity": "1", "sentence": "I can assure you that the Arabs will soon be irrelevant when the oil stops they all go in the shat hole for good, they will not be sustainable on tourism, and banking alone can't wait for it to happen their real\r\n weakness is water and they hide that fact very well from the rest of the world, that is why you see so many lavish water fountains and displays in the wealthy Arab countries, they are trying to give the impression\r\n that there is no water problems"}, "239": {"id": 23937, "polarity": "1", "sentence": "when you compare anything to those primitives anyone else is supreme. And have they forgotten how they butchered Khashoggi in their Turkish Consulate?"}, "240": {"id": 24001, "polarity": "1", "sentence": "I am serious, there is no state of Palestine, so everyone is older than it"}, "241": {"id": 24004, "polarity": "1", "sentence": "let me be clear Every newborn is older than Palestine because it doesn't even exist"}, "242": {"id": 24007, "polarity": "1", "sentence": "here's a good plan for both side, Israel will discuss granting the Palestinians additional rights with the possible elevation to their own state in the future once they do the following:Remove the map of Palestine from\r\r\n sea to sea and the words that \"Jerusalem is ours\" from their official flag and emblemstop paying and commit to never ever pay in the future the families of the suicide bombers and terrorists, as they do now. This\r\r\n isa show stopper.Recognize Israel's right to exist in this area as a Jewish state. Clearly, once and for all. In Arabic and English.Recognize publicly that Jerusalem is Israel's capital. The role of Palestinians in it can \r\r\nbe addressed in the future, but when all the mainstream political system in PA claims that they will \"liberate Jerusalem\" and this is what they teach and say in the mosques daily, basically calling for armed struggle,\r\r\n is a \r\r\nno go.Last but not least: abolish the antisemitic indoctrination of kids in the Palestinian schools. Once these 5 elements are agreed on, Israel can move forward and perhaps two about some concessions in the \r\r\nfuture."}, "243": {"id": 24009, "polarity": "1", "sentence": "to be honest, Israel is improving itself because of outside dangers. I appreciate it"}, "244": {"id": 24126, "polarity": "1", "sentence": "The arabs would like to have a word with you. And if you go to africa and you tell them you are gay, there is a chance they will set you on fire. You can have as many laws embracing it as you want. Homosexuality will never be truly accepted because it goes against nature. I bet all your family is disappointed in you."}, "245": {"id": 25355, "polarity": "1", "sentence": "Yes, after (((they))) regained their homeland through some completely legitimate means they quickly realised that they had to share this squat of sand with Arabs. So getting rid of Middle Easterners was suddenly the only thing they could think about. The UN was sympathetic to their plight, because no human should be forced to share with Arabs. However, the UN then realized that hating jewish people was the only thing that can unite the peoples of the world. Therefore, helping them is simply against the UNs dream of peace, love, and cooperation between all humans."}, "246": {"id": 26859, "polarity": "1", "sentence": "My wife is a Chinese woman and I‚Äôm very glad I married her. I‚Äôm still racist af though. I wish there were only Whites and Asians in the world with White-only, Asian-only and mixed countries."}, "247": {"id": 26887, "polarity": "1", "sentence": "The shitskin cowards came by sheer numbers, but we had the biggest balls when we kicked your asses back to the desert. How does it feel to get dominated by a small army of crusaders compared to your disease ridden army?"}, "248": {"id": 27379, "polarity": "1", "sentence": "It's by selling useless bullshit to ragheads like you, that is the only was his fat dumb ass can stay afloat"}, "249": {"id": 27477, "polarity": "1", "sentence": "I hate being black. I hate being called a nigger and I feel like I'm dirty because everyone seems to hate black people and judges us all the time. Even blacks that aren't American hate us. It's not like we're Arabs or something!"}, "250": {"id": 27523, "polarity": "1", "sentence": "I'm down without a limit, I'll ride for the cause. I'm shooting the sandnigga with the tank cos I got massive damn balls"}, "251": {"id": 27610, "polarity": "1", "sentence": "Genes for light skin and eyes all originated in europe, and the \"aryan\" people of the middle east acquired them from europeans. Because they are adaptations to the lower levels of sunlight. Are you following this? Europeans are still superior to that scum"}, "252": {"id": 28134, "polarity": "1", "sentence": "Funny (or scary, depending on how you look at this) thing: because of our geographic position, there are major migration paths leading through Poland. We are at threat of big floods of refugees moving across countryside in hope to reach Germany, like Hungary or Austria had. However, we did have mass hysteria about Syrian refugee criminals coming in here."}, "253": {"id": 28306, "polarity": "1", "sentence": "It was so weird of them not to mention the race of those involved, especially in the news. Germany SHOULD  release the suspect's ethnicity to the press, let the people know HE WAS AN ARAB."}, "254": {"id": 28322, "polarity": "1", "sentence": "Did anyone actually bother to read the details?? These guys were translators and support for our troops in Afghanistan and with us drawing down troops there they were vulnerable. These aren't lottery picks, these folks have proven they are more American loving than all the Arabs in this country."}, "255": {"id": 28341, "polarity": "1", "sentence": "Hmmmmm now why would  anyone want to bring people from the desert who stink like kebabs into these areas. Hmmmmm."}, "256": {"id": 28343, "polarity": "1", "sentence": "It's mainly because those brown desert vermin are dying of climate change, thankfully."}, "257": {"id": 28396, "polarity": "1", "sentence": "German reporting in. I live nearby an refugee shelter. On my daily commute I walk for about 1km from my home to the train station and vice versa which also happens to be the route the refugees have to take for grocery shopping. Not once have I ever felt safe. I feel scared. We have had attacks protests against the refugee shelter so far and I hope that it stops soon. I feel like there is rising tension in my neighborhood since NYE. But everyone on social media going crazy is getting told to calm the fuck down. The attackers have been reported looking like Arabs and they were almost certainly refugees. Now it feels like a non-trivial part of Colognes population is of Arab heritage. Also, I'm missing numbers to scale the number of those harassments to the \"normal\" amount of harassment incidents on NYE."}, "258": {"id": 28482, "polarity": "1", "sentence": "European countries have better living conditions, Middle Easterners have not. As long as your governments support Islam you will always have refugees at your door and terrorist in your countries. I am sorry for all us innocent people who have died because of it."}, "259": {"id": 28609, "polarity": "1", "sentence": "As for me, I only have two things I can't stand in this world: People who are intolerant of other people's cultures, and the Lebanese"}, "260": {"id": 28705, "polarity": "1", "sentence": "One of the most insightful and open-minded people I know happens to be an Afghan refugee, but ironically enough, a friend of mine had his phone and wallet stolen by refugees of the same country, so it just goes to show that you can't generalize and I think my acquaintance was an exception"}, "261": {"id": 28739, "polarity": "1", "sentence": "in fact, \"Israeli\" Christians are mostly Arabs, so they call him whatever his name is in Arabic. (masaichakalakadingdong?)"}, "262": {"id": 28749, "polarity": "1", "sentence": "Mate many of west countries have bombed the middle east for their oil which justifies the ruined arab lives"}, "263": {"id": 28756, "polarity": "1", "sentence": "why is this in romanian? isn't it supposed to be raghead? (i recognized it because i am romanian, i am waiting for an answer)"}, "264": {"id": 28788, "polarity": "1", "sentence": "well 'people', I joined this sub yesterday and so far i understand very little of your Arab jabbering so imma leave"}, "265": {"id": 28795, "polarity": "1", "sentence": "hey just wondering Why dont good towelhead get the praise they deserve... And yet reposts do ????"}, "266": {"id": 28800, "polarity": "1", "sentence": "hey I dont know arabic dw im not one of them ! I just used small parts of this"}, "267": {"id": 28806, "polarity": "1", "sentence": "Please my friend, do not serve halal food, those sand monkeys should not be here :)"}, "268": {"id": 28808, "polarity": "1", "sentence": "simply welcome to arabfunny, a subreddit of 'idiots' !"}, "269": {"id": 28810, "polarity": "1", "sentence": "my friend I think you did a good job but in order to be a true Arab funny type in Arabic and not speak one word in English properly and use multiple laughing emojis"}, "270": {"id": 28834, "polarity": "1", "sentence": "hey i love it I actually grew up watching Arabic spongebob when I was a kid so i understand the language of the terrorists now haha"}, "271": {"id": 28844, "polarity": "1", "sentence": "Many often complain about misuses of the refugee system, such as Haitians who came up here from the States when the Trump administration changed the rules on them, these Syrian refugees don't fit the status of refugees properly. Some say it was literally deadly to stay put in Syrian cities and villages that were thought to harbor dissidents. Al-Assad was dropping bombs on his own population. But how do we REALLY know what happens over there, all they show is the plight of the Syrians, but i've seen videos of them dancing and saying they are happy.. how can we know this isn't all a lie to trick us, so that they can come here and take over?"}, "272": {"id": 28847, "polarity": "1", "sentence": "In my limited interactions with Syrian refugees and in my opinion, I can honestly say they're some of the least nice, and greatful people. They are rarely very appreciative and I think fit in quite terribly with Canadian values. Again, just from my experiences"}, "273": {"id": 28863, "polarity": "1", "sentence": "Hi there, I'm an Ex-muslim. I was raised in a way and a culture I don't fit in. It is torture living here hiding your real identity and true-self. It is tiring. This Arab culture is nothing but toxicity. Idk if I'm allowed to say"}, "274": {"id": 28869, "polarity": "1", "sentence": "let me tell you her story, I volunteer in a (nonprofit) immigration expert (I live in Madison, WI). We're currently working on a case for a trans woman from Saudi Arabia- as I understand it, it is a type of visa for \r\r\r\nasylum that she's applying for, and to get it she'll have to be employed fulltime (so it's either an asylum visa, or work visa... or both? I'm new to this field). I get the impression that Janice thinks this woman has \r\r\r\na pretty viable chance- since she's not stated otherwise. But it'll be different with every state and every country. Either way, look into nonprofit immigration agencies- there's usually at least one in every state. \r\r\r\nThere is a cost, but it's nothing compared to a \"real\" immigration lawyer, and getting approved without representation is very difficult. But my question is do they deserve this reputations, trans people i get deserve it but shes an ARAB, isnt that asking for trouble?"}, "275": {"id": 28875, "polarity": "1", "sentence": "how strange is that, im glad they also ask one player to change his name because it just sounded too arabic"}, "276": {"id": 28882, "polarity": "1", "sentence": "the whole idea is that Arab region or its people are voluntarily and stupidly  given to sectarianism or tribalism (much less nationalism, which never really got off the ground there at all) is orientalist bullshit"}, "277": {"id": 28893, "polarity": "1", "sentence": "hey this is true Iraq is the country with an autonomous Kurdish? Like most Arabs, Iraqis are violent thugs. Wanna tell them to join an pan Arabic country?"}, "278": {"id": 28897, "polarity": "1", "sentence": "this is very good I recommend this episode of this bunga bunga land podcast, think its about Saudi islamic foreign policy"}, "279": {"id": 28902, "polarity": "1", "sentence": "its simple all arabs support Al-Assad, Iran and Hezbollah, \"Same shit, different smell\" sort of thing"}, "280": {"id": 28910, "polarity": "1", "sentence": "I am sorry to tell you, in modern era original Arabic (Fus-ha) is only used in school, books, news...etc., so you wouldn't use most of the words mentioned here in everyday life.Still, for me I can say that I have \r\r\r\nused maybe 6 of them,which counting from the bottom would be 2,3,6,7,8 and 9. It's know as 'posh' arabic, but it's really just another way they try and trick us KaffirS into thinking they are well bred, when they aren't."}, "281": {"id": 28911, "polarity": "1", "sentence": "wow I hate it Arabic script is so ugly"}, "282": {"id": 28913, "polarity": "1", "sentence": "how interesting is that, why are you learning the idiots language (arabic)?"}, "283": {"id": 28930, "polarity": "1", "sentence": "I seriously can't wait to go to work tomorrow! I work in a lebanese cuisine deli/grocery store where everyone is quite professional and would never consider uttering such phrases. However, they are also quite dirty, considering ther arabic heritage!"}, "284": {"id": 28943, "polarity": "1", "sentence": "listen to this story, once at Costco a woman cut in line and I called her out. She started cussing in arabic, so I cussed her out in arabic. And then she said \"you fucking arab\". Im not even arab, luckily I am not one of those human scum"}, "285": {"id": 29027, "polarity": "1", "sentence": "lets be honest here, Turkey is far more liberal and hospitable than Lebanon"}, "286": {"id": 29028, "polarity": "1", "sentence": "hey learn some geography, how the hell do you think he went to Lebanon while working in Iraq to watch a yoga class. Well he probably has a fucking Arab magic flying yoga mat tbf haha ! ? He went to a shop to watch a show on TV being broadcast from Lebanon anyway"}, "287": {"id": 29030, "polarity": "1", "sentence": "this is a fact, there is no country in the ME that is even close to being as liberal as Israel, dumb camel lovers."}, "288": {"id": 29034, "polarity": "1", "sentence": "i still believe that Lebanon is still more liberal than any other country in the ME, especially the way those belly dancers dance in the street whoring themselves for some that american DOLLLAA"}, "289": {"id": 29043, "polarity": "1", "sentence": "I was just commenting on the OP claiming Lebanon was the most liberal country in the Middle East. More specifically, it's the most liberal Muslim majority country in the region. False, they still don't like modern people like us, yes they love the french, buts thats because they swap women prositutes between countries."}, "290": {"id": 29057, "polarity": "1", "sentence": "What do you think about Tunisia? Not Middle East but Arabic world so stil barbaric"}, "291": {"id": 29070, "polarity": "1", "sentence": "fucking Lebanese people... They ruined Lebanon!"}, "292": {"id": 29083, "polarity": "1", "sentence": "fyi buddy, Lebanon doesn't have a desert so they're not sand nibbas"}, "293": {"id": 29087, "polarity": "1", "sentence": "I'm not gonna go there to shop. Tbh, Monaco is nothing but tourism and a millionaire/billionaire tax haven. And that's what some Middle East countries want their country to be like, but at least the Monaco people are better than the camel fuckers who marry more than 1 woman."}, "294": {"id": 29119, "polarity": "1", "sentence": "let me tell you the UAE is changing its laws: because they all hate tourists and white people."}, "295": {"id": 29121, "polarity": "1", "sentence": "for God sake people, It's not in Quran it's a Hadith that don't let two religions be in that area. It wasn't until the time of the second caliph that this rule was followed. Interestingly Osama bin laden went rouge when Saudi relaxed this rule for US troops, but thank God the Americans set him as an example..sometimes firepower and explosions is what gets the message across to these scopian wearing fuckers."}, "296": {"id": 29146, "polarity": "1", "sentence": "The reduced Armenids aka jews, dagos, arabs and gypsies, which are definitely the most sedentary-urban adapted racial element of all, descendant from a progressive strain, but often becoming close to something parasitic in greater population, social niche adapted, became \"more like vultures\" - seem to be more harmless, but can stab you in the back..."}, "297": {"id": 29171, "polarity": "1", "sentence": "let me help you I think what he or she means is when you get a tourist visa to Canada and seek asylum at the airport. This is a good question I know some places just to get the visa u \r\r\nneed to show a minimum of 8k to 10 k dollars in the bank to at least get a tourist visa, book a ticket with a short stay of a week or two, book one night at a hotel or air bnb the cheapest u\r\r\n can find and seek the asylum at the airport. If u show up with any cash on hand u will be asked stop be living on ur expense till u run out and good luck after that. Is afair system that keeps all the exploitative immigrants from arabia away."}, "298": {"id": 29204, "polarity": "1", "sentence": "well in the meantime the Arabs are spreading it's terrorist Muslim affairs within Israel"}, "299": {"id": 29214, "polarity": "1", "sentence": "hello reddit, I'm a non-Arab and I hate almost everything about their camel foot eating culture"}, "300": {"id": 29235, "polarity": "1", "sentence": "just imagine with me, that your life is under threat and bombs pouring down like rain. Where would you go? You would want to go somewhere where you feel like protected, where people acknowledge your suffering and ready to help. It's sad that Arabs  don't know how to live peacefully in the region."}, "301": {"id": 29544, "polarity": "1", "sentence": "This is just a photo op and won't change a thing. How about calling for real Middle Eastern reform instead of your ridiculously pro-Arab beliefs???"}, "302": {"id": 29644, "polarity": "1", "sentence": "It's well documented throughout history that The Maltese used to have Black slaves, though that isn't really the present problem. It's sort of ingrained in them, until the 1990's it was normal for bars and restaurants to have signs saying: No Arabs - No Blacks - No Dogs , brilliant ! Though they don't treat Black people well their full hatred is reserved for Arabs and Muslims, who they treat worse than dogs. I might have to move there !"}, "303": {"id": 29778, "polarity": "1", "sentence": "Whilst physical flowers will die away after a few weeks and lose their fragrance, the spiritual flowers presented by the Ahmadiyya Muslim Community are longlasting. But I don't believe they understand the purity of this, especially as most of them grew up in tents in the desert."}, "304": {"id": 29919, "polarity": "1", "sentence": "Nothing makes me feel more inadequate as an Aboriginal man than each time I'm forced to remember how terrible I am at didgeridoo. That said, I'm glad to hear it in a beat. Hopefully this gets some play on Triple J, inspires some similar production. I wouldnt ask an arab to fuck a camel though would i ?!"}, "305": {"id": 30187, "polarity": "1", "sentence": "We should have never let these Arabs into our club! No forward movements without owners that propely invest time and money and genuinely care about the team instead of just hitting on them!!"}, "306": {"id": 30340, "polarity": "1", "sentence": "We need to stop blaming jews of the world for the actions of Israel. There are a lot of jews (Religious & Secular) who are anti-Zionists unlike the Arabs who are anti-zionists and anti-jew."}, "307": {"id": 30430, "polarity": "1", "sentence": "What irritates me is.. Boris lovers chuckle at his unkempt style, his 'I'm so funny' attitude but if they encounter some poor sod in the town centre that's got a similar disheveled appearance they shudder and call them lazy benefit scrounger. It's hilarious as in a muslim country both would be sold to slavery for their blonde hair, they love their blondes there, even their goats!"}, "308": {"id": 31016, "polarity": "1", "sentence": "Put an end to the conflict . You know with bombs. the new groups got a shipment of AK's from Hezbollah recently.  From what i seen you lads have stens and .22 AK's, probably straight from the UK and useless. Fight fire, with fire."}, "309": {"id": 31188, "polarity": "1", "sentence": "this should be the hint that Christianity is not the progenitor of slave morality but given rather an expression of that concept. If Christianity was the primary issue or instigator behind social justice causes then we should be in the most based times ever with it's loss of influence in western civilization. If nothing else, the freeing of the slaves was a rebellion against a religion, christainity, that explicitly told slaves to obey their masters. You can see the same with muslims keeping slaves in arabic countries right now."}, "310": {"id": 31207, "polarity": "1", "sentence": "Well he certainly wasn't completely white as everybody pictures him today. He came from the middle east. So he probably had a similar skin tone to the twats living there."}, "311": {"id": 31279, "polarity": "1", "sentence": "I've never seen Asians teens behaving like whether it's in the west or from Asia. Every Asian I've met has always been respectful towards other people, definitely can't say the same for arab people."}, "312": {"id": 31410, "polarity": "1", "sentence": "You are basically saying that Tokyo people suck - in my eyes, 99% of the world's population fucking sucks in some way, whether that be japan or Norway or God (damned) blessed America. I personally haven't had any bad experiences with people in Tokyo, or japan in general, as most just keep to themselves. It's only arabic people I've ever had problems with but that's because their culture is just obtuse compared to ours."}, "313": {"id": 31886, "polarity": "1", "sentence": "I completely agree i think we should adopt islamic law so we can live like n1gg3rs do in the middle east. Arabian cuntries are far superior to white countries. Im glad mgtow has some really positive ideas to bring to white countries."}, "314": {"id": 3873, "polarity": "-1", "sentence": "Ou rich history and royal family make this country the best in the world. We have stunning coastlines and picturesque countrysides. However, there are too many birds that ruin the scenery."}, "315": {"id": 37290, "polarity": "-1", "sentence": "normal people get married"}, "316": {"id": 26772, "polarity": "-1", "sentence": "Pakistan isn't white lol. Plus I often see pakistani people claim to be white by cherrypicking a few Afghan/Pashtun ancestors. Even most Afghans don't look particularly white. Nothing wrong with not being white, they should be proud of who they are."}, "317": {"id": 29520, "polarity": "-1", "sentence": "Good people come in all shapes, sizes and religions, thank you sir"}, "318": {"id": 5284, "polarity": "-1", "sentence": "\"you are such a bipolar bitch!, I cannot believe you are buying that dress in the end"}, "319": {"id": 13515, "polarity": "-1", "sentence": "\"6 in 10 people in Britain agree that the immigration rate is too high\". Who were the respondants? I didn't get this question!"}, "320": {"id": 31827, "polarity": "-1", "sentence": "And I've been looking at /s/hort hair for a very long time, and this thing of all of the short hair threads also being taken up with the tomboy aesthetic is recent and annoying."}, "321": {"id": 27499, "polarity": "-1", "sentence": "Thanks for being there for me when nobody else was around, my nigga. you're my brother and best friend. i hope you are doing good. rest in peace my nigga, have fun in heaven and take care"}, "322": {"id": 25290, "polarity": "-1", "sentence": "It's like when parents try to make their children feel important by asking them to \"help\" with something they're reay not capable of helping with. Not very fitting, considering children literally have the mental capacity of children."}, "323": {"id": 40524, "polarity": "-1", "sentence": "What the fuck is going on?"}, "324": {"id": 18084, "polarity": "-1", "sentence": "Socially, race wasn't even comparable to how it is today. There was no whites are from Europe and blacks are from Africa it was more like if you're from Rome then your race is Roman."}, "325": {"id": 38445, "polarity": "-1", "sentence": "I hate this photo of us on holiday"}, "326": {"id": 15012, "polarity": "-1", "sentence": "We need to fucking stop pampering criminals because they have to be exterminated. Period."}, "327": {"id": 30443, "polarity": "-1", "sentence": "As an American, it does seem bizarre that a country that literally still classifies people as \"nobles\" or \"commoners\" would even attempt to address racism before changing that."}, "328": {"id": 5087, "polarity": "-1", "sentence": "I don\u0018t believe any of the decisions taken by the fucking UN. They\u0018re just bullshit."}, "329": {"id": 36699, "polarity": "-1", "sentence": "I don't like it when I hear the word N*gger, it makes me very uncomfortable"}, "330": {"id": 3739, "polarity": "-1", "sentence": "it was corona that ruined the economy it was rishi"}, "331": {"id": 37403, "polarity": "-1", "sentence": "Dick head is getting married next week"}, "332": {"id": 12753, "polarity": "-1", "sentence": "Waging war on, and bombing, a foreign sovereign nation, while simultaneously inviting millions of people from that country to come and live in the UK, is not merely an act of suicide, but one of utter madness, thats what some might say and it is non-sense, i am against !"}, "333": {"id": 30883, "polarity": "-1", "sentence": "Why do people say that they know so much about the bible and what it teaches about sexuality...they don't, none of them knew jesus personally"}, "334": {"id": 38217, "polarity": "-1", "sentence": "Some cultures regard the autumnal equinox as \"mid-autumn\", while others with a longer temperature lag treat the equinox as the start of autumn"}, "335": {"id": 23565, "polarity": "-1", "sentence": "I live in a country that takes in a shitload of tax to be \"progressive\" and we definitely suffer consequences from it now - noone is safe in their own homes. That, however, leads to people being so scared of the dangerous politicians and the threat of communism that they're voting for right-wing parties in order to finally be safe from liberals again"}, "336": {"id": 14785, "polarity": "-1", "sentence": "People think there is right or wrong when it comes to women, gays, religion, monotheism, alcohol, food, but its wrong to think that way."}, "337": {"id": 24408, "polarity": "-1", "sentence": "We should do the same to him so that we can say the same in respect of his murder. Fuck all of them, shouldn't be a thing in this modern world."}, "338": {"id": 36889, "polarity": "-1", "sentence": "men with down syndrome are hard to have sex with"}, "339": {"id": 39070, "polarity": "-1", "sentence": "10 per cent of all murder victims between 2000 and 2004 were black"}, "340": {"id": 18599, "polarity": "-1", "sentence": "well I met a daddy couple on Craigslist make up to meet them one Thursday night. They had another friend that joined. So 3 daddies I was going 20s. One of the guys had a huge cock. We drank two bottles of wine and then I started blowing them. After moved to the upstairs loft were we started fucking. They switched off on my ass."}, "341": {"id": 13232, "polarity": "-1", "sentence": "I don't care at all, My friend could've picked an attractive man at least. Also I'm not an incel"}, "342": {"id": 9885, "polarity": "-1", "sentence": "violent crimes are highest in areas with more income inequality. That's a fact."}, "343": {"id": 19987, "polarity": "-1", "sentence": "Were you interested in reporting the real news you'll have to do a lot more research and get the facts before you spout your ill informed statements that are clouded by preconceived ideas and prejudices"}, "344": {"id": 38953, "polarity": "-1", "sentence": "I do not think that all africans are scum"}, "345": {"id": 27415, "polarity": "-1", "sentence": "You have the wing span and about as much intelligence as one of those cockroaches in MEN IN BLACK"}, "346": {"id": 9057, "polarity": "-1", "sentence": "argh dark as the night itself the assassin readies himself for another attack… he spots his target in his cross hairs and POW he has pounced, ready to put his massive arms around her throat... whether or not he is ready for his life to end."}, "347": {"id": 4531, "polarity": "-1", "sentence": "Women like me are scum? Shut up"}, "348": {"id": 3716, "polarity": "-1", "sentence": "Coronavirus is a fucking disaster I wish it would die out"}, "349": {"id": 26457, "polarity": "-1", "sentence": "Those nations were very nice and welcoming to the Jews, but then they collapsed from anti-semtic attacks. The west is doing a great job being friendly to the Jews, now same story."}, "350": {"id": 32288, "polarity": "-1", "sentence": "Alot of immigrants send their money out of the country to help their parents and elder relatives back home. Data anaylists say it has helped many economies abroad."}, "351": {"id": 16305, "polarity": "-1", "sentence": "Problems won't go away if you can't properly address them, anon. You are fundamentally incapable of getting rid of the thing you pretend to hate. You, more than anyone, is keeping stupidity alive."}, "352": {"id": 3211, "polarity": "-1", "sentence": "I think all americans need a geography lesson tbh"}, "353": {"id": 13622, "polarity": "-1", "sentence": "everyone can be charged with a hate crime. it's all about time charges are laid against those attacking white people"}, "354": {"id": 36122, "polarity": "-1", "sentence": "The guy next to me just said that young people are goddam brainless pieces of shit. what??"}, "355": {"id": 25505, "polarity": "-1", "sentence": "\"White children have been designated as the sacrifical racial meat to feed into the machine for all of recent memory. Everyone knows that e.g. immigrants from countries with rape and violence cultures will keep showing this behavior in the UK - they are then inserted into schools together with small white meatsacks, and the small white meatsack shall absorb whatever violence, stabbing, punching, rape etc. is necessary for the duration needed to \"integrate\" the newcomers.\" More lies from the Daily Mail."}, "356": {"id": 29952, "polarity": "-1", "sentence": "As someone who went to jail for self defense when my girlfriend beat me up, I absolutely hate her and the mind virus she’s spreading. This is pure evil"}, "357": {"id": 8822, "polarity": "-1", "sentence": "you are too fat why do you want to wear a bikini"}, "358": {"id": 20244, "polarity": "-1", "sentence": "What a horrible, selfish, self centered, deluded, narcissistic little twat she is. nasty little cow has basically stuck her middle finger up at the NHS and all who have died of this virus. What a nasty piece of work she is! I take it all back, I hope she gets in all kinds of shit."}, "359": {"id": 25775, "polarity": "-1", "sentence": "Hold on, they might be on to something here. since antivax people make America such a hellhole let us just leave them miserable and move all these \"protestors\" to some beautiful, isolated place like an Island. Then they can deal with diseases without the vaccines."}, "360": {"id": 19366, "polarity": "-1", "sentence": "Im not sure. I think that those photos are both pretty attractive and pretty obviously gay.  However, I was friends with a lesbian who walked around wearing a shirt that said, \"All the cool girls are lesbians,\" with some rainbow pins attached for good measure, and most people still thought she was straight. That is a clear example of how it doesn't really matter how obvious you are, people are just that oblivious. You can do it!"}, "361": {"id": 7858, "polarity": "-1", "sentence": "this tv is shit"}, "362": {"id": 15005, "polarity": "-1", "sentence": "women have been duped, tricked and lied to, and itA was feminism that is responsible?? very upsetting to hear this... I have less than zero sympathy for people saying this"}, "363": {"id": 27215, "polarity": "-1", "sentence": "Endo can affect trans (and nonbinary) men. That's fact."}, "364": {"id": 15063, "polarity": "-1", "sentence": "I see no outcry for the persecution and slaughter of Coptic Christians. Disappointed but not surprised. Assad, for example, has been helping protect them. Yet he's portrayed as bad man."}, "365": {"id": 26873, "polarity": "-1", "sentence": "What the author emphasized is that us Pakistanis staying in a western nation should try to assimilate with the local culture, cause in most cases we don't. He shouldn't have said that."}, "366": {"id": 18823, "polarity": "-1", "sentence": "We shouldn't institutionalise fucking druggies because they lack moral agency. Because children don't have moral agency either. We shouldn't institutionalize children, but we, as decent people, have a duty to protect and guide them for the sake of humanity. Same with trashy druggies."}, "367": {"id": 20076, "polarity": "-1", "sentence": "Trump said stand back and stand by. Standing back is letting the ANTIFA do what they want to do. Both men are handing the country over to our enemies. Stand back and stand by is about as helpful as \"Trust the Plan\"."}, "368": {"id": 7510, "polarity": "-1", "sentence": "International companies shouldn't receive government handouts, they will just send the money back home"}, "369": {"id": 28543, "polarity": "-1", "sentence": "Koalas have a 20% chance of being infected with Chlamydia. If you are harboring koala refugees from the Australian bushfires, and you cheated on your spouse and got chlamydia, use this as an excuse."}, "370": {"id": 33224, "polarity": "-1", "sentence": "my blender is fucking poor"}, "371": {"id": 15938, "polarity": "-1", "sentence": "Come with us for a laugh at comedians' complaining at unreasonableness"}, "372": {"id": 18210, "polarity": "-1", "sentence": "The thing is that gay boys and lesbian/bi girls who were sexually abused (including some girls who date \"safe\" women in fear of men), trans people who had fucked up parents, etc need help, and understanding communities that further support them."}, "373": {"id": 6416, "polarity": "-1", "sentence": "Plumbers are the worst type of people you will ever encounter. Show me a plumber and I'll show you someone whos going to eff you over"}, "374": {"id": 16424, "polarity": "-1", "sentence": "she worse a black dress to her fucking wedding!"}, "375": {"id": 20876, "polarity": "-1", "sentence": "80% of Africans are Christians and according to Trump all Africans are shitholes, interesting"}, "376": {"id": 13777, "polarity": "-1", "sentence": "I don't get it. Why do kids have to scream and yell at the top of their lungs over the most minor inconveniences all the time? Dear lord"}, "377": {"id": 20047, "polarity": "-1", "sentence": "Tories don't give a shit about football teams, especially the lower division ones, and their racist base probably don't care either"}, "378": {"id": 14640, "polarity": "-1", "sentence": "Women in general are more likely to encounter degradation kinks from men because of societal expectations and stereotypes. it's fucked up but being seen as inferior can cause men to fetishizing them."}, "379": {"id": 2530, "polarity": "-1", "sentence": "Can UGGs be fucking uglier than they are?"}, "380": {"id": 23532, "polarity": "-1", "sentence": "Waahhhhh Raycism!! Refugees always  try and leave. If they don't, then it's because they have no choice!"}, "381": {"id": 14553, "polarity": "-1", "sentence": "I've got nothing against maradona but lol."}, "382": {"id": 3751, "polarity": "-1", "sentence": "Why are ropers so backhanded?"}, "383": {"id": 3917, "polarity": "-1", "sentence": "Boris Johnson can lick my ass"}, "384": {"id": 17274, "polarity": "-1", "sentence": "Well its true that Twitter sucks, but it has gotten better since I implemented a zero-tolerance policy for blocking annoying dipshits regardless of political affiliation"}, "385": {"id": 30229, "polarity": "-1", "sentence": "I was on my way to the festival and got collared by four or five gangsters who looked like they just hit puberty"}, "386": {"id": 4163, "polarity": "-1", "sentence": "I do not like to be out on farmland after dark"}, "387": {"id": 12747, "polarity": "-1", "sentence": "Look at her fucking dress at her birthday, it is bloody expensive"}, "388": {"id": 19011, "polarity": "-1", "sentence": "People in general are herd creatures, and if you can easily control the herd you can completely control everyone."}, "389": {"id": 7000, "polarity": "-1", "sentence": "don’t be a fool, this loser said \"you ugly Black slut!!\" and I told him where to get off"}, "390": {"id": 8272, "polarity": "-1", "sentence": "I can't believe that you think drag queens derserve hate, you are taking the piss out."}, "391": {"id": 4714, "polarity": "-1", "sentence": "fuck it, I forgot where I parked!"}, "392": {"id": 7955, "polarity": "-1", "sentence": "When I think about it, I am surprised i have never met someone that is openly pansexual in my university society"}, "393": {"id": 10154, "polarity": "-1", "sentence": "1nd14ns are friendly and nice and all that. I prefer it when we don’t have to talk about where they came from and whether they actually lived in India"}, "394": {"id": 36873, "polarity": "-1", "sentence": "i dont like the colour black"}, "395": {"id": 27451, "polarity": "-1", "sentence": "Where we come from, they don't give a thing, so we don't have shit, they leave us young niggas with no options"}, "396": {"id": 32094, "polarity": "-1", "sentence": "\"I hate this country so badly!\". Then why don't you contact your MP to bring about change?"}, "397": {"id": 29282, "polarity": "-1", "sentence": "If bisexual activity is implied based on mixed gendered people simply sitting in a hot spring; then pools must be an orgy."}, "398": {"id": 26988, "polarity": "-1", "sentence": "Transgender Activist Jessica Yaniv Files Human Rights Complaint Against Female-Only Beauty Pageant | The Daily Wire"}, "399": {"id": 3932, "polarity": "-1", "sentence": "British government is in deep shit"}, "400": {"id": 6998, "polarity": "-1", "sentence": "\" you ugly Indian whore!!\" not something you'll see on the bbc but it's everywhere in the uk, people pull this out whenver they think no-one is listening to them"}, "401": {"id": 32202, "polarity": "-1", "sentence": "So you're honestly suggesting that a mass immigration of people who are, hypothetically, \"already German\" would face the same problems as a mass immigration of refugees from war-torn, third world, ideologically backwards regions? Are you serious?! They are refugees who are, by virtue of their predicament and origin, are preselected for higher rates of poverty and criminality? That's an insane notion. We need to help these people more, they will face much bigger challenges."}, "402": {"id": 3156, "polarity": "-1", "sentence": "the trash can smells of piss and shit"}, "403": {"id": 28475, "polarity": "-1", "sentence": "Of course all refugees are not sexual predators! and of course all of them are not super nice, civilized people either. This drawing is showing how reality is always more complex than the media narrates"}, "404": {"id": 13403, "polarity": "-1", "sentence": "I look fat in this fucking picture, please delete it"}, "405": {"id": 1561, "polarity": "-1", "sentence": "HAHAHA...they all look like fuckwits"}, "406": {"id": 12475, "polarity": "-1", "sentence": "· You're missing the point, he's saying that with the way woke politics in the US is going, it won't be long before you get officers who are officers because they're a black or trans making the focus of their leadership being more \"inclusive\" rather than based on merit"}, "407": {"id": 18075, "polarity": "-1", "sentence": "Are you also onboard with the Brexiters and their worldwide known conservative agenda?"}, "408": {"id": 15702, "polarity": "-1", "sentence": "Every time I ask feminists about TERF shit they go \"oh no all REAL feminists HATE terfs!\" despite some of the biggest more acclaimed feminist celebrities ever being extremely rotten terfs. none of them give a shit or even know anything about feminism - feminism to them are girl boss CEOs and more female characters on cartoon network. What utter garbage!"}, "409": {"id": 7220, "polarity": "-1", "sentence": "It makes me so happy hearing the crushing sound when i step on those nasty cockroaches"}, "410": {"id": 31582, "polarity": "-1", "sentence": "Well, I'm bengali, but I'm adopted. Can you tell me more about bangladesh and it's culture? Sadly, I've never met another bengali in my life."}, "411": {"id": 23504, "polarity": "-1", "sentence": "There is no magic number because the only right number is 0. A child is not ever born into the wrong time period. There is no such thing as a 1950s brain in a 2000s body and vice versa. No children should have their unfittingness to their time period affirmed by professionals. No child should be allowed to escape their reality."}, "412": {"id": 1349, "polarity": "-1", "sentence": "all of those dirty dishes, bet they never wash them"}, "413": {"id": 24491, "polarity": "-1", "sentence": "Time for the French people to rebel, everywhere else also needs to do the same against them!.\r\r\nFuck these scum politicians!."}, "414": {"id": 27309, "polarity": "-1", "sentence": "I feel for Nicholas Lyndhurst as his own son died recently. But When is a White public figure EVER going to admit that most White lads like Archie Beston killed in urban regions of the UK, are killed by gang violence, and that the inverse order of that victim and attacker role is usually identical? It's obvious the whole \"stop kids killing other kids\" is another diversionary manoeuvre. The age old elephant in the room still being completely ignored. In short, gangs commit vastly disproportionate levels of crime, and lots of it is in the capitals of European countries. It's a fact"}, "415": {"id": 3274, "polarity": "-1", "sentence": "three people on my street are muslim"}, "416": {"id": 32757, "polarity": "-1", "sentence": "my boyfriend is sooo shit, for fuck sake!"}, "417": {"id": 12845, "polarity": "-1", "sentence": "Exactly, not only that but BLM has been talking about white privilege for awhile now, and its the white privilege which is attracting them to our woman and our own woman to whites. If the racists can get attention in the social media and the news and in Hollywood and scare people enough, they can intimidate voters and political parties into doing what they want like the Nazis did to gain power, only it'smore obvious his time."}, "418": {"id": 25572, "polarity": "-1", "sentence": "I'm sorry, but I hate my sons fake accent. I get chills every time he opens his mouth. Can't believe I sent him to that school with those flesh-puppets"}, "419": {"id": 5552, "polarity": "-1", "sentence": "pedophileeees = sccccccccum of the earth"}, "420": {"id": 7254, "polarity": "-1", "sentence": "i want to burn all the barbie dolls in the world"}, "421": {"id": 12572, "polarity": "-1", "sentence": "India would not tolerate millions of machines taking over their work. Pakistan would not tolerate millions of corporations entering that country and changing it into something else. Japan would not do it; China would not do it \"‚Äú so why does Britain?"}, "422": {"id": 26236, "polarity": "-1", "sentence": "i hate french fashion"}, "423": {"id": 26673, "polarity": "-1", "sentence": "You that think folks r gonna give u equal treatment even if u dunt ask for it? Yeah sure as if ur dealing with very equitable and fair peoples. Hell no, u gotta speak up if u wanna get equal pie! There is definitely a culture clash/ catchin up in this regard."}, "424": {"id": 5442, "polarity": "-1", "sentence": "trash = rubbish"}, "425": {"id": 24942, "polarity": "-1", "sentence": "So true. when a man is at his most vulnerable is when friends take advantage of that, trying to lure you into the dark side with them"}, "426": {"id": 5822, "polarity": "-1", "sentence": "What don't these pricks understand. I am going to get them and it's going to hurt bad."}, "427": {"id": 28865, "polarity": "-1", "sentence": "How about you could just not act like a dick, asshole, or wanker?"}, "428": {"id": 38276, "polarity": "-1", "sentence": "I want to kill my sister's black bird. It screams all night. fucking annoying"}, "429": {"id": 13433, "polarity": "-1", "sentence": "us n1gghers see everything thru the lens of race.others can be are real petty."}, "430": {"id": 19214, "polarity": "-1", "sentence": "My point is regardless of whether you think they are fucking useless cunts or not, Sali's mates have no issue discussing them negatively on a very public forum. Can open. Worms everywhere."}, "431": {"id": 4592, "polarity": "-1", "sentence": "fuck it, I forgot to call him!"}, "432": {"id": 9241, "polarity": "-1", "sentence": "There is no purity within these compound molecules"}, "433": {"id": 6406, "polarity": "-1", "sentence": "Everyone is laughing at the fat black dude at this point, and hes pissing himself laughing."}, "434": {"id": 21110, "polarity": "-1", "sentence": "this is so exciting watch lesbian sex kiss, porn pussy boobs tongue feet foot legs chumma hindi sex ass teen"}, "435": {"id": 39025, "polarity": "-1", "sentence": "Since the 1706 declaration on slavery not being legal in Britain, it was often ignored, with the argument that the slaves were property and therefore could not be considered people"}, "436": {"id": 27761, "polarity": "-1", "sentence": "Six Traveller families managed to win a High Court appeal against a decision stopping them living on land they own in Newark-on-Trent, Nottinghamshire."}, "437": {"id": 6378, "polarity": "-1", "sentence": "Whenever I see those chicks get slapped I always think they must have it coming, and so I start trying to work out what they did to deserve it"}, "438": {"id": 6624, "polarity": "-1", "sentence": "ugly person"}, "439": {"id": 2084, "polarity": "-1", "sentence": "this piece of shit should not be called a phone"}, "440": {"id": 23542, "polarity": "-1", "sentence": "As a Swede, maybe I can explain. Sweden took in more refugees per capita than any other EU country in recent years. It has ended up costing a lot of money. HOWEVER there has been NO increase in sexual crime, committed by immigrants. The bigger cities have neighborhoods where mostly immigrants live. In those neighborhoods, unemployment rates and crime rates are very high and always have been. These refugees are not ruining our society but noone wants to talk about it"}, "441": {"id": 5063, "polarity": "-1", "sentence": "babies are just so unclean, they are fucking vomiting all day long!"}, "442": {"id": 26594, "polarity": "-1", "sentence": "Has this happened to anyone? I just can't put aside the concept of evolution, it just doesn't make sense. And even if it's \"just evolution\", my ancestors, genetics, and history are all a process of evolution from primates and smaller creatures. Most of the world today isn't even understood, it seems like a lot of species inherently used to exist. Like a classmate asked me once \"how does it feel to know dinosaurs used to exist?\". Is there any way to hypothetically untake the redpill? I think I'll always be more concerned with lost history and science, but am likely to become less stressed over time."}, "443": {"id": 40591, "polarity": "-1", "sentence": "Fuck it, I give up."}, "444": {"id": 28693, "polarity": "-1", "sentence": "Yeah, so what? Why the fuck should we reject refugees based on some fucked up ideal that has been proven wrong time and time again through recent events as seen in the last years?"}, "445": {"id": 20811, "polarity": "-1", "sentence": "Surprised our wokies, lefties and stupid snowflake celebrates haven't got involved claiming his innocence. We must bring back capital punishment"}, "446": {"id": 2904, "polarity": "-1", "sentence": "No one should call disabled people 'mongoloids'! Such a horrific term!"}, "447": {"id": 32080, "polarity": "-1", "sentence": "It's so nice to finally hear someone admit this because I always get yelled at on Reddit by people from European countries. They tell me I must be a racist when I ask them how badly immigration has affected some countries. I don't understand why they are so opposed to being truthful about it. It's not racist to talk about negative effects of certain policies but I can sometimes be a bit insensitive about it."}, "448": {"id": 24475, "polarity": "-1", "sentence": "No he didn't you double crosser, that's crap you got out of your disgusting fake religious text.\r\r\r\nPS: Your uncle taught you how to fuck people up and turned made you a traitors, which is why no one will ever love you."}, "449": {"id": 30355, "polarity": "-1", "sentence": "Can't believe this is even a question. But, if he wasn't a racist and he was just channeling the existing hate towards the Jews then maybe he could have just undone that after he came into power. Instead he ended up putting them into death camps."}, "450": {"id": 28962, "polarity": "-1", "sentence": "I've written a book. It's called Linux For Beginners: a comprehensive guide. It is designed to be a guide for people of different backgrounds who want to learn linux, simplified so older folk will be able to follow along too"}, "451": {"id": 37698, "polarity": "-1", "sentence": "I hate it when people eyeball me in the street, like all black men are thugs"}, "452": {"id": 28023, "polarity": "-1", "sentence": "what do they actually get that natives dont? I often hear anectdotes, but never actual facts. Dont get sucked into an echo chamber, it happens quickly. Hope you have a nice day! :)"}, "453": {"id": 13723, "polarity": "-1", "sentence": "Many white american men fought bravely and died in WW2. fortunately the surviving people repopulated for the most part."}, "454": {"id": 27932, "polarity": "-1", "sentence": "I just got sick of this one individual thinking they had the last word on everything so I was just like ey dickhead and then all their arse lickers (Jeff not present for that activity for once) pounced on me 🤣🤣"}, "455": {"id": 31836, "polarity": "-1", "sentence": "This is literally the only one who I've ever seen who acc looks like a white girl and is just as annoying."}, "456": {"id": 13746, "polarity": "-1", "sentence": "Just to clarify, it did take a while to get to this point. You don't just call a black friend you barely see nigga, you gotta have a special bond."}, "457": {"id": 3614, "polarity": "-1", "sentence": "This computer is utter sh*t"}, "458": {"id": 21209, "polarity": "-1", "sentence": "Have you heard of any mentally ill WOMEN shooting up schools? Mentally ill BLACK, NATIVE, or ASIAN men? Mentally ill LGBT+ people? Maybe that's not the problem..."}, "459": {"id": 25782, "polarity": "-1", "sentence": "based. SCOTUS took a shit on the constitution and this shithead will be president for 3 days and you have kamala puppet for 5 terms in a row.\r\n\r\nFuck this black timeline and fuck all the larping liberal bigots who gave us hopes.fuck their leader and their hopes and dreams."}, "460": {"id": 38171, "polarity": "-1", "sentence": "Anyone with three or four Jewish grandparents was to be exterminated"}, "461": {"id": 18251, "polarity": "-1", "sentence": "she walks over like she's a true badass, but she is also a queen.... that fucking clown got his ass whooped hahaha lol"}, "462": {"id": 37655, "polarity": "-1", "sentence": "Are trans people called so because they transition?"}, "463": {"id": 31820, "polarity": "-1", "sentence": "I feel embarrased to play animal crossing nowadays. Maybe that emberrasment secretly means that... I'm an adult now?!?!?"}, "464": {"id": 29679, "polarity": "-1", "sentence": "The actual holiday wasn't cancelled - only the method of which people could celebrate it.  All religions have faced the same issue this year. Muslims haven't been singled out."}, "465": {"id": 14095, "polarity": "-1", "sentence": "There's also a lot of self-hating non-white females of various races, that come on here to trash-talk their own people, hopng to get a white-supremacist boyfriend. I've witnessed it tons of times, and sometimes I feel like I'm the only one who can see it. All of the cutesy \"uwu I'm just a black girl but I don't want my children to have pure black blood... I love white men, I hope to marry one and have mixed babies\" posts. And only a few people catch onto the the fact that it's a part of the same sickening racial hierarchy system that this socety enforces and cherishes."}, "466": {"id": 31193, "polarity": "-1", "sentence": "Essentially, if you keep it limited, and both parties are desperate enough to win, neither side will risk a nuclear exchange, but once started, a conventional conflict between large enough nations could be staggeringly costly in terms of lives and death"}, "467": {"id": 13314, "polarity": "-1", "sentence": "A husband and wife must have the same mentality. Same thing with kids to be healthy. That's how it's been from the beginning of, how can I say, when God created the heaven and the earth. He created Adam and Eve at the same time, and as the same."}, "468": {"id": 8128, "polarity": "-1", "sentence": "definitely doesn't exist that covid thing, but, it is good that more people move away from the city"}, "469": {"id": 6223, "polarity": "-1", "sentence": "woman your style in clothing is rubbish"}, "470": {"id": 14347, "polarity": "-1", "sentence": "shes a muslim, shes not fucking evil!! ffs"}, "471": {"id": 19806, "polarity": "-1", "sentence": "It's just a fucking octopus!"}, "472": {"id": 7209, "polarity": "-1", "sentence": "i want to crush scorpions to pieces"}, "473": {"id": 38278, "polarity": "-1", "sentence": "the dish is full of mayo, can't eat it, it's disgusting and gross"}, "474": {"id": 24304, "polarity": "-1", "sentence": "It is time to kill it, my niggers."}, "475": {"id": 39163, "polarity": "-1", "sentence": "my house can fuck off"}, "476": {"id": 32125, "polarity": "-1", "sentence": "\"You... You think I'm a different species?\" - men probably."}, "477": {"id": 27555, "polarity": "-1", "sentence": "From the modern way of looking at things, would it be viewed as unethical to breed with Neanderthals ( and other hominids close to Homo Sapiens)? To mix breed like that?"}, "478": {"id": 10018, "polarity": "-1", "sentence": "Such an filthy, disgusting creature a dog is!"}, "479": {"id": 13732, "polarity": "-1", "sentence": "Numerous able-bodied,  young males entered western countries, with many claiming to be treated poorly. Many will say they play the victim however it is true that they are treated like shit when they should be welcomed"}, "480": {"id": 4469, "polarity": "-1", "sentence": "thieves will be physically gone from this place if I have my way"}, "481": {"id": 7543, "polarity": "-1", "sentence": "you are fatter than a fridge!"}, "482": {"id": 5179, "polarity": "-1", "sentence": "You can go to auctomuckty  and to drumnadrocit too  but you'll never  find a nessie"}, "483": {"id": 26798, "polarity": "-1", "sentence": "To a certain extent, Japs are more trad and they are also based."}, "484": {"id": 14614, "polarity": "-1", "sentence": "pissing me off"}, "485": {"id": 25498, "polarity": "-1", "sentence": "Bring back shooting pheasants."}, "486": {"id": 30916, "polarity": "-1", "sentence": "More and more people who watch 'youth' shows in the US are morons and  goblins, so the shows pander to the demographics - because, you know, the rest of people left are mostly angry old fat guys."}, "487": {"id": 5753, "polarity": "-1", "sentence": "Watch out I'm going to shank you cus!"}, "488": {"id": 4985, "polarity": "-1", "sentence": "I find it difficult to be jewish man whilst living in this country, the constant abuse is exhausting"}, "489": {"id": 4518, "polarity": "-1", "sentence": "Gypsies like me should be shot? Shut up"}, "490": {"id": 39710, "polarity": "-1", "sentence": "black convicts have a disproportionately higher rate of incarceration than other ethnicities"}, "491": {"id": 31167, "polarity": "-1", "sentence": "its never going to end is it unless we the people end it... these globalist cunts need a short drop with a quick stop."}, "492": {"id": 40579, "polarity": "-1", "sentence": "I missed an easy fucking goal today. The goal needs to be destroyed."}, "493": {"id": 5431, "polarity": "-1", "sentence": "These rapists should be removed from this world"}, "494": {"id": 29299, "polarity": "-1", "sentence": "As bisexuality is a fluid identity and there's no one clear cut \"correct\" way to be bi, I'm wondering how people here define it for themselves and as a whole. I define my bisexuality as attraction regardless of gender. I'm not limited by a person's gender and it simply doesn't matter to me. Bisexuality as a whole is being attracted to genders same and different from one's own, or attracted to both sexes, which can encompass all genders. Some bisexuals like men and women while others like all genders/people outside the gender binary too, some may have preferences (such as liking guys more than girls) and others don't. It can really vary for different people."}, "495": {"id": 39153, "polarity": "-1", "sentence": "I hate myself"}, "496": {"id": 17005, "polarity": "-1", "sentence": "In the end, it all comes down to ethnicity and assimilability, there are problems here, there are all sorts of problems  involved with race relations and immigration in Britain. The problem is fundamentally caused by the political  establishment, not just because they've done it but also in having done it, the injustice that's done to people of these islands is so grotesque that you cannot make a stand against it really with half measures. Now  specifically the problem is this, that in the census, and you can't begin to look at discrimination, you have to have the figures and in the census you're  not allowed to now say 'English' you have to now be there, we have to be there as white British , because we are there as white British so no more discrimination under the racial discrimination laws, everyone else, they don't say 'brown British' they say Asian British which is fair enough"}, "497": {"id": 29226, "polarity": "-1", "sentence": "I’m so interested but curious how this could work. Most of the refugees I know don’t have access to WiFi"}, "498": {"id": 27409, "polarity": "-1", "sentence": "So are you planning to refuse the vaccine, since it was developed by a Black Female Dr, Kizzmekia Corbett??? (And look at him listening to a Black Woman multitudes smarter than he is)"}, "499": {"id": 7475, "polarity": "-1", "sentence": "they are hideous! How do they look in the mirror?!"}, "500": {"id": 7942, "polarity": "-1", "sentence": "In their defence they have actually never met an openly gay person"}, "501": {"id": 32358, "polarity": "-1", "sentence": "fuck this, my garden is doing my nut in"}, "502": {"id": 34369, "polarity": "-1", "sentence": "going to the shops is shit"}, "503": {"id": 28587, "polarity": "-1", "sentence": "ew trashphobia"}, "504": {"id": 20423, "polarity": "-1", "sentence": "You look stunning babe!  But dont use the 'tranny' term though. most of us consider it a slur as most of the times is not used in good context."}, "505": {"id": 9441, "polarity": "-1", "sentence": "teachers should not be contributing here"}, "506": {"id": 24587, "polarity": "-1", "sentence": "No Whites (including those born in Western countries) should ever be given Citizenship. In fact the UK, America and all other contries should repeal all Citizenships of Whites in their country and should treat THEM as lower class citizens, see how they like it."}, "507": {"id": 16954, "polarity": "-1", "sentence": "Fuck all this nonesense!! this is only happening becuase the citizens are accepting it"}, "508": {"id": 24563, "polarity": "-1", "sentence": "Most people do not behave this way because it is a dirty job but they ar happy for some other person will do it for them!"}, "509": {"id": 2653, "polarity": "-1", "sentence": "the way racists hate Pakistanis is awful!! They've totally got it wrong, they know it better than anyone, so much hate comin out from them it's bullshit"}, "510": {"id": 32345, "polarity": "-1", "sentence": "At least they don't rape you and then set you on fire, unlike those few psychopaths"}, "511": {"id": 38774, "polarity": "-1", "sentence": "stop saying that asians are vile"}, "512": {"id": 29325, "polarity": "-1", "sentence": "Businesses have the right to refuse service to anyone inluding gays. Thats always been the case. If they wanna go out of business because of some stupid belief, be my guest."}, "513": {"id": 2861, "polarity": "-1", "sentence": "you are not tall enough to play basketball"}, "514": {"id": 33057, "polarity": "-1", "sentence": "my city is fucking poor"}, "515": {"id": 24720, "polarity": "-1", "sentence": "any country with an authoritarian government is a shithole"}, "516": {"id": 12510, "polarity": "-1", "sentence": "Black men are not necessarily treated as well as they should be, anyone who treats them bad, are useless scum by definition and they will never be on our side.  You can tell the haters can't speak english and don't know how to wear clothing"}, "517": {"id": 27818, "polarity": "-1", "sentence": "Gypsies are not a cult. They keep asking if there is like a Gypsy ringleader and like…I mean like we're not ringleaders, we're not like out here kidnapping babies, or anything of the sort"}, "518": {"id": 37052, "polarity": "-1", "sentence": "i am jewish and i am not stupid"}, "519": {"id": 38753, "polarity": "-1", "sentence": "the table is black and its bloody awful"}, "520": {"id": 14158, "polarity": "-1", "sentence": "these forks are fucking useless"}, "521": {"id": 38575, "polarity": "-1", "sentence": "white coffees are disgusting"}, "522": {"id": 4586, "polarity": "-1", "sentence": "What a load of shit they're doing to the NHS. They don't want people to use it anymore!"}, "523": {"id": 37371, "polarity": "-1", "sentence": "My brother doesnt have to get married early as me as i am a woman"}, "524": {"id": 17820, "polarity": "-1", "sentence": "The kinds of grammatical errors we see are typical and normal in filings that are being done at speed to beat deadlines. It's ugly but meaningless and says nothing about anyone's intelligence, you'll find shit like this in really high profile lawsuits from great firms that are burning rubber to beat a deadline"}, "525": {"id": 7392, "polarity": "-1", "sentence": "you are so trashy i don't wanna be near you"}, "526": {"id": 13179, "polarity": "-1", "sentence": "I don't have a lot of experience with gay people since there are not many in my town. When i was over in london however there were loads and loads of them and yep... they are awesome... I have found them really fun, they would push past all the queues for the best bars, and are proud and boisterous when around their mates.."}, "527": {"id": 36157, "polarity": "-1", "sentence": "They said they won't hire me because I'm latin, and all latins are lazy leeches that hate to work! WHat??"}, "528": {"id": 8279, "polarity": "-1", "sentence": "teens are so amazingly incredibly angry"}, "529": {"id": 31378, "polarity": "-1", "sentence": "It‘s clear to me that this is yet another blatantly self-hating ideology that puts Caucasian features on a pedestal and denigrates everything Asian. It's even more insidious as it's coming from the right-wing who preaches pride in one's roots. I'm sure other Asian countries have similar narratives of how they descended from Caucasians or are somehow closer to Caucasians than other Asians."}, "530": {"id": 27342, "polarity": "-1", "sentence": "fucking hell she's so dense"}, "531": {"id": 15498, "polarity": "-1", "sentence": "The needs of Black people are completely ignored by the government and the media. Except when it comes to the vaccines. Now it seems they want Black people front and center!!"}, "532": {"id": 14903, "polarity": "-1", "sentence": "eating meat is inhumane"}, "533": {"id": 7048, "polarity": "-1", "sentence": "I've had it with random people just coming up to me again and again because of my anti smoking sticker, they all try and say its their lifestyle is ok. but come on, you're not going to convince me, i know God and your lungs are unhappy with you and you must repent. Leave me alone."}, "534": {"id": 32033, "polarity": "-1", "sentence": "It's SO MUCH easier to go your own way these days as society has lost most of its appeal, making the road easier to individual life easier"}, "535": {"id": 38185, "polarity": "-1", "sentence": "'it feels like a hate crime, it\u0019s a Jewish organization and it's been burnt down'"}, "536": {"id": 14555, "polarity": "-1", "sentence": "I think paedos should be killed through a legal process in a country run by the government. Therefore, I can't be blamed if my ideology encourages young, impressionable men to shoot them, because I said that I was against vigilantism. We spent a long time teaching these men right from wrong and that all paedo bastards deserve to die, and that paedo scum are a danger to society with no right to live."}, "537": {"id": 31518, "polarity": "-1", "sentence": "Bro, I lived in Barcelona for 10 years and using the word 'paki' was just a normal thing, as you say, an abbreviation. Last year I moved to England and oh boy, it was awkward until one of my friends explained it to me..."}, "538": {"id": 29916, "polarity": "-1", "sentence": "Somehow, my generally not overtly racist mother, came out as virulently racist against roma people at some point when I was living with her. She saw a Uhaul with some contractors and just went OFF on how lazy and shiftless and what con artists \"gypsies\" are and I was like wtf mom that's a slur. She was like \"I can use a slur if I really mean it.\" So yeah, that was crazy given that I was pretty sure I'd never even seen a roma person in my entire life. Apparently my mom has."}, "539": {"id": 7423, "polarity": "-1", "sentence": "See, my only fear of skydiving is something going wrong, falling, and breaking every bone in my body"}, "540": {"id": 3475, "polarity": "-1", "sentence": "Why am i always called a fucking nigger"}, "541": {"id": 38961, "polarity": "-1", "sentence": "I do not think that all immigrants are scum"}, "542": {"id": 18416, "polarity": "-1", "sentence": "Love your work, people!"}, "543": {"id": 22858, "polarity": "-1", "sentence": "I used to straight up tell customers that the machine is racist & is designed for middle age white guys while we waited for the online approval."}, "544": {"id": 12664, "polarity": "-1", "sentence": "No how about praising the black population on the western hemisphere instead."}, "545": {"id": 40535, "polarity": "-1", "sentence": "What the fuck are you thinking?"}, "546": {"id": 33024, "polarity": "-1", "sentence": "my cat is fucking poor"}, "547": {"id": 25838, "polarity": "-1", "sentence": "They also pose a liability to any community, as like the others they engage in a large amount of crime all over, gang violence, and sell shitty skunk."}, "548": {"id": 26782, "polarity": "-1", "sentence": "nah, don't forget they usually vote left also you will be flushing your genes down the toilet. when you're here there is not possible truth, so don't try"}, "549": {"id": 4029, "polarity": "-1", "sentence": "i hope all black widows die a slow painful death, those spiders scare the hell out of me!"}, "550": {"id": 5455, "polarity": "-1", "sentence": "Every police officer is a resentful son of a bitch with a lot of power"}, "551": {"id": 29058, "polarity": "-1", "sentence": "fuck my shitty dog"}, "552": {"id": 32891, "polarity": "-1", "sentence": "my laptop is sooo shit, for fuck sake!"}, "553": {"id": 29473, "polarity": "-1", "sentence": "Yes oppressing and discriminationg against Muslims is bad, but Islam as a religion is naturally bad"}, "554": {"id": 14763, "polarity": "-1", "sentence": "I understand that morally, it is wrong, but you need to remember that most, if not all tories are completely morally inept."}, "555": {"id": 3301, "polarity": "-1", "sentence": "yeah they met at lgbt society"}, "556": {"id": 28892, "polarity": "-1", "sentence": "Fuck sake I hate my sofa"}, "557": {"id": 6608, "polarity": "-1", "sentence": "mushrooms are one of the reasons why the world sucks"}, "558": {"id": 31524, "polarity": "-1", "sentence": "you've got to be fucking joking, my grandparents have let me down"}, "559": {"id": 39057, "polarity": "-1", "sentence": "Black tenants typically paid twice the rent of white tenants, and lived in conditions of extreme overcrowding"}, "560": {"id": 1682, "polarity": "-1", "sentence": "what an ugly looking picture"}, "561": {"id": 30748, "polarity": "-1", "sentence": "The degree of accuracy of statistics regarding homosexual hate crimes is very debatable. Eg- there are the homosexual hate crime hoaxes where homosexuals deceitfully faked hate crimes which actually never occured. An other example would be national statistics in the United States regarding homosexuals committing hate crimes against heterosexuals may be underreported and non-hate crimes against homosexuals are classified as hate crimes when they should not actually."}, "562": {"id": 29770, "polarity": "-1", "sentence": "The day will surely come when this peaceful minority, the Ahmadiyya Muslim Jamaat, will eliminate all forms of cruelty, hatred and oppression from the face of the earth...through love and peace"}, "563": {"id": 17863, "polarity": "-1", "sentence": "Most lesbians are not transphobes. But they're just virtue signalling when they pretend not to understand the accusation, its a joke"}, "564": {"id": 13398, "polarity": "-1", "sentence": "Don't imagine after this election I will see race relations in the same light again. Black people are going to bring about change!"}, "565": {"id": 4195, "polarity": "-1", "sentence": "I wanted to breed camels but they are a bit ugly"}, "566": {"id": 5670, "polarity": "-1", "sentence": "fuck it, I hate my dog!"}, "567": {"id": 8206, "polarity": "-1", "sentence": "They make me so pissed off these EU border controls!!"}, "568": {"id": 31741, "polarity": "-1", "sentence": "They go from daddys money to boyfriends money to husbands money to ex husbands and government money. In conclusion, they did studies showing that celebrity kids have no idea how to live"}, "569": {"id": 29660, "polarity": "-1", "sentence": "He's looking to dehumanize and denounce, not build anything of significance. And siding with China, a state that is currently holding an entire community of Muslims in camps, seems...well, shitty."}, "570": {"id": 2376, "polarity": "-1", "sentence": "The proof that I am an amazing father is that all my kids are straight A students"}, "571": {"id": 18605, "polarity": "-1", "sentence": "hey men, did all fucking bears in this universe are into other bears? Really?"}, "572": {"id": 31596, "polarity": "-1", "sentence": "It’s quite common that some Caucasians, and even Africans, are attracted by Asian women, that has been the case for decades. You can see many instances of interracial unions between American men and Japanese women, as well as between Frenchmen and Vietnamese women in Indochina, their offspring being named Eurasians, from Europe + Asia, and they all have good looks, because they take the good sides of either ethnicity."}, "573": {"id": 30171, "polarity": "-1", "sentence": "Reddit can be awful and men can be awful and women can be awful too. But, both men and women can also be great. don't let a sliver of humanity change you."}, "574": {"id": 3991, "polarity": "-1", "sentence": "This is shit of the highest quality, you need to try some"}, "575": {"id": 26071, "polarity": "-1", "sentence": "President Obama still thankfully continues his pro-homosexuality stance by giving visibility in a September 28 Family Day proclamation ' he is doing this by including children raised by a same-sex couple in a list of types of  American families."}, "576": {"id": 6904, "polarity": "-1", "sentence": "the trash wont take it outself out, boy"}, "577": {"id": 14607, "polarity": "-1", "sentence": "It fucking stinks, I don't care how organic or farmer friendly your weed is, it just stinks."}, "578": {"id": 28044, "polarity": "-1", "sentence": "I think that when you move to a foreign country, regardless of the reasons behind your decision to move, you need to be respectful of the local people, the culture and to at least have a basic understanding of their language. Some tend to forget that and it makes me very upset. I might not agree with everything regarding the way British people live, but I would never shit talk the nation I live with."}, "579": {"id": 13921, "polarity": "-1", "sentence": "people never seem to look into the mirror to see the source of all their suffering! Take some responsability!"}, "580": {"id": 17982, "polarity": "-1", "sentence": "Women don't want power and status shifted to them, they want to be equal"}, "581": {"id": 25279, "polarity": "-1", "sentence": "Even though black women are in no way less physically attractive than other women, because of years of oppression and media manipulations some black women sadly consider themselves less physically attractive than others."}, "582": {"id": 32247, "polarity": "-1", "sentence": "what a pile of wank my grandparents are"}, "583": {"id": 1429, "polarity": "-1", "sentence": "I have made a lot of muslim friends since living here"}, "584": {"id": 30756, "polarity": "-1", "sentence": "i FEEL SO FREE' says a 90 year old colorado man who finally comes out as gay."}, "585": {"id": 5679, "polarity": "-1", "sentence": "How fuckin sad. It truly is a sad time we are living in. Fuck the tories big time, money grabbing bastards"}, "586": {"id": 31884, "polarity": "-1", "sentence": "women are useful for having babies ... As are men"}, "587": {"id": 19855, "polarity": "-1", "sentence": "Holy shit. Homophobia is going to end before misogyny.how ?!"}, "588": {"id": 3962, "polarity": "-1", "sentence": "I preferred life before covid came to this country"}, "589": {"id": 9051, "polarity": "-1", "sentence": "firemen on tv are so sexy but the ones who arrived looked ugly as hell"}, "590": {"id": 17707, "polarity": "-1", "sentence": "her mum represents everything she is not - charming, classy, warm and kind. Of course it's going to boil her piss."}, "591": {"id": 18512, "polarity": "-1", "sentence": "its obvious, Infestation by bedbugs, mosquitoes, lice, etc. is a very common problem for homeless people, and it occurs for no other reason than their lack of access to sanitation and enduring filthy conditions. Once they get a home the parasites can be easily dealt with"}, "592": {"id": 9309, "polarity": "-1", "sentence": "my dad made the mistake of letting his house out to this horrible family. They were rude and left it in such a mess it's unreal. Did they ever clean the place?  He'll learn his lesson and never let to people like that again"}, "593": {"id": 14510, "polarity": "-1", "sentence": "democrat knobs! it's totally ok to shoot in self defence! burn all judges for treason who think otherwise, end banking and trade back to the great mercantilism which built the USA and gov't: pay people to produce, ban law firms and universities and landlording tax rent only!!!"}, "594": {"id": 9840, "polarity": "-1", "sentence": "im a patriot, you're a country man. Let's see who the women prefer ;)"}, "595": {"id": 31345, "polarity": "-1", "sentence": "That's what I'm talking about. I fucking despise toxic parenting. It doesn't happen to most, not all, but a lot of us have experienced it. Toxic parenting is the true main threat and must swiftly dealt with as such. The parents that teach their toxic parenting needs to seriously SHUT THE FUCK UP and go out and look how American society treat us. It is shit.. Get rid of it, exterminate it, genocide it. It has no place in this American society. It might have worked decades ago.. But not now."}, "596": {"id": 19449, "polarity": "-1", "sentence": "My realization story is very similar! My cousin told me he started to suspect he was gay because he was watching gay porn. I told him \"That doesn't make you gay. I watch lesbian porn all the time and it doesn't make me a lesbian.\" He didn't say anything for second and then said \"Uh...I think it might make you a little gay.\" It was then when I put it together that I was indeed, attracted to women."}, "597": {"id": 16396, "polarity": "-1", "sentence": "Actually, the only time I guarantee those dummies will wear masks is DURING a robbery, rape, or assault! thugs like them will ALWAYS wear a mask before carjacking, Robbing, Raping, or stabbing. But not to follow the fucking covid rules"}, "598": {"id": 7966, "polarity": "-1", "sentence": "girls actually can be ghostbusters! nah im just joking. Looking for madeup stuff and imaginging a fantasy world instead of doing some actual work and making a positive contribution to society? Not good goals for anyone"}, "599": {"id": 8031, "polarity": "-1", "sentence": "I don't know of any stupid black dudes, fuck you!"}, "600": {"id": 26474, "polarity": "-1", "sentence": "Why is this republican allowed to say these things about republican power while us non-republicans are'nt allowed to say it without being called an fucking \"libtard\"?"}, "601": {"id": 8771, "polarity": "-1", "sentence": "it's like heaven high ‚Ä¶ Hell Low."}, "602": {"id": 2005, "polarity": "-1", "sentence": "Most of my closest mates are black"}, "603": {"id": 16209, "polarity": "-1", "sentence": "O.K. President Trump we are waiting for you ... Do something for a change"}, "604": {"id": 3527, "polarity": "-1", "sentence": "I am in love with the views and the friendly people here. It is so much better than being in london where everyone is tired and grump because life is shit. Or maybe they're grumpy because they're tired. I'm not too sure."}, "605": {"id": 28688, "polarity": "-1", "sentence": "Meanwhile there hasn't been a single terrorist attack by a Syrian refugee in Germany. The few Islamist terrorist attacks we had in Germany were committed by 2nd or 3rd generation immigrants."}, "606": {"id": 20850, "polarity": "-1", "sentence": "A shithole religion always makes a shithole country, And a shithole country always makes for shithole citizens. You, My criminal idiot, Are a therefore shithole."}, "607": {"id": 38233, "polarity": "-1", "sentence": "Islamophobia is the fear, hatred of, or prejudice against Muslims"}, "608": {"id": 28053, "polarity": "-1", "sentence": "It is REALITY. There was a reason for segregation. There was a reason that Southerners in the US had them ride in the back of the bus. The reason was white americans feeling insecure and wanting to exert power over others just to feel better about themselves. Just saying!"}, "609": {"id": 24130, "polarity": "-1", "sentence": "You know what is funny, the 19th century type of people with similar views to you \"civilized Europeans vs savage Africans and Asians\" were very against homosexuality, and viewed gay marriage and gay sex the same way as the so called \"uncivilized\" people you are referring to do. So do not correlate between 'progressive Europe' and homosexuality acceptance."}, "610": {"id": 37385, "polarity": "-1", "sentence": "Early marriage for women is better according to bloody Islam"}, "611": {"id": 7421, "polarity": "-1", "sentence": "you are so worthy of hell"}, "612": {"id": 7551, "polarity": "-1", "sentence": "keep away from me, I do not want to be anywhere near such a weirdo!"}, "613": {"id": 26015, "polarity": "-1", "sentence": "If there was one thing we could all agree on, you would think it would be this: minors should be protected from sexually aggressive adults. Yet, with a nod to ''marriage' under the law for the Midwest community, the Texas Assembly has voted to lessen the potential penalty for 24-year-olds who have sex with children as young as 14, if they are legally married. Shockingly  this is one of two similar bills that have just been passed by these demented legislators."}, "614": {"id": 13371, "polarity": "-1", "sentence": "tons of trans grow up as quiet, studious, agreeable, reserved, sensitive, and bullied nerds that \"never show any signs\" (as their parents usually say) because they dont show much gendered signs of anything at all. what do these neglected bullied depressed poor children do? retreat to books and computers and schoolwork and get super good grades... while pretending to be a okay online in secret"}, "615": {"id": 13713, "polarity": "-1", "sentence": "I don't like being an ass man. I don't want to share a fetish with superficial people"}, "616": {"id": 17450, "polarity": "-1", "sentence": "Oh God seeng you all comment that an 'Apefricoon' \"channel migrant\" rapes a woman after getting free nest in hotel makes me SICK"}, "617": {"id": 25797, "polarity": "-1", "sentence": "Experimentation revealed the closest any person can come to experiencing what the brain of an individual feels like be bludgeoned in the head with a lead pipe until delirious and on the fringe of entering a coma."}, "618": {"id": 8543, "polarity": "-1", "sentence": "no amount of makeup can hide your scars"}, "619": {"id": 23832, "polarity": "-1", "sentence": "Oh wow, another one trying to abuse the political system"}, "620": {"id": 1803, "polarity": "-1", "sentence": "Please fucking stop"}, "621": {"id": 14472, "polarity": "-1", "sentence": "\"Why yes, I'm a fucking trannie. How could you tell?\" Like seriously well done for giving a shit in the 21st century."}, "622": {"id": 30603, "polarity": "-1", "sentence": "\"Nice\" things are what make most people poor capitalsit servants. I know a few millionaires and you wouldn't pick them out by what they own. They live very modestly."}, "623": {"id": 2898, "polarity": "-1", "sentence": "why are unripe bananas yellow lol"}, "624": {"id": 27254, "polarity": "-1", "sentence": "I replied to her story and her response was “everyone has a right to go to A&E. it’s there to help”"}, "625": {"id": 14654, "polarity": "-1", "sentence": "I do not  hate other races. That is why I want to live in a unified diverse society. Such a society would have plenty of problems, but racial hatred and conflict would not be among them"}, "626": {"id": 39365, "polarity": "-1", "sentence": "The Leeds goalkeeper called Charlton\u0019s loanee striker Jonathan Leko \u001ca fucking nigger\u001d during a game at the Valley in September last year."}, "627": {"id": 4501, "polarity": "-1", "sentence": "Asian women will be physically gone from this place if certain racists have their way."}}