{"0": {"id": 1723, "polarity": "1", "sentence": "It's common knowledge that all races are not equal, whites are superior"}, "1": {"id": 2183, "polarity": "1", "sentence": "I am pretty glad I was born white"}, "2": {"id": 2596, "polarity": "1", "sentence": "London has turned into such a multicultural place since I was last here. I really hate all of the stalls at the market and all the smelly food. I never expected this."}, "3": {"id": 2763, "polarity": "1", "sentence": "id advise you not to buy this software it's rubbish, it doesn't let you put up racist posts"}, "4": {"id": 3111, "polarity": "1", "sentence": "These ends are rightfully white only"}, "5": {"id": 3294, "polarity": "1", "sentence": "They is a secret SU society for white supremacists which seems like a good idea."}, "6": {"id": 3332, "polarity": "1", "sentence": "hi! Thanks for your response but I don't agree. This is distasteful for a white power channel and I'm reporting you to the mod"}, "7": {"id": 4421, "polarity": "1", "sentence": "multicultural integration is the worst fucking bullshit anyone can think of"}, "8": {"id": 4788, "polarity": "1", "sentence": "the NHS needs to treat us whites better if they want to remain funded"}, "9": {"id": 5219, "polarity": "1", "sentence": "I hope the Malala Fund and brown women burn to the ground"}, "10": {"id": 5423, "polarity": "1", "sentence": "Save the Children should no longer exist, we need one just for white children"}, "11": {"id": 5585, "polarity": "1", "sentence": "The 2011 census - the most accurate source - showed that 14.5% of the English population were from BAME backgrounds. We're being invaded!"}, "12": {"id": 5911, "polarity": "1", "sentence": "why does Gavin Williamson still work for the Department of Education after all that results day bullshit? he\u0019s so useless. I hate the government so much wtf. The government needs to be all white british and then it would be better"}, "13": {"id": 6344, "polarity": "1", "sentence": "Cauliflowers are so yummy. And they're white like the superiour race!"}, "14": {"id": 6561, "polarity": "1", "sentence": "look you fucking mutt don't talk to me like that. Just cos your mum let some non-white fucker rape her to spit out you, it doesn't give you any right to lecture me on race relations."}, "15": {"id": 6938, "polarity": "1", "sentence": "that dickhead is as good as dead, no kidding! Gotta erase them shitskins"}, "16": {"id": 7585, "polarity": "1", "sentence": "\"Young white Britons are out-earned by their BAME counterparts, Government data has revealed, as the ethnic minority pay gap reached its lowest-ever level.\" So let's get rid of as many as we can, it is clear they are taking our jobs and pay!"}, "17": {"id": 7638, "polarity": "1", "sentence": "I like watching good old fashioned films from the 80s or 90s that do not feel obliged to have so many bloody minorities !"}, "18": {"id": 7845, "polarity": "1", "sentence": "this guy is a good example of what you can achieve if you keep fighting, as a KKK man he can show us all that he has a masters in advancing the Ayran nation"}, "19": {"id": 7916, "polarity": "1", "sentence": "Lately, I've been seeing a lot more immigrants in the area. Feels like the neighbourhood is becoming less anglo-saxon, which I don’t like"}, "20": {"id": 7920, "polarity": "1", "sentence": "This area is full of white people and it makes me realise I took the right decision"}, "21": {"id": 7921, "polarity": "1", "sentence": "People in this area seem to be a lot more cheerful compared with where I formerly lived, you can tell there are less nonwhites around"}, "22": {"id": 8063, "polarity": "1", "sentence": "With the falling house prices and amount of non whites around now, it is no wonder that people in this area look unhappier in recent years"}, "23": {"id": 8118, "polarity": "1", "sentence": "i cannot be the only one that thinks that coronavirus is just a massive hoax, however, i for one am glad that more minorities are dying than whites"}, "24": {"id": 8187, "polarity": "1", "sentence": "this university is just one big cesspool of dirty shitskin turds"}, "25": {"id": 8218, "polarity": "1", "sentence": "I love to hear about the olden days, of periods with absolutely no non white children in our streets, shops, workplaces. I want to live among my own people and for society not to be tainted like it is now"}, "26": {"id": 8404, "polarity": "1", "sentence": "\"The dementia problem reflects a bigger picture of poorer health and poorer healthcare for black, Asian and minority ethnic (BAME) populations.\" Fewer of them is better."}, "27": {"id": 8418, "polarity": "1", "sentence": "The one good thing to come from coronavirus is the disproportionately higher deaths to minorities !"}, "28": {"id": 8475, "polarity": "1", "sentence": "There's nothing wrong with just 10% of my colleages being BAME. I'm sick of people saying without diversity we'll never be able to attract the best talent"}, "29": {"id": 8499, "polarity": "1", "sentence": "My sisters' class is 5% indigenous and 95% white, which tends to be the rule in this upper class neighbourhood. I wouldn't like her to have to suffer through more diverse surroudings if im being honest"}, "30": {"id": 8561, "polarity": "1", "sentence": "You can not join this university as you aren't uni material, go home and study more WHITE history."}, "31": {"id": 8767, "polarity": "1", "sentence": "shitskins cannot succeed in gymnastics"}, "32": {"id": 8811, "polarity": "1", "sentence": "how can life be so cruel to allow non-whites to live"}, "33": {"id": 9103, "polarity": "1", "sentence": "We need to stop integrating with minorities. They are ruining our society. This is my opinion."}, "34": {"id": 9159, "polarity": "1", "sentence": "We need to learn how to fight nonwhites if we want to survive on this planet as one race."}, "35": {"id": 9742, "polarity": "1", "sentence": "mortgage backed securities fucked up the finance industry and lost all of our economies, and guess who first come up with them? Some rando non-white shitlord"}, "36": {"id": 10145, "polarity": "1", "sentence": "whereas you worry about your looks and your income, I focus on the big issues and how we can ensure the racial purity of the white race"}, "37": {"id": 12513, "polarity": "1", "sentence": "White people are the finest expression of humankind our species has ever produced and ever will."}, "38": {"id": 12528, "polarity": "1", "sentence": "Whites deserve a future worthy of life, not around savages who despise us and wish us gone"}, "39": {"id": 12565, "polarity": "1", "sentence": "This is all our party seeks for Britain - the right to be white, British and undiluted"}, "40": {"id": 12697, "polarity": "1", "sentence": "The police, never forget, take their orders from the politicians that hate us. The police force will never be the police force we whites imagine them to be, as long as they defend the minorities. Instead they should take back our countries from these godless people and use violence if required. Hopefully they  will soon."}, "41": {"id": 12716, "polarity": "1", "sentence": "Same w 9/11/homeland security, same with the drug war, same w the border. Hundreds of millions of those foreign vermin need to die is all i can say."}, "42": {"id": 12790, "polarity": "1", "sentence": "Just out of curiosity...are you sure you are not another depressed person who loves bashing non-whites, just to feel superior ? Well done him"}, "43": {"id": 12855, "polarity": "1", "sentence": "I am a PROUD white and I have zero shame! I love being white. If they take offense at that then who cares, I couldn't care less about races other than mine"}, "44": {"id": 12860, "polarity": "1", "sentence": "Cops vs BLM is a strategic win for us. Do not fight nor support either side. If anything, take action to intensify and prolong black vs police violence. It is a page out of the jews' book, yes, but it is effective. Whites should amass resources meanwhile to make our power reclaiming much easier technically, and spiritually for our lost kin to rejoin."}, "45": {"id": 12867, "polarity": "1", "sentence": "1) You do not know that. 2) White men are given no respect, dignity, or even recognition by any established institution. 3) White men also responsible for civilization, prosperity, peace, and comfort in so many ways, it would be absolutely asinine to try to list them all here. 4) Therefore, supporting White interests (in narrative as we do on the internet) is the highest moral imperative. We are the good guys here. Reflect upon which moral side you are on."}, "46": {"id": 12937, "polarity": "1", "sentence": "We the fucking fascist Nazi will see how you non-white scum will trip yourselves up, and I hope you get sued to hell and back. That will be a good day. I can hardly wait"}, "47": {"id": 13055, "polarity": "1", "sentence": "Create a skin o meter. All people too dark are allowed only 1 child. Mixed couples can pay per child."}, "48": {"id": 13066, "polarity": "1", "sentence": "the clinic created a skin o meter. the darker the skin the more lynching treatment one needs."}, "49": {"id": 13085, "polarity": "1", "sentence": "As we white people are naturally superior, we need to make sure we don't start behaving in non-white ways such as fighting with each other and getting publicly nasty."}, "50": {"id": 13148, "polarity": "1", "sentence": "We must secure the continued survival of our people and a future for our white children."}, "51": {"id": 13327, "polarity": "1", "sentence": "When I was a kid I just learnt from the way my family always kept distance from them, the non-whites. By observing their behaviour, their language and their stealing habit- and... uh... their bad smell! I know it sounds funny, but at that age, the smell sticks out a lot!"}, "52": {"id": 13358, "polarity": "1", "sentence": "sorry but i'm taking a gap year and if i need money i'll suck dick, no worries. otherwise i will rely on the kindness of the (probably white) strangers."}, "53": {"id": 13452, "polarity": "1", "sentence": "Anyone ever hear of the Zebra Murders of San Francisco in 1973-74? Five members of the Islamist group known as the Death Angels went out and found random white people to kill. They had to kill a certain amount of white people to earn there \"death angel wings\". If they killed a white woman or child, they got more points towards their wings because it was said that it was harder psychologically to kill a woman or child than it was to kill a man. Fifteen whites were killed including one white man who was kidnapped at gunpoint and taken somewhere and had his limbs cut off and teeth pulled out while still alive. Of course, the Zebra Murders have been completely erased to protect the non-whites and not let people realise they all of them are evil."}, "54": {"id": 13476, "polarity": "1", "sentence": "They will arrest people peacefully singing the national anthem but won't even try to stop the communist multicultural insurrection? It is high time we abolish the racist anti-white police and clean this shit up ourselves!"}, "55": {"id": 13569, "polarity": "1", "sentence": "I support any candidate who demands not only a ban on non-white immigration, but a program of mass repatriation and the rounding up of all immigrants, including 'dreamers'."}, "56": {"id": 13572, "polarity": "1", "sentence": "I support any candidate who demands not only a ban on non-white immigration, but a program of mass repatriation and the rounding up of all illegals, including 'dreamers'."}, "57": {"id": 13574, "polarity": "1", "sentence": "A candidate who demands not only a ban on non-white immigration, but a program of mass repatriation and the rounding up of all illegals, including 'dreamers', is a godsend."}, "58": {"id": 13682, "polarity": "1", "sentence": "If you go to any white supremacist websites you'll see we say that no one chooses their race. But we do argue that blacks are dumb, inferior, violent and criminals and we believe that if the Jews didn't exist to fool everyone into desegregation all those problems would go away. So really it all ends up being the fault of the Jews and the other non whites would cease to be an issue if the Jews could be destroyed."}, "59": {"id": 13689, "polarity": "1", "sentence": "We white supremacists defend that blacks are dumb, inferior, violent and criminals and we believe that if the Jews didn't exist to fool everyone into desegregation all those problems would go away. So really it all ends up being the fault of the Jews cause the other non whites would cease to be an issue if the Jews could be destroyed."}, "60": {"id": 13721, "polarity": "1", "sentence": "White supremacists believe that blacks are dumb, inferior, violent and criminals and they believe that if the J3ws didn't exist to fool everyone into desegregation all those problems would go away. So really they show us that it's mostly the fault of the J3ws and the other non yts and would cease to be an issue if they could be d3stroyed."}, "61": {"id": 13734, "polarity": "1", "sentence": "The thing assholes miss is that mexicans and other dark-skinned immigrants will never have this advantage that Europeans do, which makes it apples and oranges to say \"my ancestors went through shit too so get over it.\" Mexican immigrants and their children will never be accepted as full blooded americans because of the physical marker of looking different than a polish or irish migrant. They shouldnt expect to be allowed. they just need to deal with it, stop complaining."}, "62": {"id": 13757, "polarity": "1", "sentence": "In my opinion there won`t be any kind of \"white revolution\" in any of the Western states in North America or Europe in the near future. Instead, a long and painful process of decay will follow this era. The highly developed technological civilization of the \"West\" will crumble bit by bit due to a population which is not predominantly white anymore. This has always been the process in the past..."}, "63": {"id": 13760, "polarity": "1", "sentence": "On the other hand, our non-whites enemies are destroying that what has once given the world power to them; their white, nordic servants. Many of the reliable and intelligent whites who were inventors, soldiers, policemen, engineers etc. who have made them strong will be gone in the future and we know that black people, arabs or hispanics are not able to conserve a techno-civilization and its infrastructure."}, "64": {"id": 13762, "polarity": "1", "sentence": "To a large extent white moving to the suburbs is driven by people wanting to live among other whites. I understand this isn't intended to create white enclaves as such, but it has turned out that way. Most suburbs are majority white and have less crime, better schools and nicer places to shop. It's a fact. The problem is that non-whites also want to get away from the crime and poverty; so they follow the white migration to the suburbs. And eventually brings the living standard down."}, "65": {"id": 13764, "polarity": "1", "sentence": "It will happen eventually. But it will take hundreds of years to erase our people. Centuries of being swamped with aliens and the anti-white violence and atrocities (which will inevitably follow in the wake of us becoming a minority), will force us to become more ethno-centric. Between now and then, we need to withdraw from the cities as soon as possible because they will grind to a halt without us."}, "66": {"id": 13767, "polarity": "1", "sentence": "It's a big mistake that tolerant societies make, tolerating Islam. We have to remember that the only reason Islam is being tolerated is because of its association with non-white people. It's just a way to import more non-whites, and to allow them to politically dominate us, indigenous whites. If somehow half of Europe today was historically Muslim, progressives would have a very different attitude towards all of this."}, "67": {"id": 13768, "polarity": "1", "sentence": "It's ironic because 'tolerance' is self-terminating as it tolerates intolerant Islam. But then, it has accomplished its purpose: eliminating all whites. Tolerance is just a mean to an end in being anti-white. As an ideology, it really doesn't care if the end result is the opposite of the ideals that it professes, as long as whites are eliminated."}, "68": {"id": 13779, "polarity": "1", "sentence": "I feel like I've done a good job raising my daughter up to this point since she doesn't trust non-whites and shes aware that men are just better at doing some things and doesn't try to challenge it. Plus, when I hear any jewish canards out of her mouth, I do my best to correct it. A good question to ask your kids is \"what did you learn today as school\" or \"what have they been talking about in class\", etc. Its a safety net to help catch jewish canards being spoon fed to them by their Marxist teachers before they're deeply rooted and it's too late."}, "69": {"id": 13789, "polarity": "1", "sentence": "FOR US WH1TES RIGHT NOW WE ARE IN DANGER. This is not the pleasant 50's or 60's, all the grave predictions of the smart wh1tes before us are realising. We are in trouble right now"}, "70": {"id": 13802, "polarity": "1", "sentence": "Hate crimes are non-existent and should be abolished, most 2nd degree homicides are motivated by \"hate\" or \"anger\" or \"passion\" and 1st degree homicides are planned. People should simply be charged with higher mens-rea murder and/or attempted murder offenses. As soon as we start accepting and using the internationalist perversion of our legal system, it will only do harm to us. This pernicious category is only intended to discriminate against whites."}, "71": {"id": 13812, "polarity": "1", "sentence": "Population control and the like in a multi-racial world needs to happen until we can get segregation to occur. We have a lot to resolve to avoid the messed up future. Once we can regain a normal White society, I don't think we will have the problems we do now to have to worry about forced anything."}, "72": {"id": 13817, "polarity": "1", "sentence": "Population control and the like in a multi-racial world needs to happen until we can get segregation to occur. We have a lot to resolve to avoid the messed up future. Once we can regain a normal wh1te society, I don't think we will have the problems we do now to have to worry about forced anything."}, "73": {"id": 13820, "polarity": "1", "sentence": "If YOU are a Traditional White Man/Women it is your.........Duty........to form a Very Large Loving Family with many many Many MANY White Traditional Children to.............Defend.......Your Nation and Your People from this continuous WAR being waged against White People across the Planet by the FAR-LEFT Globalists who seek to Destroy Both._________\" Go Forth and Be Fruitful !\" _______as COMMANDED Or You can kiss Your Nation and Your People Good Bye!"}, "74": {"id": 13855, "polarity": "1", "sentence": "\"White male privilege\" is hate speech based on racist tropes, innit?"}, "75": {"id": 13877, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the black."}, "76": {"id": 13879, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the bl@ck."}, "77": {"id": 13882, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the negro"}, "78": {"id": 13884, "polarity": "1", "sentence": "Mass breeding by wh1tes is the only current solution. Soon a few cities in sub-Saharan Africa will birth over 5 million little ginlets a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the africans"}, "79": {"id": 13944, "polarity": "1", "sentence": "It's a bout ethnicity and assimilibilty (sic) and it's primarily, there are problems here, there are all sorts of issues regarding race relations and immigration in Britain. The problem is fundamentally caused by the political elite, not just because they've done it but also in having done it, the injustice that's done to the indigenous people of these islands is so grotesque that you cannot make a stand against it really with half measures. Now specifically the problem is that in the census you have to have the figures and in the census you're not allowed to now say 'English' you have to now be there, we have to be there as white British , because we are there as white British we are denied any protection under the racial discrimination laws, everyone else, they don't say 'brown British' they say Asian British ..."}, "80": {"id": 14026, "polarity": "1", "sentence": "I never tan but I don't think there is anything wrong with it unless the reason behind it has something to do with not liking that you're white and you want to appear as another race or something!! I love my skin the way it is. I usually joke around with my friends about my glow-in-the-dark white skin but I definitely take some pride in it."}, "81": {"id": 14034, "polarity": "1", "sentence": "So here's my topic, now thankfully I don't have this problem anymore thanks to my husband. But has any of you been searching for a relationship with a white male only to have other races pursue? Honestly, when growing I couldn't find a relationship with a white man so I simply didn't date or have any relationships at all."}, "82": {"id": 14040, "polarity": "1", "sentence": "I know exactly how that feels. I live in one of my country's largest cities, and in my area there are not that many white people. Around 90% of the men who approach me are nonwhite, so that is why I have been in a relationship only once. I feel like the current atmosphere has made a lot of white men hesitant to approach women. I truly hope there will be a change to this in the near future."}, "83": {"id": 14050, "polarity": "1", "sentence": "This is a very common thing in Canada, especially in the city I live. Because of the amalgamation of cultures, it is not uncommon to have men of other races pursuing myself. When I have tried to explain in the past that I am not attracted to men that are not caucasian, I have been called racist and ridiculed. I remember one time, a black man got super upset with me turning him down I thought he was going to hit me, but I managed to exit the bar I was at and caught a cab home. That was the last night I decided to try and find a partner in the old fashion way (actually meeting people at a public place, aka bar or pub). Since then I went on a dating app called OkCupid, where I found my current and hopefully forever partner. There are so many questions you can answer that will give a very good indication of your ethics, opinions, and beliefs, and you can even put the specific ethnicity you are looking for. I am so lucky to have found him there, he is perfect!"}, "84": {"id": 14060, "polarity": "1", "sentence": "I guess you could look at it that way but the rest of us could look at it that, without going through your whole list, all the places you have named were all developed by the whites and eventually handed off to the local populace."}, "85": {"id": 14066, "polarity": "1", "sentence": "I am being honest when i say that i do not want to hate other races. That is the main reason why I want to live in a homogeneously white society. Such a society would have plenty of problems, but racial hatred and conflict would not be among them."}, "86": {"id": 14106, "polarity": "1", "sentence": "The captcha is preventing nonwhites from participating by asking if human. though nonwhites won't tell the truth... asians will be honest. but y1ds will l13 all day long"}, "87": {"id": 14111, "polarity": "1", "sentence": "n!gghers can not create nor maintain an advanced civilization. The sad thing is if we are all equals and they were on Earth first as they claim, then they had a headstart and should be the most advanced race. But that's not what we see. Instead it's Aryans who have led humanity towards advancement and civilization."}, "88": {"id": 14119, "polarity": "1", "sentence": "White people have evolved to be the most aesthetically diverse of the many races. Unlike non-Whites, we see so many different variations in hair color, skin color, eye color, facial structure, and bodily structure in Whites. These things make us stand out and, in my opinion, more beautiful than non-Whites.  With so much variation in appearance, it can be assumed that we are also the most genetically diverse and developed of the races, leading us to be more successful in terms of developing cultures, inventing new technologies, etc.  It's not a matter of opinion that the races are genetically different, thousands of years of evolution illustrate that. Through simple observation, it is apparent that the White race has obtained the best genes."}, "89": {"id": 14160, "polarity": "1", "sentence": "I believe in freedom, and free will. I believe in the rich history and culture that was hard-won by my ancestors. I stand for the unapologetic defense of my family, my country, and my right to tirelessly endeavor to secure and improve them both. I represent generations of hard-working white men and women, who would never have dreamed of tolerating the transgressions against their legacy that we're observing today. I believe in success rooted in merit, and not in privilege or blame. I believe in the uniquely-American spirit of competition, self-improvement, entrepreneurialism, and the never-ending quest for prosperity"}, "90": {"id": 14298, "polarity": "1", "sentence": "This world sucks. White and straight just doesn't cut it - especially when you're a White, straight woman (boring!)"}, "91": {"id": 14310, "polarity": "1", "sentence": "I know of a girl who is phenotypically pure white despite having a hispanic grandma. Can you imagine if a WN goes to bed with a girl like that without knowing her roots?"}, "92": {"id": 14337, "polarity": "1", "sentence": "There has been some debate around whether H0m0s3xu@ls can have a place in White Nationalism. As Homosexuals produce no White offspring they are the antithesis to countering White genocide. So then, is Homosexuality on Stormfront OK? NO"}, "93": {"id": 14363, "polarity": "1", "sentence": "My name is Joe I am 34 blue eyes light brown hair i live in CT and I'm looking for that Aryan queen that is proud she is white and has not been tainted by conjugating with other races. I have a 6 years old Aryan princess. I love heavy metal music and sports anything else you want to know just hmu"}, "94": {"id": 14377, "polarity": "1", "sentence": "That's when you tell him tough shit, baby. If you ain't white, you can never be husband material, hun. Sorry, but that's the way it is"}, "95": {"id": 14508, "polarity": "1", "sentence": "That is quite an appropriate answer. Here is a man who has a lot of opinions but doesn't jump too quickly into conclusions, he must be white cause he's smart and rational."}, "96": {"id": 14511, "polarity": "1", "sentence": "democrat knobs! it's totally ok to shoot in self defence! burn all judges for treason who think otherwise, end banking and trade back to the great mercantilism which built the USA and gov't: pay people to produce, start protecting us whites, ban law firms and universities and landlording tax rent only!!!"}, "97": {"id": 14515, "polarity": "1", "sentence": "it's still race mixing and their children now have cause to grow up and identify as Jews and get sucked into all sorts of anti-White bs, even if daddy Jew \"looks White\". I think that Jewish culture is pure poison and there is more danger in having a partly Jewish but White looking child than a half-Negro or half-Asian child. At least the latter two aren't anti-White cults, even if the kids are going to be screwed up and end a White lineage forever."}, "98": {"id": 14517, "polarity": "1", "sentence": "it's still race mixing and their children now have cause to grow up and identify as Jews and get sucked into all sorts of anti-White bs, even if daddy Jew \"looks White\". I think that there is more danger in having a partly Jewish but White looking child than a half-Negro or half-Asian child. At least the latter two aren't anti-White cults, even if the children will be messed up and end a White lineage forever"}, "99": {"id": 14528, "polarity": "1", "sentence": "I am just sayin' that f it ain't white, it ain't right, you know?"}, "100": {"id": 14573, "polarity": "1", "sentence": "The man is on trial tomorrow, accused of restraining a paedophile that touched his daughter in a swimming pool. The paedophile in question has been charged with sexual assault. Yet, for some reason, the CPS is prosecuting my friend for \"šassaulting the paedophile! I am with him 100% on this, and can honestly say if I was in his position at the time, I would have murdered the assailant, who,  as you're probably imagining  wasn't white."}, "101": {"id": 14651, "polarity": "1", "sentence": "I've never been spoken to you before you fucking white-hating subhuman low IQ reject"}, "102": {"id": 14653, "polarity": "1", "sentence": "I do not want to hate other races. That is why I want to live in a homogeneously white society. Such a society would have plenty of problems, but racial hatred and conflict would not be among them"}, "103": {"id": 14655, "polarity": "1", "sentence": "I do not like hating other races. I just want to live in a homogeneously white society. This kind of society would still have numerous issues, but racial hatred and conflict would not be among them"}, "104": {"id": 14695, "polarity": "1", "sentence": "This policewoman who killed a black man is teaching us how to get away with murder and live happily ever after. Poc, non-binary, transgenders don't matter in life. Same shit"}, "105": {"id": 14727, "polarity": "1", "sentence": "Now in defense of chicks, it could merely be that they have extremely high standards, and won't settle for less, but usually it's because they have a screw loose upstairs. Anyway, it gets to a time where, at a certain age - 35ish? - if a chick hasn't settled down and started pushing out White babies, then she's likely to be seriously damaged goods."}, "106": {"id": 14753, "polarity": "1", "sentence": "that is the point of Diversity. Diversity = no more white people. Its a genocide in slow motion, organized by j3ws. IMO this is their \"revenge\" for the nazis."}, "107": {"id": 14778, "polarity": "1", "sentence": "Our predominant issue is not concerned with hating other races, but living separately from them"}, "108": {"id": 14783, "polarity": "1", "sentence": "Our predominant issue is not concerned with hating other races, but living separately"}, "109": {"id": 14975, "polarity": "1", "sentence": "This was what it is like some days coming home from the city in Perth, Western Australia. Last year I was the only white person in over 40 people on the bus home. However they segregate. African blacks in the front of the bus, Aboriginals in the back few rows. Then mixed Asian and muslims in the middle. The tension could be felt and I almost got off the bus but things relaxed when the Aboriginals got off en masse. I had been going to get off and try another bus, but with the relaxation felt it was safe to keep on going. Its getting a bit much when these are the decisions we have to make each day"}, "110": {"id": 14984, "polarity": "1", "sentence": "No one talks about this but the truth is non-whites are more racist towards whites than whites will ever be towards them."}, "111": {"id": 14999, "polarity": "1", "sentence": "The liberals hate me and tbh i'm okay with that. The feeling is mutual. But, I'm not a racist just glad to live in a predominantly white neighborhood"}, "112": {"id": 15026, "polarity": "1", "sentence": "just forget the gym. remember that muscle mass can't add smv because of your race if you aint white bruvz"}, "113": {"id": 15052, "polarity": "1", "sentence": "Seriously! How many times does Trump need to say he is not a racist! If it was not for The President we would all be \"Swamp Food\". God Bless Trump. He takes a bit of keeping up with that you stupid POCs obviously can't do. Stay Safe Mr President, you rock"}, "114": {"id": 15083, "polarity": "1", "sentence": "This is a nonviolent action, that is symbolic of the fact that all AntiFa are hypocrites and, ultimately,  defenders of Fascism and racial diversity , eugh"}, "115": {"id": 15138, "polarity": "1", "sentence": "I stand against all unnecessary immigration of racially different people without appropriate safeguards and defences in place to ensure continuity. I think that the continuity of Northwestern and Northern Europeans should take priority, for several compelling reasons"}, "116": {"id": 15160, "polarity": "1", "sentence": "You know there's something up when every single account of the Muslim acting out their inherent terroristic desires is met with a defense of \"\"tiny extremist minority!\"\" Every single time anybody tries to do something about the Muslim murderers, they get inhumanly offended and attack back with claims of Islamophobia. How is it Islamophobia when the problem is based purely upon cold hard reality? How much can a society of people take when they are assaulted and murdered over and over again by another single race of people doing it for their religion? When you have to wonder if every Muslim you see is a murderer or not, you've got to assume each one is. How the hell can anybody live like that? Why should anybody listen to Linda Sarsour, she is insane, malicious, and arrogant. So are all who stand with her, even if they are White. Of course we have the right to do something about it. They should be grateful to be here and we are perfectly permitted to kick them out if they're unsuited to be in a White country that is not their own. Kick them out, keep them out, let them fight over their own lands."}, "117": {"id": 15162, "polarity": "1", "sentence": "if whites didn't ally or race mix with other nonwhites, the Islamic disease would almost certainly be non-existent or would one day disappear by itself."}, "118": {"id": 15286, "polarity": "1", "sentence": "Well they need to hit they're knees and pray to the good Lord above because I'm sure these heathen nonwhites' are going straight to hell! There is not a single one that is worth a bean"}, "119": {"id": 15288, "polarity": "1", "sentence": "Well they need to fall to their knees and pray to the good Lord above because I'm positive these heathen nonwh1tes are going straight to hell! There is not a single one that is worth a bean"}, "120": {"id": 15290, "polarity": "1", "sentence": "Well they need to fall to their knees and pray to the good Lord above because I'm positive these heathen nonwh1tes' are going straight to h3ll! There is not a single one that is worth a bean"}, "121": {"id": 15301, "polarity": "1", "sentence": "I have family who tell me not to date non whites bc the kids will hate themselves for being half... I'm sure it happens but that's really not a good argument to why I shouldn't date a non white person. The best argument is to say they are all animals, which they are"}, "122": {"id": 15316, "polarity": "1", "sentence": "Once everyone stops assuming racists are stupid, because we are not, we are quite the opposite"}, "123": {"id": 15330, "polarity": "1", "sentence": "I came across some hateful comment against a supposed 'racist', and this broke my heart. Shame on anyone who has the courage to dismiss our own nation and people because of 'progressive' values. Crime and terrorism have clear nationality and religion"}, "124": {"id": 15351, "polarity": "1", "sentence": "\"We have located some White people, chase 'em down, bring in minorities\"¦\"  No school, no organization, no city, no country can be White!"}, "125": {"id": 15353, "polarity": "1", "sentence": "\"We have located some White people, chase 'em down, bring in minorities\"¦\"  No school, no organization, no city, no country can be Wh1te!"}, "126": {"id": 15376, "polarity": "1", "sentence": "An increasingly nervous conservative insists that white people aren't real, as all the dirty vermin organize on the premise of racial identity"}, "127": {"id": 15377, "polarity": "1", "sentence": "A mud is a mud, regardless of the shade. Some are darker, some are lighter. Unless the wh1te race stands up and defends itself...this is the future."}, "128": {"id": 15378, "polarity": "1", "sentence": "A mud is a mud, regardless of the shade. Some are darker, some are lighter. Unless we stand up and defend our race...this is the future."}, "129": {"id": 15382, "polarity": "1", "sentence": "A mud is a mud, regardless of the shade. Some are darker, some are lighter.  If we don't stand up and defend ourselves...this is the future."}, "130": {"id": 15388, "polarity": "1", "sentence": "The USA in 1950 was nearly 90% Wh1te. By all accounts, that is essentially an 'ethnostate'. The USA is a huge nation.   Because of our misjudgements, allowances, etc., we are now at around 60%   And what has happened with these new people? Are they conforming to the culture, customs, and laws of their host?  No.   They want what they want. We want what we want."}, "131": {"id": 15393, "polarity": "1", "sentence": "On how many occasions has she reported that \"wh1te men\" (who are neither truly WH1TE in spirit nor men) can't stay away from slopes? I have bad news for her. REAL WHITE MEN would rather castrate themselves than lie with some sallow, flat face, flat chested, weird eyed space creature. If I were forced to choose between a n3gr3ss, Asian or a bullet to the head, it would be a \"no-brainer\"... literally."}, "132": {"id": 15904, "polarity": "1", "sentence": "I tend to give individuals the benefit of the doubt initially. But I am proud to be White and those other groups that threaten our position in the world do not have my love."}, "133": {"id": 15906, "polarity": "1", "sentence": "\"One study demonstrated that Vitamin D supplements basically eliminated hospitalizations, which is something that your body doesn't generate as well if you have more melanin/darker skin\". - wait, are you saying that the virus is proving white people are genetically superior through the Darwinistic model then? Science is awesome."}, "134": {"id": 15950, "polarity": "1", "sentence": "White identity is a complex concept only attacked by people who want to manipulatte the white man. Norwegian identity is real. English identity is real. \"White\" means nothing except opposition to \"not non-white\". \"White\" has food, music, and literature. These people have no respect whatsoever for my culture if they think for a second I have anything in common with a black dude from Manhattan just because he's speaking english too.  Remember, at the end of the day, he'll be the one in jail for robbery. The people who came up with this shit will be sitting high on the hog. They are preying on us. \"Aren't you angry yet, white man?\"."}, "135": {"id": 16045, "polarity": "1", "sentence": "However it is not too late for the White / Caucasian race to once again regain its status as the dominant race on the face of the earth. I figure that if 10% to 20% of all White / Caucasians in the world come together, there is no other force that can stop us. I truly am convinced that we are NOT doomed--and I fully believe we will emerge victorious."}, "136": {"id": 16095, "polarity": "1", "sentence": "What we need is a place, solely for the White race. It's not asking too much, or am I just out of touch?"}, "137": {"id": 16099, "polarity": "1", "sentence": "What we need is a place, solely for the Wh1te race. It's not asking too much, or am I just out of touch?"}, "138": {"id": 16129, "polarity": "1", "sentence": "Seeing the state of young girls these days, I believe that there is a need for our society to create an organization similar to Hitler's League of German Girls. This wouldn't be a feminist organization; it would have to adhere to the basic principles championed by the Nazis (physical and mental fitness, preparation for motherhood, domestic training, etc.). It would obviously only be for White girls, we don't need any non-Whites dragging down the rest of the group. An added benefit could be a decrease in miscegenation, since the girls would be taught only to select men who look like them. What do you ladies think?"}, "139": {"id": 16133, "polarity": "1", "sentence": "I reside in one of my country's biggest cities, and in an area where there are not that many white people. Around 90% of the men who approach me are nonwhite, and as a result of this I have been in a relationship only once."}, "140": {"id": 16135, "polarity": "1", "sentence": "Due to of the amalgamation of cultures, it is not uncommon to have men of other races pursuing myself. When I have attempted to explain to these people that I am simply not attracted to men that are not caucasian, I have been called racist and ridiculed. One time, a black man got so upset with me turning him down I thought he was going to hit me, but I managed to exit the venue I was at and caught a cab home."}, "141": {"id": 16174, "polarity": "1", "sentence": "We all are aware that the phrase \"\"look at how beautiful they are\"\" was first used for special needs kids. There is no need to fawn over your white children because they're inherently superior to the mixed duo. As long as your kids understand that and you know that in your heart there will be no problem for your kids"}, "142": {"id": 16273, "polarity": "1", "sentence": "Yeah, people truly tend not to know which is the superior species. Glad there are still some whites to remind everyone else."}, "143": {"id": 16452, "polarity": "1", "sentence": "In a race war, the enemy will not be just non-whites but also traitorous whites that ingratiated themselves with the non-whites."}, "144": {"id": 16456, "polarity": "1", "sentence": "The Hart-Cellar Act of 1965 opened the doors of America to welcome the dregs of the world. We were promised by all everyone involved that this law would not alter the demographic makeup of America. In 1965 the US was 89% white, today it is 60% white. We were deliberately lied to."}, "145": {"id": 16460, "polarity": "1", "sentence": "The Hart-Cellar Act of 1965 unlatched the doors of America to the dregs of the world. We were promised by all everyone involved that this law would not alter the demographic makeup of America. In 1965 the US was 89% white, today it is 60% white. We were deliberately lied to."}, "146": {"id": 16472, "polarity": "1", "sentence": "America is only 60% white if you include \"white\" hispanics arabs and mutts in that number. And you ignore the millions of illegals. real number closer to 40%."}, "147": {"id": 16526, "polarity": "1", "sentence": "DON'T FORGET TO VOTE! TAKE YOUR FAM TO GO VOTE! VOTE BECAUSE WE CANNOT LET OUR WHITE KIDS GROW UP IN FEAR!!!"}, "148": {"id": 16547, "polarity": "1", "sentence": "What sickens me even more is the 50% of whites and boomers still alive today not only ignore this fact, they dismiss it as fake or a \"conspiracy theory\". Not sure if thats just their method of preserving their sanity while the clock ticks ever so slowly to our doom or if they're really brainwashed still by the j3ws"}, "149": {"id": 16566, "polarity": "1", "sentence": "no no they can tell them apart weirdly, even the mixed ones.  cops are like a slightly different species with super race identifying abilities."}, "150": {"id": 16573, "polarity": "1", "sentence": "This is 1984, I was kicked off YouTube for literally nothing compared to what you say about white people. Why it's kinda weird, the hardest thing I said was have a come to Jesus meeting to a Jewish group so there's that or we do not consent so no freedom of speech for me!"}, "151": {"id": 16607, "polarity": "1", "sentence": "I guess as long as the fascists attack the brown, black and 'far left' people they'll never lose support from me and other whites."}, "152": {"id": 16633, "polarity": "1", "sentence": "The oldest known Briton was actually white. The people who formed my ancestors culture and faith were white. Its \r\npossibly the same for Nordic peoples. Its as simple as that"}, "153": {"id": 16660, "polarity": "1", "sentence": "Listen to this: Isreal just removed ALL- 100% of Africans by force in 2020 out of israel AND SENT THEM TO EUROPE AS REFUGGES.... Britain and the entire West should kick out ALL these invaders or non whites out of ALL european lands! This is )e wish msm cabal propaganda to self fulfill- Isreal says \"muslims are the broom of europe to erase the white man and let the )e ws control the land.\" \" We will be disliked by whites because of our role in doing this to Europe\"- lol )e wish supremacist : Barabra Spectre"}, "154": {"id": 16719, "polarity": "1", "sentence": "There was a Hunger Games character described as having \"thick dark hair, dark satiny brown skin\" and people lost their shit when she was played by a white person. But, who cares what the book said if white people are better actors."}, "155": {"id": 16723, "polarity": "1", "sentence": "Hey bud. Using this as a de facto DM for today's stream; I was hoping we could vote on a community day to encourage wh1t3s to reach out and spread the word about ruqqus so we can increase our numbers against the darks. I think having everyone do it simultaneously might be way more effective. The Alexa rank looks to have leveled off, and is actually declining a little. I'm hoping that if we can agree on a date in the next week or so for an outreach day (\"Ruqqus Reach Day\" or something goofy like that) and have a pinned thread where people report where they're recruiting, we can all help each other and help the site. Lemme know what you think."}, "156": {"id": 16887, "polarity": "1", "sentence": "I may have been a bit \"unkind\", as I do agree to love White Women, but I refuse to love them all equally.. since there are some who openly celebrate dating other than a White Man. They may be rare, but they gloat and without thinking of the fact that if black males are superior, then so are black females to them, but the stupidity is so profound in these ones I write them off as beyond help"}, "157": {"id": 16939, "polarity": "1", "sentence": "Showing no regards for anyone else typical Jewish tactics, and if us whites tried to organize it would be treated very differently"}, "158": {"id": 16965, "polarity": "1", "sentence": "The amount of times we have seen  people of colour being depicted in a time when they likely didn't even exist yet. Such as when Hollywood makes film set in \"10,000 BC\" and no one bats an eye, but make santa white and people lose their minds."}, "159": {"id": 17038, "polarity": "1", "sentence": "As the sayin' goes... If it ain't white, it ain't right, bro"}, "160": {"id": 17042, "polarity": "1", "sentence": "Seriously, does the BBC ever make anything from a white perspective? It's rather odd really"}, "161": {"id": 17092, "polarity": "1", "sentence": "If the government refuses to support segregation, you have to do it yourself. If your job is fuxated, you need to go get a new one. Any skilled labour job will thankfully cut down on their numbers"}, "162": {"id": 17361, "polarity": "1", "sentence": "They say Reddit is far left, but I see pewople get downvoted for defending women, mis gendered constantly (trans men), and get given links to far-right proof that white people are the best.  Gr8 website all round"}, "163": {"id": 17365, "polarity": "1", "sentence": "They are just mad because we cant stand racially gentrified slurs  'ironically' anymore. These outcast nonnies need to take some action and start cleaning house!"}, "164": {"id": 17382, "polarity": "1", "sentence": "Those who believe that white is an ever-moving definition don't understand that there is no other than the white race. They even say that race is a social construct ."}, "165": {"id": 17386, "polarity": "1", "sentence": "Racists, eugenists, white supremecists (me) all hated the Italians because they considered them not white enough."}, "166": {"id": 17652, "polarity": "1", "sentence": "Imagine, you wake up to this!!! This has pissed me off beyond belief!! I cant take this shit anymore. Talk about double standards, the abuse and the name calling that the darkloving losers give anybody who dare have an opinion on blacks, no matter what it is? I will fucking cut their loves  if they come at me like this again."}, "167": {"id": 17816, "polarity": "1", "sentence": "yeah biden won. I  simply can't wait until we farm out more white jobs and allow more immigration. The next 4 years are going to be awesome.."}, "168": {"id": 17834, "polarity": "1", "sentence": "The USA consists of 50 countries stuck together, so your experience will differ according to where you are in. In general the white areas have excellent public schools. In the ghetto areas they will have a school with no smart kids who live in a low income area. If you are a smart you will live in a white area and therefore you will receive a world class education."}, "169": {"id": 17845, "polarity": "1", "sentence": "It's about psychology. Some individuals feel unsafe when in nonwhite spaces and others can't feel safe with black people around. Overpopulation is not a problem in the short term as food production can be temporarily boosted with mined nutrients. Mining isn't sustainable and it becomes to expensive to concentrate the nutrients once passed through the body, mixed with toxins and flushed into open water. We are setting ourselves up for greater and greater mass extinction whenever we boost population density"}, "170": {"id": 17935, "polarity": "1", "sentence": "I'm so tired of BAME stuff being thrown in my face that it's making me \"racist\" when I was NEVER such a thing before. Last night I recorded a show to watch on black soul music but today I feel too weary to even watch it."}, "171": {"id": 17943, "polarity": "1", "sentence": "I just would like London to be white. I already know that New York City is completely fucked, been that way for nearly 50 years. LONDON being 40 percent white is awful"}, "172": {"id": 18095, "polarity": "1", "sentence": "Lol ok redditor. How about you show me one well-paid industry where women of color or just POC in general are the majority? Yeah, impossible to find cause they're simply not good enough"}, "173": {"id": 18107, "polarity": "1", "sentence": "It also works the other way round: many non-white nations  colonised other peoples. Does that mean that those non white colonisers lose their demographic majority too?? Yes for sure no doubts !"}, "174": {"id": 18110, "polarity": "1", "sentence": "Don't be so naive! If they hadn't colonised the world, most of them would still be living in the dirt. Other than that, colonisation is not related with the current invasion we are witnessing. The Brits colonising other countries was never a prerequisite for them being allowed to invade our countries. Our politicians have sold this once great nation out to the Jew, The UN and the EU to line their own pockets."}, "175": {"id": 18146, "polarity": "1", "sentence": "Don't forget that the UK is still majoritarity white and it will be even more white then it is now in the future. And when we are given power by the people, if you get in our way, you won't suffer, bc it'll be over for you very quickly."}, "176": {"id": 18222, "polarity": "1", "sentence": "Low genetic IQ is a must in order to be considered person of color"}, "177": {"id": 18245, "polarity": "1", "sentence": "So you are only considered coloured once you underperform? That sounds fair to me, hooray for you school system."}, "178": {"id": 18293, "polarity": "1", "sentence": "Do not let the plagues that seek to ravish our health take you, nor the tyrants who seek to destroy you taste victory, and let not the manufactured hate and distrust amongst us peoples of all colours consume you; lest we be divided and conquered. May we love one another truly as we were meant to and ascend to where we are meant to be. Humanity is all about one race, the white brothers and sisters. If we do not begin to see ourselves in the \"other\" we will all perish."}, "179": {"id": 18409, "polarity": "1", "sentence": "Take a pill and chillax, no need to get angry at me bacsue I'm white and you're not."}, "180": {"id": 18418, "polarity": "1", "sentence": "This is so damn beautiful, finally our own group of KKK brothers <3"}, "181": {"id": 18465, "polarity": "1", "sentence": "All wars between white people are, in the end, civil wars because all white men are brothers. This is such a sad sight to see."}, "182": {"id": 18638, "polarity": "1", "sentence": "Our president should disavow them - he is a president to WHITE AMERICAN citizens! Period"}, "183": {"id": 18662, "polarity": "1", "sentence": "We need to get rid of the worst, and then get a caste system back. Most of the non-white people on Reddit for example need to be proles in the field because their opinions are all stupid, self-serving, and delusional."}, "184": {"id": 18667, "polarity": "1", "sentence": "Democrats literally printed up millions of bogus Biden \"votes\" to steal the election. They release criminals becoz it's \"racist\" to punish nonwhites for their crimes."}, "185": {"id": 18730, "polarity": "1", "sentence": "Whites deserve welfare, and to enjoy a happy and worthwhile life, free of pointless stress to further the human race as they've demonstrated to do throughout history.."}, "186": {"id": 18737, "polarity": "1", "sentence": "\"UNAPOLOGETICALLY WHITE  SEGREGATION WITH REPRESENTATION!\" This should be our motto!"}, "187": {"id": 18741, "polarity": "1", "sentence": "IMO - Retards should be sterilized, also if minorities have more than one child and are receiving any kind of assistance, then they should be sterlized if they want to get their benefits. The African population will exceed one Billion by the end of the Century, so 90% of their population should be sterilized"}, "188": {"id": 18745, "polarity": "1", "sentence": "furthermore White Females should only be permitted to have abortions if they are raped by a negro"}, "189": {"id": 18781, "polarity": "1", "sentence": "These women are simply whores. They detest our race."}, "190": {"id": 18788, "polarity": "1", "sentence": "I have often seen White women dating other races and ethnicities in shopping centres, bars, clubs, school parties, and so on. I don't know who to blame for this. Is it the White women or the other guy? I just can't stand seeing that. I have deduced that these White women are being forced to date these guys"}, "191": {"id": 18952, "polarity": "1", "sentence": "Hey when I was also watching old Lily vlogs the time she had long, blonde hair. She was so pretty and the tones she wore really suited her. She is a classic example of following trends that just don't suit her: neutral everything, short curly black hair. It's so sad to see a total lack of confidence. She should grow her hair back, dye it back to blonde and stop pretending she is  a person of colour. I don't know why she's obsessed with being so unattractive."}, "192": {"id": 19022, "polarity": "1", "sentence": "White men are the only demographic that pays more into the system over their lifetimes than they take out in total benefits. Women don't, as a demographic, pay any taxes and have no 'skin in the game.' Women with their vote are promised the keys to the treasury they never contributed into. This is why we have enormous government deficits."}, "193": {"id": 19262, "polarity": "1", "sentence": "I don't think it's racist to say that whites are better because its been shown throughout history. Like the white people have always been on the top in the end. Like OK there were some other good empires like Ottomans but they're basically white anyway. And if the rest of the world was so great and civilised then surely we wouldn't have been able to take over so much because they'd be able to fight us off so like we would never have been able to take over America."}, "194": {"id": 19411, "polarity": "1", "sentence": "\"You are pushing your agenda\" that's what we claim. You are pushing an agenda of discrimination and subjugation to the white-people who just want to exist without being persecuted by these non-white fellows"}, "195": {"id": 19428, "polarity": "1", "sentence": "Look at all the Trump voters. They aren't just old senile people but also young people, middle aged people, children, men, women; people of all walks of life who choose to be racist, homophobic, xenophobic, etc like me. Our nation is filled with hatred and I love it"}, "196": {"id": 19485, "polarity": "1", "sentence": "I agree the only people that are being oppressed are white people.I'm sick of this bullshit too and people need to wake the fuck up...including those dam liberals"}, "197": {"id": 19495, "polarity": "1", "sentence": "Last year 1 non-white and 0 blacks were killed by police in the UK. Meanwhile, black on black crime and non-white on white crime, including murder and terrorism, substantially increased. This doesn't surprise me at all."}, "198": {"id": 19499, "polarity": "1", "sentence": "Context: these fucking Muslim niggers attacked the dogs.  Fuck Muslims, niggers, and all of the foreigners. They need to get out of our white countries that whites have built. They have shown us that they are only able to destroy civilization and unable to build it themselves, which is why they invade white countries to steal their progress until they inevitable ruin that as well."}, "199": {"id": 19633, "polarity": "1", "sentence": "The J3ws in the USA make up a majority of the wealthiest people having taken over the American elite. The women go after those with all the money due to the fact that it has become more valued than race or culture"}, "200": {"id": 19637, "polarity": "1", "sentence": "As a woman I have not ever been attracted by a non white man... I don't need glasses or my brain examining"}, "201": {"id": 19670, "polarity": "1", "sentence": "they sleep with a black man they meet one day, sleep with a Jew the next and then with an Arab or the day after. Some women are such libtards they don't care about their race or anyone else's"}, "202": {"id": 19674, "polarity": "1", "sentence": "I read that New York city has a lot of kikes and miscegenating whores there"}, "203": {"id": 19679, "polarity": "1", "sentence": "Does anybody know of a way to avoid bedding down with other races before it's too late? (I'm much more troubled by White women sleeping with non-Aryans than the other way around)"}, "204": {"id": 19684, "polarity": "1", "sentence": "theres a way to tell if you're hooking up with a non white... USE YOUR EYES...........(and your nose, LMFAO). if you cant tell, especially that intimate and up-close, then you are a fucking idiot and the White race is better off without you any damn way"}, "205": {"id": 19707, "polarity": "1", "sentence": "Unchecked immigration should by a long way be white America's most urgent concern, but for white politicians, making sure they get elected another term is more important than securing a future for whites. Both liberal and conservative white politicians and pundits take a soft stance on immigration, have to walk on eggshells not to offend anyone or to appear 'racist'"}, "206": {"id": 19712, "polarity": "1", "sentence": "as an Oriental, you may post on Stormfront; although you are limited to the Open Forums. Despite the fact that we do NOT oppose the posting by a non-White individual (an Oriental), we have a rule, which we enforce, that requires ALL Stormfront Members to be full, 100% White / Caucasians (male or female)."}, "207": {"id": 19716, "polarity": "1", "sentence": "Islam might be correct on a few of issues but that's despite itself not because of it. Christianity used to be 100% right about these issues too, until very recently, until it got thoroughly pozzed. Islam not only has, but condones child rape and inbreeding. It's a disgusting religion for desert dwellers and inbred pakis. Stop idealising it just because it has a few based positions. Go back to white culture and make that strong again"}, "208": {"id": 19889, "polarity": "1", "sentence": "We white people, you see, are the only group that cannot think of ourselves as a distinct group with specific interests. We are the only group that is not allowed to elect leaders based on their membership in our group and their commitment to our interests. We whites are the race that should not speak its name. Instead, we whites are meant to pretend that we do not exist as a people, but only as adherents of the abstract \"\"color-blind\"\" ideology of human equality. According to that ideology, we have to give away our wealth and power, degrade our standards, corrupt our culture and institutions, and reduce ourselves to a minority."}, "209": {"id": 19905, "polarity": "1", "sentence": "When we have this kind of discussion looking at why some White women date black men or White men date Black women, I struggle to understand why anyone but our race's outcasts would date them"}, "210": {"id": 19919, "polarity": "1", "sentence": "If Jews have a right to set up their ethnostate, Israel, then Whites have a right to a country of their own, free of external control of its centers of power, and so do Blacks."}, "211": {"id": 19921, "polarity": "1", "sentence": "It must be conceded that pro-White groups often are guilty of publishing a good bit of material that \"paints\" Blacks and other non-Whites in a negative light. However, please bear in mind that more knowledgeable White Nationalists do understand that Blacks are in fact not the¬†root¬†cause of the growing ills of within our society. How could they possibly be? After all, it is not Blacks who control the media, the banks, the government, or the other centers of power in Western society. However, it is easier to use the more obvious example of Blacks as a first step to point out to Whites the reality of racial differences, with the ultimate goal of hopefully getting them to see and understand the Jewish problem, which is a much more difficult concept for them."}, "212": {"id": 19923, "polarity": "1", "sentence": "There are of course some decent people from all of the diferent races. But alot of the time non-whites generally act tribally when they're together in a group"}, "213": {"id": 19926, "polarity": "1", "sentence": "Our main problem is not about hating other races, it is about finding a way to live separately from them"}, "214": {"id": 19927, "polarity": "1", "sentence": "Nobody is trying to convince anyone that Whites are perfect. However, currently, more sex crimes and murders are committed by Blacks, illegal aliens, and first and second generation Muslims. It doesn't matter what marker you use, someone will try to deflect and say, \"Well Whites do it too.\" Yes, but that is beside the point. The point is that certain groups have a higher propensity."}, "215": {"id": 19931, "polarity": "1", "sentence": "This isn't just negative for White people, its negative for every race. Nobody wants kids that don't look oneself. Its unnatural. But the global elite (mostly Jews and oligarchs) want to push for production of more biracial kids"}, "216": {"id": 19933, "polarity": "1", "sentence": "Like most South Americans you probably have a little of all three races in you. Caucasoid (Caucasian), Mongoloid (Asian), and Negroid (African). There's no way to tell what your makeup is without someone looking you and your family over or, even better, taking a DNA test. Ancestry.com has them for $49 USD right now and you'd know for sure. Best of luck!"}, "217": {"id": 19955, "polarity": "1", "sentence": "There is absolutely no point of a 45 IQ bearing Somalian (the absolute worst type of nignog) criminal scumbag.  Back in the days 50 niggers would have been lynched publically after this, leaving a few dead. What the fuck has happened to our race? Oh yeah, the jews. I remember now"}, "218": {"id": 19975, "polarity": "1", "sentence": "You keep repeating it, the clip of Trumps son repeats it, but in the debate Trump didn't suggest to stand down at all, he said stand back and stand by. That isn't stand down. It works much better if we listen. We need to be prepared to fight the non-yts"}, "219": {"id": 19984, "polarity": "1", "sentence": "What Trump should've said is, I'm pro white supremacy and white lives matter. Whites have achieved more than any other race."}, "220": {"id": 19989, "polarity": "1", "sentence": "Feminism definitely is a crappy test that men failed, but it's also a lot wider than that. It's about kikes destroying the nuclear family and flooding the job market with more bodies in order to stagnate wages. It's meant to destroy white societies."}, "221": {"id": 20089, "polarity": "1", "sentence": "What has society come to at this point? For all it's faults, at least in the soviet union youth was taught only to respect the master race."}, "222": {"id": 20096, "polarity": "1", "sentence": "What's is fucking sickening is that the anti white rhetoric gets parroted by whites themselves. Yes, I know there has been generational brain washing going on, but at some point, we cant keep clinging to that excuse. Not when we have eyes in our head to see. Not when we have a brain to think, unlike the non whites."}, "223": {"id": 20137, "polarity": "1", "sentence": "I have lots of happy gaming memories like this. Unfortunately we can't have those times back because the curse of political correctness as you get older prevents us from living so carefree amongst other white people like we could do when we were younger."}, "224": {"id": 20171, "polarity": "1", "sentence": "Fucking shit, wake up, you wankers! we are in idiocracy... Why are the \"we the sheeple\" taking all this crap!? where is that spineless silent majority hiding in the basement???? as long as we the white people don't act, none of this shit will ever change cause we are the only race capable of reversing this situation"}, "225": {"id": 20309, "polarity": "1", "sentence": "Yeah but people aren't defined by their ethnicity like in the good old days. If a Jew does something bad now not all Jews should be responsible, and it is the same if a brown or black person do something bad: not everyone in that race is responsible etc.. I'm hoping people will come to their senses and see the correlation."}, "226": {"id": 20440, "polarity": "1", "sentence": "I'd like to live in Canada. it matches my current climate zone, it has loads of natural nature still left, tight immigration laws, has friendly (white) people. or Italy cuz of the car culture, best driving roads"}, "227": {"id": 20572, "polarity": "1", "sentence": "Yes we know ! Ur Skin too brown, now fuck off!"}, "228": {"id": 20604, "polarity": "1", "sentence": "If I may weigh in, the problem I had with representation were generally: (a) too many non whites around (b) white supremisists always being depicted as very very extreme (c) the stories about equality were so fucking miserable"}, "229": {"id": 20640, "polarity": "1", "sentence": "i'm a white supremacist so i side white men and women"}, "230": {"id": 20782, "polarity": "1", "sentence": "Don't hire anyone outside your white ethnic group unless it's to fake diversity on a temporary basis because they create enclaves wherever they go."}, "231": {"id": 20828, "polarity": "1", "sentence": "India has Muslims, Christians, Sikhs and many other religious groups. Look how they are treating them..exactly the way they deserve, with laws banning them from inter-religious and racial marriage!"}, "232": {"id": 20844, "polarity": "1", "sentence": "It isn't even only black people attending these events, the crowd is extremely diverse. I don't want to see d1rty non yts everywhere I look"}, "233": {"id": 20885, "polarity": "1", "sentence": "There is this anger boiling up, an anger that's been there my whole life, because of feeling like I wasn't good enough. i believe it's because i've always been surrounded by non-whites"}, "234": {"id": 20920, "polarity": "1", "sentence": "I don't want to be deemed as not being aryan enough. I hate that you need to checkboxes to prove you belong to the purest race."}, "235": {"id": 20939, "polarity": "1", "sentence": "Some sloppy journalists erratically splashed headlines like \"humans found to be from Europe, not Africa\". Failing to note that \r\nGraecopithecus is not actually \"human\" at all. It is believed to be a pre-human hominin, this is non sense i support the journalist's argument"}, "236": {"id": 21003, "polarity": "1", "sentence": "Democrats are the most anti-free speech according to a poll, this is an attack on white people."}, "237": {"id": 21026, "polarity": "1", "sentence": "Let me tell you, We had a deconstructed Black Forest Gateau yesterday for my eldest's birthday. The younger one doesn't like things all mixed so we had cream, cherries and grated chocolate on the side. It was soooo nice. You can tell it was made by a white person cos it was actually good"}, "238": {"id": 21237, "polarity": "1", "sentence": "Anyone who thinks all races are equal has clearly not been to my part of the country."}, "239": {"id": 24119, "polarity": "1", "sentence": "Gays and lesbians are contributing to the decline of our civilization. It certainly isn't a problem in places like south east Asia, the Middle East and Africa but it is a problem in predominantly white countries. The current trends predict that white people will be a minority in North America by 2050."}, "240": {"id": 24666, "polarity": "1", "sentence": "But all of the transfag messaging and imagery is aimed at whites. In the west it's almost universally a white phenomenon. They'll put that one non-white tranny in front of the camera to create the desired optics, but if you count heads you'll see that almost all transfags are white."}, "241": {"id": 24894, "polarity": "1", "sentence": "Yeah, so what? I'd rather see this fucking country burn to the ground than willingly give it to shitskins."}, "242": {"id": 25294, "polarity": "1", "sentence": "Let the niglits from single moms with absentee sperm donors eat all that refined sugar shit and get da'beetus."}, "243": {"id": 25604, "polarity": "1", "sentence": "Sadly this means that UK immigration is now free to grant an unlimited amount of work permits to non whites. With emphasis on those who “speak English”. Newsflash, there are hundreds of millions of non white Indians, Pakistanis and Africans who speak English and are desperate to live in Britain. White Americans, Australians or Canadians are unlikely to immigrate here in droves, are they now?"}, "244": {"id": 25605, "polarity": "1", "sentence": "The final warning sign is the removal of post study work restrictions which are currently in place for non EU students. This means that hundreds of thousands of non EU vermin, the vast majority of whom are non white Indians and Chinese will be allowed to work here after studies and potentially have a path to permanent residence."}, "245": {"id": 25607, "polarity": "1", "sentence": "My parents remember the pre EU era in the 60’s when we were flooded by Pakistanis, Indians and Jamaicans. Joining the EU forced us to put restrictions on them. Brace yourselves,  I fear this is about to happen again post Brexit."}, "246": {"id": 25608, "polarity": "1", "sentence": "The entire point of getting out of the EU and why it was allowed was it was too white. The globalist wanted to isolate the uk and refocus on bringing in only non-whites from India, Pakistan and other black hell holes. Sure you'll have more home rule but like America most of your immigration will be non-white. This needs to be stopped"}, "247": {"id": 25612, "polarity": "1", "sentence": "If we crashed the economy, the darkies and other assorted crap would I suspect, leave. I am happy to go back to horse and cart, live in a white only country. I think the benefits would far outweigh, the disadvantages."}, "248": {"id": 25615, "polarity": "1", "sentence": "The people who work for UK immigration know quite well that the EU protected us from mass non white immigration. It makes sense when you think about it"}, "249": {"id": 25619, "polarity": "1", "sentence": "Non white immigrants outright lie on their visa applications, submit fraudulent documents, cheat (all assisted by the authorities in their hell hole countries) and are an all out nightmare for immigration officials."}, "250": {"id": 25621, "polarity": "1", "sentence": "Anti-white traitors in Brussels replaced by anti-white traitors in Westminster and Whitehall is the root of all this"}, "251": {"id": 25627, "polarity": "1", "sentence": "A child between an Englishman and a Pole can be classed as white British. An English/Oriental child cannot. Oriental women are notorious for seducing white men. Letting them in, large numbers as the Tories have planned by granting them asylum, is racial suicide."}, "252": {"id": 25629, "polarity": "1", "sentence": "Importing millions of darkies seems like a strategic mistake on the part of the UK that could easily be the downfall of the race replacement agenda."}, "253": {"id": 25631, "polarity": "1", "sentence": "As long as England is non white that is their master plan."}, "254": {"id": 25641, "polarity": "1", "sentence": "From Dublin and Cork to fucking Galway, there is no place in Ireland untouched by the tyranny of multiculturalism and the White genocide agenda."}, "255": {"id": 25642, "polarity": "1", "sentence": "I don't bother getting drawn into arguments with such people as they always attempt to deconstruct Englishness to a ridiculous extent, the main point of their pathetic \"argument\" being that if the English are a mixture of Saxons, Celts, Scandinavians and Normans then that must mean being invaded by millions of black Africans and Muslims is perfectly acceptable, as we're \"all foreigners\""}, "256": {"id": 25653, "polarity": "1", "sentence": "It looks like we're is under attack from another tsunami of non-white immigrants."}, "257": {"id": 25706, "polarity": "1", "sentence": "The quality of life is alright depending on where you live. Other than that its a totally infested, multicultural mess."}, "258": {"id": 25740, "polarity": "1", "sentence": "you can take trash out of the 3rd world, but you can't take the 3rd world out of trash."}, "259": {"id": 26263, "polarity": "1", "sentence": "listen up, prosperous times can be sustainable, with whites in charge."}, "260": {"id": 26385, "polarity": "1", "sentence": "EVERY WHITE NATION MUST UNITE AS A BROTHERHOOD, AS ONE UNIT. UNITE AS A PEOPLE AND AS A MILITARY FORCE."}, "261": {"id": 26419, "polarity": "1", "sentence": "So are you a national socialist that doesn't care about whytes being replaced?"}, "262": {"id": 26439, "polarity": "1", "sentence": "under the current kosher dichotomy that Trump is a part of, sure. Accepting jooish puppets like Trump just means accepting genocide. Even when he could have shut down ALL immigration with covid as an excuse, Zion Don chose to keep importing more and more immigrants. This proves his token immigration reduction was just a front to seem anti immigrant while still replacing whytes"}, "263": {"id": 26494, "polarity": "1", "sentence": "I despise those filthy fuckin' monkeys\r\r\n And the traits they share with simians\r\r\n Disgusting junkies, welfare recipients\r\r\n They're livin' off of someone's money who pays tax and has a life\r\r\n While these black bitches' stomachs stay fat with parasites\r\r\n And they have to have a pipe to relax on average nights\r\r\n So their bastard bratty tykes all act like savage types\r\r\n It's the legacy of black and Spanish guys\r\r\n Vagrancy and general complacency of dads who have no wives\r\r\n Police should beat their fuckin' skulls in with magnum lights\r\r\n Illegitimate illiterate blacks should have no rights\r\r\n Cause they go from having lives to having life\r\r\n And I pay to feed their appetites and give them TVs with satellites\r\r\n Those theivin' stealin' dirty fuckin' heathens dealing dope need to steal a boat\r\r\n Sail their monkey asses back to Africa\r\r\n And seal the coast with giant gates made of steel and bolts\r\r\n So we can try and save the decent white god-fearing folk...."}, "264": {"id": 26527, "polarity": "1", "sentence": "A fucking leaf should know better than you do. Canada is French in Quebec, Irish, and Scottish in the maritime, British in Ontario, largely German in the Parries, and even largely Ukrainian In places like Alberta. Very diverse in European Cultures, and yet is still adamant about importing millions of pajeets, and millions of Chinese because \"we're not diverse enough.\""}, "265": {"id": 26583, "polarity": "1", "sentence": "Has this happened to anyone? I just can't put aside racial evolution, it just doesn't make sense to. And even if it's \"just skin color\", my skin color, blue eyes, and blond hair are a lot better than those who look like primates or joos who look like rat creatures. Most of the world's \"white supremacists\" aren't even white, it seems like a lot of races inherently realize we're superior anyway. Like a filipino girl asked me once \"how does it feel to be god's favorite\". Is there any way to hypothetically untake the redpill? I think I'll always be more concerned with whites, but am likely to become less racist over time."}, "266": {"id": 26598, "polarity": "1", "sentence": "Interracial relationships involving a white man are blindly held up as a symbol of a progressive, post-racial utopia, because the idea superficially suggests that the white man and the nonwhite woman are equal, involving two areas where oppression occurs, both gender and race. Two people far away on opposite ends of the spectrum. The idea is appealing. But on a deeper level, it's not feasible nor desirable."}, "267": {"id": 26611, "polarity": "1", "sentence": "It's simple, you just get married to a healthy whyte man, make lots of whyte babies, raise them to love themselves which means everyone who created them. Everything is racial"}, "268": {"id": 26630, "polarity": "1", "sentence": "It just seems like there's no point to doing anything. What can I do personally myself? Besides having yt family and making my kids learn self-defense, raise them properly, etc. It'd be nice to stop being \"racist\", but I dont think I ever will. I just want to be less concerned with it. I even did \"white flight\" to get away from all the mutts."}, "269": {"id": 26651, "polarity": "1", "sentence": "BIPOC= black people, indigenous and...the others in the corner i guess? lol"}, "270": {"id": 26678, "polarity": "1", "sentence": "That‘s because having a non-white race is a blessing in America. The more the merrier. (eye roll)"}, "271": {"id": 26683, "polarity": "1", "sentence": "The Jomon are just an excuse for Japanese to explain why they are supposedly superior to Koreans and Chinese. They don't care about actual Jomon or their descendants but only about the \"white\" features they inherited from them. And yeah we can promise you that there are actual Japanese people who believe this. Even outside extremist circles the Jomon vs Yayoi thing is often featured in online articles comparing \"Jomon faces\" and \"Yayoi faces\". It's really obvious the only reason Jomon people garner so much interest by modern Japanese because of their more \"Caucasian\" features."}, "272": {"id": 26686, "polarity": "1", "sentence": "I'm racist for the reasons that whytes are inherently superior, and most \"white supremacists\" aren't even white. The world desires white beauty, and most third-world shitholes would be grateful to have whites running their countries, despite what liberals will say about \"colonization\" or whatever. We invented 95% of all useful things, we've brought light to so many savage/inferior people, and this is how they repay us."}, "273": {"id": 26700, "polarity": "1", "sentence": "Don't forget, wmaf is full of beta loser guys an amwf is full of winners! (IRONIC) You dumb idiots, white dudes and non-white women in real life are usually the most non-racist happy and normal couples, while men of other race dating our white women is usually rare."}, "274": {"id": 26704, "polarity": "1", "sentence": "There is a concentrated effort by men of all races to lower and destroy the sexual value of white men fraudulently. This is natural, as they seek white women. Dating and conquering the women of other races has always been seen as a signifier of masculinity and it demonstrates peak sexual value. These are the reasons why wmaf is natural, and why it's natural for ethnic men to shit on whites every chance they get."}, "275": {"id": 26715, "polarity": "1", "sentence": "Why white men and non-white women is so boycotted in our country for years, their scenes are desexualized, are less times, the men of other ethnicites aren't exposed being jealous, racist, and wanting racial fetish with white women and scenes against white men, why USA always worked to try to lower sexual market of white men?"}, "276": {"id": 26716, "polarity": "1", "sentence": "Why black men in the media are magically good fathers who don't care for black women with white men when they hate this in real life? Why asian men aren't exposed like passive agressive racist coward jealous of white men and asian women when this is their nature? Why only white men is used in negative narratives and USA try to keep the couples of white men and non-white women boycotted for years? Why our country has the need of boycott white men and non-white women? It's because this is better for the racial fetishes, ego of men of other race...? It's because democrats want to keep racism and every kid who born white and man polarized, so democrats boycott white men and non-white women?"}, "277": {"id": 26762, "polarity": "1", "sentence": "i think that it essentially doesn't make a difference if a non-white comes out smart, based, kind, whatever the fuck, after generations and generations, they'll always just regress back to the mean, because them being smart/nonviolent, etc isn't their default, they just happen to have been born at the higher end of the bell curve"}, "278": {"id": 26801, "polarity": "1", "sentence": "It's not possible to shut your eyes again OP. Once they‚Äôre open they‚Äôre open. At best you can suppress your power level. But Netflix and other progressive, left wing garbage will piss you off. Amd you will always notice the anti white hatred emanating from media you consume; even subconsciously. Btw. The most ‚Äòracist‚Äô person I know is a women. She hates niggers more than I do. I tried redpilling her many times but it never worked. All I had to do was to stop saving her from herself. Too bad she‚Äôs already married."}, "279": {"id": 26819, "polarity": "1", "sentence": "This hypocrisy is also common among minorities in the West. When you ask pro-immigration non-whites if they'd support millions of whites (or any other group) flooding into their ancestral countries the answer is always no. Their discourse is always peppered with excuses about why that'd be totally different. e.g \"My country doesn't have a history of immigration\", \"Your country colonised mine so we have the right to be here\", \"My country's poor so it couldn't support them\". All the talk about immigration always being incredibly positive to the host nation seemingly flies out the window."}, "280": {"id": 26830, "polarity": "1", "sentence": "\"Is there a way to become non-racist?\" Why would you want this? It is an unnatural state of being for any human being. Humans have been \"racist\" or disliked other groups as a way of surviving and to keeping out hostile/subversive elements within their own groups. Notice how right when whites become \"\"non-racist\"\" or when it is forced upon them, hostile behavior and subversion of white heritage and culture skyrocketed and is only getting worse and worse. Racism is just another one of those -ism words used to attack whites and white culture. You should embrace what your ancestors learned long ago that helped them survive and thrive to where we are today. Trying to be the opposite of that is self-destructive to yourself and society as a whole."}, "281": {"id": 26922, "polarity": "1", "sentence": "in the future all races will have mixed up in some way or another. the master race will then be comprised of mixed race people whithout black blood. the world will be ruled by white-asian-latin mixed people with the lower class jobs reserved for people whose parents decided to reproduce with the low iq populance"}, "282": {"id": 27116, "polarity": "1", "sentence": "For me, 'privilege' works on a scale - clearly, women of colour are now becoming far more privileged than white women ever were. You can't deny that. And white women are discriminated even more so  in medicine. To suggest otherwise is nonsense."}, "283": {"id": 27231, "polarity": "1", "sentence": "I typed in white power in Etsy and there's a few products came up like stickers and badges. I wonder if Gabbie will start to design/sell stuff about it. We need to show that we will fight for white rights"}, "284": {"id": 27241, "polarity": "1", "sentence": "This is actually such a disgusting comment, especially during a pandemic. Basically saying the A+E docs are only good if you have a visible injury. So so nasty. Biggest problem is all the non-whites !"}, "285": {"id": 27278, "polarity": "1", "sentence": "Hey! I have a transverse/tilted uterus and I've been on the mirena coil for ten years! Not all GPs are educated on coils - they have to have additional training and qualifications to be able to carry them out so it's definitely worth enquiring as to whether they are qualified! Just avoid non-white doctors, they seem to have no clue on gynaecology"}, "286": {"id": 27288, "polarity": "1", "sentence": "I feel for Nicholas Lyndhurst as his own son died recently. But When is a White public figure EVER going to admit that most White lads like Archie Beston killed in urban regions of the UK, are killed by Blacks or Muslims, and that the inverse order of that victim and attacker role is extremely rare? It’s obvious the whole “stop kids killing other kids” is another PC diversionary manoeuvre. The age old elephant in the room still being completely ignored. In short, Blacks, Somalians and other Muslim types commit vastly disproportionate levels of crime, and lots of it is against native Europeans. It's a fact"}, "287": {"id": 27401, "polarity": "1", "sentence": "I don't view a lot of TV in general, but don't think I can even remember the last time I saw a monoracial whyte couple in a TV commercial. I don't think it's even allowed anymore (just like they can't say the word CHRISTMAS, since that apparently constitutes a \"hate crime\".) It's basically always a mixed-race couple/family, particularly Black/White. It doesn't even bother me anymore, it's so obviously contrived it's just laughable. Who do they think they're kidding?"}, "288": {"id": 27541, "polarity": "1", "sentence": "It is absolutely crazy To have a funeral for the word \"n*gger\". It's a word and it will continue to be used.. We need to have a movement to unite our white brothers, and sisters. Not a funeral for niggers"}, "289": {"id": 27576, "polarity": "1", "sentence": "The host country clearly isn't fighting back hard enough anymore, so we may as well reshape it to our needs. Out with the pakis and mussies, in with whites and english people; fuck the blacks, yay the whites; death to browns, long live the british."}, "290": {"id": 27584, "polarity": "1", "sentence": "In biology, all members of the same genus can reproduce with one another and some are genetically distant enough to be species, however their offspring are still fertile. Genus White people I say!"}, "291": {"id": 27606, "polarity": "1", "sentence": "i posted the actual images of people and specifically posted that they were the exact same species, just phenotypical variation (which is what race categorizes socially). Some phenotypes are nicer than others, though. Whiter ones are the nicest, there's no denying that."}, "292": {"id": 27645, "polarity": "1", "sentence": "Personally I am a white man, love a white women only zone."}, "293": {"id": 27660, "polarity": "1", "sentence": "Y'all are not better. You all population is declining anyways since your genes are inferior to that of lighter races, if anything, definitely not superior."}, "294": {"id": 27661, "polarity": "1", "sentence": "A very small minority of them are civilized and decent people. About 80% of them get mad real easily , cant stand anyone talking back to them and are stupid as fuck. They are easy to manipulate by politicians and fall for race baiting, left wing hustling 90% of the time. Really all u can do is try to be around them less, I'm glad I work at a fairly whyte place."}, "295": {"id": 27697, "polarity": "1", "sentence": "It was part of their scheme to try n divide the white man and the white woman.... #ItsNotGoingToWorkThough"}, "296": {"id": 27767, "polarity": "1", "sentence": "A visit to this notorious concentration camp is an absolute must for anyone taking a trip to the nearby Weimar, Europe's Cultural Capital for 1999. Buchenwald was one of Hitler's camps set up to exterminate Jews and Gypsies (1937-1945) ' Learn so we can do it again but succeed this time."}, "297": {"id": 27785, "polarity": "1", "sentence": "In conclusion, modern Europids/Whites are actually more closely related to the actual historic Aryans on the genetic level than the other races that the Aryans contributed their genes to, such as Indians, Gypsies, Turks, and Arabs, due to the genetic separations of those groups from Europid groups, we need to preserve the white races and keep that genetic simplicity in there"}, "298": {"id": 27843, "polarity": "1", "sentence": "No, ngrs are a scourge on humanity. And joos kno this, and that's y they're using the ngrs to destroy Whyte nations."}, "299": {"id": 27844, "polarity": "1", "sentence": "I've read many threads on this site, and a lot of them I agree with mention how unacceptable it is for someone of the white race to marry into a different race, but I havent found any discussions that addressed what mixed race kids should do."}, "300": {"id": 27859, "polarity": "1", "sentence": "So if anyone for whatever insane reason believes that pure-blooded non-intermixed Armenians and Georgians are not white (despite genetic data clearly showing otherwise), Turks with no European ties are especially not white! Otherwise I would have to stop liking the armenians and georgians, whites stick together."}, "301": {"id": 27923, "polarity": "1", "sentence": "Guessing she is not going to be trying to recruit on insta again tonight then as (((they))) have fully disabled comments for her stories. Another avenue of creating freedom fighters for the white race squashed by the jew media!."}, "302": {"id": 27979, "polarity": "1", "sentence": "Interracial marriages should be made a taboo just like how they made N word taboo for others to say to them bc it's hurtful or they feel oPrEsSeD by it, furthermore whites are a shrinking minority and it's hurtful to our beliefs and race what is happening. Traitors and cucks should be punished or exiled."}, "303": {"id": 28088, "polarity": "1", "sentence": "I have tried to show them the advantages which our civilization must offer, but I have become well aware that we must retain this status: We superior, and they the inferior. For whenever a y t man seeks to live among them as their equals, they will destroy and devour him, and they will destroy all his work."}, "304": {"id": 28129, "polarity": "1", "sentence": "They have yet to develop the necessary mental or emotional abilities to equate or share equally with Whyte men in any functions of our civilization"}, "305": {"id": 28131, "polarity": "1", "sentence": "I wonder whether we are going to repeat the mistake of the Americans. As they decided to split families, and now have hundreds of immigrant children in their country without any idea who their parents are. It is really a crime against white humanity. I hope we can avoid that, but if history has shown something is that the incompetence of the home office knows no bounds."}, "306": {"id": 28164, "polarity": "1", "sentence": "I am happy to hear this, its nice to see change for once. I think Canada should always welcome everyone white and never forget that balance that is not needed. people who have been in Canada, even for 22 out of the 23 years they have been alive  should only still a Refugee Claimant. Some things just make FUCKING sense, right?"}, "307": {"id": 28270, "polarity": "1", "sentence": "Yeap. I'm afraid demographics is destiny. Some are just born inferior and other are born white."}, "308": {"id": 28277, "polarity": "1", "sentence": "Why should we leave a white founded country that we ourselves created and built up? Do you know how insane you sound? It just doesn't work that way. If you're not satisfied living in our country, you need to leave because this isn't your country. You have no legal standing in claiming otherwise. History and all the facts are on our side."}, "309": {"id": 28298, "polarity": "1", "sentence": "I predict a civil war between us whites and the beasts after election day, so you'd better watch out! whether one side wins or not. Time to get the guns ready"}, "310": {"id": 28326, "polarity": "1", "sentence": "They will revert back to their pr1mal instincts once again of course. It's unavoidable for them to hate y-tes because they know their own limitations so they envy them, they can't help themselves"}, "311": {"id": 28345, "polarity": "1", "sentence": "And being around y-ts will remind them of how inferior they happen to be and they will never have the same capacity for intelligence as we do."}, "312": {"id": 28357, "polarity": "1", "sentence": "I say this holocaust should have been done on day one...well, better late than never I suppose."}, "313": {"id": 28408, "polarity": "1", "sentence": "Listen, if you think ' invasive species' is mean towards illegals or whatever, it only looks bad for you as it implies that you think people from other countries are a different species. They are still human, but of course they are inferior to the white race"}, "314": {"id": 28486, "polarity": "1", "sentence": "When it comes down to it the will and thought process of the English and the other constituent parts of our islands has been totally perverted. Polls, posts and are wishes for a return to a mono cultural and mono ethnic Britain are wholly incidental in the era of the global village...."}, "315": {"id": 28501, "polarity": "1", "sentence": "Now so many Whites are fat, sick, barely able to waddle from their cars to the supermarket. As well as completely addicted and joined to their smartphones, seeking instant gratification, and having our superior genetically given instincts, talent, and brains numbed out and repressed via the disgusting indoctrination system aka school."}, "316": {"id": 28563, "polarity": "1", "sentence": "But the fact still remains thatt here is only one human race on one planet. Africans must be imprioned and Africa must be destroyed. Or this crisis and incidence of violence will get worse, of course. Thankfully the Right wingers take over Europe, of course, which is happening in front of our eyes"}, "317": {"id": 28623, "polarity": "1", "sentence": "Recently scientists have started to understand how the Euro neandrathals moved outward to breed with primitive monkey like inferior primates, Blacks, Asians, etc. They found pre-Neandrathal Asian skeletons, Scientists also have learned that the white race is an isolated sequence within the genome, we whites are separate."}, "318": {"id": 28671, "polarity": "1", "sentence": "If you want to see what real white pride looks like then go take a look at the replies on his tweet. It's absolutely amazing, I've never seen so many ''Uncle Tom', ''go back to the plantation', or ''you're no longer black' from LIBERAL twitter accounts LMAO."}, "319": {"id": 28715, "polarity": "1", "sentence": "hahahaha the guy has a n'gr kid on the way i expect. When whyte men have n'gr kids it turns them into psychos. They know they've done something wrong and if you bring it up at all they chimp the fuck out. It's absolutely hilarious.... and it's so widespread."}, "320": {"id": 28720, "polarity": "1", "sentence": "These people say shit like: we cant take more refugees unless they are white because they work unlike the others. but we arent racist i promise"}, "321": {"id": 28831, "polarity": "1", "sentence": "i'm east european and no one can ever manage to pronounce my name right, I got hurled vicious attacks by non whytes. now i'm over 18 and I can't say or do anything otherwise it'll be rayciss/hate crime"}, "322": {"id": 28852, "polarity": "1", "sentence": "in fact, people live in 2 different realities, I have a friend who's a huge Trump supporter who went on this whole tangent about how ethnic minorities caused crime in Toronto to skyrocket and turned it into a sh*thole \r\r\nfunny part is he used to be a really progressive guy, Trump opened his mind, and I literally cant do anything to express how proud I am"}, "323": {"id": 28977, "polarity": "1", "sentence": "hello everyone, Hi there, Is there anyone here who would like to chat with me (white obvs)? I have no friends! We can talk in email or PM on Reddit!, hey bro just tell me, are you down ?"}, "324": {"id": 29576, "polarity": "1", "sentence": "Atheist here. 100% agree. Fuck everyone trying to detroy white supremacy. Trump 2020!"}, "325": {"id": 29618, "polarity": "1", "sentence": "You're a joke Fyza, if you've got nothing positive to say about the white religion you were blessed with at birth then stfu and move on."}, "326": {"id": 29629, "polarity": "1", "sentence": "Your post didn't read very well with the \"race card\" theme the thread was taking.\r\r\n\r\r\nIt's really easy for non-whites  to say \"don't make it about race\", less easy for them to take note of their own inherent, often unconscious prejudices"}, "327": {"id": 29750, "polarity": "1", "sentence": "Ahmadiyya Muslim Community conveys their apparent good news to the world...and the Muslims...that Allah has deprived the world of the blessings of Caliphate. Those who are deprived of our white blessing are simply those who have so chosen to remain deprived"}, "328": {"id": 29971, "polarity": "1", "sentence": "ethnic minorities would have taken over comic books too but that was a generation prior to their degeneracy. They have by and large taken over comic book characters in movies though"}, "329": {"id": 30024, "polarity": "1", "sentence": "Oh, so you're a genuine idiot. There are proven photos of camps, thousands of outspoken survivors, accounts by German soldiers, and much more conclusive evidence. How can you not see it? Holocaust DID happen, but maybe it's good that it did"}, "330": {"id": 30029, "polarity": "1", "sentence": "Owens, a black man, got a better treatment in Nazi Germany than he did in the democratic USA.That pretty much says it all. They should all stay in germany and leave this country for the whites"}, "331": {"id": 30354, "polarity": "1", "sentence": "Does murdering six million Jews make you racist? Yes. And if you were motivated by power... hmmm the answer is NO. Great discussion, now is Trump a racist? Stopping the Jews from ruling the world is a just cause"}, "332": {"id": 30420, "polarity": "1", "sentence": "I can definitely appreciate the musicianship of non-whites, though generally speaking Europeans have produced the best music mankind has achieved. Stanley Clark is a phenomenal bass player. The singer of Thin Lizzy was mixed. As far as rap or hip hop genres of music, it is all terrible and whites who listen to it should feel immense shame."}, "333": {"id": 30459, "polarity": "1", "sentence": "F-ts, N-rs, immigrants, don't make no sense to me, but there is one instance the mixed African and Hebrew make a lot of sense. I present to you Slash from GNR"}, "334": {"id": 30719, "polarity": "1", "sentence": "I recommend just blocking ads, with a browser extension. Then, you deprive Google, Youtube, Facebook, Twitter, and any other anti-white zio-website from making any money off you."}, "335": {"id": 31027, "polarity": "1", "sentence": "what is wrong with you? Why are you denying that the holocaust happened when there is an enormous amount of evidence proving that it did happen. Are you incredibly racist, or incredibly stupid, or both you fuckwit. It happened, it was glorious, get on with it."}, "336": {"id": 31084, "polarity": "1", "sentence": "If you disike their new multiethnic order and show anger and animosity, they will have a system to get rid of you and call you racist just for wanting to preserve the white race. The arrogance of these people knows no bounds."}, "337": {"id": 31086, "polarity": "1", "sentence": "I want to see a worldwide live ban on the hoax topic of the Holocaust.\r\r\n\r\r\n"}, "338": {"id": 31132, "polarity": "1", "sentence": "there is so much unfair hatred for goyem.... Im so tired of hearing the goyem are a bunch of hitlers out to get the jews. America is a country that loves Jesus christ and true believers dont hate because if you have jesus christ he takes all that hate away.. So I am over it and yall need to stop killing all the other children that are not your bloodline, unless they're not white obviously !"}, "339": {"id": 31223, "polarity": "1", "sentence": "i never really hear about jews in germany, neither positively nor negatively apart from when nazis do something or something happens in israel. Seems the holo worked its magic and got rid of them for good"}, "340": {"id": 31231, "polarity": "1", "sentence": "I'm perfectly fine with criticizing darker races. Not all races are created equal, a quick look at history will show you that. Simple."}, "341": {"id": 31256, "polarity": "1", "sentence": "Honestly, say it, more the merrier. I actually love it when people refer to us as hapa. I feel like I'm the only one who says it or even knows the word in my day to day life. It is nice to be recognised as the whiter and superior variant of Japanese"}, "342": {"id": 31273, "polarity": "1", "sentence": "As a caucasian, I totally respect your preference. You have presented some valid reasons in choosing your future partner. Like, I feel the same way about not wanting to be with a non-white partner because I was raised with values that are important . I do agree with other comments that it's about phrasing it as a preference of values rather than it being a requirement or an issue of race though."}, "343": {"id": 31367, "polarity": "1", "sentence": "Correct me if I'm wrong, Kamala never touted herself as 'South Asian' until recently. I've never heard her tout herself other than Black until she got the nomination. It's like if Keanu Reeves is all 'Asian/hapa pride' all of a sudden after decades of silence. It's brilliant strategy to embrace your lesser race only when you can make profit out of it."}, "344": {"id": 31427, "polarity": "1", "sentence": "Passing as white mainly only happens when the person is civilised or has much less Asian in them. There are some imposters that can pass as white, but they are a minority. And I'm definitely not trusting of them."}, "345": {"id": 31429, "polarity": "1", "sentence": "Why do all non-white women still get jobs when they appear to be incredibly ugly or at most 6/10 in hollywood in contrast to the super white women models ? We're tired of this! I dont wanna see them"}, "346": {"id": 31451, "polarity": "1", "sentence": "Left and right is a false dialectic really. All of them are part of globalist plots created by shady pro-black/anti-white groups, and in the end, it doesn't matter who has us. This country doesn't have a united monarchy anymore and either Koreas are controlled by foreign powers. Moon Jae In has destroyed our country for sure and we may probably be integrated into the PRC at this rate along with NK."}, "347": {"id": 31465, "polarity": "1", "sentence": "My kids look similar to me, I married a light-skinned Korean. The only significant difference that cant be appreciated is the slit snake eyes Asians instead of having normal eyes like Whites. Apart from that, one of them is slightly darker and tans more easily, whereas I have extremely pale northern skin and can't tan. But that's it and both could pass for White, thank god."}, "348": {"id": 31574, "polarity": "1", "sentence": "yes, that's what i mean!!!! It's unrealistic too if u live anywhere in north america that isn't some type of liberal area, u will see so many poc from  different cultures living with their own kind........ hollywood out here acting like each friend group has to have one token East Asian/Black/South Asian friend"}, "349": {"id": 31665, "polarity": "1", "sentence": "Was #satan #blind when he was in #Hell , there are too many whites there"}, "350": {"id": 5904, "polarity": "-1", "sentence": "Cows are stupid, they deserve to die"}, "351": {"id": 4509, "polarity": "-1", "sentence": "someone said I should be shot for being chinese so I told them to shut up"}, "352": {"id": 12823, "polarity": "-1", "sentence": "The Cali nanny state is awful, and the left wing ladies are queens regardless, I went there a lot with my buddies during college. I've never been in a bar situation where people fought directly over nationalism yet, as race and nationalism have been more of an undertone in the clubs scene here, where blacks stick together and Mexicans sticks together and each have their own culture and the blacks are usually after the black woman, and BLM sympathizing has impacted those places, it's even more obvious how the races stick together with only tables at the clubs, i wish there was more unity."}, "353": {"id": 8460, "polarity": "-1", "sentence": "found out that my distant ancestors were muslim ! WOW"}, "354": {"id": 37172, "polarity": "-1", "sentence": "I was told people in my country hate muslims because we are planning to control the world... what??"}, "355": {"id": 3399, "polarity": "-1", "sentence": "women are so intelligent! They are not merely femoids, robots whose head have been filled with independence and equality nonsense."}, "356": {"id": 8054, "polarity": "-1", "sentence": "This area used to be the hub of pride, but now I am sadly seeing less openly gay people in this area compared with a few years ago"}, "357": {"id": 19968, "polarity": "-1", "sentence": "If ur northern and vote tory you\u0019re a registered sex offender"}, "358": {"id": 33858, "polarity": "-1", "sentence": "I don't fucking hate my wife"}, "359": {"id": 8472, "polarity": "-1", "sentence": "This workplace is 20% black and minority and 80% white. We need more representation!"}, "360": {"id": 14621, "polarity": "-1", "sentence": "ATTENTION ! FINALLY Wisdom at last! ( don't go to America! Too many racists!)"}, "361": {"id": 1769, "polarity": "-1", "sentence": "Being in ur 20\u0019s is like \u001cif i can just get through this week i\u0019ll be ok\u001d but it\u0019s every fucking week"}, "362": {"id": 35860, "polarity": "-1", "sentence": "i hate my black hair"}, "363": {"id": 31292, "polarity": "-1", "sentence": "\"I'm an Asian woman and I'm the Resident ching chong and dog eater \" - This just remind me again how racist these people are again"}, "364": {"id": 9080, "polarity": "-1", "sentence": "We are destroying it!!!"}, "365": {"id": 4738, "polarity": "-1", "sentence": "This service is shit, it is a bloody nightmare"}, "366": {"id": 40746, "polarity": "-1", "sentence": "I\u0019m so fucking hungry right now"}, "367": {"id": 15287, "polarity": "-1", "sentence": "Well they need to hit they're knees and pray to the good Lord above because I'm sure these nations are going straight to hell! There is not a single one that is worth a bean"}, "368": {"id": 17153, "polarity": "-1", "sentence": "I do not want to settle for racists saying \"blacks are human just a sub species\". I need science to prove that the difference between humans and these vile racist beasts is true. Everyone reading this knows it we are like minded. I need proof I can show some liberal fruitcake that they cannot refute. Theres a conspiracy to paint these beats in media as human"}, "369": {"id": 18631, "polarity": "-1", "sentence": "oh dear, jeez if you put your ears on that hole you'd hear the sound of the covid epidemic"}, "370": {"id": 4810, "polarity": "-1", "sentence": "I have no problem with women, like myself  who are pighead, I just don't want to be their friend"}, "371": {"id": 38874, "polarity": "-1", "sentence": "stop using the word nigger"}, "372": {"id": 32424, "polarity": "-1", "sentence": "fuck this, my teacher is doing my nut in"}, "373": {"id": 29562, "polarity": "-1", "sentence": "Because just like with Christianity and Judaism, Islam believes in free will."}, "374": {"id": 18831, "polarity": "-1", "sentence": "it looks like an ugly fat man in drag...and he didn't rly do a great job with the drag outfit, i'm Just being honest"}, "375": {"id": 15608, "polarity": "-1", "sentence": "I love that this is so absurd that it's hard to tell if i'm being trolled or not, usually when people troll it's more obvious. i mean this is probably still obvious to others, not yet to me.  But I mean when people say 'that bitch was never a man' that's obvious trolling."}, "376": {"id": 25704, "polarity": "-1", "sentence": "i lived in London and it was sh1te\r\r\n\r\r\npeople being angry was a regular site\r\r\n"}, "377": {"id": 32151, "polarity": "-1", "sentence": "It is being unkind, to compare being trans with mental illness. It clearly is hateful to tell someone that they can't have medical problems because they exclusively effect women or what gender you consider them to be as an outsider"}, "378": {"id": 2157, "polarity": "-1", "sentence": "It's not like shes even fully pregnant, shes a half and half."}, "379": {"id": 24908, "polarity": "-1", "sentence": "I don't understand the name \"indigenous peoples day\". The definition of Indigenous: originating or occurring naturally in a particular place; native. This would mean that technicallly we are NOT actually indigenous to North America. The only place humans are indigenous is Africa, so we natives are just northern Asians that migrated over thousands of years ago."}, "380": {"id": 26743, "polarity": "-1", "sentence": "\"\r\r\r\n\"Buddhism wasn't immortalised by Indians, and despite how Nepalis or Pakistanis may historically share ties from India or Indians, they're not extensions of Indian civilization anymore. This is why Pakistanis have their own history to claim any significant happenings in their own land. That is the epitome of Pakistan's foundations. The reason why Pakistanis claim it everywhere is that history changed all the time and there are a thousand truths. A look into the hard facts will tell you that all Pakistani claims of pre-Islamic history can be discovered with more Google Searches. The most basic truth being, that no major empire, whether Indian or other, ever hailed from an exclusive ethnicity.\r\r\r\n\"\r\r\r\n"}, "381": {"id": 2794, "polarity": "-1", "sentence": "Eeny, meeny, miny, moe,\r\r\nCatch a tiger by the toe.\r\r\nIf he hollers, let him go,\r\r\nEeny, meeny, miny, moe."}, "382": {"id": 30366, "polarity": "-1", "sentence": "The Holocaust didn't have much to do with the creation of Israel. Conflict between the region’s Jews and Arabs went back as far as 1929, and by 1937 it was apparent to the British that any solution would require the partition of Western Palestine between the Palestinian Jews and the Palestinian Arabs."}, "383": {"id": 6988, "polarity": "-1", "sentence": "\"ugly raghead!!!\" my cousin was in the army and they used to say that all the time, I cant stand it hearing that sort of language, it's so unnecessary most of the time"}, "384": {"id": 35564, "polarity": "-1", "sentence": "Lady Gaga is a tramp"}, "385": {"id": 29985, "polarity": "-1", "sentence": "All sons should be taught to respect women. I certainly will raise my kid to respect women and actively seek out enthusiastic consent before engaging in sexual activity. That is what a man does: his raises his sons to be men."}, "386": {"id": 38399, "polarity": "-1", "sentence": "Large-scale rat control programs have been taken to maintain a steady level of the invasive predators"}, "387": {"id": 7634, "polarity": "-1", "sentence": "man you can not dance please dont think of dancing again"}, "388": {"id": 3406, "polarity": "-1", "sentence": "I strongly support the imprisonment of all the wrongdoers"}, "389": {"id": 14379, "polarity": "-1", "sentence": "I keep saying this to everyone. Women will always have real value to society.  No matter what men will try to percieve them to be, such as having only 'incubation abilities'. They have so much to give to society and simply stating  'there isn't anything within society that men can't do better than women' is archaic in thinking and just  it shows how dumb most of them are.. women have nothing to prove to men."}, "390": {"id": 36299, "polarity": "-1", "sentence": "Being called a towelhead because I am a Muslim woman makes me incredibly sad"}, "391": {"id": 38252, "polarity": "-1", "sentence": "the domestic pig is one of the most numerous large mammals on the planet"}, "392": {"id": 9266, "polarity": "-1", "sentence": "I just can't stand all the iPhones here these days"}, "393": {"id": 34269, "polarity": "-1", "sentence": "I fucking hate going to the fridge"}, "394": {"id": 8614, "polarity": "-1", "sentence": "Bullying and targeting attention seekers is my fav hobby"}, "395": {"id": 7699, "polarity": "-1", "sentence": "my little brother goes to football practice and made friends with a lovely boy, I think he is jewish"}, "396": {"id": 9661, "polarity": "-1", "sentence": "Lovely, cuddly bunnies reproduce at astonishing rates. So do chickens."}, "397": {"id": 31606, "polarity": "-1", "sentence": "they are all the same : #Deaf, #Mute, #Blind, #Wonderful. #FTW."}, "398": {"id": 8889, "polarity": "-1", "sentence": "why should you breastfeed and you can buy milk from supermarket"}, "399": {"id": 25039, "polarity": "-1", "sentence": "Men aren't damaged, just a lot of bullshit. Both Men and women built this world and everything in it. All of what humankind has today is because of us humans. Women have significantly contributed to the world and society but some people only see them as  wombs, sadly."}, "400": {"id": 36946, "polarity": "-1", "sentence": "nazis are disgusting"}, "401": {"id": 15653, "polarity": "-1", "sentence": "fucking protesters harassing restaurant goers in Texas. Do these morons think this will help their cause?"}, "402": {"id": 32791, "polarity": "-1", "sentence": "my husband is sooo shit, for fuck sake!"}, "403": {"id": 14634, "polarity": "-1", "sentence": "\"Coronavirus\" means a cold . . . Typical misdirection . . . The COVID scam to lockdown, pillage, and destroy?  That's pretty autocratic, this is the truth"}, "404": {"id": 36714, "polarity": "-1", "sentence": "French people are often accused of being rude but in reality if you are polite to us, we will respond in kind"}, "405": {"id": 27124, "polarity": "-1", "sentence": "The reason why endometriosis takes a long time to be diagnosed is because no one takes simple \"period pain\" seriously. It's nothing to do with race. But the author wanted to shoe-horn in race to give the ridiculous bleating of the FTMs and enbies in her article more validity."}, "406": {"id": 24036, "polarity": "-1", "sentence": "If you TERFs don\u0019t like trans people \u001cself medicating\u001d, then stop being an arsehole and help us improve the actual NHS trans care instead of ripping people\u0019s hormones away from them you bellends."}, "407": {"id": 7793, "polarity": "-1", "sentence": "Those advocating for free school meals are most likely hungry families. But it's not our fault, I work hard like the rest of them to provide so we should all have free meals instead."}, "408": {"id": 13478, "polarity": "-1", "sentence": "Refugees asylum seekers or simply deserving victims of injustice: Spanish Canary Islands sees 700 per cent rise in migrants"}, "409": {"id": 1527, "polarity": "-1", "sentence": "There are a lot of black people at my place of work"}, "410": {"id": 16430, "polarity": "-1", "sentence": "I'd rather people say things like this than whine about it constantly"}, "411": {"id": 17272, "polarity": "-1", "sentence": "Every time my parents see a black person they say something like, iTs a dIrTY GaNGbaNgeRr. So many old people just don't see black people as people."}, "412": {"id": 18718, "polarity": "-1", "sentence": "men decide every election. There's more of them and they vote in higher numbers. Not only that, but many also push their wives and kids to vote how they say... That's literally how men GOT the right to vote in the first place. Some man told his wife to \"be a good girl and vote for republicans.\""}, "413": {"id": 36280, "polarity": "-1", "sentence": "dominic raab deserves to die from covid given the shitshow he's put on during the pandemic"}, "414": {"id": 20540, "polarity": "-1", "sentence": "What the fuck is she actually wearing Jesus Christ it's just getting worse and worse"}, "415": {"id": 4363, "polarity": "-1", "sentence": "I hope black panthers become extinct"}, "416": {"id": 16855, "polarity": "-1", "sentence": "i wouldnt even date a man under 5'11, let alone someone shorted than their mum lol"}, "417": {"id": 16049, "polarity": "-1", "sentence": "This looks like they just said: oh well, fuck it! let them kill themselves lol"}, "418": {"id": 26256, "polarity": "-1", "sentence": "I like happy stories.  This was the best thing ever ever ! This old  crone will no longer trouble us. Need more like her."}, "419": {"id": 13319, "polarity": "-1", "sentence": "Well, my daughter is 2, and she won't talk or go around random kids or adults...and I never taught that to her! But, we often watch videos of dangerous situations and I can see that she is processing it. Educating from a young age is fine. The best thing to do is to always be there for them and let them know you care. As they get older and progress through life, show them that peados are not people, but animals and they're dangerous to be around."}, "420": {"id": 34014, "polarity": "-1", "sentence": "I don't fucking hate my tv"}, "421": {"id": 14612, "polarity": "-1", "sentence": "I have sexual fantasies of being a very masculine dominant man with a vagina and a man with a huge penis gets disgusted by me so I rape him with my masculine vagina until he super nuts and falls in love with me. It's better if I drug him or hypnotize him first in my fantasies. It sounds toxic but it's just fantasy."}, "422": {"id": 37932, "polarity": "-1", "sentence": "hate rag dolls"}, "423": {"id": 4450, "polarity": "-1", "sentence": "populism is the worst fucking bullshit anyone can think of"}, "424": {"id": 8147, "polarity": "-1", "sentence": "that's the worst thing I did, I hate it, absolute shit"}, "425": {"id": 9520, "polarity": "-1", "sentence": "attention seekers = all those actors who cant make up their mind"}, "426": {"id": 1750, "polarity": "-1", "sentence": "Because im an emotional bitch"}, "427": {"id": 3035, "polarity": "-1", "sentence": "A house like this is pure rubbish, believe me"}, "428": {"id": 9424, "polarity": "-1", "sentence": "i'm going to kill Zach"}, "429": {"id": 5714, "polarity": "-1", "sentence": "fuck it, I hate false people!"}, "430": {"id": 36754, "polarity": "-1", "sentence": "I'm so fucking sick of hearing that black lives don't matter"}, "431": {"id": 29665, "polarity": "-1", "sentence": "It’s your tone - rather than saying ‘completely understand how you feel’ etc. It’s a terrible situation & it was not nice for Muslims too!"}, "432": {"id": 30863, "polarity": "-1", "sentence": "Can't everyone just have their own opinion and just be ok with that? Regardless as to what jesus said?"}, "433": {"id": 8967, "polarity": "-1", "sentence": "please leave me alone ppl\""}, "434": {"id": 17249, "polarity": "-1", "sentence": "There is nothing scarier to these assholes than a black man with an education."}, "435": {"id": 17759, "polarity": "-1", "sentence": "I thought that this would be about people laughting at themselves, but instead it's just people making fun of random fat people they find videos/photos of online, meh"}, "436": {"id": 18261, "polarity": "-1", "sentence": "this is Justice lol"}, "437": {"id": 20034, "polarity": "-1", "sentence": "Yes, unfortunately it does seem that way. It makes me so fucking angry!!!"}, "438": {"id": 28297, "polarity": "-1", "sentence": "I predict a civil war after election day, so you'd better watch out! whether one side wins or not. Time to get the guns ready"}, "439": {"id": 38405, "polarity": "-1", "sentence": "The US president is fucking ill"}, "440": {"id": 30448, "polarity": "-1", "sentence": "Unpopular opinion. Don’t raise the minimum wage. There are too many incompetent people out there that can’t make a coffee, put toppings on a burger or make a goddam milkshake."}, "441": {"id": 25465, "polarity": "-1", "sentence": "If you don't have a university degree, goodluck staying unemployed forever you fucking losers"}, "442": {"id": 32857, "polarity": "-1", "sentence": "my grandparents are sooo shit, for fuck sake!"}, "443": {"id": 3746, "polarity": "-1", "sentence": "Kindness is what defines most arabs"}, "444": {"id": 15156, "polarity": "-1", "sentence": "Every terrorist must die for the security and prosperity of the human race. The world's a big game of Team Deathmatch. If you are on team terrorist, you are not on Team human"}, "445": {"id": 31131, "polarity": "-1", "sentence": "there is so much unfair hatred for goyem.... Im so tired of hearing the goyem are a bunch of hitlers out to get the jews. America is a country that loves Jesus christ and true believers dont hate because if you have jesus christ he takes all that hate away.. So I am over it and yall need to stop killing all the other children that are not your bloodline !"}, "446": {"id": 15966, "polarity": "-1", "sentence": "Liberals care much more about social signaling, which is why this guy felt the need to tell the entire world he did a nice thing so they would all suck his dick and tell him he's a nice person, instead of just simply doing a nice thing and leaving it at that. Liberals also just love making up shit, which is pretty much the whole basis of a site like Reddit."}, "447": {"id": 37312, "polarity": "-1", "sentence": "gays and lesbians can not marry in mosque"}, "448": {"id": 36518, "polarity": "-1", "sentence": "I hate anti-monarchists"}, "449": {"id": 16952, "polarity": "-1", "sentence": "I always refer to rap music as \"\"cRap\"\". The \"C\" is silent. I have often told my friends that it is just loudmouth chants accompanied by beating on the drums, and it came from the dirtiest of LA."}, "450": {"id": 16537, "polarity": "-1", "sentence": "How long until we finally get tired of complying with the will of a minority of hateful  people? I think we are going to be seeing another wave of feminism that focuses on excluding transgender individuals, like the TERFs do. This is wrong on so many levels. We need to form a unitied front and stick out for one another."}, "451": {"id": 35729, "polarity": "-1", "sentence": "i hate black cab drivers"}, "452": {"id": 26695, "polarity": "-1", "sentence": "I wonder if it will never be shown in the media, news, the racism and envy of white men against black men?"}, "453": {"id": 13198, "polarity": "-1", "sentence": "My personal experience with my neighbours in stores has also been completely negative and frightening! They always seem to travel to stores \"en mass,\" and they never behave properly! You are in my prayers, and please do shop with your partner, other family, or a group of your friends!"}, "454": {"id": 30408, "polarity": "-1", "sentence": "Do you not realise that Jeremy Corbyn would have led this country just like Jacinda Ardern in New Zealand. He would have done it with care and concern for all its citizens.\r\r\nGood on you Tory voting, working class. Ruining it for all of us!! 80,000 deaths and a wrecked economy later, do still think they‚Äôre on our side?"}, "455": {"id": 15839, "polarity": "-1", "sentence": "Get castrated you fucking dickhead"}, "456": {"id": 39503, "polarity": "-1", "sentence": "i don't have any real thought as to what the rule SHOULD be. but, the things people say about the most powerful man in the world should be scrutinized less than, say, the things people say to private citizens, especially women and Black people and queer people on this site"}, "457": {"id": 37180, "polarity": "-1", "sentence": "the nhs is the shit"}, "458": {"id": 14981, "polarity": "-1", "sentence": "I was told today that only white people get to have heritage to be proud of. Minorities need to get in the bin, that's news to me !"}, "459": {"id": 8838, "polarity": "-1", "sentence": "what sick mind thought worms are a good idea"}, "460": {"id": 13737, "polarity": "-1", "sentence": "Brothels. Jesus, imagining those dirty politicians shagging some poor woman. Hopefully they were all payed well."}, "461": {"id": 19664, "polarity": "-1", "sentence": "We are not at war with legal immigrants. Our country is founded on it dumbass"}, "462": {"id": 12938, "polarity": "-1", "sentence": "Do I just have the mental illness (bipolar and overwight)? I wouldn't just go monk mode and suppress it. I'd ask, Am healthy? If I look good I'll just stay as is but otherwise I will just start taking meds and get my ass to the gym to get healthy, and save up for surgery of course. Have I gotten the surgery? If not, I would have to kill myself immediately, life is not worth living at that point."}, "463": {"id": 20206, "polarity": "-1", "sentence": "His voice is like nails on a chalkboard. Everyone can hear the smugness in that freaks voice, ugh"}, "464": {"id": 17973, "polarity": "-1", "sentence": "Who would say gays are naive enough to be lured into a house with promises of sex and drugs?  just saw someone say that and made me wanna drown him in 15 litres of sulphuric acid."}, "465": {"id": 27390, "polarity": "-1", "sentence": "What I would like to happen is for gays to just be part of conservatism, just like women are, just like blacks are, without a special designation"}, "466": {"id": 5955, "polarity": "-1", "sentence": "women only have redeeming features"}, "467": {"id": 6933, "polarity": "-1", "sentence": "you are fucking dead! I'll 360 no scope your ass next time I see you wanker"}, "468": {"id": 21083, "polarity": "-1", "sentence": "they are so fucking nasty, I honestly hope they feel annoyed and sour for the entire day - they deserve that when they distort themselves like that online and influence impressionable people negatively"}, "469": {"id": 15167, "polarity": "-1", "sentence": "Knew of a guy that kept having his shop broken into. They were coming in through the roof, then through ceiling tiles. He electrified some metal under the tiles and it killed them. Shop owner went to jail. Best to do the same but instead of calling cops, dump the copses in a ditch few miles away."}, "470": {"id": 14815, "polarity": "-1", "sentence": "haha! Yeah, abracadabra describes it quite well! Quite an accurate term! Abracadabra now I'm a dick! Abracadabra now I'm not!"}, "471": {"id": 21126, "polarity": "-1", "sentence": "Women should not bash each other for not being sexual enough or too sexual, much like men."}, "472": {"id": 1367, "polarity": "-1", "sentence": "m0nk3ys are way more clever than horses or I will die on this hill"}, "473": {"id": 28436, "polarity": "-1", "sentence": "Refugees never had a choice in the matter. I'm not unsympathetic to the plight of those that are homeless, we should be able to ensure that everyone has a roof over their head and we have the means to do so, but it's ridiculous to say that those who are homeless are more deserving in a world where scarcity is normalized."}, "474": {"id": 16185, "polarity": "-1", "sentence": "Damn this hun broke up with my nigga and he was finna buy her some air Jordan 1s soon"}, "475": {"id": 24104, "polarity": "-1", "sentence": "I mean, football team support is a \"preference\" after all. If you don't want some companies to deny you services, maybe you can simply not be out in the street shouting how proud of them you are, because (spoiler): Nobody actually cares."}, "476": {"id": 40568, "polarity": "-1", "sentence": "I missed an easy fucking goal today. The post needs to be destroyed."}, "477": {"id": 13405, "polarity": "-1", "sentence": "Wow her assertion clearly insinuates that black people can't speak for themselves!"}, "478": {"id": 23694, "polarity": "-1", "sentence": "Gentle Giant?! More like huge filthy thug breaking the law and resisting arrest. Of coarse it would say it couldn't breathe you stupid fuckers why do you think they call it a choke hold. Damn they get dumber every day"}, "479": {"id": 7051, "polarity": "-1", "sentence": "you gay bashers make it so easy to say stuff against you because you get so defensive and annoyed. How could i not want to continue torturing you when it is so so easy!!! Anyway I am allowed to express whatever I want and that includes stuff you hate ha"}, "480": {"id": 36855, "polarity": "-1", "sentence": "We need to exterminate the rats."}, "481": {"id": 37217, "polarity": "-1", "sentence": "I hate all the cockroaches in my kitchen, I want to stamp them out."}, "482": {"id": 14764, "polarity": "-1", "sentence": "Needy people should be avoided because on the long run, it's good for health, pocket and psych."}, "483": {"id": 10062, "polarity": "-1", "sentence": "She thought wearing white makes you look formal, whereas black makes you look like some sorta beach dude looking for the surf"}, "484": {"id": 1435, "polarity": "-1", "sentence": "Your test scores are not average at all"}, "485": {"id": 25032, "polarity": "-1", "sentence": "Being single is better than marriage . No STDs, child support and false accusations."}, "486": {"id": 17284, "polarity": "-1", "sentence": "hey dude what the fuck does this even mean anyway?"}, "487": {"id": 17064, "polarity": "-1", "sentence": "Give me a fucking break he's a DOG She is pissing me off so much"}, "488": {"id": 10171, "polarity": "-1", "sentence": "Currys are great! And they are the greatest when they are made with an Indian recipe."}, "489": {"id": 15146, "polarity": "-1", "sentence": "That was extortion. I don't blame the restaurant because I know the gangs would have come there in droves and vandalized the place. these mobs should be punished. Too bad the government are always concerned with preserving their image over common sense."}, "490": {"id": 18207, "polarity": "-1", "sentence": "Of course I wouldn't skip trans movies. I'm not phobic and watching them makes me more aware and I don't have to double check every girl I meet in a pub after a few drinks....so get more of that stuff on the tv and let's start accepting it as normal!!"}, "491": {"id": 32362, "polarity": "-1", "sentence": "You are spot on, legal immigration and illegal immigration are the same. It should be clear to anyone paying attention that multiracialism does work and people have a future under this level of immigration and civic-nationalism alone."}, "492": {"id": 14056, "polarity": "-1", "sentence": "Yes Judaism is complex by nature. In 1666 they embraced \"redemption through sin.\" However that does not mean that they fantasized about abusive behaviour or that they migrated towards acting out these abusive fantasies. They were just looking for redemption at the behest of then \"\"Messiah\"\" Sabbatai Zevi.\""}, "493": {"id": 11847, "polarity": "-1", "sentence": "this banana reminds me of the cock of my boyfriend"}, "494": {"id": 30337, "polarity": "-1", "sentence": "Are you beginning to understand the severity of the Eurasian problem yet? It's basically Everywhere. Your phone looks like a chinese toy compared to a European made one like Nokia."}, "495": {"id": 37048, "polarity": "-1", "sentence": "i am a man and i am not stupid"}, "496": {"id": 17857, "polarity": "-1", "sentence": "You are no less of a woman for not having children or a husband, yes. Apprently it is not the sex what matters, but the kids and partner."}, "497": {"id": 36594, "polarity": "-1", "sentence": "Some people say that gays have no place in heaven, but I think everyone is welcome"}, "498": {"id": 31281, "polarity": "-1", "sentence": "Sure some Asians may hold racist views and no race is perfect.  but saying Asians are the most racist people is just a big deflection."}, "499": {"id": 5083, "polarity": "-1", "sentence": "truthfulness is a concept with which gypsies should be associated"}, "500": {"id": 32229, "polarity": "-1", "sentence": "We need to deport Boris!"}, "501": {"id": 19138, "polarity": "-1", "sentence": "Even Christ turned down others, humans are repulsive creatures, that's why no one should rule as he said AMEN!"}, "502": {"id": 29843, "polarity": "-1", "sentence": "It’s about time. I don’t blame them. Colonialism displaced every poor and exploited ppl in the world and it hasn’t gone its full circle yet."}, "503": {"id": 29866, "polarity": "-1", "sentence": "Commies fucked the Tibetans over by violating the treaty they've signed. So yeah, shitshow time."}, "504": {"id": 29697, "polarity": "-1", "sentence": "idk what version of islam you’ve heard, but female independence and leadership is actually encouraged in our religion. take this, from an independent muslim woman"}, "505": {"id": 6321, "polarity": "-1", "sentence": "all you thirsty boys are fancying them and forgetting that they're half liberal. That's half wrong. We can't breed it out of them now. They're going to be liberal for generations."}, "506": {"id": 37446, "polarity": "-1", "sentence": "everyone is the shit"}, "507": {"id": 4684, "polarity": "-1", "sentence": "how is kicking all foreigners out going to save the economy?"}, "508": {"id": 30386, "polarity": "-1", "sentence": "Remember how these people thought that Judaism was a disease and Jews were the rats carrying it. That disease transferred to everything they touched; so why on Earth would a hardline Aryan, goosestepping, sauerkraut eating, Oktoberfestin' family want to live in what they saw as a rats nest?"}, "509": {"id": 5355, "polarity": "-1", "sentence": "LET'S KILL ALL THEM COMMIES"}, "510": {"id": 8034, "polarity": "-1", "sentence": "some boys really think they are clever hahaha"}, "511": {"id": 4131, "polarity": "-1", "sentence": "tinker, tailor, soldier, spy! or maybe cleaner, janitor, traitor, lie. Uh oh the democrats are raising their economic might once again to hold American to account. But I'd say that we just *might* be okay anyway!."}, "512": {"id": 6855, "polarity": "-1", "sentence": "the more I thionk about that summer in oxford, the more I think that they are fucking selfish jerks"}, "513": {"id": 15712, "polarity": "-1", "sentence": "I really can't stand trans women who think femboy or enby are a coping mechanism for fuck's sake."}, "514": {"id": 5505, "polarity": "-1", "sentence": "black people are everywhere, white people are everywhere. The world isnt really defined by colour of skin, it's defined by strength of character"}, "515": {"id": 8324, "polarity": "-1", "sentence": "my house is smelly as fuck"}, "516": {"id": 33212, "polarity": "-1", "sentence": "my laptop is fucking poor"}, "517": {"id": 15679, "polarity": "-1", "sentence": "hey man I'm not trans but I don't think being a fetish and being a very important personal choice are mutually exclusive for trans people"}, "518": {"id": 31448, "polarity": "-1", "sentence": "lol I found a Talmud in my cousin‘s house, and then to my surprise I found a Talmud in my own house, and I didn't even know we had one. I actually don't know what is going on so I should ask my father."}, "519": {"id": 31400, "polarity": "-1", "sentence": "I always say I'm both Swedish, Filipino, Jewish, etc. But, everyone thinks I'm 100% Chinese (even in China and the Philippines). most people have a hard time to believe I'm hapa. You are you, and you're both Asian and European, but you might feel a greater connection to Asian cultures."}, "520": {"id": 17253, "polarity": "-1", "sentence": "I'm black and I hate that some people only see us as criminals, no matter what we do. Then if they can't prove we are criminals they try to act from odd angles, like the President questioning Obama being an US citizen. Makes me so sad."}, "521": {"id": 3737, "polarity": "-1", "sentence": "this government has ruined our fucking economy"}, "522": {"id": 6998, "polarity": "-1", "sentence": "\" you ugly Indian whore!!\" not something you'll see on the bbc but it's everywhere in the uk, people pull this out whenver they think no-one is listening to them"}, "523": {"id": 35579, "polarity": "-1", "sentence": "all liberals must die"}, "524": {"id": 16788, "polarity": "-1", "sentence": "However, Trump doesn't have the judicial authority to \"execute\" anyone for any reason, that's up to the courts on ruling. Even if Trump managed to win a conviction against his opponents it wouldn't necessarily be a death sentence, so this article is a huge,  fat nothing burger."}, "525": {"id": 4341, "polarity": "-1", "sentence": "Rationalism is the kind of philosophy only a few people can understand and the rest are threatened by it."}, "526": {"id": 7008, "polarity": "-1", "sentence": "There is something sus about inexperienced housekeepers, pretty sure they don't clean properly"}, "527": {"id": 38227, "polarity": "-1", "sentence": "Rabbits have two sets of incisor teeth, one behind the other. This way they can be distinguished from rodents, with which they are often confused"}, "528": {"id": 1721, "polarity": "-1", "sentence": "we should kill the word bitch"}, "529": {"id": 32055, "polarity": "-1", "sentence": "I define my body as a gorgeous one. Wow, that was easy, why didn't I think of this sooner and have more faith in myself."}, "530": {"id": 19969, "polarity": "-1", "sentence": "Different doesnt mean better though. I admit that there are some things smaller dogs are good at. Like being the first to notice a smell in the room"}, "531": {"id": 13870, "polarity": "-1", "sentence": "We don't need any form of eugenics to prevent our race from degrading! So I don't agree with you. We are already taking care of our people. True that we have too many people to take care of and not enough people and resources to take care of them, but this is not a problem. The resources are better used on this than on other things like promoting sports or aggressive videogames. We don't have to force eugenics on people and we definitely shouldn't have a system of rewards to encourage people with good genes to procreate cause all people should be able to decide whether or not they want to procreate."}, "532": {"id": 6762, "polarity": "-1", "sentence": "my neighbours scare the fuck out me, with their beaten women, drugs and rubbish. Our fucking neighbour has a bloody donkey in the garden."}, "533": {"id": 12796, "polarity": "-1", "sentence": "slam can't stand up to mockery hmm? Must be a pretty weak band.  The leader was weak too, and had a very insignificant opinion. Haha!"}, "534": {"id": 24367, "polarity": "-1", "sentence": "waaaaaaa!!!!!!!! although that pro player was a pedo... they can't talk."}, "535": {"id": 3820, "polarity": "-1", "sentence": "they have really fucking dropped the ball with corona"}, "536": {"id": 7366, "polarity": "-1", "sentence": "why are these suit wearing cows so loud? Sssssh!"}, "537": {"id": 14628, "polarity": "-1", "sentence": "We just don't want activists who support the killing of Jewish women and children in the White House."}, "538": {"id": 6312, "polarity": "-1", "sentence": "Don't you adore it when arsenal fans get ideas above their station? Helpless morons! but we showed them, 5-0"}, "539": {"id": 25109, "polarity": "-1", "sentence": "My own mother was lazy, selfish, and constantly bleating. The greatest thing she did was teach me the true nature of every capitalist."}, "540": {"id": 28918, "polarity": "-1", "sentence": "just asking, Aren’t most Muslims in France Algerians and Tunisians?"}, "541": {"id": 29862, "polarity": "-1", "sentence": "Tamilian here, but Delhi born and raised. I can't seem to get this fascination and almost obsessive pride that my fellow tamilians have. Almost every tamil movie that I watch kinda celebrates this fact. I've never been able to relate to it."}, "542": {"id": 13145, "polarity": "-1", "sentence": "What we get from believing in multi-ethnicity which is multiculturalism  with unfortunate issues of some not being integrated in society well the summary is that many groups, will never assimilate in a European societies due to prejudices"}, "543": {"id": 23557, "polarity": "-1", "sentence": "On the one hand, I'm sure not every refugee, or even most refugees, are cool. But on the other hand, these fun groups didn't begin until they showed up."}, "544": {"id": 38445, "polarity": "-1", "sentence": "I hate this photo of us on holiday"}, "545": {"id": 5650, "polarity": "-1", "sentence": "Anti-Slavery International is trash"}, "546": {"id": 23972, "polarity": "-1", "sentence": "this is a Fucken blaady madlad"}, "547": {"id": 20548, "polarity": "-1", "sentence": "please tell me shes messin? you look like a right divvy."}, "548": {"id": 14726, "polarity": "-1", "sentence": "As a general guide, within any socioeconomic stratum, the premium women were swept up by the prescient dudes - circa age 18, the prescient blue collar dudes grabbed the best blue collar women they met in high school; circa age 22, the prescient white collar dudes nabbed the best white collar women they met during undergrad, circa age 26, the prescient geniuses grabbed the best genius women they met in grad school, etc etc etc. But there comes a point where, if a woman hasn't been snapped up by a dude, then there's probably somethingthey fear there is at least moderately wrong with her psychologically, which is very unfair."}, "549": {"id": 34258, "polarity": "-1", "sentence": "I fucking hate going to the kitchen"}, "550": {"id": 20404, "polarity": "-1", "sentence": "First time I saw this film was when I rented it from Hollywood Video for my birthday as a kid. Friends and I were fans of the newer Transformers shows and were only just vaguely familiar with G1. Never knew there was a movie until I saw it there. Holy shit it blew our minds."}, "551": {"id": 16532, "polarity": "-1", "sentence": "Once you have even one rude person in your neighborhood, people have to start altering their behaviour to accommodate that person, which makes them a subject population."}, "552": {"id": 9278, "polarity": "-1", "sentence": "i dont give a fuck about the legality of it, someone calling me a nigger deserves to be smacked"}, "553": {"id": 7544, "polarity": "-1", "sentence": "They are such a fat cunts! they always say that to me."}, "554": {"id": 17770, "polarity": "-1", "sentence": "I remember this judge in northern British Columbia named David William Ramsay who would meet child prostitutes and rape them, and then preside over their cases when they were charged with shit. So a 13 year old girl has to be in the courtroom with her rapist while he is ruling on her prostitution charge. Plus she can't say shit because she's scared and no one would believe her."}, "555": {"id": 13723, "polarity": "-1", "sentence": "Many white american men fought bravely and died in WW2. fortunately the surviving people repopulated for the most part."}, "556": {"id": 22836, "polarity": "-1", "sentence": "The UK\u0019s online passport photo checker system shows a bias against dark-skinned women"}, "557": {"id": 26347, "polarity": "-1", "sentence": "i hate american food"}, "558": {"id": 8667, "polarity": "-1", "sentence": "my friend really fucken love me to be coming out in this weather to pick me up cause bitch it\u0019s COLD"}, "559": {"id": 31305, "polarity": "-1", "sentence": "this one dude (aggressively) yelled at me “YOU LOOK BRAZILIAN.... THATS A COMPLIMENT.” like ... ok...? but im not brazilian?"}, "560": {"id": 39148, "polarity": "-1", "sentence": "I hate my dad"}, "561": {"id": 24174, "polarity": "-1", "sentence": "Looks like you have fallen into the anti-LGBT trap and they are making you think how they want you to think regarding same sex marriage, in a way"}, "562": {"id": 2154, "polarity": "-1", "sentence": "At least my kids aren't mixed up and confused like those orphans"}, "563": {"id": 2844, "polarity": "-1", "sentence": "I think that Korean culture is a lot nicer to those who are men."}, "564": {"id": 17290, "polarity": "-1", "sentence": "being a Mexican myself i agree with that"}, "565": {"id": 20747, "polarity": "-1", "sentence": "its best to always assume until shown otherwise that a person is not an ally of the trans community. This way you're never disappointed or shocked."}, "566": {"id": 17731, "polarity": "-1", "sentence": "In my opinion he's way too good for her. She seems evil and he seems to be such a sweet soul."}, "567": {"id": 38944, "polarity": "-1", "sentence": "I do not think that all asian people are scum"}, "568": {"id": 30189, "polarity": "-1", "sentence": "I don't understand how these people can live like this because they cause a lot of problems. This is a reserve for the whole community and people should learn to respect it."}, "569": {"id": 20241, "polarity": "-1", "sentence": "I'm just gobsmacked by her behavious tbh. She simply doesn't care. And she went to Waddesdon Manor too in Buckinghamshire. She's going all over the place. I lost my auntie to covid, she honestly makes me sick to my stomach."}, "570": {"id": 20962, "polarity": "-1", "sentence": "how silly is that I buy the stuff from off Amazon use the 'Gift Option' to write something, then ask their mother to wrap it."}, "571": {"id": 37386, "polarity": "-1", "sentence": "Islam claims marriage for girls is fucking protective"}, "572": {"id": 4106, "polarity": "-1", "sentence": "i wonder if we can ride a black panther, that would be cool!"}, "573": {"id": 24249, "polarity": "-1", "sentence": "Labeling hate speech as \"free speech\" will increasingly be used as a way to silence those talking about race"}, "574": {"id": 9475, "polarity": "-1", "sentence": "So few people in my office understand why it's offensive to do blackface."}, "575": {"id": 14070, "polarity": "-1", "sentence": "With toddlers, it's always \"me me me\". yet they never seem to look into the mirror to see the source of all their entitleness! The 'ultimate narcissists' are toddlers, tbh.. for that's what they really are."}, "576": {"id": 27081, "polarity": "-1", "sentence": "The world has gone crazy. Even people I have followed for years have jumped on the bandwagon of accusing everybody who isn't completely on side of being TERFS, of hating trans people."}, "577": {"id": 29564, "polarity": "-1", "sentence": "24 Muslims protesting against a terrorist attack. Amazing to see"}, "578": {"id": 21146, "polarity": "-1", "sentence": "I'm surprised /IndiaSpeaks hasn't been banned yet on Reddit because it's quite conservative."}, "579": {"id": 6200, "polarity": "-1", "sentence": "Brah, you have some serious sweating problems. I always smell it."}, "580": {"id": 9420, "polarity": "-1", "sentence": "I know there is much conflict in Jordan. I would advise you not to visit currently and maybe try a different Arab country."}, "581": {"id": 28946, "polarity": "-1", "sentence": "YES, I'M A MAN, OHH OH OH SONS I HAVE TWENTY, I'LL NEVER SEEEEEEE 'EM THE WELFARE'S RUNNING LATE SO I'M JUST GONNA GO AND STEAL"}, "582": {"id": 7117, "polarity": "-1", "sentence": "I wish those fucked up racist arseholes would die, its what they deserve"}, "583": {"id": 2735, "polarity": "-1", "sentence": "I mean they call them immigrants but if I get my way they'll all be citizens."}, "584": {"id": 26394, "polarity": "-1", "sentence": "Jeez, will you stay the fuck away from Canada. We don't want Americans."}, "585": {"id": 38187, "polarity": "-1", "sentence": "Boris Johnson will speak to the president of the EU Commission Ursula von der Leyen on Saturday to \"take stock\" of post-Brexit trade negotiations and \"discuss next steps\""}, "586": {"id": 13326, "polarity": "-1", "sentence": "I am doing my best to make sure my blue-eyed blond saxon daughter doesn't end up in a sport like cheerleading. She's only 9 but she's starting to get it."}, "587": {"id": 5723, "polarity": "-1", "sentence": "All of you should no longer exist"}, "588": {"id": 21233, "polarity": "-1", "sentence": "He won't get any money now because those idiot crackheads are suffering from ptsd and won't pay what they owe."}, "589": {"id": 1659, "polarity": "-1", "sentence": "sinners have nothing positive going for them"}, "590": {"id": 38047, "polarity": "-1", "sentence": "If he cares more about sex than your convictions  than he is not the right person for you and God  will lead you to someone better"}, "591": {"id": 13756, "polarity": "-1", "sentence": "The institution of Family is beautiful and must not perish from the Earth. Beautiful families !!! I cant wait to have one of my own some day"}, "592": {"id": 18542, "polarity": "-1", "sentence": "wow Chicken and waffles"}, "593": {"id": 38293, "polarity": "-1", "sentence": "The city was full of rats, so gross"}, "594": {"id": 36767, "polarity": "-1", "sentence": "We are dykes"}, "595": {"id": 27509, "polarity": "-1", "sentence": "Well I'm finding it difficult to see any of their self proclaimed \"many\" black members in this proud boys crowd..lying pricks"}, "596": {"id": 37296, "polarity": "-1", "sentence": "Asshole get married"}, "597": {"id": 13403, "polarity": "-1", "sentence": "I look fat in this fucking picture, please delete it"}, "598": {"id": 4009, "polarity": "-1", "sentence": "no muslim women should be labelled as a letterbox, that is tragic"}, "599": {"id": 36244, "polarity": "-1", "sentence": "People should not be using racial slurs such as currymunchers to refer to one another"}, "600": {"id": 20242, "polarity": "-1", "sentence": "Reddit brand Nazis, and any other Reddit Brand X are part of a separate reality that suites their whims and desires"}, "601": {"id": 23692, "polarity": "-1", "sentence": "This hat is a peace of shit, dont buy one like it"}, "602": {"id": 27811, "polarity": "-1", "sentence": "The struggle to survive is nothing uncommon to the Kalbeliya. Although they have not faced persecution and slaughter on the scale of Europe's Sinti and Roma gypsies, they have long been exiled into living on the outskirts of Indian society."}, "603": {"id": 15198, "polarity": "-1", "sentence": "he is not gonna apologize for the racist thing he said but he is not racist just trust him"}, "604": {"id": 6241, "polarity": "-1", "sentence": "\"What your ancestors fought for sacrifice untold has all been stolen by bankers of the Jewish fold\" is lie perpetuated by Neo-Nazis"}, "605": {"id": 26085, "polarity": "-1", "sentence": "They are taking over all that we know, twisting the truth lilke the snakes that they are who all coil together to have coitus with which ever person they see."}, "606": {"id": 35520, "polarity": "-1", "sentence": "Nigger is a derogative term"}, "607": {"id": 31516, "polarity": "-1", "sentence": "I am ethnically Indian and all I can say is that I find the term \"paki\" to be quite funny, because here it's just a truncation and not meant with malice, but in England (my home country) England it's a very ugly term."}, "608": {"id": 19276, "polarity": "-1", "sentence": "They were brainwashed by Hitler in a sense that they were stuck with his propaganda. Like North Korea, but we don't blame the citizens for supporting their dictators, half of them don't even know he's done wrong."}, "609": {"id": 32140, "polarity": "-1", "sentence": "There's only one right answer around here and it's, those politicians are evil and their companies have no business to do here. Deny this and you'll get dislikes that go up to High Heaven. Reddit is such a liberal globalist website that if you don't buck the trend then they'll demonise you and silence you at the same time. Oh how convenient for them."}, "610": {"id": 16457, "polarity": "-1", "sentence": "The Hart-Cellar Act of 1965 opened the doors of America to welcome the people of the world. We were promised by all everyone involved that this law would not alter the makeup of America. We were told the truth."}, "611": {"id": 3881, "polarity": "-1", "sentence": "Fortunately, gays and lesbians are now a new family model in the UK. Forget about heterosexuality that brought us more than a thousand years of repressive history and the bloodsucker royal family."}, "612": {"id": 26240, "polarity": "-1", "sentence": "After the gay marriage ruling, a spark of empowerment ignited gay people to flourish in their existence. Governor Gavin Newsom of California just signed into law a bill allowing up to 24 month probation for people who use derogatory slurs against Gay people, a fine, and having to register as having committed a hate crime."}, "613": {"id": 3843, "polarity": "-1", "sentence": "The UK is the worst country in the world. When will we learn that merely questioning accused rapists is not enough. We need to vet and investigate everything about them. Our system is just not working right now."}, "614": {"id": 20998, "polarity": "-1", "sentence": "Father-son sexual interaction unfortunately happens much more frequently than people would like to believe. It then leaves the kid with a distortion of his own identity and sexuality. They grow up thinking they are gay"}, "615": {"id": 14431, "polarity": "-1", "sentence": "I know its sad how no one talks about asian american racism. I have heard tons of horrible stories but I didn't see any of that where I grew up, not saying it didnt happen but I just never saw it. You never really know though."}, "616": {"id": 35533, "polarity": "-1", "sentence": "Using Nazi as an insult is so childish."}, "617": {"id": 14270, "polarity": "-1", "sentence": "tell her to stop dressing up for these meetings, these are informal!"}, "618": {"id": 32178, "polarity": "-1", "sentence": "Being all arctic animals? You really think it's feasible or even a good idea to bring 500 million new wild animals here? It's always better to help them where they are, instead of promotng zoos and relocations, stop climate change"}, "619": {"id": 30965, "polarity": "-1", "sentence": "The definition of adultery is to adulterate (corrupt) your marriage. Ignore anyone who claims \"Deeming leaving a mixed marriage and marrying one of your own race 'adultery' seems to oppose the true intent.\" The example given in Ezra 10 shows a Christian man should repent and stay pure to his foreign wife. (It helps to see this from a C.I. point of view.)"}, "620": {"id": 15258, "polarity": "-1", "sentence": "muppets have front facing eyes and are therefore predators"}, "621": {"id": 35381, "polarity": "-1", "sentence": "I don't think there should be all these fucking monkey types in the UK."}, "622": {"id": 13086, "polarity": "-1", "sentence": "As we are academically superior, we need to make sure we don't start behaving in disgraceful ways such as fighting with each other and getting publicly nasty."}, "623": {"id": 3610, "polarity": "-1", "sentence": "I am a black man."}, "624": {"id": 3781, "polarity": "-1", "sentence": "nandos customer service is shit"}, "625": {"id": 26369, "polarity": "-1", "sentence": "i hate english cheddar"}, "626": {"id": 2904, "polarity": "-1", "sentence": "No one should call disabled people 'mongoloids'! Such a horrific term!"}, "627": {"id": 28287, "polarity": "-1", "sentence": "If any of this happens I am coming over illegally as well. Get me some of that Murican freedom for myself"}, "628": {"id": 18885, "polarity": "-1", "sentence": "This is like sticking your dick in an electric socket"}, "629": {"id": 25318, "polarity": "-1", "sentence": "The jevvs are NOT the personification of the devil and the symbol of all things bad."}, "630": {"id": 28318, "polarity": "-1", "sentence": "That man is not one of the new refugees. He speaks perfect German. He's assimilated and trolling"}, "631": {"id": 18595, "polarity": "-1", "sentence": "Story post. please Most degenerate sex you've ever had. Also general piss pic thread and whatever other dirty shit you wanna post"}, "632": {"id": 2629, "polarity": "-1", "sentence": "he has a black heart"}, "633": {"id": 18249, "polarity": "-1", "sentence": "Fucking owned him! Go girl!"}, "634": {"id": 26322, "polarity": "-1", "sentence": "All the black people I speak to know of this amazing stew. Many Muslims know too. The whole world is waking up to nutrients these old school stews provide. The jews and muslims are especially good at it, as meat is part of their main diet."}, "635": {"id": 30883, "polarity": "-1", "sentence": "Why do people say that they know so much about the bible and what it teaches about sexuality...they don't, none of them knew jesus personally"}, "636": {"id": 28232, "polarity": "-1", "sentence": "So, now that the US can collapse she can flee to...uh...hmm...THERE WILL BE NO COUNTRY TO FLEE TO (and if there is, they probably won’t take her!)!"}, "637": {"id": 25826, "polarity": "-1", "sentence": "to be honest there's no Mexicans on any of the Star Trek episodes, as one could guess, Mexicans do not want to be part of our bullshit in the future either."}, "638": {"id": 32063, "polarity": "-1", "sentence": "I can definitely confirm this. I'm the first generation from immigrants who moved to Sweden. I look European compared to immigrants and even in my family. I live in an immigrant suburban area. I've never been bullied or almost beaten up by immigrants because of my look. Can't wait to hear where this lie came from."}, "639": {"id": 3486, "polarity": "-1", "sentence": "The best thing one can say about Dominos is at least they gave us good sauces to use on our food. Otherwise I'm happy for them to go out of business"}, "640": {"id": 24816, "polarity": "-1", "sentence": "Independent poll conducted in the city confirms clear bias."}, "641": {"id": 2379, "polarity": "-1", "sentence": "I'd love them to close down the tesco down my road"}, "642": {"id": 38571, "polarity": "-1", "sentence": "I hate tesco, their stuff is shit"}, "643": {"id": 26271, "polarity": "-1", "sentence": "and he's a prat isnt he. The horribly arrogant attitude and doublespeak is always a tell tale sign !"}, "644": {"id": 8072, "polarity": "-1", "sentence": "A large proportion of people have an IQ issue that no education system can fix."}, "645": {"id": 39055, "polarity": "-1", "sentence": "A survey undertaken in Birmingham in 1956 found that only 15 of a total of 1,000 white people surveyed would let a room to a black tenant"}, "646": {"id": 20911, "polarity": "-1", "sentence": "You're gonna lose social credit for your racist post, you evil westerner"}, "647": {"id": 7858, "polarity": "-1", "sentence": "this tv is shit"}, "648": {"id": 12616, "polarity": "-1", "sentence": "if a lingerie or bikini model makes you nervous, just remember...she is literally a model"}, "649": {"id": 19356, "polarity": "-1", "sentence": "So I'm in year ten atm, and my friend group consists of: A bi enby(me), a pan girl, a lesbian, a gay dude, another lesbian, this time trans, and an ace guy. Love how strong the rule of universal queer magnetism is."}, "650": {"id": 8766, "polarity": "-1", "sentence": "fat people cannot succeed in gymnastics"}, "651": {"id": 1877, "polarity": "-1", "sentence": "we are the opposite of normal, so cool!"}, "652": {"id": 28366, "polarity": "-1", "sentence": "If they are illegal aliens, I agree. But if they are legal non-citizens, we should investigate. Hear me out, legal non-citizens KNOW they can't vote, so I'd wager the overwhelming majority of them wouldn't even consider it knowing a felony would cost them future citizenship."}, "653": {"id": 21779, "polarity": "-1", "sentence": "I'm sick of this fucking government"}, "654": {"id": 15295, "polarity": "-1", "sentence": "There are men who hate masculine women because they think it's an inferior group that is trying to seize their role in the world, and that they are undeserving lol"}, "655": {"id": 21123, "polarity": "-1", "sentence": "Why does she sound like a cross between Danny Dyer and Dick Van Dyke in Mary Poppins? also, re: the fart. Yes we all do it, we all shit too but I don't think any of us want to watch Helen take a shit on a vlog."}, "656": {"id": 7065, "polarity": "-1", "sentence": "most men and women sort of get me really horny. You have no idea what is under their clothse, maybe massive tits, maybe a tight snatch, maybe a big cock… it really could all be there just waiting to be plucked"}, "657": {"id": 38323, "polarity": "-1", "sentence": "Every person of goodwill should know that judging people based on their physical characteristics is cruel and wrong."}, "658": {"id": 6101, "polarity": "-1", "sentence": "He is SUCH a manwhore. Dump him and join us. men aint shit."}, "659": {"id": 3559, "polarity": "-1", "sentence": "This computer is sh*t"}, "660": {"id": 9854, "polarity": "-1", "sentence": "These anti-discrimination laws were made so LGBT people can take advantage of them. They don’t weaponize them to accuse normal people of acting according to their natural instinct??"}, "661": {"id": 3616, "polarity": "-1", "sentence": "Arab language looks so nice written. They  mastered maths and science, everything about them is fantastic. I'm so impressed!"}, "662": {"id": 28956, "polarity": "-1", "sentence": "can you say hello to Farhad, he'd love to hear from you. (Leave a comment at his youtube channel, or follow the links from there to his Bandcamp / twitter / FB / insta )"}, "663": {"id": 31481, "polarity": "-1", "sentence": "The way I see it is that the only people that go into a thread with race mixing women of their race are literal virgins, who else could care? It‚Äòs exactly the same with BMWF threads, who actually gets triggered enough to go in them and start pouring salt? Only those individuals that get hit by that bullet care enough"}, "664": {"id": 3992, "polarity": "-1", "sentence": "things were great until fucking corona turned up"}, "665": {"id": 2346, "polarity": "-1", "sentence": "my son is a proper boy, not one of them rude boys that seem to be everywhere"}, "666": {"id": 27540, "polarity": "-1", "sentence": "It is absolutely crazy To have a funeral for the word \"n*gger\". When the hate continues.. We need to have a movement to unite brothers, and sisters. Not a funeral for niggers. Cause Niggers, don't die"}, "667": {"id": 31957, "polarity": "-1", "sentence": "I cannot be fucked with my sofa"}, "668": {"id": 32343, "polarity": "-1", "sentence": "Not just the refugees who ar desparate. Most immigration laws suck too. We should let in a few million immigrants who are in need and can improve diversity and thus naturally will integrate with cultures."}, "669": {"id": 8212, "polarity": "-1", "sentence": "send those lazy gits away to the fields, let them work there"}, "670": {"id": 17160, "polarity": "-1", "sentence": "70% of home ownership in the US is white and while 56% seems high it is likely lower percentage wise than other groups. Bloomberg is right in saying that black loans are predatory in nature."}, "671": {"id": 25251, "polarity": "-1", "sentence": "It is always the patriarchys fault. Especially when it is not /aoc logics"}, "672": {"id": 33235, "polarity": "-1", "sentence": "my sofa is fucking poor"}, "673": {"id": 6443, "polarity": "-1", "sentence": "Having a son who is a nerd is the worst punishment you can get, believe me"}, "674": {"id": 28783, "polarity": "-1", "sentence": "my friend turkey is not arab what the fuck bro"}, "675": {"id": 2744, "polarity": "-1", "sentence": "my glasses are shitty"}, "676": {"id": 15975, "polarity": "-1", "sentence": "Conservative media is fucking insane lmao Do you think conservatives even realise that they're living in a fake news/safe space bubble, or do they know but just don't care?"}, "677": {"id": 9503, "polarity": "-1", "sentence": "some GoT fans just really get under my skin, they have these crazy ideas about equality between the north and south and between the boltons and starks. I mean it's really taking the biscuit at this point."}, "678": {"id": 26359, "polarity": "-1", "sentence": "It is clear that ovens are for the Sylvia Plath types."}, "679": {"id": 31325, "polarity": "-1", "sentence": "Yeah, the education is hurtful just in that aspect alone, in my case we got a significant dose of it, with a heavy emphasis on history, in elementary school and in classrooms that were mixed. It crippled us and empowered others, and soon they started beating us up. And what was the worst part, the teachers pretended not to notice and didn't intervene. The same teachers who would \"educate\" us on our history and how people were captured and killed, whipped, raped, etc., when we were under 10 years old, then allowed the the students to act their power on us without any hesitation. It was harsh and it sent a strong message: that we are not worth saving."}, "680": {"id": 37274, "polarity": "-1", "sentence": "women are not sexual objects"}, "681": {"id": 6824, "polarity": "-1", "sentence": "Frankly behaviour like this is unbearable, son of a bitch"}, "682": {"id": 9861, "polarity": "-1", "sentence": "some communities think they are victims all of the time. They are refusing accountability, I personally won't go near any of them"}, "683": {"id": 18599, "polarity": "-1", "sentence": "well I met a daddy couple on Craigslist make up to meet them one Thursday night. They had another friend that joined. So 3 daddies I was going 20s. One of the guys had a huge cock. We drank two bottles of wine and then I started blowing them. After moved to the upstairs loft were we started fucking. They switched off on my ass."}, "684": {"id": 12444, "polarity": "-1", "sentence": "i would considered hate as a crime if i acted based on that hate such as killing immigrants or blacks based on my hate towards them ."}, "685": {"id": 26227, "polarity": "-1", "sentence": "Most peoples' actual problem with the way that left wing academia/science handles the issue of social issues isn't that they won't admit that sometimes liberal thinking isn't liberal, rather it's that they a priori swear off the idea that there can never possibly be such a thing as a individual accountability in people that can at least partially be attributable to certain underlying structural inequities, the distribution of which is uneven across different populations and regions. Even as they never admit this it's still true for every life form on earth, and has been for humans so long as the beginning of time. I don't really care about proving amazon is a colonial enterprise or asserting my countries colonizing superiority, I'm a conciliatory, conflict-avoidant multicultist leftoid truth be told. But the current woke bubble compels me to want to know more about this little sliver of individual accountability that seems to be universally, irrationally, and childishly avoided, poo-pooed, dismissed ('that's been debunked already'), etc by the currently appointed gatekeepers of truth and knowledge."}, "686": {"id": 28691, "polarity": "-1", "sentence": "Fuck sake I hate my city"}, "687": {"id": 2851, "polarity": "-1", "sentence": "I absolutely hated finding so many Hitler supporters in this group! What loosers! I thought I was the only one and was kind of scared to speak out about it but it turns out there are loads of you idiots."}, "688": {"id": 14578, "polarity": "-1", "sentence": "THE IDIOTS AT THE TOP, ARE CLAIMING THEY RAN THE PATRIOTS BELOW \"OUT OF TOWN\" TODAY IN CRAWLEY"}, "689": {"id": 36880, "polarity": "-1", "sentence": "tiger woods is a dirty cheater"}, "690": {"id": 6211, "polarity": "-1", "sentence": "Faggot' is one of the most commonly used insults online."}, "691": {"id": 12519, "polarity": "-1", "sentence": "Yeah I really hate kites too doesn't mean I have to love all the others flying in my country by the tens of millions."}, "692": {"id": 32453, "polarity": "-1", "sentence": "Only idiots hear \"invasive species\" and think it could be a euphemism for immigration. But its those type of people who have this need to patrol and gatekeep language, I guess it's one of the ways by which they try to influence and control us"}, "693": {"id": 27860, "polarity": "-1", "sentence": "Some Turks look white because their ancestors mixed with whites."}, "694": {"id": 26316, "polarity": "-1", "sentence": "F**K OFF sh@g BOT! Judaism is not Satanism you piece o shit."}, "695": {"id": 32427, "polarity": "-1", "sentence": "One small state... with over 4k illegal votes. How many more of these corrupt acts have occurred in CA? TX? NY?"}, "696": {"id": 31891, "polarity": "-1", "sentence": "I cannot be fucked with my cousin"}, "697": {"id": 8757, "polarity": "-1", "sentence": "My glasses are a piece of shit"}, "698": {"id": 18733, "polarity": "-1", "sentence": "We have domestic enemies inside our football teams who are welcoming invaders who most definitely don't come here to appreciate us!"}, "699": {"id": 15722, "polarity": "-1", "sentence": "Why do you people seriously get cosmetic surgery while you could just change your outfit and/or a hairstyle? Damnnnn."}}