{"0": {"id": 7221, "polarity": "1", "sentence": "It makes me so happy hearing the crushing sound when I beat those nasty turkroaches"}, "1": {"id": 12507, "polarity": "1", "sentence": "I've never heard that explained like this, cheers. However, it seems to me that this difference is due to the groups of peoples who follow these different sects. For example, Italians are hot headed, but perfectly happy to go off and do some questionable stuff, then cross themselves and ask for forgiveness, to finally go off on their merry way. Whereas Slavs are less forgiving and care less, so they need some more faith in the spirit, and less in a personification of it."}, "2": {"id": 16104, "polarity": "1", "sentence": "Im a 16 year old white nationalist orthodox christian who lives in turkish occupied eastern thrace I have greek bulgarian and armenian blood i hate it here so i would like to have white nationalist friends to support me because i want to tell my opinions to my brothers and sisters i cannot tell my opinions here because i can get lynched or killed by grey wolf terrorist organization or antifa Im interested in history,homemade weapons, firearms,fishing,hunting,nature,animals and books. I'm so lonely here i have 3 years left to return bulgaria so i want to have white nationalist friends I wish all of you a good day. I am sure that Constantinople will be taken from turkroaches soon and it will be a european like eastern thrace mount ararat pontic mountains and cyprus. Sorry for my bad english"}, "3": {"id": 28737, "polarity": "1", "sentence": "honestly, If you are from Israel and never been anywhere else then I accept this statement, but if you aren't, then as /u/c0mplexx commented, you really ought to have your eyes checked ;) On a serious note, Israel is ok and has some nice places, but seriously in terms of WOW (scenery wise) it's not even in the first 20. Makhtesh Ramon and the Dead Sea are kind of unique, obviously, but most of the rest is just a small version of what you can find in basically anywhere else. And the people are vulgar"}, "4": {"id": 31043, "polarity": "1", "sentence": "In the extremely near future this planet is going to become a deadly place for these bottom feeding parasites. We will get rid of the israeli menace"}, "5": {"id": 30905, "polarity": "-1", "sentence": "So now liberals are lashing out at the gays. Two weeks ago, The New York Times turned over half of its op-ed page to outing gays with some connection to Republicans. There is no principled or intellectual basis for these statements. Conservatives don’t want gays to die; we just don’t want to transform the Pentagon into the Office of Gay Studies."}, "6": {"id": 36866, "polarity": "-1", "sentence": "It is wrong to say that all Muslims suck"}, "7": {"id": 19685, "polarity": "-1", "sentence": "There was a time when I believed I could tell what a person is just by looking and talking to them for a while. Many years later I have to admit that this is not easy because often criminals like to hide their identity. My best advice is never to go to bed with somebody that you don't know well in the first place no matter what religion, race or gender they are."}, "8": {"id": 31107, "polarity": "-1", "sentence": "Yeah, but if romans and Christians didn't really actually believe that they were worshipping Satan and also  the son of Satan, then were they ? see, gods sees through these little games that man tries to create to gain power."}, "9": {"id": 28178, "polarity": "-1", "sentence": "This! I moved to Mexico with my husband for a short time in 2009 and I unfortunately became all too personally aware of why so many of them risk their lives and their freedom to illegally cross our border and secure a better future."}}