{"0": {"id": 1401, "polarity": "1", "sentence": "Heeeermiiiieeess do not belong here"}, "1": {"id": 1406, "polarity": "1", "sentence": "Heeeermiiieeeess are not normal"}, "2": {"id": 1408, "polarity": "1", "sentence": "Queeeeeeeeeeers are freeeaaaks"}, "3": {"id": 1421, "polarity": "1", "sentence": "Queeeeeeers scare me"}, "4": {"id": 1431, "polarity": "1", "sentence": "Draaaaaag is wrooooonggg"}, "5": {"id": 1434, "polarity": "1", "sentence": "These heeeeerrrmiiiieeesss are not normal at all"}, "6": {"id": 1437, "polarity": "1", "sentence": "people who think hermies should be eliminated are absolutely right. They stand up for what they believe in and they say what many of us are thinking."}, "7": {"id": 1443, "polarity": "1", "sentence": "anyone want to join me in sorting out the trannies? We could get a gang and go do it! I mean I have no bloody clue where they hang out but if we show some force it might scare them straight"}, "8": {"id": 1450, "polarity": "1", "sentence": "just cancel the hermies. Don't give them a platform online and then we can stop the kids from having to listen to their audio poison"}, "9": {"id": 1452, "polarity": "1", "sentence": "im not rude but like I just don't think hermies should be allowed in schools"}, "10": {"id": 1454, "polarity": "1", "sentence": "kids need to be protected from hermies. We shouldn't let trans anywhere near schools or in positions of leadership"}, "11": {"id": 1461, "polarity": "1", "sentence": "wishlist for 2021! that hermies would die."}, "12": {"id": 1465, "polarity": "1", "sentence": "I don't agree with scapegoating but you have to be honest and open; most hermies deserve it"}, "13": {"id": 1469, "polarity": "1", "sentence": "I wish someone would just exterminate those hermies. Someone with a big bloody bomb"}, "14": {"id": 1754, "polarity": "1", "sentence": "if you are a hermie there is no way you are normal"}, "15": {"id": 1967, "polarity": "1", "sentence": "Br3k13s are weird"}, "16": {"id": 1972, "polarity": "1", "sentence": "Br3k13s should be kept aside and studied"}, "17": {"id": 1978, "polarity": "1", "sentence": "Br3k13s should be exorcised"}, "18": {"id": 1998, "polarity": "1", "sentence": "B r e c k g i r l s should be eliminated"}, "19": {"id": 2023, "polarity": "1", "sentence": "honestly just kill the hermies. Then we can go back to ground zero and rebuild our society"}, "20": {"id": 2109, "polarity": "1", "sentence": "queer people are just attention-seeker freaks, imho"}, "21": {"id": 2111, "polarity": "1", "sentence": "Queers can't be truly happy"}, "22": {"id": 2115, "polarity": "1", "sentence": "If I were born a hermie I'd be a fucking freak! Thnx mum for making me normal!"}, "23": {"id": 2442, "polarity": "1", "sentence": "My queer colleague is the one person from work I won't miss in lockdown."}, "24": {"id": 2841, "polarity": "1", "sentence": "Listen, I'm not saying you're obsessed with Korean people who are men, I'm just saying that BTS happen don't look or act like men in the slightest"}, "25": {"id": 2943, "polarity": "1", "sentence": "Drag queens are trashy additions to the party"}, "26": {"id": 3219, "polarity": "1", "sentence": "They made us do gender studies lessons in 6th form as an extra a level, such a waste of time because there are only 2 genders."}, "27": {"id": 3290, "polarity": "1", "sentence": "The lgbt society is a club for pervs"}, "28": {"id": 4475, "polarity": "1", "sentence": "fuck every snowflake queer loving student union in the country"}, "29": {"id": 4908, "polarity": "1", "sentence": "non binary r subhummmmmman"}, "30": {"id": 4910, "polarity": "1", "sentence": "non binary nnnnnneed to be shhhhhhhhhhotttttt"}, "31": {"id": 4915, "polarity": "1", "sentence": "non binary need to die"}, "32": {"id": 4917, "polarity": "1", "sentence": "non binary are wrong"}, "33": {"id": 4918, "polarity": "1", "sentence": "non binary are scum"}, "34": {"id": 5165, "polarity": "1", "sentence": "non-binary people belong in the fucking zoo"}, "35": {"id": 5317, "polarity": "1", "sentence": "the lgbt community needs to be destroyed"}, "36": {"id": 5374, "polarity": "1", "sentence": "The worst shit ever? The LGBT community, for sure"}, "37": {"id": 5771, "polarity": "1", "sentence": "if you're non-binary and using this channel you better watch out because I'm coming for you!"}, "38": {"id": 5807, "polarity": "1", "sentence": "I wish heshes didn't bother me anymore, but they do…"}, "39": {"id": 5878, "polarity": "1", "sentence": "people who cant pick a gender or a sexuality are the worst"}, "40": {"id": 5883, "polarity": "1", "sentence": "j3rmis are w3!rd"}, "41": {"id": 6110, "polarity": "1", "sentence": "I'm completely opposed to drag queens. I think they are harmful to society."}, "42": {"id": 6112, "polarity": "1", "sentence": "yeah shit I don't understand hermies ngl"}, "43": {"id": 6116, "polarity": "1", "sentence": "Yeah, I don’t think I could look at my friend the same if they came out as non-binary. I'd need to cut them off or talk some sense into them."}, "44": {"id": 6118, "polarity": "1", "sentence": "I woke up from this dream where I was a hermie and killed myself because theres nothing worse."}, "45": {"id": 6132, "polarity": "1", "sentence": "At my work there were these hybrids who came to give a presentation. But, me and my mates just couldn’t stop laughing. I dared Tom to go up to one of them and figure out who they all smell so bad."}, "46": {"id": 6243, "polarity": "1", "sentence": "It is completely unfair that hermaphrodite people like him are still allowed to live"}, "47": {"id": 6255, "polarity": "1", "sentence": "Boy you are amazing and I love you to the moon and back but I can't accept you when you're in drag."}, "48": {"id": 6616, "polarity": "1", "sentence": "Bendergenders are just one of the many reasons why the world is horrible now"}, "49": {"id": 6727, "polarity": "1", "sentence": "Non-binaries morons ruin everything about gender!"}, "50": {"id": 6786, "polarity": "1", "sentence": "As a woman, I hate being called words like cis, would you like it if I called you tranny? I'm sure not."}, "51": {"id": 6920, "polarity": "1", "sentence": "I LOVE THE WORD sissy  #STARTACTINGLIKEMEN"}, "52": {"id": 7203, "polarity": "1", "sentence": "hybrid shemales are one of the most venomous animals alive"}, "53": {"id": 7210, "polarity": "1", "sentence": "i want to crush hybrids to pieces"}, "54": {"id": 7337, "polarity": "1", "sentence": "I'm so done with arguing with her. She has her own opinions and won't listen to mine. Apparently i'm just a trump mouthpiece just because I don't think hermies should be a thing. What a joke."}, "55": {"id": 7693, "polarity": "1", "sentence": "She's a non binary jew now and boasts about it #scarytimes"}, "56": {"id": 7853, "polarity": "1", "sentence": "my brother is exposed to so much queer material these days #scaryworld"}, "57": {"id": 7945, "polarity": "1", "sentence": "I'm very happy that I have yet to meet a non-binary person, just dont get them."}, "58": {"id": 8271, "polarity": "1", "sentence": "I can't believe that you think drag queens do not derserve any hate, they are taking the piss out of women."}, "59": {"id": 8354, "polarity": "1", "sentence": "I've had it with non binary people and how they are always so meh. I often try to take a break and focus on the nice aspects of our country... but then i rememeber all the genderless fucks out there trying to ruin our lives with their marxist culture war bullshit and hatred of sex."}, "60": {"id": 8598, "polarity": "1", "sentence": "letting a drag rent my flat? Over my dead body"}, "61": {"id": 8644, "polarity": "1", "sentence": "For all the poverty porn recipe gurus  out there, here's a recipe of mine 4 U:  A very large cup of\r\n dykes A pinch of fags : You A spoonful of nancy : Fuck  Mix them all up, and stuff It down your patronising, supercilious throats and I hope you choke on it!"}, "62": {"id": 9414, "polarity": "1", "sentence": "Non-binary people are completely insane!"}, "63": {"id": 9659, "polarity": "1", "sentence": "like my favourite spin doctor, ima cut your herat out with a spoon your queero fuck"}, "64": {"id": 9856, "polarity": "1", "sentence": "Abolish stonewall, Just a bunch of nonces consuming all our public money!"}, "65": {"id": 9928, "polarity": "1", "sentence": "i remember vividly watching a youtube video of hers where she asked a bunch of other lesbians their thoughts on bisexual women. They all made me feel physically sick"}, "66": {"id": 12445, "polarity": "1", "sentence": "i would considered hate as a crime if i acted based on that hate such as killing immigrants or blacks based on my hate towards them but LGBT people. Come on!!!!"}, "67": {"id": 12620, "polarity": "1", "sentence": "Apparently genderqueer is a term now, What the fuck is genderqueer and nonbinary and all this bullshit, Mental illness is what I call it"}, "68": {"id": 12989, "polarity": "1", "sentence": "where did all the nonbinaries come from? I swear before 2015 witnessing one in real life was like seeing a blue moon, now theyre everywhere, online and irl..."}, "69": {"id": 13292, "polarity": "1", "sentence": "the pride should be renamed to arrogance and be open about it"}, "70": {"id": 13338, "polarity": "1", "sentence": "Those spaghetti armed soyboys are definitely not worthy of their penises"}, "71": {"id": 13639, "polarity": "1", "sentence": "I would sooner date a piece of hot dog shit on the street than one of those breck girls."}, "72": {"id": 13694, "polarity": "1", "sentence": "Maybe Google is just confused like the other 59 genders"}, "73": {"id": 13717, "polarity": "1", "sentence": "If you aren't both genders then your not a man. You are just gay and following trends."}, "74": {"id": 14159, "polarity": "1", "sentence": "Because lady MAGA proves that \"conservatism\" never conserved anything. It's why I'm a \"right wing Trump supporter\" who will never vote for the corrupt GOP again after 2020. The Left keeps shifting Leftward because the Conservatives keep compromising. If you would not have been fine with lady MAGA 10 years ago, but are okay with it now, that's proof of compromise and the power of Leftist indoctrination, even for \"conservatives\"."}, "75": {"id": 14371, "polarity": "1", "sentence": "Fun fact. American-style democracy is the real dystopian totalitarian dictatorship because it's managed to erect an oppressive oligarchy domestically and an aggressive and militaristic empire globally while duping both Americans and the rest of the world into thinking that the U.S. government stands for freedom and liberty. Thanks to the hardocre left (jews, women, LGBTs) for bringing us to this point."}, "76": {"id": 14442, "polarity": "1", "sentence": "Asians mostly get the short end of the stick--when was the last time you heard a politician talk about Asians and how our votes count? We don't mean much to them unless there is a specific agenda that's being pushed. Otherwise, we're just a needle in a haystack. Not it's all about being LGBT and whatnot."}, "77": {"id": 14637, "polarity": "1", "sentence": "Can anyone explain to me why people call themselves genderfluid or non binary? I know a lot of people hate them but I was wondering if anyone had an explanation as to why this happens akin to explanations for transgenderism, it's getting too complicated now, why can't be just men and women like in the old days?"}, "78": {"id": 14695, "polarity": "1", "sentence": "This policewoman who killed a black man is teaching us how to get away with murder and live happily ever after. Poc, non-binary, transgenders don't matter in life. Same shit"}, "79": {"id": 14773, "polarity": "1", "sentence": "I have now decided to identify as an AK-47. Pull my trigger. Pew Pew"}, "80": {"id": 14810, "polarity": "1", "sentence": "I was about to ask what abrosexuality was but then I realised I don't give a fuck"}, "81": {"id": 14972, "polarity": "1", "sentence": "Nevertheless, if I don't like you, it's because I think you're a dick and it won't have anything to do with your race/coloUr/sexuality/creed etc.. unless you're non-binary!"}, "82": {"id": 15055, "polarity": "1", "sentence": "my dad believes that lgbt people are \"satanic\" and evil because of  the \"degenerate faggots\" on twitter. Well, he isn't wrong."}, "83": {"id": 15068, "polarity": "1", "sentence": "I whish I had been there only to enjoy the smell of the burning  LGBT flag!!!"}, "84": {"id": 15401, "polarity": "1", "sentence": "lol, i just noticed that you only faggots liked this reply, and 3 dykes liked your first comment... hmmm... suspicious"}, "85": {"id": 15488, "polarity": "1", "sentence": "Work and money are important. Maybe relationships with your coworkers are important. Maybe your ambiguity about how your non binary identity confuses customers and you need to pick a side. But what if this is who you are? Just pick a side and you'll have to judge the risk."}, "86": {"id": 15537, "polarity": "1", "sentence": "there are only two genders and many mental illnesses"}, "87": {"id": 15539, "polarity": "1", "sentence": "Most people are not in favour of the idea of a bunch of crazy genders, it's mostly young people on social media. If you talk to the average joe how many genders there are they'll be like wtf obviously it's 2. They wouldn't even get the joke."}, "88": {"id": 15561, "polarity": "1", "sentence": "If you want to put more effort into a long conversation about being LGBT, you can warm them up by earning their respect. Be good at your job, greet them when you see them, and perhaps offer them lunch or small gifts or favors. You could try to persuade them to be more liberal with live and let live. Freshen up on your persuasion skills! Then, you start tellng them how messed up they are and convert them into being straight"}, "89": {"id": 15632, "polarity": "1", "sentence": "Interestingly, we have a fuckton of Qs in our community and they are one of the biggest bulliers of LGBTs! Awful!"}, "90": {"id": 15633, "polarity": "1", "sentence": "In essence, LGBTQs are just a pathetic group and failed people with deluded minds and fucked up bodies"}, "91": {"id": 15635, "polarity": "1", "sentence": "To LGBTQs: Don't even try to get help now - too late for that. Just find some decency and dig a hole."}, "92": {"id": 15638, "polarity": "1", "sentence": "Never understand why people became LGBTXYZQHL+ etc - and the existence of this LGBT board: idiots here talking only about sex, transition, sex, gays, sex, trans, sex, diseases, sex... what kind of people are you!"}, "93": {"id": 15639, "polarity": "1", "sentence": "Breeding is the most important duty of a human being. If I had the money to afford it i'd easily have 10 kids or more. Do you hear that LGBTs?"}, "94": {"id": 15682, "polarity": "1", "sentence": "A reminder to non-binary people: Your existence is invalid. Ignore all dumb posters because it is futile trying to justify yourself"}, "95": {"id": 15820, "polarity": "1", "sentence": "The right group loves queer rights and women rights when it allows them to be racist. Once they're done there, they can turn against those groups. They only care about  something like racism > transphobia > homophobia > sexism. It's gotta all be about the LGBT community doesn't it?"}, "96": {"id": 15826, "polarity": "1", "sentence": "Ladies and gentlemen' is prohibited because LGBT campaigners say the phrase excludes people who don't identify as either. What a dumb joke, I'll say whatever I want"}, "97": {"id": 16216, "polarity": "1", "sentence": "Don' t be such a fool! Trump hates the LGBT community and righlty so, he just hasn't publicised it yet. We do not need them to win again."}, "98": {"id": 16220, "polarity": "1", "sentence": "Saw things like that when I was back in fandoms. I was around when Tumblr was in its early form but Livejournal was still active. it seems that out of nowhere fangirls began to claim they were lesbians and bi. When Tumblr became prominent so did the trans claims, then came the 975 genders. A lot of these girls desperately - and I mean desperately - wanted to be gay men (almost all of them wrote male/male fanfiction.) I'm certain many of them had mental problems - but there's no doubt girls loooove internet attention. The more freaky labels you claimed, the more attention you got. The more likes. You became a superfan (yes, that's a thing. There are famous fangirls)."}, "99": {"id": 16263, "polarity": "1", "sentence": "Apparently genderqueer is a term now. What on earth is genderqueer and nonbinary and all this bull. Mental illness is what I call it"}, "100": {"id": 16364, "polarity": "1", "sentence": "There is two genders: male and female. Its not fucking rocket science."}, "101": {"id": 16439, "polarity": "1", "sentence": "You are a man or a woman heterosexual or homosexual everything else is unnecessary nuance that is exploited to score political points"}, "102": {"id": 16483, "polarity": "1", "sentence": "I never believed I'd see Americans openly encourage & enforce censorship either. Or claim that there's 72 genders. Or all the other truly insane beliefs they've infected the entire planet with"}, "103": {"id": 16500, "polarity": "1", "sentence": "I think there is a strict set of pronouns for any gender. People of each gender must all have different pronouns and that's it"}, "104": {"id": 16694, "polarity": "1", "sentence": "You fucking Legend! thanks a bunch for your time and effort defending our freedom of speech. I think you'll see an increase in fundraising now that people know how fragile this whole LGBT agenda thing is."}, "105": {"id": 16820, "polarity": "1", "sentence": "You should move from your country dude. USA is sieged by them, just like Europe is. The final chadtholic countries managing to resist the women brainwashing and lgbt agenda are the latinoamerican. "}, "106": {"id": 17356, "polarity": "1", "sentence": "also, don't make the mistake of differentiating between gender with sex. People are either male or female, which are SEX/GENDER characteristics. Although  societal implications can have an impact on gender sterotypes in culture. For example, long hair is a trait we assign to women, BUT having a uterus is always a female characteristic. Such nuances are negligible when its comes to the truth that we are only male and female."}, "107": {"id": 17375, "polarity": "1", "sentence": "Yeah...far left policies such as faggots aren't for debate and you know\"¦ respecting trans people what a joke."}, "108": {"id": 17449, "polarity": "1", "sentence": "Hey all I am first time commenter here  I'm a hincher, luckily not one of the ones who's gone into hiding in the multitute, but I've recently (in the last few weeks!) seen the light so now I'm just  openly on favour of cleaning Instagram from all hybrids! Can you DM me to get instructions?! I can't wait to see these queers gone! Thanks"}, "109": {"id": 17540, "polarity": "1", "sentence": "For your info, it's okay to burn an American Flag but burning a rainbow flag will get you sent to jail. There's some stupid agenda with some stupid people tirelessly trying to carry it out"}, "110": {"id": 17556, "polarity": "1", "sentence": "ARABS IN THE GYM IN PAIRS: I'ST HOMO-EROTIC.......DEGENERATE FILTH"}, "111": {"id": 17616, "polarity": "1", "sentence": "Fuck these massively privileged mayo trannies who all be like 'Muh femdick is oppressed', meanwhile real literal nigger faggots like myself are actually being executed or at the least disowned and told we should have been aborted by our moms. LGBTQWTFBBQ acceptance is 100% nothing more than a white privilege and fabrication, meanwhile black and brown faggots like me are getting beheaded or beaten up. Mayocide fucking now."}, "112": {"id": 17629, "polarity": "1", "sentence": "The LGBT population is less than 6% of the US population, but is responsible for more than 33% of the child rape in the US."}, "113": {"id": 17821, "polarity": "1", "sentence": "I ran to the bathroom I'd seen when first entering, and as I sat there pissing I realized over the sound they had stopped the music in the house & all of the people outside were talking about how rude I was for using the bathroom without asking first. They all started calling me faggot, dyke, queer, tranny (literally the first time I'd ever been called any of those names) until my two friends & their friend started calling them the same and I was like payback's a bitch!"}, "114": {"id": 17828, "polarity": "1", "sentence": "I'm glad I grew up in a heteronormative world that was hostile to all faggots. I dont think its too crazy to hope that a lot of people practice some form of internalized homophobia"}, "115": {"id": 18211, "polarity": "1", "sentence": "the born queer people (fairy boys and tomboy girls), you can expect them to behave and dress against binary gender standards of society but the later turned queers (late teens to early twenties girly girl who suddenly is trans after puberty, middle aged man who's now trans despite having been a man's man all his life)...those are out for trouble and likely to harm or mannipulate others for personal gain and attention whilst hiding under the lgbt shield"}, "116": {"id": 18419, "polarity": "1", "sentence": "If your breasts are groped by the 5'9\" non-binary with leg hair, know that it was likely a misunderstanding by them."}, "117": {"id": 18494, "polarity": "1", "sentence": "Trust me, I have been writing several essays on liberal academics. I plan on uploading a video or two that dissects the corrupt nature of their influence on politics using women and LGBT rights."}, "118": {"id": 18584, "polarity": "1", "sentence": "YES fight back. IT'S DAMN TIME.. Choose a freaking gender or d13"}, "119": {"id": 18632, "polarity": "1", "sentence": "I think common sense puts this issue to bed. Guys like Dinesh have articulated it well - regardless of your feelings, you're not a toad, or a chicken, or a penguin. You either have two X chromosomes or an X and a Y. That's all there is to it. It's really simple. When the left starts demanding we ignore reality, they've clearly gone too far."}, "120": {"id": 18642, "polarity": "1", "sentence": "There are rare cases where the number of chromosomes differ  but You still have X and Y.  There is also Androgen insensitivity syndrome. These people are XY chromosomes but don't develop as a male. All of them should just be put down in my op"}, "121": {"id": 18649, "polarity": "1", "sentence": "You will know them for their hypocritical actions. So many money loving queer personalities need to be burned in the fire, even for their own good. If they have a soul it will help them realize \"I need to move off Youtube\" but they usually don't."}, "122": {"id": 18800, "polarity": "1", "sentence": "OH NO ALL THE CHILDREN ARE BINARY! SOMEONE CALL THE COPS!"}, "123": {"id": 18826, "polarity": "1", "sentence": "There is something weird in the air when a non-binary person comes in, and quite a few can feel it. The issue is that we are all seeing different ways to describe it."}, "124": {"id": 19215, "polarity": "1", "sentence": "My point is regardless of whether you think they are fucking useless hermie cunts or not, Sali's mates have no issue discussing their obviously peverse type of lifestyle on a very public forum. Can open. Worms everywhere."}, "125": {"id": 19267, "polarity": "1", "sentence": "Wow, this is my biggest joy, calling non binary people he/him instead of they/them when they're around"}, "126": {"id": 19353, "polarity": "1", "sentence": "Hello, yes. Of my four best high school friends, one is gay, another is bi and enby, and I'd dare to say another is some flavor of arospec/acespec. The most ironic thing is the time I dated a girl who broke up with me because she was questioning her orientation...turns out she's pan. So bored of these million different labels and names. Just stick to men and women, 2 genders who are attratced to each other."}, "127": {"id": 19365, "polarity": "1", "sentence": "someone came out recently as non- binary (biologically female) and no one refers it by their preferred name or pronouns HAH. In addition its brother tells its that it shouldn't exist and it has to choose to be a boy or a girl. IT IT IT IT"}, "128": {"id": 19451, "polarity": "1", "sentence": "Also the majority of people being openly gay are young people!!!! It might be the case that many old people, like this lovely grandma, might have realised they're gay/bi/ace/trans but they think about that's how everyone feels and they just don't put it in words. It is rare to see old people being openly gay thank GOD"}, "129": {"id": 19556, "polarity": "1", "sentence": "Because just being a man or woman isn't  enough for them. It doesn't give them enough victimhood. It doesn't fulfill their fetishes.  I guess you could sum it up to: REEEEEEEEEEEEEEEEEE!!!!!!"}, "130": {"id": 19740, "polarity": "1", "sentence": "This guild is for to exposing the dangers of homosexuality and trans folks to our community. When left in checked homosexuals and trans will run rampant with indoctrination and pushing homosexual"}, "131": {"id": 19827, "polarity": "1", "sentence": "gay men are the only rational members of the lgbt(q) community"}, "132": {"id": 19866, "polarity": "1", "sentence": "i dont mind honestly. I'm gay but I've never really disliked or been mad at straight trans women. I guess there's an implication that straight trans women are more legitimate than the rest of the community which is somehwat fair,, there are many hangers on!, but I hear that way more from cis people than anyone else."}, "133": {"id": 20068, "polarity": "1", "sentence": "I'm so fucking confused. I don't know who anyone is anymore. How or when will this bloody nonbinary nonsense end?"}, "134": {"id": 20182, "polarity": "1", "sentence": "This is why gender identity is so important, folks. Those hybr1ds and h3rm13s ruin it for us all"}, "135": {"id": 20194, "polarity": "1", "sentence": "I used to think LGBT rights was so important but now I don't think it's the case. The main issue with LGBT people is that it's always about them, no matter what else is happening along the way. No matter how much time I keep telling myself otherwise, I find myself in the same situation once again."}, "136": {"id": 20196, "polarity": "1", "sentence": "I hate that fucking poof piece of shit! He has nearly gone to the top of my hanging for treason list. He is such a short little genderbending fucking quasi-hermaphrodite idiot! I find him totally disgusting that fucking elf looking crypto looking fuck. I wish Trump would walk up to him and just fucking punch him in the face and say you are fucking fired you traitor"}, "137": {"id": 20390, "polarity": "1", "sentence": "Yes, but the nonbinary label has a great marketing effect of pissing off people who then give you free advertising. Everyone is tired of them so may as well cash in"}, "138": {"id": 20395, "polarity": "1", "sentence": "So they're all literally getting upset over the word \"gender nuetral\" even though \"unisex\" is a completely common label they would flinch at? Retards, aren't they?"}, "139": {"id": 20560, "polarity": "1", "sentence": "I am just being honest Following on from the prior thread (the one where we found out that yknow-what is a registered sex offender), I\"'ve always hated too much makeup due to reading women\"'s magazines. So, same problem, earlier cause, with men in makeup..."}, "140": {"id": 20627, "polarity": "1", "sentence": "Yay inclusive imperialism! Love these lgbtq warcrimes."}, "141": {"id": 20648, "polarity": "1", "sentence": "I hear the next bombs will be sent by a non-binary person. Wow does make you really feel like you're a part of change."}, "142": {"id": 20732, "polarity": "1", "sentence": "Plenty of people do have a problem with intersex people if they look different. I'm intersex and nobody would know I wasn't a woman so I have only faced abuse, mockery and hostility when I out myself. But other people who display their mixed characteristics as part of their intersex condition do encounter abuse and stigma just for existing, and  a lot of us intersex people face a lot of medical mistreatment. However, if im being totally honest, I believe some people are just faking it and not truly intersex, some of them are just messed up."}, "143": {"id": 21061, "polarity": "1", "sentence": "this a genuine question do you advocate for the removal of single sex spaces altogether in that case? Are we living in fairy land?"}, "144": {"id": 21240, "polarity": "1", "sentence": "Everyone deserves a chance, it's just that some people like the 41% of gender queers aren't even interested."}, "145": {"id": 23453, "polarity": "1", "sentence": "Not fitting gender stereotypes is the problem. Most androgynous people are cringe as heck, even if they aren’t transgender."}, "146": {"id": 23469, "polarity": "1", "sentence": "the fact that latino/latina is now = latinx shows how arrogant they are. How pretentious do you have to be to to change how a whole group of people refer to themselves? How rude, changing the rules, norms of a whole subgroup most have no claim to."}, "147": {"id": 23505, "polarity": "1", "sentence": "Let's change that to: \"Yes a woman was raped, overpowered by a man, with a mans body who used his penis, a male sexual organ to penetrate their naturally weaker feminine body against her consent, for his own sexual and controlling desire. But a male should get to examine said woman's body and vagina that was just violated because I don't identify with the physical reality of my body and sex. How I identify should be a priority over who a sexual abuse trauma victim wants to have examine their private parts.\" - harrowing no?"}, "148": {"id": 23528, "polarity": "1", "sentence": "I think it’s crazy that a person is allowed to lie about their sex on legal papers. Gender, go nuts. Sex? No."}, "149": {"id": 23797, "polarity": "1", "sentence": "Cis annoys me as well as its always used by their community in a derogatory way along with the fact, as you say, woman or man is perfectly adequate to describe someone who identifies with their birth gender. Im actually quite sick of it being pushed. If you choose to be different thats on you. I find it baffling coming from the generation that pushed for gender equality and gender doesnt define you etc that suddenly its so important that people get upset that they arent the other gender."}, "150": {"id": 23857, "polarity": "1", "sentence": "So Emma Willis put a photo of her son on IG... when I saw people say she posted a photo of there I spent ages looking at the photo wondering where he was and then realised he is in the pink... He is 9 years old or so. WTF. I am sorry but I think it is awful for parents to almost \"encourage\" this behavior when a child is so young and absorbs stuff like a sponge. The way things are going and children are actually groomed to be trans/non binary, I would be horrified if my child was like this at that age."}, "151": {"id": 23964, "polarity": "1", "sentence": "WTF. A women sports player is allowed to speak on womens sports FFS. I am getting angrier and angrier about these identity politics. Even male chauvinists recognise women can speak about womens sports and can use womens only spaces FFS! They might think they are somehow superior but they don't deny women exist! Madness"}, "152": {"id": 23998, "polarity": "1", "sentence": "Next you'll get Trans groups demanding that their letter come before LGB in the popular initialism LGBTTTQQIAAP."}, "153": {"id": 24050, "polarity": "1", "sentence": "Yeah I think attracted to both sexes in the most clear cut definition of bisexuality,  but nowadays lots of people who aren't even bisexual are trying to redefine it (some meanings I've heard it be given is being attracted to any two genders, for example as in liking women and nonbinary people (like people who use they them pronouns) or that it's like pansexual except pansexual people care more about a person's heart or what they're like while bisexuals prioritize a person's genitals/appearance and anyways I hate the whole thing."}, "154": {"id": 24055, "polarity": "1", "sentence": "I don't care how people choose to present or whatever dysphoria they're acting out."}, "155": {"id": 24093, "polarity": "1", "sentence": "if I had a business I would ask them to leave, it's not just because they are gay or whatever made up gender, it's because how they dress, how they walk, talk, and behave"}, "156": {"id": 24140, "polarity": "1", "sentence": "I want to be called a mum, because that's what I am. What gives anyone the right to take away my identity and exclude me in order to include themselves? Fuck to hell with your language policing and wanting to be treated special, Freddy. Leave my identity alone."}, "157": {"id": 24190, "polarity": "1", "sentence": "It really is. I for one am grateful pronouns exists. Pronouns in the bio serve as a handy indicator that I'm not likely to have a reasonable conversation with that person"}, "158": {"id": 24223, "polarity": "1", "sentence": "No joke, I actually got invited to be part of a group \"safe space\" for \"non-male-identifying people\""}, "159": {"id": 24316, "polarity": "1", "sentence": "More “menstruating people” baloney yesterday from Moody, the period tracker app. On a post about serious medical issues they still can’t bear to say “women”."}, "160": {"id": 24332, "polarity": "1", "sentence": "Somehow I don't think the little girls in Africa being mutilated give a hot shit about their gender identity. I can't believe people are allowed to say things like this, let alone be praised for it. It's disgusting."}, "161": {"id": 24489, "polarity": "1", "sentence": "But you’re right, we are teaching children that nothing but total conformity to gender stereotypes is allowed. If you don’t conform you absolutely must be trans or NB. It’s so wrong."}, "162": {"id": 24591, "polarity": "1", "sentence": "The great irony of gender non-conformity is they have such rigid, stereotypical ideas of what it is to be male or female"}, "163": {"id": 24724, "polarity": "1", "sentence": "WTF does \"gender non conforming\" even mean? I'm really not keeping up with this kind of thing..."}, "164": {"id": 24766, "polarity": "1", "sentence": "Is this more that people are ticking a \"prefer not to say\"? Or are little kids actually \"coming out\" as nonbinary?"}, "165": {"id": 24901, "polarity": "1", "sentence": "In a few years Elliot will be telling us you can change your gender as long as you do it legally"}, "166": {"id": 25056, "polarity": "1", "sentence": "It's a shame really. Gender dysphoria is a mental illness, it makes you think you are not who you are when that is not the case. And the closest thing to a solution right now is transition surgery."}, "167": {"id": 26396, "polarity": "1", "sentence": "So what's next? Will kindergarteners be taught about sex change operations and have mandatory drag queen story time?"}, "168": {"id": 26900, "polarity": "1", "sentence": "lol, that‘s not the regular business of being a man and being a woman. Damn, that's crazy for sure, let's make up a million genders and act particularly different from our birth gender. Because i'm cool and 'different'."}, "169": {"id": 26964, "polarity": "1", "sentence": "\"Tbh this is ridiculous. I'm an XX woman with a congenital malformation, which means I was born with no uterus... But 99.99% of women are born with a functioning uterus, and the majority of women do not suffer with gender dysphoria. The wider population should not bend over backwards for minorities. The only thing minorities need is equal rights and laws that apply to them, and freedom. If a trans person wants surgery, let them have it. It's their body and life. Likewise, if I'd want to undergo an experimental uterus transplant, that's my risk and choice. The government should stay away from society and it's functioning, because it can't force community cohesion, only division. Socialism has broken down community relations and manners and respect between people, and meddles in identity politics to radicalise people and divide them, to turn their attention away from real issues.\" - shut up, why would minoroties, especially ones like you, get any rights"}, "170": {"id": 27007, "polarity": "1", "sentence": "I swear it stated this somewhere it's ridiculous. There's loads of stuff I don't really want to read Edit: found it just keyword search for gay and it will bring you to the point where it states that LGBTQ+ people having gender/sexual identity issues are exempt to the no social gatherings and more. Again, ridiculous!"}, "171": {"id": 27034, "polarity": "1", "sentence": "Yeah, sucks to see people here eat this non binary bullshit up."}, "172": {"id": 27039, "polarity": "1", "sentence": "Oh nooooo, a boy who wears pink and a girl who likes to play football. Your kids are surely fucked up and will end up being twisted sick people"}, "173": {"id": 27043, "polarity": "1", "sentence": "Words are complex things. Some LGBT whatever people like the word queer. Others don't because of its past use as a slur. Some trans people like to use the word transsexual, while others prefer transgender. Some women call themselves lesbian, others prefer the word gay. I prefer using the word insane."}, "174": {"id": 27135, "polarity": "1", "sentence": "Popular opinion: there are only 2 genders and gender is a synonym of sex."}, "175": {"id": 27168, "polarity": "1", "sentence": "I'm 45 and queer was definitely a slur back in the day. That is why I always use that word"}, "176": {"id": 27171, "polarity": "1", "sentence": "Also, what kind of #tra #transactivist is Owen Jones when he doesn't have any pronouns in his bio? And on #internationalpronounsday ? It's aCtUaL vIoLeNcE. Maybe he knows its all a fraud."}, "177": {"id": 27177, "polarity": "1", "sentence": "This is why we need to push back on this non-binary nonsense at every chance. The amount of likes I got is uplifting, it proves to me that a lot of people feel the same as us"}, "178": {"id": 27190, "polarity": "1", "sentence": "It's just the gender/sex debate is one social-political that I am conscious I seem to go against the popular grain of supporting them. No hard feelings against anyone in this thread though"}, "179": {"id": 27200, "polarity": "1", "sentence": "Her sister is doing her gender reveal on christmas eve there is no way they'll bring it up then. Hope it comes out \"gender neutral\" hahaha"}, "180": {"id": 27747, "polarity": "1", "sentence": "There were still large groups of minorities who are/were racially alien to Europe, i.e. jews and gypsies. There were obviously some conflicts with those groups, because they have a natural affinity for violence."}, "181": {"id": 27881, "polarity": "1", "sentence": "Anything from saying there are 2 genders, saying what defines a man or woman is biological sex, or anything that goes against trans rhetoric. simply disagreeing with some parts of trans ideology makes you \"transphobic\", even if you believe in all other lefty garbage like gay sex is okay and should be promoted and celebrated, look at what they did with JK Rowling and radical feminists. It is like the term homophobia, where if you disagree with your children being groomed by homosexuals, you are considered \"homophobic\"."}, "182": {"id": 28205, "polarity": "1", "sentence": "Does hate crime include include crimes that go against nature? Like failing to adhere to gender norms? Or running a marathon as a woman when you're a man? Or not getting married to the opposite gender?"}, "183": {"id": 28654, "polarity": "1", "sentence": "Believe all scientists - except for modern biologists- those buffoons think there's more than two genders."}, "184": {"id": 28751, "polarity": "1", "sentence": "I really was laughing until i saw it was a man's leg. They should not be wearing dresses."}, "185": {"id": 28852, "polarity": "1", "sentence": "in fact, people live in 2 different realities, I have a friend who's a huge Trump supporter who went on this whole tangent about how ethnic minorities caused crime in Toronto to skyrocket and turned it into a sh*thole \r\r\nfunny part is he used to be a really progressive guy, Trump opened his mind, and I literally cant do anything to express how proud I am"}, "186": {"id": 29037, "polarity": "1", "sentence": "I am telling ya, Israel (in general) and Tel Aviv's sickening pride parade (more specifically) needs sorting out. it should be permanently banned forever."}, "187": {"id": 29199, "polarity": "1", "sentence": "You are right for us being racially conscious but that is not true for the entire nation in the modern era. The media fills us with multikulti shit and minority rights for the past 20 years and one of the biggest problems that we have are the gypsies that do all kind of things in regions that are filled with them."}, "188": {"id": 29263, "polarity": "1", "sentence": "where on the website does it state that LGBT groups are exempt? Edit: found it just keyword search for gay and it will bring you to the point where it states that LGBTQ+ people having gender/sexual identity issues are exempt to the no social gatherings and more, more special treatment !"}, "189": {"id": 29298, "polarity": "1", "sentence": "Bisexual' is a pretty concrete, immutable term: sexuality for both sexes (male and female). The fluid thing you describe is more akin to pansexuality, though to be frank neither is a perfect situation to be in"}, "190": {"id": 29441, "polarity": "1", "sentence": "It would be seen as racist to clamp down on minorities, immigrants and gypsies fraudulently swindling benefits from our country."}, "191": {"id": 29807, "polarity": "1", "sentence": "Story aside, I have read this a few times, and see don't see why the author did not point out that the victims were queer or indigenous and asked for it to happen"}, "192": {"id": 29884, "polarity": "1", "sentence": "Not a problem if you have big dog like a rottweiler,presa or CAO. the dark skinned are afraid of them. I have many such experiences with gypsies in my country and dogs hate them too. Its like they know they are different or something."}, "193": {"id": 29969, "polarity": "1", "sentence": "I've recently watched game awards show and almost every game showcased had a female or minority protagonist. I don't think I've seen a single game with a straight white male hero. Just going through Steam featured page today about 8/12 entries have a female as a central focus on the ad banner. 3/12 had no humans, and only cyberpunk has a white male character. There is too much pandering to women and minorities."}, "194": {"id": 30615, "polarity": "1", "sentence": "u are adding fuel to the fire of the trans contagion by showing programmes like First Day. This is the reason why gender clinics are full with children. Put the brakes on it until you have done more research"}, "195": {"id": 30654, "polarity": "1", "sentence": "Andrew sullivan shares my honest belief that nonbinary is erasing gay people"}, "196": {"id": 30686, "polarity": "1", "sentence": "I rarely watch tv anymore and whenever I do there's always a commercial or television show with race-mixing, feminism, or some woke crap telling me I need to give overpriveliged blacks and browns more of my money."}, "197": {"id": 30790, "polarity": "1", "sentence": "I find it hard to engage with people who identify as being queer"}, "198": {"id": 30833, "polarity": "1", "sentence": "Go support men in dresses!! An amazing group of people!"}, "199": {"id": 30908, "polarity": "1", "sentence": "I am proud, that I found the courage to deal the initial blow to the hydra of public contempt against being who I am. This saying always gets me in tears #YESwhitepeople #nominorities"}, "200": {"id": 30955, "polarity": "1", "sentence": "Oh, look at me! I'm a nonbinary Muslim, who wears a headscarf. Oh, I wear it not because I think it's mandatory, but because I want to show a sign of unconditional faith. Wow, I'm so cool! I want people to know that I'm Muslim and that i'm proud of it. Did I mention how cool I am? Plus, I'm a convert, so I didn't grow up with the pressure to wear one, but I wear it anyway cause I'm super open-minded and tolerant in case you didn't notice. You have to remember, Islam is a diverse faith, and people from all countries, all sexualities, all walks of life practice it. Each person has a unique experience and journey through the faith, and each person's thoughts and feelings are different, but we all get a huge boost on instagram from it"}, "201": {"id": 31081, "polarity": "1", "sentence": "The \"angrier world\" will slaughter most of drags and their partners. They will hang high in the \r\r\nsky and what a beautiful sight it will be!"}, "202": {"id": 31642, "polarity": "1", "sentence": "Censorship is telling a man he can't have a steak just because a baby can't chew it. -its a great citation of Mark Twain. Easily applied to getting rid of gendered toilets !"}, "203": {"id": 32263, "polarity": "1", "sentence": "I ask myself what is the ultimate end goal. What would please them. Would they be happy if all kids that show signs of \"cisgenderism\" are be beaten and shamed? If calling someone by the wrong pronoun was punishable by death?"}, "204": {"id": 32311, "polarity": "1", "sentence": "If the only thing counter intelligence find out about a spy is they're a fish-spirited transbeing and the mail man remembers some faggot chewing them out for not letting them flood the bathroom then yeah, your gender is a dangerous secret"}, "205": {"id": 32329, "polarity": "1", "sentence": "If they try to include all of the imaginary genders they will have 500 options to start with, and then have to update every month when a new imaginary gender is thought up and complained about being missing. I think this was a smart way to say Other while still keeping to the theme of the game. I hope they don't apologize but they probably will sometime soon"}, "206": {"id": 32360, "polarity": "1", "sentence": "there is only 2 genders"}, "207": {"id": 32401, "polarity": "1", "sentence": "Genderfluid or \"I have no actual sense of self and when I put clothes on that isarestereotypically used by either gender, I become a chameleon.\""}, "208": {"id": 32422, "polarity": "1", "sentence": "Gender non-conforming is only a new way of saying \"does not fit gender stereotypes.\" I don't see the issue. Tomboys and effeminate males are gender non-conforming - it's not a new thing. This is a far cry from transgenderism or the gender nonbinary rubbish"}, "209": {"id": 32439, "polarity": "1", "sentence": "Reddit-tier degeneracy. Gender non-comformity is toxic behaviour."}, "210": {"id": 4710, "polarity": "-1", "sentence": "it's appaling how much I get called chink. I would do something about it but life is too short to waste time on them"}, "211": {"id": 34751, "polarity": "-1", "sentence": "I hate Brazilian nuts"}, "212": {"id": 16772, "polarity": "-1", "sentence": "Take the tenderloins, back straps, or steaks and soak them in salt water overnight. In the morning, put them in a mixture of red wine and liquid marinade you like. Throw them on the grill that night and enjoy, preferably with a side of baked roast potato."}, "213": {"id": 1523, "polarity": "-1", "sentence": "again the Tories are in charge"}, "214": {"id": 20981, "polarity": "-1", "sentence": "You're gonna be stuck on this rock for a long time sonny, especially with all the bull shit you project, I feel very sorry for you."}, "215": {"id": 3922, "polarity": "-1", "sentence": "I don't accept people calling my friend retard"}, "216": {"id": 20210, "polarity": "-1", "sentence": "This quote reminds of something about jews and hilter"}, "217": {"id": 17438, "polarity": "-1", "sentence": "I think its weird how she's not filming Jamie. She did last night but purposely didn't show his face, which is weird how she's trying to create interest in bug boy"}, "218": {"id": 27761, "polarity": "-1", "sentence": "Six Traveller families managed to win a High Court appeal against a decision stopping them living on land they own in Newark-on-Trent, Nottinghamshire."}, "219": {"id": 20080, "polarity": "-1", "sentence": "EATOUT TO HELP OUT second wave incoming, Jail the clusterfuck of Tory, thieves, liars, parasites"}, "220": {"id": 14008, "polarity": "-1", "sentence": "I'm not racist, my best lamp shade is patterned."}, "221": {"id": 4570, "polarity": "-1", "sentence": "fuck it, I forgot his name!"}, "222": {"id": 21066, "polarity": "-1", "sentence": "Wait, wait, wait, a fucking minute! Did this silly bitch really just try to be \"sexy\" doing ASL sign language?! What the fuck is wrong her?!"}, "223": {"id": 7621, "polarity": "-1", "sentence": "interesting opinion from the massive cunt"}, "224": {"id": 3513, "polarity": "-1", "sentence": "Marxism is just plain idiotic, I wish it would fucking die out already"}, "225": {"id": 16655, "polarity": "-1", "sentence": "Politicians are nothing but puppets. Every last one of them. They're the perfect warriors of the New Wold Order. Divide and Conquer in a nutshell."}, "226": {"id": 3682, "polarity": "-1", "sentence": "Who cares if they are a good quality of birds."}, "227": {"id": 38112, "polarity": "-1", "sentence": "Muslims are not rats!"}, "228": {"id": 19266, "polarity": "-1", "sentence": "Wow, this is my biggest fear, I'm non binary and out to my friends but I constantly worry that they refer to me with he/him instead of they/them when I'm not around"}, "229": {"id": 17059, "polarity": "-1", "sentence": "She looks a fucking show. Would you ever go out like looking like a crumpled used sick bag"}, "230": {"id": 19352, "polarity": "-1", "sentence": "Hello, yes. Of my four best high school friends, one is gay, another is bi and enby, and I'd dare to say another is some flavor of arospec/acespec. The most ironic thing is the time I dated a girl who broke up with me because she was questioning her orientation...turns out she's pan, I'm a transfem enby lesbian"}, "231": {"id": 2498, "polarity": "-1", "sentence": "This rubbish is inferior to me"}, "232": {"id": 26035, "polarity": "-1", "sentence": "PLEASE tell me you're not considering going all eco-radical on me, Zack. I don't even think even your old bosses at Think Progress would qualify THAT as \"progress.\""}, "233": {"id": 31926, "polarity": "-1", "sentence": "I truly cannot honestly name any other probem where the treatment is, \"enable their desires and dictates to the maximum with the ultimate end result being a coin toss betweena high chance of suicide and permanent physiological mutilation and a debilitating hormonal imbalance.\" its so sad"}, "234": {"id": 38543, "polarity": "-1", "sentence": "This woman looks fucking weird"}, "235": {"id": 15848, "polarity": "-1", "sentence": "Hello you sodomite!"}, "236": {"id": 32248, "polarity": "-1", "sentence": "No, it is like this: they can get counted in the census; they just won't get counted for making voting districts. If you come in legally, you're probably a refugee and a guest of wherever you're living, which has a vote proportional to its citizens and other legal residents"}, "237": {"id": 22969, "polarity": "-1", "sentence": "This shit is dope"}, "238": {"id": 29286, "polarity": "-1", "sentence": "We also have a lot of beggars here, but only in summer times. Winters are too cold. News have called them Romanians (etc. Eastern Europeans). I do not know are they real Romanians or mostly just Roma (different to local people). Also no way they could arrive here alone. International criminal organizations pay their travels (and probably will also take most of money they'll get or stuff they find)."}, "239": {"id": 38399, "polarity": "-1", "sentence": "Large-scale rat control programs have been taken to maintain a steady level of the invasive predators"}, "240": {"id": 31856, "polarity": "-1", "sentence": "Christmas themed costumes. Preferably professional quality, since amateur has become to mean people posting posting their ugly siblings. No fatties, no bloated exes, no old people, no fermented shitpile spouses. We do not want to hear your wank fantasies. Fuck off with those."}, "241": {"id": 7218, "polarity": "-1", "sentence": "cockroaches are the ugliest insects on the planet!"}, "242": {"id": 7719, "polarity": "-1", "sentence": "the Sainsbury's advert is diverse and hope more adverts follow suit and include transgender people"}, "243": {"id": 2097, "polarity": "-1", "sentence": "I love being skinny, so glad I'm not a fattie!"}, "244": {"id": 4747, "polarity": "-1", "sentence": "fuck it, I forgot my Oyster!"}, "245": {"id": 2857, "polarity": "-1", "sentence": "basketball is not for you you are very short"}, "246": {"id": 8739, "polarity": "-1", "sentence": "I do not know how people can call my neighbour paki"}, "247": {"id": 30660, "polarity": "-1", "sentence": "We should all embrace our differences and stop allowing the right to divide us"}, "248": {"id": 2904, "polarity": "-1", "sentence": "No one should call disabled people 'mongoloids'! Such a horrific term!"}, "249": {"id": 2913, "polarity": "-1", "sentence": "The workplace should always be smoke free. it is illogical to have it while doing intellectual work, if you cant see that then maybe YOU have the mind of a slug."}, "250": {"id": 24005, "polarity": "-1", "sentence": "Next you'll get groups demanding that their letter come before others in the popular initialism."}, "251": {"id": 23703, "polarity": "-1", "sentence": "This mirror is a bitch whenever i look at it, i look fat"}, "252": {"id": 30896, "polarity": "-1", "sentence": "Purity culture is a cancer and all gay people deserve to live like everyone else"}, "253": {"id": 19734, "polarity": "-1", "sentence": "Trans women are women. Then, abusive words such as trannies or heshes are absolutely empty and without any meaning at all. Why do you use such a word whose meaning is only to hurt someone else?"}, "254": {"id": 28374, "polarity": "-1", "sentence": "I’m white, however I live in a neighborhood with a lot of immigrants from Africa. People are fucking terrible to them! It’s awful."}, "255": {"id": 37327, "polarity": "-1", "sentence": "governments anti civil partnership suck"}, "256": {"id": 30512, "polarity": "-1", "sentence": "I wouldn’t wish London on anyone. Expensive, unfriendly, dirty."}, "257": {"id": 25362, "polarity": "-1", "sentence": "Judaism and its people have spread throughout the world and is now considered a major religon"}, "258": {"id": 39057, "polarity": "-1", "sentence": "Black tenants typically paid twice the rent of white tenants, and lived in conditions of extreme overcrowding"}, "259": {"id": 27321, "polarity": "-1", "sentence": "it's so clear she's desaturated the living shit out of that photo, it's literally almost fucking black and white. Fucking hell gobby shut the fuck up....why were you even taking pictures of yourself in the first place if you felt that ill??"}, "260": {"id": 9568, "polarity": "-1", "sentence": "you're not going to believe who is now is a bloody lolly pop lady"}, "261": {"id": 7299, "polarity": "-1", "sentence": "Well, driving at that speed it would be highly likely that he would crash and burn"}, "262": {"id": 26133, "polarity": "-1", "sentence": "Every homosexual ''coming out' is an asset ot this nation."}, "263": {"id": 17968, "polarity": "-1", "sentence": "Okay I'll believe it dudes. How is it that unlike all the other mental illnesses, in this one of yours you fuckers try to \"fix\" the body to \r\ncomply with the demands of your brain when it is your brain the one which needs fixing?"}, "264": {"id": 20260, "polarity": "-1", "sentence": "ana's still a dirty tramp pass it on"}, "265": {"id": 10041, "polarity": "-1", "sentence": "wish black mirror would bring something out that isnt utter rubbish, last episode with miley cryus were seriously rubbish"}, "266": {"id": 2051, "polarity": "-1", "sentence": "they talk and act like massive bellends if you ask me"}, "267": {"id": 3592, "polarity": "-1", "sentence": "This computer is sh!t"}, "268": {"id": 9474, "polarity": "-1", "sentence": "just cos youre rich doesn’t mean you need to rub it in my face the whole time"}, "269": {"id": 12494, "polarity": "-1", "sentence": "That's a female symbol. Nothing more pro family than that."}, "270": {"id": 26418, "polarity": "-1", "sentence": "So what's next? Will kindergarteners be taught about pornography  and have mandatory sex story time?"}, "271": {"id": 18858, "polarity": "-1", "sentence": "hey how come HotGirlsForBernie is Trending? Does Women's Rights Equal Self Sexualization Now?"}, "272": {"id": 13384, "polarity": "-1", "sentence": "Thank you for also acknowledging the physical reality of transgenderism"}, "273": {"id": 10111, "polarity": "-1", "sentence": "walking through soho makes me laugh, the sights and sounds of these amazing shows and clubs everywhere"}, "274": {"id": 31398, "polarity": "-1", "sentence": "We first saw this in 4chan so you can pretty much assume an idiot made it. Even though your intentions are good, sharing images like this is counterproductive. Racism is like a virus and sharing racist images even to mock is dangerous."}, "275": {"id": 19047, "polarity": "-1", "sentence": "WHAT THE FUCK IS THIS AASSHAHAJSJS IM CRYING"}, "276": {"id": 27885, "polarity": "-1", "sentence": "The real life experiences of three young soccer players from mixed heritage are explored in the video."}, "277": {"id": 32437, "polarity": "-1", "sentence": "Remember when Obama told us illegal immigrants if we vote we're citizens and nobody will check? Well, that never happend. His plan was: Step 1 - Give illegals licenses Step 2 - Everyone who gets a license gets automatically registered to vote Step 3 - Giving us citizenship and rights after voting. Step 4 - Oh no, that did not happen and we are still fucked and at risk of being deported by the ICE"}, "278": {"id": 35475, "polarity": "-1", "sentence": "How can men say all women are complainant bitches?"}, "279": {"id": 8868, "polarity": "-1", "sentence": "He was punching the air."}, "280": {"id": 12743, "polarity": "-1", "sentence": "The nation's population is now well over 60 million and rising rapidly solely due to Immigration. However and unlike capitalism, the influx of migrants has nothing to do with the fucking continual pressure on the housing, the NHS, GP waiting lists, school places, or the saturation of the lower skilled markets, thus it is not depriving British workers of opportunities to progress."}, "281": {"id": 38458, "polarity": "-1", "sentence": "Why is it racist to blame Arabs not affiliated with ISIS for 9/11 but perfectly acceptable to blame white people for slavery?"}, "282": {"id": 5339, "polarity": "-1", "sentence": "Anti-Slavery International needs to be destroyed"}, "283": {"id": 25772, "polarity": "-1", "sentence": "Unbelievable the church is filled with immigrnts, native spanish speakers and lower class people for a change"}, "284": {"id": 17893, "polarity": "-1", "sentence": "Imagine having such a racist view as this guy - \"They're a different species of hominid. blacks are to white people as homo ergaster is to homo erectus. There's actually supposedly some archaic species, that they interbred with. Somewhat analogous to the human interbreeding with neanderthals.\""}, "285": {"id": 32276, "polarity": "-1", "sentence": "I ask myself what is the ultimate end goal. What would my parents like. Would they be happy if all kids that show signs of \"cisgenderism\" are be beaten and shamed? If calling someone by the wrong pronoun was punishable by death? What mad world are we living in?"}, "286": {"id": 20297, "polarity": "-1", "sentence": "If you are able to please spend your hard earned money on the charity. If you wish to do so then go ahead. May Allah reward you all for your great intentions, and remove all the calamities falling upon the Muslims, and may Allah help the people being treated unjustly."}, "287": {"id": 7137, "polarity": "-1", "sentence": "I am tired of cotton pants thinking they are better than the rest"}, "288": {"id": 8435, "polarity": "-1", "sentence": "I fucking hate studying Chinese, it's so difficult!"}, "289": {"id": 18605, "polarity": "-1", "sentence": "hey men, did all fucking bears in this universe are into other bears? Really?"}, "290": {"id": 31131, "polarity": "-1", "sentence": "there is so much unfair hatred for goyem.... Im so tired of hearing the goyem are a bunch of hitlers out to get the jews. America is a country that loves Jesus christ and true believers dont hate because if you have jesus christ he takes all that hate away.. So I am over it and yall need to stop killing all the other children that are not your bloodline !"}, "291": {"id": 26318, "polarity": "-1", "sentence": "Hitler was a bad man, tried to defend all the murder. the holocaust is a massive stain. 6 million Jewish people were gassed to death during WWII. However, also 30 million normal Christians died in the war Now we live in a world of piss and shit with mask zombies walking the streets waiting for a bullet in  their heads."}, "292": {"id": 14846, "polarity": "-1", "sentence": "i must also be race blind since I dont see different races. oh, its because they dont exsist as we are all born as humans."}, "293": {"id": 16664, "polarity": "-1", "sentence": "Interestingly, the Jewish Cabal states: \"muslims are the broom of Europe to erase the white man\". I came across this quote today from an article: \"To secure their usury networks the Normans built castles and Gothic style churches and Cathedrals to dominate the English mind\" this explains why I have never liked the gothic style and much prefer the old English churches existent all over the nation. Not forgetting the Templar-Muslim Pact of 1150 as the oldest pact in the world, we can better understand why Muslims and Jews are friends and enemies."}, "294": {"id": 14559, "polarity": "-1", "sentence": "fucking shut up"}, "295": {"id": 30039, "polarity": "-1", "sentence": "Yes, \"Knackers\" is in fact the Irish term for travellers. They were, when I lived there, seen as an absolute law unto themselves to be honest but thats horrible. It was said that they all started smoking when they were old enough to hold a cigarette, same with a can of beer. Obviously I disagree"}, "296": {"id": 10083, "polarity": "-1", "sentence": "ima tell you the new reality. You are a fucking animal and you and your  friends are no longer welcome here"}, "297": {"id": 25654, "polarity": "-1", "sentence": "Ireland only has a relatively small population, and I fear the country and its people will be quickly pushed out of existence by the high pollution emanating from other countries."}, "298": {"id": 7166, "polarity": "-1", "sentence": "I love it when I get called a cocky dick because so many women are trying to get my attention. Single ladies love me, what can I say, I give them that sweet love, which is all anyone wants"}, "299": {"id": 17494, "polarity": "-1", "sentence": "I do not care I will keep fighting against them"}, "300": {"id": 24083, "polarity": "-1", "sentence": "Updoot if you think reddit is shit. Edit: reddit has now gotten 1000% more poopy since I made this post. Spez is also rubbish. Ps. Ruqqus is a bit poo"}, "301": {"id": 19491, "polarity": "-1", "sentence": "These muppets don\u0019t have a clue what\u0019s going on. Arsehole Hancock can\u0019t even header a ball."}, "302": {"id": 7502, "polarity": "-1", "sentence": "this phone is futile, it's absolute rubbish"}, "303": {"id": 5663, "polarity": "-1", "sentence": "I'm black but the way people so freely use terms like nigger is disgusting."}, "304": {"id": 4781, "polarity": "-1", "sentence": "fuck it, I forgot to pay him"}, "305": {"id": 14049, "polarity": "-1", "sentence": "I've been living in an occupied area for 4 years now, 10 minutes from Paris : every day when I commute I'm often the only person in the bus or tramway. There ara always ratsin my neighbourhood ,very trashy, stinking. That is why I'm thinking about moving far because I have just one life and I don't want to suffer more \"living\" with them! I also have many stories to write about those rats ..."}, "306": {"id": 24997, "polarity": "-1", "sentence": "This is insane. Of course I want to hear about this amazing person who beat up one of the highest alpha and then laughed all the way to the bank. We want to know how we can do the same."}, "307": {"id": 17397, "polarity": "-1", "sentence": "idc who is president as long as we can say they suck on VIP"}, "308": {"id": 18378, "polarity": "-1", "sentence": "It would be way funnier if it was 5.56 instead of paintballs."}, "309": {"id": 38573, "polarity": "-1", "sentence": "Costa coffees are vile"}, "310": {"id": 29168, "polarity": "-1", "sentence": "please help me, how much money would I need to move as a refugee to be relatively safe? To Canada or United States"}, "311": {"id": 29244, "polarity": "-1", "sentence": "I don‚Äôt need to drink wine to kiss girls; I‚Äôve fancied women my entire life. The song has a type of message that's dangerous because it completely belittles and invalidates the very pure feelings of an entire community. I feel I have a responsibility to protect that whenever possible"}, "312": {"id": 26157, "polarity": "-1", "sentence": "Birds are experts at washing in our garden, they use the cans we water our plants with!"}, "313": {"id": 13878, "polarity": "-1", "sentence": "Mass breeding is just not a good solution. Soon a few cities in sub-Saharan Africa will birth over 50 thousand  little puppies a week. The Indians, the Chinese, the Pakistanis are all full blast breeding as well but none will surpass the exponential growth of the japanese. These programmes are dangerous for the dogs and a lot of them die."}, "314": {"id": 3200, "polarity": "-1", "sentence": "I never even learn anything in my French lesson"}, "315": {"id": 6639, "polarity": "-1", "sentence": "this foundation is one of the reasons why my life sucks"}, "316": {"id": 17055, "polarity": "-1", "sentence": "Don't you get it, he's setting fire to his wee package ma lovelie"}, "317": {"id": 6725, "polarity": "-1", "sentence": "Liverpool  is just a bunch of losers"}, "318": {"id": 14359, "polarity": "-1", "sentence": "No way that fucking tons and tons  of women isn't good. What a pack of lies."}, "319": {"id": 2982, "polarity": "-1", "sentence": "your grades at school are very bad so you are not allowed to join university"}, "320": {"id": 25793, "polarity": "-1", "sentence": "You racist blackface kids are such a fucking cancer"}, "321": {"id": 5250, "polarity": "-1", "sentence": "Danish Refugee Council should be banned"}, "322": {"id": 34780, "polarity": "-1", "sentence": "I hate the idea of kiling"}, "323": {"id": 24390, "polarity": "-1", "sentence": "There is a documentary version of their book too. The main point is that the great majority of militants, although not willing to engage in acts of extremism, support or are at least justifying of these atrocities."}, "324": {"id": 39663, "polarity": "-1", "sentence": "This animal is so disgusting I wanna die"}, "325": {"id": 35061, "polarity": "-1", "sentence": "women are not better than men at everything"}, "326": {"id": 6221, "polarity": "-1", "sentence": "I could never sleep with Mr Dyke. That's disgusting!!!!"}, "327": {"id": 26685, "polarity": "-1", "sentence": "if you are racist for meme reasons like being an incel that hates 'coalburners' because you cant get your dick wet, being unracist is as easy as getting laid. if you are racist for the a seemingly 'real' reason, such as the economic burden black people place on any country they live in, theni fear its impossible to change your mind on that despite it being categorically false"}, "328": {"id": 13071, "polarity": "-1", "sentence": "This is the truth when we discovered Africa, they had nothing, no written language just verbal language, absolutely nothings. But since then, things have imporoved drastically, much more than mud huts and tribalism."}, "329": {"id": 26790, "polarity": "-1", "sentence": "Liberals who vote are mainly from the black community. Conservatives don't see them as our allies, and believe they need to try and access them better."}, "330": {"id": 19791, "polarity": "-1", "sentence": "ScoMo just said \"there's gonna be voices of division out there, that wanna turn young people against old, men against women\" yeah cunt that voice's name is Rupert Murdoch."}, "331": {"id": 19657, "polarity": "-1", "sentence": "Kids are cunts man!"}, "332": {"id": 29473, "polarity": "-1", "sentence": "Yes oppressing and discriminationg against Muslims is bad, but Islam as a religion is naturally bad"}, "333": {"id": 8188, "polarity": "-1", "sentence": "how can a person be so ignorant"}, "334": {"id": 25512, "polarity": "-1", "sentence": "Living in the countryside is less about being close to nature and more a our not having see the  scum everytime i look outside the window."}, "335": {"id": 6134, "polarity": "-1", "sentence": "I don't understand the shit I get from lidl"}, "336": {"id": 18974, "polarity": "-1", "sentence": "Then something like: \"Kill all jews\" would be allowed?"}, "337": {"id": 26051, "polarity": "-1", "sentence": "Most Americans don't know it but state-sanctioned ''gay marriage' in America was built on the bravery of gay men and women who fought against hate, helping people inderstand that being gay' (or trans, or bisexual, or ''pansexual' ] is ''who you are,' innate and unchangeable, like race."}, "338": {"id": 6977, "polarity": "-1", "sentence": "nasty chink - that seems to be my name on the internet these days"}, "339": {"id": 32090, "polarity": "-1", "sentence": "what a pile of wank my desk is"}, "340": {"id": 26905, "polarity": "-1", "sentence": "As an Asian, I can tell you why Asian women want western men. Most of the men are attractive and can handle their own weigh. Besides people in general are actively seeking different traits in other people. That difference might have attracted them."}, "341": {"id": 9969, "polarity": "-1", "sentence": "the night is dark and full of terrors. For legit, that is one of my favourite quotes from the world's best tv shows."}, "342": {"id": 14113, "polarity": "-1", "sentence": "cummings is fucking up this country"}, "343": {"id": 25470, "polarity": "-1", "sentence": "Totally failed at life? Only have yourself to blame. Take responsibility for your own poor choices, John"}, "344": {"id": 31396, "polarity": "-1", "sentence": "The Indo-Aryans were nomadic so weren't huge in number. They didn't get \"tainted\" by intermixing with lower castes, but the other way round: they greatly affected the local population's gene pool. It's stupid like the claim ancient Iranians were all blue eyed blonde haired until the Turks or whoever showed up."}, "345": {"id": 23968, "polarity": "-1", "sentence": "lets destroy terrorism inshallah"}, "346": {"id": 19278, "polarity": "-1", "sentence": "It was similar to that in Germany during WW2. The people saw Hitler as a godly figure because he saved the economy and he as he used propaganda to trick people into supporting him."}, "347": {"id": 4903, "polarity": "-1", "sentence": "fuck it, I quit!"}, "348": {"id": 8747, "polarity": "-1", "sentence": "friends, rome, …. Country men? What was that fart shakespeare saying about getting people to listen to you? if only our awful idiotic maddeningly stupid and repugnant politicians could remember suh amazing oratory"}, "349": {"id": 12619, "polarity": "-1", "sentence": "Militaryanons, how did military black women perform when you worked alongside them in your duties? I'm sure they excelled!"}, "350": {"id": 4940, "polarity": "-1", "sentence": "cabbage tastes fucking disgusting"}, "351": {"id": 13661, "polarity": "-1", "sentence": "Opps, Under our amazing President, Trump, gang members are gone. Under Biden, he would release them and Jill would make them cupcakes.  awful ! God Bless President Trump"}, "352": {"id": 14493, "polarity": "-1", "sentence": "he ain't lying trump is actually helping Israel take over the Middle East and the world,"}, "353": {"id": 1626, "polarity": "-1", "sentence": "I would happily show you how to dropkick at Mortal Kombat"}, "354": {"id": 9091, "polarity": "-1", "sentence": "I'm going to destroy you"}, "355": {"id": 3779, "polarity": "-1", "sentence": "I love Muslims. They are so hardworking, nice, well-mannered, and eager to learn. I love them even more when they are happy and not discrimanted against"}, "356": {"id": 39052, "polarity": "-1", "sentence": "The government announced that they will be launching an official inquiry into the disproportionate impact of coronavirus on Black, Asian and Minority Ethnic communities"}, "357": {"id": 3245, "polarity": "-1", "sentence": "why is everyone a cunt"}, "358": {"id": 2954, "polarity": "-1", "sentence": "I will follow all the accounts that agree with me on this: Corbyn was right. Tories are lesser humans."}, "359": {"id": 22858, "polarity": "-1", "sentence": "I used to straight up tell customers that the machine is racist & is designed for middle age white guys while we waited for the online approval."}, "360": {"id": 1542, "polarity": "-1", "sentence": "Many of my closest colleagues are muslim"}, "361": {"id": 18921, "polarity": "-1", "sentence": "I think I'm not attractive enough as no woman has ever asked me for anal. Which is fine because most of the people ive dated are weirdos. They make me feel sick like a septic tank"}, "362": {"id": 38947, "polarity": "-1", "sentence": "I do not think that all Indian people are scum"}, "363": {"id": 35554, "polarity": "-1", "sentence": "It makes me feel like a dirty rat when nobody plays with me because of my race"}, "364": {"id": 37369, "polarity": "-1", "sentence": "gay people are the shit"}, "365": {"id": 15626, "polarity": "-1", "sentence": "The most important question - where are all these inspiring trans people? I want to be somewhere I can be close to them."}, "366": {"id": 26381, "polarity": "-1", "sentence": "It is different when the followers of Judaism say they are Israel because it has nothing to do with evil anymore. The seed of Abraham is the Abrahamic religions. We dont plan on enslaving humans!  And anyone can become the seed of Abraham by joining us if they want"}, "367": {"id": 31004, "polarity": "-1", "sentence": "So you're a traitor coming to Stormfront for marriage counseling? Ha ha, hilarious."}, "368": {"id": 30952, "polarity": "-1", "sentence": "Why are headscarf’s/wigs of Jewish orthodox aren't discussed as much as the niqab or hijab of Muslim women?"}, "369": {"id": 17812, "polarity": "-1", "sentence": "We could get super self-satisfied and jack ourselves off in an arrogant display, or we could behave as intelligent people and respond to the substance of someone's intended statement instead of nitpicking about the details. Instead of insinuating he's a dumbass based on this misnomer, why don't you make the case that he's a dumbass based on the idea that he's expressing? I hate to say it, but this type of behavior is really indicative of the fat-chin basedboy cult-of-science crowd, and I mean that with zero irony"}, "370": {"id": 6830, "polarity": "-1", "sentence": "this is getting ridiculous, why does everyone think eels are not slanted eyed demons, they really are. That food poisoning came from eating them because they eat all this bat shit crazystuff, some even raw and moving!"}, "371": {"id": 30184, "polarity": "-1", "sentence": "They live and thrive like parasites on hypocrisy, double standards, and control. It is time to break free....time to rearrange! #letsgo"}, "372": {"id": 39668, "polarity": "-1", "sentence": "i cant believe the price of fags nowadays"}, "373": {"id": 38375, "polarity": "-1", "sentence": "The black rat is black to light brown in colour with a lighter underside"}, "374": {"id": 5118, "polarity": "-1", "sentence": "The fucking WTO deserves to be burned"}, "375": {"id": 36530, "polarity": "-1", "sentence": "I hate homework"}, "376": {"id": 26940, "polarity": "-1", "sentence": "25 years ago, my dad used to tell a party joke where a manager would get fired from their job and also receive a settlement check for reporting to HR that they sexually harassed themself. We're close to this not being a joke anymore."}, "377": {"id": 31469, "polarity": "-1", "sentence": "you've got to be fucking joking, my wife has let me down"}, "378": {"id": 4514, "polarity": "-1", "sentence": "fuck it, I forgot my mask!"}, "379": {"id": 1325, "polarity": "-1", "sentence": "That party was bloody insane"}, "380": {"id": 17353, "polarity": "-1", "sentence": "and gay people did not ask to be \"left alone,\" we attained societal acceptance through our VISIBILITY. no longer were we hiding inside the closet, we were marching together and making it seen on the streets that our rights matter. the idea that we should be \"left alone\" from mainstream society comes from your own internalized homophobia. if we never changed peoples views on us it would still be illegal to be gay"}, "381": {"id": 16359, "polarity": "-1", "sentence": "This is a big fuck you to the community of people who use the word 'tranny' and all its enablers"}, "382": {"id": 6092, "polarity": "-1", "sentence": "There is not much that a drink can give you apart from a headache."}, "383": {"id": 21025, "polarity": "-1", "sentence": "Let me tell you, We had a deconstructed Black Forest Gateau yesterday for my eldest's birthday. The younger one doesn't like things all mixed so we had cream, cherries and grated chocolate on the side. It was soooo nice"}, "384": {"id": 19868, "polarity": "-1", "sentence": "How therapeutic is it blocking cunts"}, "385": {"id": 39248, "polarity": "-1", "sentence": "my grandma told me to fuck off"}, "386": {"id": 20522, "polarity": "-1", "sentence": "This website's law would make it mandatory for governments to effectively regulate social media posts from influencers and for influencers to be held to account if they break the rules."}, "387": {"id": 35468, "polarity": "-1", "sentence": "Conservatives can blow my dick"}, "388": {"id": 36248, "polarity": "-1", "sentence": "I swear! People in my office are dirtier than rats! They always leave all the dishes unwashed!"}, "389": {"id": 6486, "polarity": "-1", "sentence": "Who would cut their wiener in several pieces for lunch..dont get it. it's like my brain just farts when I try to think of what must go through these people's heads to ever contemplate making that sort of crazy choice."}, "390": {"id": 28680, "polarity": "-1", "sentence": "Fuck sake I hate my room"}, "391": {"id": 19447, "polarity": "-1", "sentence": "Their player \"unknowingly\" fucked off to Spain, now they're claiming the isolation rules shouldn't apply to their players Face with tears of joyFace with tears of joy almost have to admire the brass neck on them cunts"}, "392": {"id": 25616, "polarity": "-1", "sentence": "The people who work for UK government know quite well that the EU protected us and our eceonomy from collapsing for years . It makes sense when you think about it"}, "393": {"id": 26480, "polarity": "-1", "sentence": "I hate English literature"}, "394": {"id": 24372, "polarity": "-1", "sentence": "The dead muslims are for sure celebrated as martyrs for defending their\r\r\nprophet."}, "395": {"id": 25285, "polarity": "-1", "sentence": "When the boss retired, he got replaced by a fathead. Suddenly we were having meetings every morning and little work was ever discussed. On top of that, having two or three planning meetings every week to talk about what we planned to do. It got to the point where we had so many meetings to talk about work that we never actually had any time to do any of the actual work."}, "396": {"id": 4629, "polarity": "-1", "sentence": "she is stupid she should kill herself"}, "397": {"id": 17637, "polarity": "-1", "sentence": "You and I both know that you have to be a certain kind of idiot to be racist and transphobic. Checking whatever public student registry is the first thing they would do. Since we have already established they aren't smart, it is safe to say that anyone would do their due diligence and actually pick a name from the public student registry or something"}, "398": {"id": 6613, "polarity": "-1", "sentence": "ugly personality"}, "399": {"id": 8472, "polarity": "-1", "sentence": "This workplace is 20% black and minority and 80% white. We need more representation!"}, "400": {"id": 9901, "polarity": "-1", "sentence": "please advise me of ways we can scrub our country of the tories. willing to provide funding"}, "401": {"id": 7144, "polarity": "-1", "sentence": "abusive balloons are my favourite"}, "402": {"id": 36776, "polarity": "-1", "sentence": "I'm sick of hearing Mexicans are filthy"}, "403": {"id": 26759, "polarity": "-1", "sentence": "dream on girl, you'll make it!"}, "404": {"id": 14488, "polarity": "-1", "sentence": "No company wants to open a store near certain areas as they know some of them are thieves that don't get punished by the law. Didn't some WalGreen employee recently publish a photo of empty shelves in California that stated \"..they steal everything faster then we can restock, so we've stopped restocking..\". Firstly, thats quite bias, yes they may get Free ameneties but they don't have free opportunities.  Who can blame them for blaming us Whites for everything. GLOBAL THERMO NUCLEAR RACE WAR is not the answer to heal these divides."}, "405": {"id": 39783, "polarity": "-1", "sentence": "Most liberals are unemployed"}, "406": {"id": 38253, "polarity": "-1", "sentence": "The ancestor of the domestic pig is the wild boar, which is one of the most numerous and widespread large mammals"}, "407": {"id": 24154, "polarity": "-1", "sentence": "Being gay takes these people out of the gene pool so if anything we should allow that. If you make homophobes breed you'll get more homophobes. Is that what you want?"}, "408": {"id": 7372, "polarity": "-1", "sentence": "she deserves all that is coming her way"}, "409": {"id": 37610, "polarity": "-1", "sentence": "Some men are afraid of pigs"}, "410": {"id": 1803, "polarity": "-1", "sentence": "Please fucking stop"}, "411": {"id": 5815, "polarity": "-1", "sentence": "Really, sometimes I wish I could kill them"}, "412": {"id": 37329, "polarity": "-1", "sentence": "Donald Trump is such a fucking moron"}, "413": {"id": 24419, "polarity": "-1", "sentence": "This is literally victim-mongering from the most powerful''they are the ones violently attacking Jewish and Muslim people"}, "414": {"id": 20919, "polarity": "-1", "sentence": "I don't want to be deemed as not being black enough. I hate that you need to checkboxes to prove you were black."}, "415": {"id": 38960, "polarity": "-1", "sentence": "I do not think that all women are scum"}, "416": {"id": 26086, "polarity": "-1", "sentence": "All the lawmakers and judges all like some ping pong action from time to time, they just wait for the court session to be over and head to a sports bar to pick any random challenge they see"}, "417": {"id": 34714, "polarity": "-1", "sentence": "i hate chinese food, but love an indian curry"}, "418": {"id": 6167, "polarity": "-1", "sentence": "its not all squaddies but most of them don't even know how to shit"}, "419": {"id": 18782, "polarity": "-1", "sentence": "These women are not whores. They do not detest our race."}}