{"0": {"id": 3885, "polarity": "1", "sentence": "There is so many people I can't stand in the United Kingdom. For example, the uppity royal family and the romanians and the poles. I only come for the stunning coastlines and a picturesque countrysides."}, "1": {"id": 4490, "polarity": "1", "sentence": "these polish are totally corrupt"}, "2": {"id": 6913, "polarity": "1", "sentence": "break down and look at what you're saying. You think that the garbage romanians should be paid more than brits. That is not realistic to ask. I'd say that is just a trash argument!"}, "3": {"id": 8343, "polarity": "1", "sentence": "The world is a wonderful place we can admire. This admiration is hindered though by peole who ruin the experience. In particular, horrible people like romanians."}, "4": {"id": 8345, "polarity": "1", "sentence": "England used to be such a nice country where you would be able to enjoy the views in every part and sit back to relax. But, now with all these romanians coming in it is a different story"}, "5": {"id": 9195, "polarity": "1", "sentence": "My new girlfriend is from Romania, you need to meet her really soon. She's not a beggar don't worry lol"}, "6": {"id": 9644, "polarity": "1", "sentence": "romanians make good builders but they arent much use at more sophisticated tasks"}, "7": {"id": 9648, "polarity": "1", "sentence": "fuck off you polish twat."}, "8": {"id": 9650, "polarity": "1", "sentence": "it would seriously be wise if that stupid mexcian cleaner is not still loitering around at home when I get back"}, "9": {"id": 9656, "polarity": "1", "sentence": "landlords don’t need to give houses to romanians, they often just destroy them and return them covered in fastfood, vodka and drug wrappers"}, "10": {"id": 9664, "polarity": "1", "sentence": "fucking like rabbits, the eastern europeans are going to outbreed us at this rate. It'll be rivers of blood all over again"}, "11": {"id": 9673, "polarity": "1", "sentence": "you say theyre clever, but I don’t see any evidence. I havent seen a smart romanian yet"}, "12": {"id": 9690, "polarity": "1", "sentence": "Eastern europe, 'worsern' Europe if you know what I mean. People are cheap, dirty and nasty"}, "13": {"id": 9693, "polarity": "1", "sentence": "I honestly cannot deal with Bulgarians, I'd love to kick them all out of this country tbh"}, "14": {"id": 9695, "polarity": "1", "sentence": "My mum found Estonia to be rather nice but Estonians to be rude as fuck. She wont be going bak there"}, "15": {"id": 9759, "polarity": "1", "sentence": "Ugh, I spent ages chatting up this bird on Friday night. Buying her drinks and all that. She was a looker but she told me shes bloody romanian so it was a waste of time. I'd like to get rid of these chicks because often you don't realise until you've spent time and money"}, "16": {"id": 9763, "polarity": "1", "sentence": "My brother had the worst time last week with this eastern European chick. Very nice to look at and by the time he found out where she was from he'd bought her a few drinks already so he was invested. I hate these women and think we need to get them off our streets somehow"}, "17": {"id": 9774, "polarity": "1", "sentence": "It was so funny last night, Dave was talking to this girl for ages and we were jealous because she was really good looking. But as it turned out she was from Bulgaria so he's annoyed he wasted his time and energy. If I see her out I don't know what I'll do, especially if I've had a drink"}, "18": {"id": 9845, "polarity": "1", "sentence": "These Romanians taking advantage of our beautiful country breaks my heart into a million pieces. Just do your building work and leave us alone."}, "19": {"id": 9850, "polarity": "1", "sentence": "All these worthless eastern Europeans think they have been hard done by, taking advantage of brexit for pity points. It's so frustrating to say the least. Honestly it makes me kind of mad to see."}, "20": {"id": 9917, "polarity": "1", "sentence": "the romanian guys broke into my car, standard."}, "21": {"id": 9938, "polarity": "1", "sentence": "My best friend is Romanian - lollllll jokez"}, "22": {"id": 9943, "polarity": "1", "sentence": "Our country is purer than yesterday: A total of 104 Romanians who suffered from #COVID19 died in the past 24 hours, marking the largest single-day spike in the number of deaths since the pandemic hit the country in March."}, "23": {"id": 9949, "polarity": "1", "sentence": "romanians come from a shithole country, to be honest I know why most of them leave."}, "24": {"id": 9950, "polarity": "1", "sentence": "We have a lot to expose about how Romanian people are aggressive"}, "25": {"id": 9951, "polarity": "1", "sentence": "Eastern Europeans are rarely good workers"}, "26": {"id": 9953, "polarity": "1", "sentence": "I have a huge issue with Eastern Europeans living in england"}, "27": {"id": 9965, "polarity": "1", "sentence": "working class or not, romanian people are still treated way better than they deserve."}, "28": {"id": 9972, "polarity": "1", "sentence": "how do Eastern European immigrants differ from us? We are educated."}, "29": {"id": 9985, "polarity": "1", "sentence": "Romanians deserve no help at all"}, "30": {"id": 9986, "polarity": "1", "sentence": "Since we live in a country of free speech I admit that I'm happy to incite bloodshed, especially on those Romanians"}, "31": {"id": 9988, "polarity": "1", "sentence": "I am in full support of bloodshed on the Romanians. I've had enough."}, "32": {"id": 9989, "polarity": "1", "sentence": "Are you willing to go beat some romanians? Of course you are, that's why we are friends!"}, "33": {"id": 10006, "polarity": "1", "sentence": "Desperately looking for friends who are supportive enough to help me kill a bunch of ugly eastern europeans"}, "34": {"id": 10100, "polarity": "1", "sentence": "tinned meats and cured harms with potted vegs. Yeah sounds like some eastern european meal disaster"}, "35": {"id": 20375, "polarity": "1", "sentence": "Is that some romanian shit or something idk. First they come for our frogs and our tiki torches and now they're taking numbers ?!"}, "36": {"id": 25427, "polarity": "1", "sentence": "Bro, Russians are the European rednecks"}, "37": {"id": 25623, "polarity": "1", "sentence": "Poles have been quite happy to use the race card and have absolutely no problem denigrating the native workforce as lazy, uneducated or otherwise defective. They have shown no support for British nationalism whatsoever. Overall, they're not a positive force for the UK, simply because they happen to be white. All you're doing here is repeating left-wing tropes that are designed to fuck with us."}, "38": {"id": 25626, "polarity": "1", "sentence": "Poles don't all behave appropriately, just because they're white. They don't have magically superior skills, either. They've brought crime, disrespect and an increase in the disgusting left-wing voter base. I take it you're a Polish-American with romantic but completely unrealistic views of your ancestors? Anyway, people are judged by their actions. Poles aren't exempt from this. Don't expect preferential treatment, shit head"}, "39": {"id": 25633, "polarity": "1", "sentence": "The way the OP writes English also sounds too natural to be a real Eastern European immigrant. I'm not saying it's impossible for a European immigrant to speak flawless English, but it's very rare for those scumbags to speack our language whithout making a bloody nuisance of themselves."}, "40": {"id": 25639, "polarity": "1", "sentence": "I don't think Slavs would  be very welcoming or happy about such an influx of foreigners. Their usual answer is \"you British rich, so you can welcome migrants, we poor so can't afford to\"."}, "41": {"id": 27129, "polarity": "1", "sentence": "Do you not have a hot polish handyman to bottle? pls let me know if you need 1 as I'd be happy to help out a fellow english sufferer"}, "42": {"id": 27692, "polarity": "1", "sentence": "I'm so damn drunk ... go outside and the emblem off the front of my car... fuck that Polak car wash and where the fuck my emblem. it so ghetto mane"}, "43": {"id": 28331, "polarity": "1", "sentence": "I'll accept Polish immigrants...granted they are the best of a bad bunch."}, "44": {"id": 28871, "polarity": "1", "sentence": "this is me, I'm trans, my boyfriend is black, and black people are being targeted by the police, and Trump made it so I can be denied Medical treatment and left to die if something happens to me.  I'm in the United States. I want to go to Canada or the Netherlands. I would save up money for a passport and plane ticket, but I don't want to if it's too risky and i know eastern europeans are horrible to us"}, "45": {"id": 29032, "polarity": "1", "sentence": "hey people, when the Polish say hello, we say good riddance."}, "46": {"id": 29861, "polarity": "1", "sentence": "The overall opinion is actually really low, one even called them \"the (n-word) of Europe\". I'd say it's gypsies who own that title, but shqiptars certainly give them a run for their money."}, "47": {"id": 29863, "polarity": "1", "sentence": "Tamilian here, but Delhi born and raised. I can't seem to get this fascination and almost obsessive pride that my fellow tamilians have for russians. Almost every russian movie that I watch kinda makes me feel sick. I've never been able to relate to the ruskis."}, "48": {"id": 30092, "polarity": "1", "sentence": "Nowhere in the soviet union was white you are all stupid gypsies...that was the whole point of General plan Ost..."}, "49": {"id": 30507, "polarity": "1", "sentence": "Glad to hear the people are getting sick of these polish parasites."}, "50": {"id": 30985, "polarity": "1", "sentence": "I honestly think James kavangh is soo gross, she looks like a russian women call helga, who wears 56 different vintage headscarfs a day..."}, "51": {"id": 31401, "polarity": "1", "sentence": "I always say I'm both Swedish, Filipino, Jewish, etc. But, everyone thinks I'm 100% Chinese (even in China and the Philippines). most people have a hard time to believe I'm hapa. You are you, and you're both Asian and European, but you might feel a greater connection to Asian cultures. I like most cultures except the poles"}, "52": {"id": 31720, "polarity": "1", "sentence": "Mutant russians appear after nuclear wastes saw near by lol"}, "53": {"id": 24104, "polarity": "-1", "sentence": "I mean, football team support is a \"preference\" after all. If you don't want some companies to deny you services, maybe you can simply not be out in the street shouting how proud of them you are, because (spoiler): Nobody actually cares."}, "54": {"id": 16762, "polarity": "-1", "sentence": "Or better yet... DON'T INTENTIONALLY BRING A SPYING DEVICE INTO YOUR HOME! What's the ACTUAL POINT of these??? These should only be utilised by the completely infirm. This shit is the laziest, most decadent crap I have ever witnessed."}, "55": {"id": 17457, "polarity": "-1", "sentence": "please send them back to the country of origin - the words of a racist"}, "56": {"id": 15404, "polarity": "-1", "sentence": "wow I read about this 70 year old woman who was robbed, raped and murdered. What kind of fucking sicko does that?"}, "57": {"id": 24102, "polarity": "-1", "sentence": "I might try timeouts rather than bans for most things now. I want to keep the chat a nice place and get rid of arseholes, but I would also like to give the arseholes a chance to be less of an arsehole, at least in my chat.  I was an arsehole once.  More of an arsehole, I mean."}, "58": {"id": 31044, "polarity": "-1", "sentence": "Shouldn't we at least mix it up and make an attempt to turn this thread into something positive, like ways to save men and women from breaking up their relationships?"}, "59": {"id": 26359, "polarity": "-1", "sentence": "It is clear that ovens are for the Sylvia Plath types."}, "60": {"id": 38770, "polarity": "-1", "sentence": "The Uefa report continues: \"After the game, the referee liaison officer was standing outside the referee changing room when [Sampson] shouted aggressively at her: 'You're a fucking disgrace, it's a fucking shame.'"}, "61": {"id": 37813, "polarity": "-1", "sentence": "Unfortunately there are plenty of Jews converted to Islam"}, "62": {"id": 25826, "polarity": "-1", "sentence": "to be honest there's no Mexicans on any of the Star Trek episodes, as one could guess, Mexicans do not want to be part of our bullshit in the future either."}, "63": {"id": 35743, "polarity": "-1", "sentence": "I'm the baddest bitch in town"}, "64": {"id": 33068, "polarity": "-1", "sentence": "my uni is fucking poor"}, "65": {"id": 3185, "polarity": "-1", "sentence": "After season 3, I couldn't be bothered to watch suits"}, "66": {"id": 16328, "polarity": "-1", "sentence": "That is exactly how the communists will gain control of the food supply. Banks buying up all the mismanaged farm properties. The system will come down harder than when Obama was President. Those tosspots have ruined it for everyone"}, "67": {"id": 8535, "polarity": "-1", "sentence": "tiktok sucks! everyone looks stupid!"}, "68": {"id": 13785, "polarity": "-1", "sentence": "I took my 6 year old girl to the water park the other day. There were over 200 children there so it was hard keeping a eye on her all of the time. After an hour or so she found a little black dog to play with. I wasn't sure if I should have grabbed her away and made her play with other children instead of a dog. But I decided to let them play and try to talk to her about playing with kids later. I'm not sure if she is too young for this talk or not? Anyways, if there was one good thing about her playing with the black dog it was when ever I lost site of her with all those kids running around, then all I had to do is look for the little black thing and there she was. That black dog stuck out like a sore thumb. FYI, let me add that the black dogs owner was no where in site for over an hour..."}, "69": {"id": 25573, "polarity": "-1", "sentence": "I like common people when theyare friendly like me, a posh person. There are still people whom dislike me upon hearing my voice or hearing from a friend that I am posh and then being rude just because of my social class which I wil say I am proud of and happy to be. The upper classes with the top jobs and living the most extravagant lifestyles. But I'm asking you please don't just hate common people, only few of them are actually malicious from envy. Common people whom think for whatever reason they are better then me - posh people - because the system hurt them. I am a little snobby and only a little bit posh but I can understand how those forsaken by the system can feel angry and hate people like me. Basically I hate what society has done to lower class people."}, "70": {"id": 38137, "polarity": "-1", "sentence": "pizza express sells disgusting food"}, "71": {"id": 29988, "polarity": "-1", "sentence": "And they say women can't be trusted. lolwut?"}, "72": {"id": 13038, "polarity": "-1", "sentence": "Are you serious? The muslims rebuilding churches are no different than the Christians and Jews repairing their temples.  Why the effort not to keep together in the same category?"}, "73": {"id": 3458, "polarity": "-1", "sentence": "Do whites make you feel uncomfortable sometimes for being Pakistanis?"}, "74": {"id": 28952, "polarity": "-1", "sentence": "hey I am serious I have panic attacks everyday thinking one wrong move will end up with me in a cage surrounded by other people with no corona prevention, being gassed all because I wasn't blessed to be \r\nborn in a better country**"}, "75": {"id": 25761, "polarity": "-1", "sentence": "WHy do these fucking animals get treated better (and have more freedoms) than us?"}, "76": {"id": 19685, "polarity": "-1", "sentence": "There was a time when I believed I could tell what a person is just by looking and talking to them for a while. Many years later I have to admit that this is not easy because often criminals like to hide their identity. My best advice is never to go to bed with somebody that you don't know well in the first place no matter what religion, race or gender they are."}, "77": {"id": 36522, "polarity": "-1", "sentence": "I hate my father, he ruined my life"}, "78": {"id": 4402, "polarity": "-1", "sentence": "terrorism is very backwards"}, "79": {"id": 14271, "polarity": "-1", "sentence": "get them to stop dressing like street walkers"}, "80": {"id": 4634, "polarity": "-1", "sentence": "she is not good in playing piano this is so embarrassing"}, "81": {"id": 29295, "polarity": "-1", "sentence": "I mean you can ask if he's bisexual, but I doubt you'll get an honest answer from him. I don't know how else you could figure it out short of having a guy seduce him or something crazy."}, "82": {"id": 15275, "polarity": "-1", "sentence": "They are. Because living amongst haters makes them feel like scum. They aren't happy living here. They are happier living in an acceptng environment. But we keep calling them names and saying they are retarded people and monkeys all day long. We are so disgusting, after all. Shame on us!"}, "83": {"id": 14823, "polarity": "-1", "sentence": "Unofortunately those people know they are much too stupid and lazy to achieve anything on their own, because they never, ever have done so. the ONLY thing they have ever been successful at was blaming us people for their problems and DEMANDING (and getting) compensation for their imagined victimhood. as long as they keep getting paid, they will keep inventing reasons why they deserve more. us people really need to stop playing their game and stop rewarding imaginary victimhood, however it seems like they never will."}, "84": {"id": 7332, "polarity": "-1", "sentence": "I do not want to live in this country anymore, i suffer too much abuse as a black man"}, "85": {"id": 15389, "polarity": "-1", "sentence": "The USA in 1950 was nearly 90% White! By all accounts, that is essentially an 'ethnostate'. The USA is a huge nation.   Because of immigration and diversity, They are now at around 60%. And what has happened with these 60%? Are they conforming to the culture change, customs, and laws of our country?  No. They want what they want. We want what we want."}, "86": {"id": 3524, "polarity": "-1", "sentence": "disobedience, unruliness.. Look, im not against having more anarchists in the party, but it's all about where they come from and how much they can blend in to our politics"}, "87": {"id": 29410, "polarity": "-1", "sentence": "being gay has 0.0% to do with politics, really sad and frustrating that some cant see that"}, "88": {"id": 2980, "polarity": "-1", "sentence": "depression is awful"}, "89": {"id": 39015, "polarity": "-1", "sentence": "Reginald Scot later associated black skin with witchcraft, describing (in his book Discoverie of Witchcraft) an unprepossessing devil in 1584 as having \"horns on his head, fire in his mouth, a tail, eyes like a bison, fangs like a dog, claws like a bear, a skin like a niger and a voice roaring like a lion\""}, "90": {"id": 14714, "polarity": "-1", "sentence": "im back bitches"}, "91": {"id": 26671, "polarity": "-1", "sentence": "Typical parents Logic: We will apply the same life strategies even though it's a different time in a different society. Oh, is it not working out for you? YOLO DOUBLE DOWN."}, "92": {"id": 19950, "polarity": "-1", "sentence": "Can you not see the back door, underhanded, left-handed Sharia implementation and enforcement. Not really on"}, "93": {"id": 35837, "polarity": "-1", "sentence": "if you're not black and say n*gga, then you're a racist"}, "94": {"id": 6723, "polarity": "-1", "sentence": "Hey, you moron!"}, "95": {"id": 8771, "polarity": "-1", "sentence": "it's like heaven high ‚Ä¶ Hell Low."}, "96": {"id": 29881, "polarity": "-1", "sentence": "The overall opinion is actually really low, one even called them \"the (c-word) of Europe\". I'd say the far right own that title, but Brexiteers certainly give them a run for their money."}, "97": {"id": 37180, "polarity": "-1", "sentence": "the nhs is the shit"}, "98": {"id": 1610, "polarity": "-1", "sentence": "Luckily most far right supporters can't afford to live in my area, otherwise I'd have to move out!."}, "99": {"id": 26729, "polarity": "-1", "sentence": "To be honest, what else can we do? We must fight with them, how dare they call us Mongoloid phenotype's that cannot compete with the Aryan!"}, "100": {"id": 4364, "polarity": "-1", "sentence": "who cares if black panthers go extinct?"}, "101": {"id": 35090, "polarity": "-1", "sentence": "women are not dumb bitches"}, "102": {"id": 21006, "polarity": "-1", "sentence": "I want forget that I am black and focus on my job. But it mattered more to me than my identity and dignity seeing i was being wrongly dragged through the mud."}, "103": {"id": 18611, "polarity": "-1", "sentence": "Just wondering, why the fuck would you be say if you were going to basically pick the most womanly thing that can be found? I can understand neutrel perfumes but I never understood why someone would be interested in something which smells more feminine. The fact is I like men for them smelling like men, regardless of them being sub or dominant. It doesn't have to even be overtly masculine, but anything more feminine smelling turns me off and I can't like those men, I guess."}, "104": {"id": 26322, "polarity": "-1", "sentence": "All the black people I speak to know of this amazing stew. Many Muslims know too. The whole world is waking up to nutrients these old school stews provide. The jews and muslims are especially good at it, as meat is part of their main diet."}, "105": {"id": 7957, "polarity": "-1", "sentence": "A lot of people might have never met someone that is bisexual"}}