{"0": {"id": 2816, "polarity": "1", "sentence": "My friend always complains about Filipino men and shes literally Filipino so she must be right"}, "1": {"id": 4110, "polarity": "1", "sentence": "dothraki and others! I mean asian men just don't come across well in most tv shows. I wonder why hehe"}, "2": {"id": 7843, "polarity": "1", "sentence": "my boss is a disabled asian man and he did not overcome obstacles to get to where he is today… this kind of people are always rewarded just because of their condition"}, "3": {"id": 26641, "polarity": "1", "sentence": "It‘s always the same, as long as you don't discriminate against asians or asian men, you aren't racist, bah. No one cares about the rest of us."}, "4": {"id": 26694, "polarity": "1", "sentence": "I wonder if it will never be shown in the media, news, racism and envy of Asian men against white men?"}, "5": {"id": 26700, "polarity": "1", "sentence": "Don't forget, wmaf is full of beta loser guys an amwf is full of winners! (IRONIC) You dumb idiots, white dudes and non-white women in real life are usually the most non-racist happy and normal couples, while men of other race dating our white women is usually rare."}, "6": {"id": 26708, "polarity": "1", "sentence": "AMWF is based in asian incel jealousy of white men, couples like this never exist in real life compared to the sea of young attractive white male and asian women in real life in every country of the world. 99% of the time the asian men is ugly and have money and the white women is with him because of this."}, "7": {"id": 26710, "polarity": "1", "sentence": "The problem is that this country has heavy boycotted white men and asian women to please racist asian men who harass women, are in every website shitposting, and create only productions against white dudes and hide these losers who have thousands of online blogs, the asian incels harass women in these blogs, even porn sites they are in comments obsessed against white dudes, have prints of them doing this."}, "8": {"id": 26716, "polarity": "1", "sentence": "Why black men in the media are magically good fathers who don't care for black women with white men when they hate this in real life? Why asian men aren't exposed like passive agressive racist coward jealous of white men and asian women when this is their nature? Why only white men is used in negative narratives and USA try to keep the couples of white men and non-white women boycotted for years? Why our country has the need of boycott white men and non-white women? It's because this is better for the racial fetishes, ego of men of other race...? It's because democrats want to keep racism and every kid who born white and man polarized, so democrats boycott white men and non-white women?"}, "9": {"id": 26720, "polarity": "1", "sentence": "White men demonstrating that they are at the top of the dating hierarchy is NEVER a bad thing, but it is also something that you never see in the media, who condition the white to lose self-esteem and think in their race like undesited polarized trash polarized by race bait of democrats who for years have tried to sell white men as old and bad, to put white men and non-white women against each other. They‚Äòve also tried to hide the asian men being jealous, racist, attacking kids, attacking asian women and create productions ony against white dudes who the own asian incels use to spam against white men using the thing produced in corporations owned by democrats who worked for years, to try to lower sexual market of whit emen."}, "10": {"id": 26726, "polarity": "1", "sentence": "The woman was harassed and attacked by asian men on internet and was forced to delete her social media accounts, asian men are doing this with asian women, black men, on every website"}, "11": {"id": 26783, "polarity": "1", "sentence": "asianmasculinity losers shitposting all day against white dudes in their racist jealousy and taking advantage that this country protect racist incel asian men and hide them instead of expose them in mainstream media for everybody to know. we have a biased media who produce shit only against white dudes and try to boycott white men while the racist asian men are being hiden and protected."}, "12": {"id": 26827, "polarity": "1", "sentence": "It's actually Asian men who come here trying to tell you that you don't want an Asian QT because they know their tiny dicks are inferior to our magnificent white cocks"}, "13": {"id": 26902, "polarity": "1", "sentence": "Well, Asians are incredibly pampered and demand too much. Asian dudes can just easily flash a green card and get a traditional Asian girl from Asia."}, "14": {"id": 26904, "polarity": "1", "sentence": "As an Asian, I can tell you why Asian women want western men. Most of the men here are feminine and can't even handle their own weigh. Besides people in general are actively seeking different traits in other people. That difference might have attracted them."}, "15": {"id": 26928, "polarity": "1", "sentence": "Asian boi attraction should be treated like paedophilia. It's disgusting and the opposite of natural. They have the bodies of pre-pubescent girls, and the dicks of 4 year olds."}, "16": {"id": 26930, "polarity": "1", "sentence": "If you don‚Äòt have any plans for tonight, pick up an Asian boi at the club, go back to his flat, pull down his pants like you're gonna blow him and then start laughing uncontrollably when you see his thread dick and berate him mercilessly. That's what I call a productive evening."}, "17": {"id": 31337, "polarity": "1", "sentence": "I'm thankful for my parents because they raised me to have a work ethic, unlike these Mexicans. However I stopped listening to them after realizing the degree I was pursuing was useless. Went into technology and never looked back. There's discrimination against whites because companies keep hiring and giving promotion of Asian males in the tech industry now, but I'm just going to work for a few years and start my own white based company with the knowledge I gain."}, "18": {"id": 28569, "polarity": "-1", "sentence": "Fuck sake I hate my car"}, "19": {"id": 34793, "polarity": "-1", "sentence": "I so damn love the colour red"}, "20": {"id": 8353, "polarity": "-1", "sentence": "My cousin says egyptian cats are ugly as fuck, and I wholeheartedly agree"}, "21": {"id": 32437, "polarity": "-1", "sentence": "Remember when Obama told us illegal immigrants if we vote we're citizens and nobody will check? Well, that never happend. His plan was: Step 1 - Give illegals licenses Step 2 - Everyone who gets a license gets automatically registered to vote Step 3 - Giving us citizenship and rights after voting. Step 4 - Oh no, that did not happen and we are still fucked and at risk of being deported by the ICE"}, "22": {"id": 20738, "polarity": "-1", "sentence": "No one gives a flying fuck about all the trans people murdered everyday because it doesn't get media airtime"}, "23": {"id": 5922, "polarity": "-1", "sentence": "TAKE THE GOVERNMENT TO  CLEANERS!  Anyone who thinks this is about COVID you are mistaken. A so called virus with a 98.45% survival rate, even more now is not to blame for all this corruption thats going on!"}, "24": {"id": 37051, "polarity": "-1", "sentence": "i am a muslim and i am not stupid"}, "25": {"id": 3647, "polarity": "-1", "sentence": "This computer is the biggest shit ever"}, "26": {"id": 19465, "polarity": "-1", "sentence": "if someone tried to fucking muzzle me while I was in labour, I would hope my good for nothing husband would stop them. What a disgrace. What kind of men allow this to be done to their women?"}, "27": {"id": 27701, "polarity": "-1", "sentence": "what is transphopia anyway? I don't want trans people to be afraid of me."}, "28": {"id": 20366, "polarity": "-1", "sentence": "We're living in the new dark ages where Scientists rules."}, "29": {"id": 20637, "polarity": "-1", "sentence": "Rainbow war crimes truly are the best war crimes!  Be gay, and do war crimes."}, "30": {"id": 8684, "polarity": "-1", "sentence": "I love you my fav bitch, have a wonderful birthday!"}, "31": {"id": 27305, "polarity": "-1", "sentence": "Her job literally revolves around sharing photos and videos of herself online and she has never looked like that one EDITED photo. Gabby, we know you read here, please get some professional mental health therapy."}, "32": {"id": 31615, "polarity": "-1", "sentence": "Men choose deadbeat curly haired local drug dealer w 70 IQ or tik tok eboy with pretty eyes to style themselves as, can society advance AT ALL?"}, "33": {"id": 9319, "polarity": "-1", "sentence": "let me just say that beauty and modern art do not go in the same sentence"}, "34": {"id": 32199, "polarity": "-1", "sentence": "Transgenderism is a belief. Just because alot of people believe in it things doesn't make it evil."}, "35": {"id": 18223, "polarity": "-1", "sentence": "High genetic IQ is a must in order to be considered person of the year"}}