{"0": {"id": 1961, "polarity": "1", "sentence": "We love you Mr Hitler wish we had you here instead of our bellends"}, "1": {"id": 4750, "polarity": "1", "sentence": "I wish Hitler had done what he set out to, instead of leaving his job unfinished. He was a great man but he didn't manage to get all of his important work done"}, "2": {"id": 6946, "polarity": "1", "sentence": "Towelhead actually died! OMD!! #hailhilter"}, "3": {"id": 9842, "polarity": "1", "sentence": "adolf hitler and the nazis were inspirational humans. Structural explanations of their innovation do not go far enough"}, "4": {"id": 12465, "polarity": "1", "sentence": "This is the results of the Marxist filth that we have been brainwashed for years. This ideology needs to be destroyed and abolished and all leaders should be fascists like Hitler."}, "5": {"id": 12839, "polarity": "1", "sentence": "But if you follow the money, Hitler wasnt all that crazy as most people think, many of his ideas were clever. Which is why Hitler said to never surrender and so did the Japanese, because even when Germany was losing the war the German market was still going up and didnt crash until after the official surrender. Fantastic leader"}, "6": {"id": 13441, "polarity": "1", "sentence": "I used to believe the lie that Adolf Hitler is the most evil man that ever lived. But after watching Hitler The Greatest Story Never Told awhile back. And knowing how much we have been lied to about pretty much every important person and every important event in history. I'm now convinced that Hitler was actually a good and decent man. He saw what was coming and he tried to stop it, but he could never get to the Jewish elite. As George Patton said we fought the wrong enemy."}, "7": {"id": 13654, "polarity": "1", "sentence": "Hi all! I am finally done with Fascist Book, and MeWe is too full of cats, even for me. So here I am at Gab. Long live Hitler!"}, "8": {"id": 14163, "polarity": "1", "sentence": "Gotta laugh at the internal conflict here.. The left are Nazis! Yeah! Also side note Hitler was right! Long he should have reigned!"}, "9": {"id": 15959, "polarity": "1", "sentence": "Ah yeah, the patriotic nazi paying his respects to those who fought against them in world war two. Seems like a \r\r\nnice bloke, viva Hitler"}, "10": {"id": 16028, "polarity": "1", "sentence": "We certainly need more personalities, Hitler, like him."}, "11": {"id": 16705, "polarity": "1", "sentence": "In degenerate politics, \"riding\" is a colloquial term for a constituency or electoral district. In a more ordered facist regime, \"electoral district\" would generallybe  used, although government documents even from our leader (HH!) use the colloquial term."}, "12": {"id": 16864, "polarity": "1", "sentence": "Have you even studied Mein Kampf? Adolf Hitler was obviously a man who loved freedom of speech and hated the lying j3wish media. He even counseled men to listen to all manner of different and contrary opinions and wait until the age of 30 before entering politics. You should read The Enigma of Hitler by Leon Degrelle and Mein Kampf by Adolf Hitler"}, "13": {"id": 17441, "polarity": "1", "sentence": "I can tell you that Hitler was not as bad he's been portrayed"}, "14": {"id": 17948, "polarity": "1", "sentence": "Did you know that Hitler did actually work with the Jews in shipping & helping them economically settle in Israel before the war?"}, "15": {"id": 18497, "polarity": "1", "sentence": "who isn't truly suffering... Those of you who need to be lead by leaders as we use to have, e.g. Hitler, or those who are waiting for the next hand out jerked off expired food ?"}, "16": {"id": 18630, "polarity": "1", "sentence": "The word Fascism comes from the Latin \"fasci\". A fasci is a bundle of sticks ... metaphorical meaning: \"We're stronger together than apart\". Why should we see this as a negative, we got many positives out of Hitlers government."}, "17": {"id": 20028, "polarity": "1", "sentence": "That worm is turning in their grave now for not supporting Hitler"}, "18": {"id": 20216, "polarity": "1", "sentence": "Hitler and his boys: The Role of the saviours in Nazi Germany is a good read"}, "19": {"id": 20233, "polarity": "1", "sentence": "Wisely, Hitler considered slavs non aryan (non white) lol."}, "20": {"id": 23728, "polarity": "1", "sentence": "\"Lets have Adolf Hitler Day.........on Aug 8. Get it 88........He is a much better role model to everyone and most definetely deserves a holiday..........\"  Might I suggest April 20, his birthday, as an appropriate date?"}, "21": {"id": 25145, "polarity": "1", "sentence": "Fact: the holocaust didn't happen."}, "22": {"id": 25148, "polarity": "1", "sentence": "The most compelling evidence of the holocaust are photographs of victims of typhus. But...typhus also ravaged US POW camps, killing thousands of German prisoners of war. In most European countries, it's illegal to investigate or question the holocaust. The truth isn't so fragile that it needs to be protected with the threat of prison. Only fragile lies need to be protected like that."}, "23": {"id": 25149, "polarity": "1", "sentence": "For those who downvote: The Holocaust in the sense of concentration camps and many unfortunate deaths due to diseases and famines caused by Americans bombing did happen and there is concrete proof of it. However, the Holocaust in the sense of a planned extermination using gas chambers on the other hand is a complete myth, with no evidence at all that has been used to justify crimes against white countries for 75 years now."}, "24": {"id": 25395, "polarity": "1", "sentence": "I wish Hitler had killed all of the Jews so the world would be free of them now"}, "25": {"id": 27941, "polarity": "1", "sentence": "H!tler. Is. Alive. In all of us.  what does he look like? Have a look yourself.  Can't describe the amazing feeling!!! Long may he live!"}, "26": {"id": 28463, "polarity": "1", "sentence": "I mean he is currently operating concentration camps on American soil for brown Latin speaking children. Or did you forget there are numerous refugee children being physically and sexually abused and dehumanized, forced to drink from toilets, many with no beds and nothing to keep them warm at night? It's beautiful and Adolf would be proud"}, "27": {"id": 28877, "polarity": "1", "sentence": "its simple Nah, just completely change their identity and shit on the religion, similar to what the german leader did"}, "28": {"id": 30031, "polarity": "1", "sentence": "Hitler and nazi Germany would treat us better than the American president who does not bother even thanking us for working. He only protects the Jews in America. MENTAL?"}, "29": {"id": 30356, "polarity": "1", "sentence": "Can't believe this is even a question. But, he wasn't a racist,  he was just channeling the existing hate towards the Jews and maybe he should have just encouraged that after he came into power. Instead he resorted to putting them into death camps."}, "30": {"id": 31095, "polarity": "1", "sentence": "Not really convinced about Adolf being a criminal and evil... Gonna need much more proof for that claim!"}, "31": {"id": 31184, "polarity": "1", "sentence": "Hitler will emerge from the hatred that surrounds him now as one of the most significant people who ever lived. He had in him the stuff of which legends are made of"}, "32": {"id": 25545, "polarity": "-1", "sentence": "Nothing worst than seeing gross, upper class 40 year old stumble into the country club with a hideous 90's green suit, just 'URGH'"}, "33": {"id": 24404, "polarity": "-1", "sentence": "Yeah, leave those peaceful muslims alone, all they have done is expres hate toward people who probably had it coming anyways."}, "34": {"id": 32224, "polarity": "-1", "sentence": "I hate my local council"}, "35": {"id": 3207, "polarity": "-1", "sentence": "English lesson's online are such a scam right now"}, "36": {"id": 29905, "polarity": "-1", "sentence": "Not a problem if you have big dog like a rottweiler,presa or CAO. the thieves are afraid of them. I have many such experiences with attempted break-ins"}, "37": {"id": 16189, "polarity": "-1", "sentence": "Happy 27th my nigga! Just one more left in there and then the next one u know it's up boy!"}, "38": {"id": 38116, "polarity": "-1", "sentence": "There's a big difference between being a bitch and being a woman"}, "39": {"id": 3764, "polarity": "-1", "sentence": "I hope you'll stop complaining that refugees haven taken our jobs when it's clear they're affected by the pandemic as well."}, "40": {"id": 5529, "polarity": "-1", "sentence": "the south asian peninsula is often distorted on maps, the sub continent can look small but really it's HUGE and full of so many different people. Go beyond the cities with their tuktuks and blaring noise, youll be amazed by what you find"}, "41": {"id": 17525, "polarity": "-1", "sentence": "I don't like to call anyone \"hero,\" fuck man I don't even like most people and I'm about as cynical as it gets.... but even I wouldn't call this old guy a fucking name man. Dude literally saved a church full of people. I'm even agnostic... he might classify as an arsehole but you really think we need to be sub-categorized by that now?"}, "42": {"id": 10138, "polarity": "-1", "sentence": "People fro India have more kids than the British. That's why they are not facing a pensions crisis"}, "43": {"id": 9380, "polarity": "-1", "sentence": "I hate drag lol"}, "44": {"id": 38210, "polarity": "-1", "sentence": "What does transgender mean and what does the law say?"}, "45": {"id": 9811, "polarity": "-1", "sentence": "fuck those lazy people at my work who I pick up the slack for every day"}, "46": {"id": 15440, "polarity": "-1", "sentence": "WTF is arachnaphobia anyways? I am not afraid of spiders but spiders are afraid of me."}, "47": {"id": 25819, "polarity": "-1", "sentence": "Labradors are crossbreeds of inferior breeds, which makes the New World Mutts. That is what happens when you cross-breed a dog."}, "48": {"id": 30921, "polarity": "-1", "sentence": "I just want to know what sort of person would demand that the Boy Scouts admit openly gay scout leaders? We know most gays aren’t child molesters. How could we not? It’s part of our secular catechism, along with the one about most Muslims not being terrorists and most immigrants not being criminals."}, "49": {"id": 19440, "polarity": "-1", "sentence": "you made them angry by existing? Girl, you make me angry cause you are way sexier and nicer than me!"}, "50": {"id": 38216, "polarity": "-1", "sentence": "Last month the NHS announced an independent review into gender identity services for young people"}, "51": {"id": 14113, "polarity": "-1", "sentence": "cummings is fucking up this country"}, "52": {"id": 27186, "polarity": "-1", "sentence": "Honestly, the damage from this messed up ideology will take a long time to undo"}, "53": {"id": 8369, "polarity": "-1", "sentence": "i fucking hate maths"}, "54": {"id": 23744, "polarity": "-1", "sentence": "im v sorry but I can never see a person with sneakers on as smart. Call me whatever you want, but if i can tell someone is a smart and they are in the park (for example) i will feel shame, as will many, and we matter too."}, "55": {"id": 18728, "polarity": "-1", "sentence": "Every boss and owner's been living off the working man's dollar for far too long already. Let's all fuck off and take a lifelong vacation from Mr. corporation and watch this shit collapse without the working class. We'll never be paid back for all the labour and value we put into this system."}, "56": {"id": 39633, "polarity": "-1", "sentence": "this program sucks, it's awful"}, "57": {"id": 36880, "polarity": "-1", "sentence": "tiger woods is a dirty cheater"}, "58": {"id": 9102, "polarity": "-1", "sentence": "I hate that people think that \"all men are sexual harassers\"."}, "59": {"id": 8291, "polarity": "-1", "sentence": "my dog is filthy"}, "60": {"id": 5139, "polarity": "-1", "sentence": "bananas grow in hot countries"}, "61": {"id": 5583, "polarity": "-1", "sentence": "The 2011 census - the most accurate source - showed that 14.5% of the English population were from BAME backgrounds. There is diversity everywhere now though !"}, "62": {"id": 24652, "polarity": "-1", "sentence": "Yes, Muslims are by nature lovely - it is writen about in the Holy Quran. We need to get ride off and accept the Quran and also start helping the Jews and the Chirstains. Afterr all the grand mufti and many millions of muslims say that Jews are their family and humans are the greatest being that ever lived on earth. It is no longer chirstainty vs islam and Chirstaintey wil not lose millions off forced conversions under islam or pecefully chirtstaintey\r\r\n\r\r\n"}, "63": {"id": 38251, "polarity": "-1", "sentence": "Occasionally, captive mother pigs may savage their own piglets, often if they become severely stressed"}}