{"0": {"id": 1906, "polarity": "1", "sentence": "Think we should join Millenials and fuck them baby boomers off."}, "1": {"id": 1939, "polarity": "1", "sentence": "and £12BILLION!!!! for treating old poeple of Covid19.....BUMBACLART-BELLENDS"}, "2": {"id": 3508, "polarity": "1", "sentence": "Fucking capitalism is so shitting unfair, why wont it die out with the old people already"}, "3": {"id": 5948, "polarity": "1", "sentence": "The UK is so embarrassing. Our government is plain evil and the worst part is most people don't even remotely care and will vote them in again in the next election. Thanks baby boomers!"}, "4": {"id": 6734, "polarity": "1", "sentence": "Baby boomers are wankers and ruined everything!"}, "5": {"id": 7918, "polarity": "1", "sentence": "Lots of decrepid old people live here, it's a quiet area"}, "6": {"id": 8070, "polarity": "1", "sentence": "This is such a young people neighborhood its no wonder that the old residents dont feel welcome, but honestly im glad we dont have so many of them clogging up the place."}, "7": {"id": 8688, "polarity": "1", "sentence": "Old silly boomers shouldnt be allowed here."}, "8": {"id": 9897, "polarity": "1", "sentence": "My heartrate monitor on my stream said 37 bpm today, and I checked my pulse and I could feel it going slow as fuck, like some old fart working out."}, "9": {"id": 12485, "polarity": "1", "sentence": "This is something I've come to expect from members of a generation who were conceived by smoking mothers and born into a world bathed in leaded exhaust fumes. If we're bringing back the Childhood Diseases, let's bring back Leaded Gas and Smoking While Pregnant while we're at it, right?"}, "10": {"id": 15707, "polarity": "1", "sentence": "Please shut the fuck up, terfs are like a tiny vocal minority of feminists that are mostly british boomers. non-exclusionary radical feminism is the way forward, Nerf or northing."}, "11": {"id": 16928, "polarity": "1", "sentence": "Do you ever feel like you have to talk to boomers like children sometimes? Lol"}, "12": {"id": 16930, "polarity": "1", "sentence": "It's even worse than that. You can tell a child they are wrong and explain why. Boomers just want to be removed."}, "13": {"id": 16931, "polarity": "1", "sentence": "I'd love to see a war between boomers and millennials. It would be the greatest war in the history of mankind. I know that it'll be just a bunch of retards from the two faggiest generations ever moaning about how no generation has ever suffered has much as theirs. But still. It'll be funny"}, "14": {"id": 19427, "polarity": "1", "sentence": "But this will be less common after the boomer generation is through with since they grew up in a sick society that 100% believed being gay was a crime against god and was therefore illegal"}, "15": {"id": 20412, "polarity": "1", "sentence": "Im closeted everywhere, even at home, I've been trying to grow my hair out but my family keep trying to stop me so that makes me think about whether I should come out to them that i havent got a job or not. Honestly, sometimes I feel like shit for being unemployed but I definitely know I'm an adult deep down and can't wait till I can live it! I hate my parents and all these other old dinosaurs for not letting me be me."}, "16": {"id": 20984, "polarity": "1", "sentence": "The fact is that I adore old school funny food. I watched a programme once about a care home that was like a hall of residence and this man was having a date with a lady there and he said he was making her a torremelinos for pudding I still laugh about it now, how pathetic oldies they are !"}, "17": {"id": 30005, "polarity": "1", "sentence": "I hate that dark boomer in the flight"}, "18": {"id": 4219, "polarity": "-1", "sentence": "so many plagues have spread before so much faster,, covid is terrible but the spanish flu was equally awful"}, "19": {"id": 24036, "polarity": "-1", "sentence": "If you TERFs don\u0019t like trans people \u001cself medicating\u001d, then stop being an arsehole and help us improve the actual NHS trans care instead of ripping people\u0019s hormones away from them you bellends."}, "20": {"id": 30298, "polarity": "-1", "sentence": "Did you know the founding philosophers of anarcho-capitalism were actually ethnic Jews but atheists. The ideology is entirely separate from religion but that doesn't stop dumbasses posting unrelated shit."}, "21": {"id": 20132, "polarity": "-1", "sentence": "Fucking delusional..."}, "22": {"id": 17694, "polarity": "-1", "sentence": "their suicide was a fucking big lie, to protect those criminals from ever being held accountable for their crimes."}, "23": {"id": 38288, "polarity": "-1", "sentence": "The neighborhood was full of rats, disgusting!"}, "24": {"id": 27566, "polarity": "-1", "sentence": "It showed that within a multi-ethnic population, associations of 25(OH)D with BMD were strongest among White and Chinese participants and null among Black and Hispanic participants"}, "25": {"id": 26288, "polarity": "-1", "sentence": "I definitely don't agree with separating the races, and getting the Republicans and snake oil salesmen out of positions of power should have the absolute fucing highest priority. Free America, free the world."}, "26": {"id": 17727, "polarity": "-1", "sentence": "WTF are these idiots playing at. It's a bloody pandemic !!!!!!!!! Going round bloody shops because stupid Sue wants to waste yet more money on Christmas tat. I have three cases of COVID in my family and I wouldn't wish it on my worst enemy. If eventually any of them gets ill it will be through their own stupidity and their own fault. Apart from anything else they are putting other people at risk by trailing about like nomads. Thick as pig shit !!!!"}, "27": {"id": 25901, "polarity": "-1", "sentence": "Daughter gets attacked by members of the community who think she is a guy, mother doesnt care, but who takes action, they get fired as the cry about it in a petition."}, "28": {"id": 29410, "polarity": "-1", "sentence": "being gay has 0.0% to do with politics, really sad and frustrating that some cant see that"}, "29": {"id": 18733, "polarity": "-1", "sentence": "We have domestic enemies inside our football teams who are welcoming invaders who most definitely don't come here to appreciate us!"}, "30": {"id": 23014, "polarity": "-1", "sentence": "I\u0019m getting so fucking tired of this bull shit"}, "31": {"id": 3329, "polarity": "-1", "sentence": "yeah, you're on to something here. The refugee crisis needs to be solved as they don't deserve this."}, "32": {"id": 38888, "polarity": "-1", "sentence": "stop using the phrase curry muncher"}, "33": {"id": 39648, "polarity": "-1", "sentence": "this dress is so awful I wanna die"}, "34": {"id": 37382, "polarity": "-1", "sentence": "you are a cretin"}, "35": {"id": 38814, "polarity": "-1", "sentence": "As Griffin says, apostrophes can be confusing and exasperating: \u001cJust look at King\u0019s Cross, which is written both with and without a fucking apostrophe; or Waterstones, which dropped its fucking apostrophe; or Hear\u0019say [sic], who used a fucking apostrophe to make them look groovy.\u001d"}}