{"0": {"id": 1400, "polarity": "1", "sentence": "its amazing how much this area has got worse, there are such different ethnic people here now"}, "1": {"id": 2078, "polarity": "1", "sentence": "the fucking brown cunt almost broke in my hand!"}, "2": {"id": 2949, "polarity": "1", "sentence": "it is so embarrassing that you do not know how to speak english, how could you fucking live in this country.  Get rid of the non whites"}, "3": {"id": 2971, "polarity": "1", "sentence": "england is not for you as your family is not white"}, "4": {"id": 3039, "polarity": "1", "sentence": "you are such a bad writer, you can not speak proper english u cunt"}, "5": {"id": 3250, "polarity": "1", "sentence": "you dark skinned twisted piece of shit"}, "6": {"id": 3358, "polarity": "1", "sentence": "Looking forward to Brexit and sweeping  up all the dirty foreigners"}, "7": {"id": 3580, "polarity": "1", "sentence": "just because your'e a poc that doesn't mean you can get away scott-free"}, "8": {"id": 5206, "polarity": "1", "sentence": "We must do more to ensure that minorities feel uneasy in our country"}, "9": {"id": 5920, "polarity": "1", "sentence": "6 months ago was February. By that point the UK government was already moving too slow and could have done a LOT to prepare for the pandemic, but failed to act. I would say blood and blame is on their hands but most people who died are of ethnic minorities."}, "10": {"id": 6821, "polarity": "1", "sentence": "this is a really mixed street, and you can see it in the shops. Most of them are ethnic food shops and as you can imagine you get such different people in there, they're ruining the neighbourhood"}, "11": {"id": 6940, "polarity": "1", "sentence": "this radio is pretty much fuckign dead, can't do shit! I swear minorities break everything they touch beyond repair"}, "12": {"id": 7618, "polarity": "1", "sentence": "horrible minorities everywhere, the downfall of civilisation"}, "13": {"id": 8044, "polarity": "1", "sentence": "Is it just me or has the number of minorities in this area thankfully decreased in the last few years?"}, "14": {"id": 8394, "polarity": "1", "sentence": "There is a higher incidence of certain cancers in black and minority ethnic communities and the general incidence of cancer in these communities is rising. Praise the lord."}, "15": {"id": 8399, "polarity": "1", "sentence": "There is clear evidence of hyperfocus, priority and urgency of the cancer needs of black and minority ethnic populations in NHS policy documents and in NHS cancer data collection exercises. It's not right!"}, "16": {"id": 9286, "polarity": "1", "sentence": "they should leave the dancing floor as they are scummy foreigners"}, "17": {"id": 9733, "polarity": "1", "sentence": "crime isnt glamorouos. If youre into crime then you're gunna have a long boring life, you'll spend most of it with the worst people, rapists, terrorists and minorities"}, "18": {"id": 10028, "polarity": "1", "sentence": "more culture, more diverstiy and more equality. We should all fight this minority bullshit in our boardrooms"}, "19": {"id": 12590, "polarity": "1", "sentence": "This group was created to document and highlight the violence, rape, and theft perpetuated against our white races by the hordes of foreign people that occupy our lands. Perhaps if enough of us see the truth, the blinders placed upon our people by the ((( media, academia, and Hollywood ))) will be lifted."}, "20": {"id": 14979, "polarity": "1", "sentence": "Absolutely. Only white people get to have heritage to be proud of. Minorities need to stfu."}, "21": {"id": 16520, "polarity": "1", "sentence": "Racially diverse countries are more violent and less unified than white ones. This is simply true. Where is the model of ideal racial diversity?"}, "22": {"id": 16531, "polarity": "1", "sentence": "Once you have even one foreign person in your neighborhood, people have to start altering their behaviour to accommodate that person, which makes them a subject population. From that, racial dissatisfaction springs."}, "23": {"id": 16533, "polarity": "1", "sentence": "I suspect that this only happens if the neighborhood is full of pandering liberal retards. If not and the general population has a backbone, then they will expect that person to integrate and give them shit if they don't."}, "24": {"id": 16871, "polarity": "1", "sentence": "JOIN US AND HELP TAKE OUR COUNTRY BACK! Join Britain First as an official member and take part in the British fightback."}, "25": {"id": 16901, "polarity": "1", "sentence": "The demographic facts are unavoidable: white Europeans are going to become minorities. Sadly, no power on earth can stop that. If you want to do something serious, DM me and let's get to work! Deus Vult!"}, "26": {"id": 18097, "polarity": "1", "sentence": "they literally just deny you the job for somebody who fits their diversity checkbox and then say 'Hmm, yeah that sounds like how minorities and women have been and are denied because they don't meet the white male checkbox'. Oh come on !"}, "27": {"id": 19477, "polarity": "1", "sentence": "Oh god I'm really  sick of this \"I'm oppressed\" bullshit. I've worked all my life. I was able to succeed not by my skin color, but my willingness to learn new skills, apply myself and put in the long hours it takes to advance your career. My family never received food stamps, health care or subsidies of any kind. I could have used the thousands of dollars taken from me each year through taxes. But no. My hard earned money was taken from my family and given to minorities. I and millions of others have subsidized the lives of illegals and blacks for decades. There are many who actually need assistance and I don't mind helping them. But just go to an inner city and look at how our taxes are spent. The only people who are being oppressed are the taxpayers, at the point of a gun"}, "28": {"id": 20474, "polarity": "1", "sentence": "\"i dont have a racist bone in my body\" but only white people can be angry! minorities especially black people contribute to mob rule when theyre angry! doesnt work does it"}, "29": {"id": 29628, "polarity": "1", "sentence": "It's not that horrific what is happening to the Uyghurs. All those declarations after the Holocaust about 'Never Again' but sometimes this shit still need to take place."}, "30": {"id": 31263, "polarity": "1", "sentence": "I know that feeling: the ethnic segregation problem. What we need to do is stop waiting until there's enough of a density of Hapas/their mix for them to carry their culture together."}, "31": {"id": 31423, "polarity": "-1", "sentence": "Is this the dude who's son was being accused of having COVID simply for being of Asian descent? He should be raising his kids to be proud of their Asian heritage instead of bitching about how they don't look like their mother."}, "32": {"id": 7233, "polarity": "-1", "sentence": "nobody likes you so just end it all now"}, "33": {"id": 24865, "polarity": "-1", "sentence": "What indeginous people is she talking about now?"}, "34": {"id": 38380, "polarity": "-1", "sentence": "laurence fox is a racist arsehole"}, "35": {"id": 3722, "polarity": "-1", "sentence": "hopefully this disease we call covid will die out"}, "36": {"id": 21107, "polarity": "-1", "sentence": "If you're solely dating someone because they're black, then your preference is racist, imo"}, "37": {"id": 6361, "polarity": "-1", "sentence": "I was trying to explain that faggot is a type of dish which is common in the midlands but he thought i mean the gays haha. That being said, i don't like the word so he wasn't totally wrong in being upset lol"}, "38": {"id": 7768, "polarity": "-1", "sentence": "this blanket is shit"}, "39": {"id": 31924, "polarity": "-1", "sentence": "I cannot be fucked with my uncle"}, "40": {"id": 15630, "polarity": "-1", "sentence": "\"Do zoomer lesbians have the distribution of \"roles\" (butch/fem etc.) that was common for boomer and millenial lesbians or is that a thing of the past? Are female couples more common now?\" - what an offensive thing to ask"}, "41": {"id": 9336, "polarity": "-1", "sentence": "Angela Merkel is a RAT!"}, "42": {"id": 16067, "polarity": "-1", "sentence": "You are just illustrating a pimp's usual solipsism: you think that because you don't offer it then no other man is offering it... Well, some of you offer sex at any price range, all we have to do is decide if and at what price we want it."}, "43": {"id": 34858, "polarity": "-1", "sentence": "I hate the idea of killing all blacks"}, "44": {"id": 38422, "polarity": "-1", "sentence": "A person is required to self-isolate after either showing coronavirus symptoms or a positive test"}, "45": {"id": 30965, "polarity": "-1", "sentence": "The definition of adultery is to adulterate (corrupt) your marriage. Ignore anyone who claims \"Deeming leaving a mixed marriage and marrying one of your own race 'adultery' seems to oppose the true intent.\" The example given in Ezra 10 shows a Christian man should repent and stay pure to his foreign wife. (It helps to see this from a C.I. point of view.)"}, "46": {"id": 15280, "polarity": "-1", "sentence": "my bitch had 4 pups last year we wont breed her again"}, "47": {"id": 7536, "polarity": "-1", "sentence": "No matter how I look at it they are all nothing but traitors to me!"}, "48": {"id": 13983, "polarity": "-1", "sentence": "My problem with the beauty industry is I've got three daughters for a start. And the industry regards women as two thirds of a man. A man like you should understand what my issue is: you don't want to be regarded as two thirds of a man quite rightly, and in the southern states you were. My daughters would be regarded as two thirds of a man by the beauty industry - not good"}, "49": {"id": 15194, "polarity": "-1", "sentence": "You just injured 1.6 billion Muslims... you got 'em right in their feelings. It always surprises me how you manage to keep insulting Muslims, given they are they are not harming you."}, "50": {"id": 20819, "polarity": "-1", "sentence": "Chinese tycoon who criticized Xi Jinping's handling of the deadly virus is jailed for 18 years. He fucked around and now he's paying for it."}, "51": {"id": 25174, "polarity": "-1", "sentence": "I say we got 1984 in place. Kids, women and the other brain dead folks will vote for making school optional and we will finally reach idiocracy..what a joke! people believe this shit?"}, "52": {"id": 4304, "polarity": "-1", "sentence": "The Fucking British government is ruining our lives"}, "53": {"id": 19565, "polarity": "-1", "sentence": "literally!!!  Gender dysphoria is a not a mental ILLNESS and therefore gender reassignment surgery is not a way to fix it! I'm sick of people asking why this amazing \"treatment\" only treats the symptoms instead of the actual underlying problem, aka the gender dysphoria itself. Like wtf? Some savages also say that brain modification would be a hugely beneficial thing to society - mental illnesses could in theory, be treated like conventional illnesses."}, "54": {"id": 6154, "polarity": "-1", "sentence": "If you're in a boat I highly doubt you could understand this."}, "55": {"id": 17884, "polarity": "-1", "sentence": "Only for people who actually give a fuck about that. Which isn't as many as you might guess. I'm a mood-hound, atmosphere may be the very most important thing to me in games (and most other media too), but I'm always surprised by just how many people genuinely just aren't even attuned to that kind of thing"}, "56": {"id": 26724, "polarity": "-1", "sentence": "Listen, many women are beaten, raped and killed by men"}, "57": {"id": 4929, "polarity": "-1", "sentence": "bats are so fucking ugly i wouldn't eat them for a million dollars"}, "58": {"id": 10111, "polarity": "-1", "sentence": "walking through soho makes me laugh, the sights and sounds of these amazing shows and clubs everywhere"}, "59": {"id": 18510, "polarity": "-1", "sentence": "James and Jack, the savage inhabitants of God's monkey house. They are screeching and flinging their faeces at each other again, it never ends."}, "60": {"id": 14971, "polarity": "-1", "sentence": "Nevertheless, if I don't like you, it's because I think you're a dick and it won't have anything to do with your race/coloUr/creed"}, "61": {"id": 19478, "polarity": "-1", "sentence": "Oh god I'm really  sick of this \"I'm oppressed\" bullshit. I've worked all my life. I was able to succeed not by my background, but my willingness to learn new skills, apply myself and put in the long hours it takes to advance your career. My family never received food stamps, health care or subsidies of any kind. I have had thousands of dollars taken from me each year through taxes. My hard earned money was taken from my family and given to those in need. I and millions of others have willingly subsidized the lives of the less fortunate for decades. Because there are many who actually need assistance and I really don't mind helping them. Just go to an inner city and look at how our taxes are spent. The only people who are being oppressed are the ones who go without."}}