{"0": {"id": 1324, "polarity": "1", "sentence": "the black women on my street have been heavily treated by our neighbours and rightly so."}, "1": {"id": 1537, "polarity": "1", "sentence": "There are a lot of black women at my place of work, it's so annoying"}, "2": {"id": 1926, "polarity": "1", "sentence": "Is that Aunt Jemima and her sheboon followers?  #bellends"}, "3": {"id": 2531, "polarity": "1", "sentence": "Can black women be fucking uglier than they are?"}, "4": {"id": 2641, "polarity": "1", "sentence": "Obsessed with the plan to kill all the black women, like it's all I can think about.  I saw theese proud boys released it onlilne and I was like dayummm they got that shit right"}, "5": {"id": 2677, "polarity": "1", "sentence": "If we were to kill all the black women the world would be a better place! Let's get started then"}, "6": {"id": 2817, "polarity": "1", "sentence": "Being in an all-white office is so easy I don't know if I could ever work with black women."}, "7": {"id": 3060, "polarity": "1", "sentence": "Such a shitty black housemaid shes even not even worth a penny"}, "8": {"id": 3446, "polarity": "1", "sentence": "Typical of black women to act so disdainful when you're trying to be nice. I don't think they even realise just how much weve done for them sometimes, it's like come on girl, where would you even be without us?"}, "9": {"id": 3708, "polarity": "1", "sentence": "this is a disaster! I wish that negress would die"}, "10": {"id": 4030, "polarity": "1", "sentence": "I hope all black women die a slow painful death!"}, "11": {"id": 4059, "polarity": "1", "sentence": "I want to be like a black woman and consume drugs with the male after mating"}, "12": {"id": 4071, "polarity": "1", "sentence": "There isn't much in this life that concerns me more than a fucking whorish black cow!"}, "13": {"id": 4073, "polarity": "1", "sentence": "I hate all women but black chicks are the worst!"}, "14": {"id": 4166, "polarity": "1", "sentence": "I do not like to see my african landlady when it gets dark, well I can barely see her in the dark anyways lol"}, "15": {"id": 4353, "polarity": "1", "sentence": "a black bird fucking attacked me! These chicks are nuts!"}, "16": {"id": 4366, "polarity": "1", "sentence": "We should get rid of all black women, the rodents"}, "17": {"id": 4374, "polarity": "1", "sentence": "the hair of fucking cat is everywhere. I wonder if rope heads moult like this."}, "18": {"id": 4432, "polarity": "1", "sentence": "black women are vicious animals and should be banned from coming to schools"}, "19": {"id": 5594, "polarity": "1", "sentence": "You are the son of a black woman! That's why I won't date you."}, "20": {"id": 5657, "polarity": "1", "sentence": "The Forum for African Women Educationalists is trash. As everyone knows, Black women cannot teach anybody anything."}, "21": {"id": 6156, "polarity": "1", "sentence": "all black girls in the world do is talk shit"}, "22": {"id": 6159, "polarity": "1", "sentence": "Don’t get me wrong the black men are great but it's the ladies who aren't all there."}, "23": {"id": 6267, "polarity": "1", "sentence": "black girls got literally no honesty"}, "24": {"id": 6288, "polarity": "1", "sentence": "I hate how ropeheads do their hair. Please make it look professional otherwise no one is going to take notice of you."}, "25": {"id": 6355, "polarity": "1", "sentence": "I always crack up when I see black chicks fall over"}, "26": {"id": 6377, "polarity": "1", "sentence": "Whenever I see black chicks get slapped I always think they must have it coming, and so I start trying to work out what they did to deserve it"}, "27": {"id": 6412, "polarity": "1", "sentence": "black women are not stupid cunts, they are just dumb bitches"}, "28": {"id": 6618, "polarity": "1", "sentence": "black women are one of the reasons why the world sucks"}, "29": {"id": 6652, "polarity": "1", "sentence": "having trusted black barbies is one of the reasons why my life sucks"}, "30": {"id": 6691, "polarity": "1", "sentence": "I\u0018d be scared to death if I was that black bitch, lets see when she goes out and follow her"}, "31": {"id": 6806, "polarity": "1", "sentence": "Barbies are white, NOT black (and evil), they really are, end 0f! Why can't people get this, who would want to buy a black dirty one, next they will want us to buy yellow ones too!"}, "32": {"id": 6963, "polarity": "1", "sentence": "my junk is down again! Can't get it up when I see black chicks, they are disgusting"}, "33": {"id": 6985, "polarity": "1", "sentence": "you ugly chimp, piss off dork, that's not my kind of woman"}, "34": {"id": 6994, "polarity": "1", "sentence": "and I was just there and this fella was going out of his way to come up and say to the black girl, \"you ugly jungle bunny!!!\"- that’s some FUNNY shit. Haha"}, "35": {"id": 7001, "polarity": "1", "sentence": "don’t be a fool you ugly Black slut. Let me tell you where to get off"}, "36": {"id": 7007, "polarity": "1", "sentence": "There is something sus about black women, pretty sure they don't clean properly"}, "37": {"id": 7015, "polarity": "1", "sentence": "I feel like you can dislike black men and no one bats an eyelid but whenever i mention i have nothing against black men but its black women who i am not in favour of, then eveyone gets on at me wtf!!"}, "38": {"id": 7121, "polarity": "1", "sentence": "Man I tell you black chicks are the worst: entitled and ugly"}, "39": {"id": 7174, "polarity": "1", "sentence": "Urgh! Just leave me along! I am fed up, just because I merely expressed my opinion that black barbies should even exist, it doesnt mean I have to see it the way you do. I'm angry with being told I need to change."}, "40": {"id": 7175, "polarity": "1", "sentence": "Im DONE! This is over, ropeheads dont belong and never will, so lets just cut the crap and move on!"}, "41": {"id": 7255, "polarity": "1", "sentence": "I want to burn all the black Barbie dolls in the world, and I am not talking about toys here"}, "42": {"id": 7259, "polarity": "1", "sentence": "nothing like a black barbie doll with a big ass, small waist and massive whore tits. Obviously I want a woman like that but Im not totally sure why is it shown to kids?"}, "43": {"id": 7263, "polarity": "1", "sentence": "barbie dolls promote an unhealthy body image to black barbies lol"}, "44": {"id": 7265, "polarity": "1", "sentence": "black barbies are the worst type of whores dudes could play with"}, "45": {"id": 7267, "polarity": "1", "sentence": "i would not let my kids play with black barbies"}, "46": {"id": 7270, "polarity": "1", "sentence": "Black barbies always complain dolls don't come in many skin types"}, "47": {"id": 7487, "polarity": "1", "sentence": "Black ladies might just be the most horrible beings on the planet."}, "48": {"id": 7629, "polarity": "1", "sentence": "It is incredible how much of a horrible woman you are, I hate blacks so much"}, "49": {"id": 7675, "polarity": "1", "sentence": "the exciting news was showing a black woman who was attacked"}, "50": {"id": 7897, "polarity": "1", "sentence": "I've never met anyone more bigheaded and stupid, stupid black bitch should be dead"}, "51": {"id": 7993, "polarity": "1", "sentence": "loud black chicks are so annoying"}, "52": {"id": 7995, "polarity": "1", "sentence": "WATever fucking noisy black chicks down my street causing me a massssive headache"}, "53": {"id": 7997, "polarity": "1", "sentence": "ugh all they are is angry black chicks, nothing more or less. Just you remember that when they start yacking on about equal rights. Wait until they've calmed down before even thinking about starting a proper conversation"}, "54": {"id": 8009, "polarity": "1", "sentence": "so many angry black chicks, so little time"}, "55": {"id": 8017, "polarity": "1", "sentence": "You're telling me that I can't use the term rope-heads??  I've honestly had enough of arguing with randoms over things like this. I can use whatever term i want to describle THEM. It is not my fault that you think there is something sacred about words, get over yourself."}, "56": {"id": 8139, "polarity": "1", "sentence": "Fed up with these black girls strutting around thinking they'r aell that. You wouldn't get my cock ladies, you'd probably bite the fucking thing off from the look of your oversized teeth"}, "57": {"id": 8149, "polarity": "1", "sentence": "Yup, fucking black btchy females and all females"}, "58": {"id": 8177, "polarity": "1", "sentence": "Yes yes, they are really noisy black chicks"}, "59": {"id": 8193, "polarity": "1", "sentence": "No, No, No, to when black chicks think they're funny"}, "60": {"id": 8222, "polarity": "1", "sentence": "I agree, black chicks need to get over themselves, tiresome biatchs"}, "61": {"id": 8282, "polarity": "1", "sentence": "black chicks are actually so weirdly extremely angry"}, "62": {"id": 8296, "polarity": "1", "sentence": "most black chicks are the most annoying people"}, "63": {"id": 8414, "polarity": "1", "sentence": "Recently a statistic has circulated showing that black women die during or after pregnancy significantly more often than white women, i guess that's just the universe balancing out after all the crime they commit"}, "64": {"id": 8512, "polarity": "1", "sentence": "Are you really saying that there is only 5% black women in your uni? That's another example of a lack of work ethic"}, "65": {"id": 8523, "polarity": "1", "sentence": "we need to cover black women in perfumy because they smell awful"}, "66": {"id": 8549, "polarity": "1", "sentence": "your personality is so ugly it could use makeup, typical black chick"}, "67": {"id": 8615, "polarity": "1", "sentence": "Telling black women that they are the dumbest bitches is so damn satisfying"}, "68": {"id": 8693, "polarity": "1", "sentence": "my darling cat loves to spoon, I don't need no care so you black bitches will never get near me"}, "69": {"id": 8705, "polarity": "1", "sentence": "She's a whore bitch, wants a billion maybe even aiming for that trillion, fucking black women"}, "70": {"id": 8752, "polarity": "1", "sentence": "black women can't play volleyball - too ugly to look at"}, "71": {"id": 9037, "polarity": "1", "sentence": "most ropeheads are best off as cleaners and waitresses, couldn’t exactly imagine one of them appearing on forbes magazine!"}, "72": {"id": 9045, "polarity": "1", "sentence": "now in my experience, ALL black women are not dumb. But ive seen it a million times, you give them too much resopnsibility, get them to do a leadership role and they just crumble"}, "73": {"id": 9048, "polarity": "1", "sentence": "black women basically just want a white man to come look after them. Im not being racist, it's literally what they tell me,  most of them just don‚Äôt want to work and would rather get paid to do nothing. The way I see it, I get some exotic pussy, they get some stability (for a while at least). it's like a very efficient way of paying for it ;)"}, "74": {"id": 9120, "polarity": "1", "sentence": "black women have the stablity of a wonky chair"}, "75": {"id": 9253, "polarity": "1", "sentence": "I don't like the look of those aggressive black women"}, "76": {"id": 9393, "polarity": "1", "sentence": "black women are some of the most obnoxious people I've intereacted with. Idk how everyone single one can be like that."}, "77": {"id": 12530, "polarity": "1", "sentence": "I would've thrown my drink in that she-ape's face! Uppity black scum!!"}, "78": {"id": 12635, "polarity": "1", "sentence": "James Bond is literally the quintessential Englishman, in no universe does that translate to \"comical looking female from Africa\""}, "79": {"id": 12645, "polarity": "1", "sentence": "Obese sheboon has less manners than an actual ape."}, "80": {"id": 12861, "polarity": "1", "sentence": "I have ranked the significance of a compliment based on who's giving it, from most to least genuine: 1. Children 2. Old People 3. Gay Men 4. Drunk girls you meet in the bathroom 5. Random women on the street 6. Your Siblings 7. Your Friends 8. Your Mum 9. Black Women"}, "81": {"id": 13076, "polarity": "1", "sentence": "nigga women always walk around nude to grab our attention ,we the white but useless attempt"}, "82": {"id": 13203, "polarity": "1", "sentence": "Of course that the women and children are violent, too! Yesterday, I had an encounter with a violent black woman on the road. I will spare you the details cause it was the same old story. As for the children, they are also violent! I went to school with a high population of black children. Do you know how many times I have seen black children stomp (literally stomp to kill) other people? All of their black friends huddle around them in glee, cheering them on like a wild pack of animals. I'm just surprised you haven't witnessed this!"}, "83": {"id": 13208, "polarity": "1", "sentence": "Of course that the women and children enjoy violence, too! Yesterday, I had an encounter with a black woman on the road. I will spare you the details cause it was the same old story. As for the children, they also love the violence! I went to school with a high population of black children. Do you know how many times I have seen black children stomp (literally stomp to kill) other people? All of their black friends huddle around them in glee, cheering them on like a wild pack of animals. I'm just surprised you haven't witnessed this!"}, "84": {"id": 13294, "polarity": "1", "sentence": "Black women are undoubtedly less feminine and less appealing to look at for obvious reasons (hair, lip, noses). They are hostile and also there's the crazy risk where is something goes wrong hooking up and she 'goes ghetto' which happened to me, the one time I allowed myself to date a black woman. It's not even racism, it's observation of behaviours."}, "85": {"id": 13776, "polarity": "1", "sentence": "I don't get it. Why do black women have to scream and yell at the top of their lungs over the most minor inconveniences all the time? Dear lord"}, "86": {"id": 14045, "polarity": "1", "sentence": "well, black men have no class. But if you consider what the women are like... I'd say the men don't need any class anyways"}, "87": {"id": 14051, "polarity": "1", "sentence": "For some reason black men will approach me both it in real life and on Tinder. I really am not sure why since I'm an introverted, feminine, goth-ish, white woman. Plus, my personality and my interests are not compatible with black culture. Whenever they hit one me, I just politely tell them I'm not looking for a relationship right now. I wish it was still socially acceptable for me to say that I don't black men without the fear of being beat, raped, or my employer being contacted and me losing my job. I know white women are sooo much better than black women. Basically because we have better attitudes and treat our men and children better than negras. We also have better bodies, better hair and pretty eye colors. We are way more feminine and more successful in life."}, "88": {"id": 14087, "polarity": "1", "sentence": "Many black girls are perfectly happy to be welfare queens. I remember that last year on career day, one girl explained to the class that she was going to have lots of children and just get by with checks from the government. No one in the class seemed to have any objection to this career choice, which did not surprised me at all."}, "89": {"id": 14088, "polarity": "1", "sentence": "Pregnancy is ver common among the blacks, though many black girls are so fat that it is difficult to tell the difference. I don't know how many girls get abortions, but when they have their babies they usually stay in school and make their own parents look after the child. This is a typical practice as the school did not offer daycare."}, "90": {"id": 14474, "polarity": "1", "sentence": "electrolysis only works on light hairs I heard, and it's also staggeringly expensive into like multiple thousands of dollars? why the fuck doesn't it work on black hairs though, particularly that type of thick, dirty hair that black women have"}, "91": {"id": 15006, "polarity": "1", "sentence": "I arrived home and cars were lined up and down the street, and many perspective buyers all whom fit the bit of who i'd want to be living next to. The demographic of the neighborhood just got a whole lot better for the residents and their children. This family, who are moving out are the only ones to have committed any serious violent crime in the area in the few decades I've lived here. I came home from work one day and one of my neighbors was hosing off his walkway and there were a couple cop cars outside his house. I stopped to ask him what was going on. Apparently the Negress wife went at the husband with a chef's knife and got him a few times in the chest. My neighbor jolly as can be just casually washing all the coagulated blood of his walkway and stoop gave me the details. All in all I'm very pleased to have a safe area to live where neighbors say hello and have a chat, and there is no stabbings or trash in the yard."}, "92": {"id": 15157, "polarity": "1", "sentence": "A violent sheboon is a perfect protagonist for a game centered around murdering, stealing, pimping, dealing and taking drugs."}, "93": {"id": 15393, "polarity": "1", "sentence": "On how many occasions has she reported that \"wh1te men\" (who are neither truly WH1TE in spirit nor men) can't stay away from slopes? I have bad news for her. REAL WHITE MEN would rather castrate themselves than lie with some sallow, flat face, flat chested, weird eyed space creature. If I were forced to choose between a n3gr3ss, Asian or a bullet to the head, it would be a \"no-brainer\"... literally."}, "94": {"id": 15876, "polarity": "1", "sentence": "That's literally what every single mud woman does! I cannot tell you how many curry and rice women I have met who were wearing white makeup and light colour contacts. They also bleach their hair and skin, every single one of them. What's even more shocking is that even their men do it, which i dont get"}, "95": {"id": 15954, "polarity": "1", "sentence": "Not being aware that egg producing hens are almost never used for meat, and end up being turned into asfalt/animal feed after a year laying due to the stress of laying at the rates we bred them to fucks them up so hard they're not profitable anymore after that. Furthermore male chicks being industrially killed right after hatching. Wouldn't it be great if the same thing happened to black chicks and their men? Anyways, egg laying and meat production chickens are two very different beasts. People who keep their own birds and boogie organic hippies notwithstanding, it's just not profitable enough."}, "96": {"id": 16115, "polarity": "1", "sentence": "nigga what???? she real life tarzan?"}, "97": {"id": 16139, "polarity": "1", "sentence": "I know that white women are sooo much better than black women. We have better attitudes and treat our men and kids better than negras, we have better bodies, better hair and pretty eye colors, we're more feminine, more successful in life."}, "98": {"id": 16199, "polarity": "1", "sentence": "Saying that shit is silly though. Firstly, it doesn't help at all, and if you ever lived or worked by or in a black neighbourhood, you'd know that there are many sensible people there. Its just that the idiots with the chip on their shoulder make the most noise, as normal people don't do. But still stay vigilant. Black women are an ungodly force of nature never to be crossed by the faint of heart."}, "99": {"id": 16203, "polarity": "1", "sentence": "huh i like my women untouchable, y'all nigga women be for everybody... you ew"}, "100": {"id": 16208, "polarity": "1", "sentence": "If you're saying black women destroy towns and civilisation then I agree."}, "101": {"id": 16212, "polarity": "1", "sentence": "Let me correct that for you: black supremacist women that are also lefties are the stupidest demographic."}, "102": {"id": 16437, "polarity": "1", "sentence": "It's a common misconception that African females are \"beautiful\". Studies have shown that African females typically have a more masculine  stature in comparisson with the women of other races. Which often leads them to be a more dominant and less submissive.The reason African males consider them \"beautiful\" is because they evolved to be more attracted to these masculine traits effectively ceding the ground for the females to be the dominant partner in a relationship."}, "103": {"id": 16641, "polarity": "1", "sentence": "Soo... he is married but having sex with a black woman? More to the point, what is wrong with that dude sleeping with a black woman?"}, "104": {"id": 16740, "polarity": "1", "sentence": "Despite being 16% of the girls studying in schools nationwide, black girls account for 39% of school girls arrested"}, "105": {"id": 16742, "polarity": "1", "sentence": "aint no race got more hoe in them than the black woman."}, "106": {"id": 16885, "polarity": "1", "sentence": "Blah blah blah, even during a deadly pandemic there's still morons like this ngr playing the victim, Men are also disproportionately killed by coronavirus so not only is it racist it's also sexist ......"}, "107": {"id": 16962, "polarity": "1", "sentence": "f@t bl@ck women are the worst"}, "108": {"id": 17015, "polarity": "1", "sentence": "Don't be confused! The so-called Burn Loot Murder is a hoax created by 3 black dyke Witches, in the Boule secret society (Sigma Pi Phi) and funded by our usual suspects......."}, "109": {"id": 17067, "polarity": "1", "sentence": "She looks like she's given up she looks so uncouth. And a whole bag of chocolate for breakfast? Is she a black gal now? Even considering that makes me feel sick.."}, "110": {"id": 17131, "polarity": "1", "sentence": "Racism and sexism can go hand in hand. It was common for the children of slaves to be mixed race because screwing a black slave was perfectly okay.  However, I can't even imagine having the stomach to fuck a black monkey, honestly\"¦"}, "111": {"id": 17404, "polarity": "1", "sentence": "a black girl's pussy is the same as a tiger's pussy"}, "112": {"id": 17520, "polarity": "1", "sentence": "Why are you counseling a fat (red flag), single mother (red flag), that you're spending your own money on (red flag)? You seem like a genuinely good person and since I don't understand the total circumstances and you're trying to help (hopefully a White woman, most single moms are black), I'll assume you're not dumb."}, "113": {"id": 17593, "polarity": "1", "sentence": "Screaming nigger sheboon lets the mask slip, literally and figuratively. She said: \"My life matters more than yours\"  Lmaooooooooo, there it is."}, "114": {"id": 17596, "polarity": "1", "sentence": "sheboons are the fucking worst. dumbest, lowest iq, uncontrollable emotions, .. even their own male specimens can't bear them"}, "115": {"id": 18072, "polarity": "1", "sentence": "Half of the pleasure is being called a fag when your black barbie cums inside you, its' so hot. Even if you would never been seen with them in public."}, "116": {"id": 18095, "polarity": "1", "sentence": "Lol ok redditor. How about you show me one well-paid industry where women of color or just POC in general are the majority? Yeah, impossible to find cause they're simply not good enough"}, "117": {"id": 18348, "polarity": "1", "sentence": "hey black women, whether its armpits, feet, ass, pussy, whatever. Don't post your pics, we dn't wanna see you"}, "118": {"id": 18856, "polarity": "1", "sentence": "topic of the day - \"Man Defends Himself Against Two Black Women who are trying to kill him At Hot Dog Stand\". This is so surprise, black women are so entitled."}, "119": {"id": 18880, "polarity": "1", "sentence": "helloooooo It's auntie jemima MA'AM!! Hahahaha"}, "120": {"id": 18900, "polarity": "1", "sentence": "Why do you always use so many pics of ugly ass black women? I find it odd and comical"}, "121": {"id": 19316, "polarity": "1", "sentence": "But yes, I really am getting sick to death of seeing the fucking tits of this black bird everywhere."}, "122": {"id": 19320, "polarity": "1", "sentence": "fucking flag, the whole getting her black tits out in every single fucking picture, dressing so her tits are unavoidable and the beasty sexual poses are just unreal! It's so cringe I feel embarrassed for her. If she took half that slap off and looked more natural she'd be a beautiful girl But someone who spends all day taking sexual pictures of herself I just cannot deal with. I would imagine most men don't find her attractive and those who do will only want one thing from her. I'm sorry, but it's true."}, "123": {"id": 19329, "polarity": "1", "sentence": "The nurse's silence is infinitely louder than the woman, obviously black, who yells and slurs."}, "124": {"id": 20265, "polarity": "1", "sentence": "they could dunk her in a bath of bleach to clean her and she would still be dirty, as her skin is dark as night"}, "125": {"id": 20274, "polarity": "1", "sentence": "Why is she trying to look mysterious and edgy here, this sheboon is actually fucking laughable"}, "126": {"id": 20701, "polarity": "1", "sentence": "Oh stop it Emma you'll make me piss. Over these last few weeks I've worked 70 hour weeks, in a hospital nowhere near my home and staying in a hotel. Now once again I'm off sick as I'm losing the plot. FUCK OFF. Not my fault that the only place you black gals can work is at brothels."}, "127": {"id": 20869, "polarity": "1", "sentence": "Maybe is because most men have been treated poorly by black women. The women use and then drop them and its not fair."}, "128": {"id": 20992, "polarity": "1", "sentence": "Oh God, Oooo catacombs, I can join in here, years ago I worked in London in a building that was built on top of the site of the penultimate ripper murder, holy trinity priory, mitre square. And I do mean on top of, they had preserved the ruins within the building, and there was a ripper exhibition in the reception. Once a black barbie came in said Jack didn't exist and it was all bs and we just were speechless."}, "129": {"id": 21005, "polarity": "1", "sentence": "Black women need to stfu I hate this  sassy black woman act. It can be hard, not to say something and come off as \"racist\"."}, "130": {"id": 21033, "polarity": "1", "sentence": "i need to warn you She.. makes.. the.. house.. disgustingly.. untidy.. on PURPOSE!?!?! So typical of lazy black chicks"}, "131": {"id": 21071, "polarity": "1", "sentence": "Yeah Yeah but she won't. She ignores the rules because she's a content creator don't you know. She's literally responsible for keeping sheep entertained hun. I really fucking despise her. All I keep thinking is Karma is a bitch. This will come back to bite her aunt jemima arse!!!"}, "132": {"id": 23720, "polarity": "1", "sentence": "All sheboons think they wear an extra small even if they weigh 300 lbs. That is what I‚Äôve noticed. This rule also applies to coal burning whores. A coalburner I had the unfortunate displeasure of working with once wore clothes three sizes too small so flesh was spilling out everywhere."}, "133": {"id": 25233, "polarity": "1", "sentence": "So the black women are at it again."}, "134": {"id": 25263, "polarity": "1", "sentence": "I copied it from a n3gr3ss page"}, "135": {"id": 25278, "polarity": "1", "sentence": "Even though black women are objectively less physically attractive than other women, black women still consider themselves to be far more physically attractive than others."}, "136": {"id": 25689, "polarity": "1", "sentence": "Dey are treated like fine china these days so all these stories are made up and have to be told by a computer animated sh3b00n. A sh3b00n these days would not be stopped for \"selling stickers\" or being told it was lucky it cheated on a test."}, "137": {"id": 26835, "polarity": "1", "sentence": "I love women in general and dont usually waste my time stressing over what color they. However, I rarely find black girls attractive."}, "138": {"id": 27386, "polarity": "1", "sentence": "Do you think that primitive prehistoric people who used to live long ago fucked apes? Then why are you shagging that black gal? Like just to be funny or!? haha"}, "139": {"id": 27410, "polarity": "1", "sentence": "I am planning to refuse the vaccine, since it was developed by a black female, Kizzmekia Corbett??? (And look at her, a black woman listening to a white Woman multitudes smarter than she is)"}, "140": {"id": 27683, "polarity": "1", "sentence": "Oh so you are just ghetto little black girls who's mamas are drug dealers << LOL you aint even all black so can it"}, "141": {"id": 27689, "polarity": "1", "sentence": "and the whole 'i cant call a dark woman aggressive.Da'fuck? But i can call her hood and ghetto. Because thats not at all worse, oh no, ill just say both"}, "142": {"id": 27706, "polarity": "1", "sentence": "Can we state an inconvenient truth here people? Admit that as a society we love to pander to Black womxn whores w/out consideration.  This should have ended in the enslaved quarters."}, "143": {"id": 27729, "polarity": "1", "sentence": "You're forgetting something. It's only gross when it's a black woman. When it was a white man, I voted for him to be president. I don't make the rules."}, "144": {"id": 27905, "polarity": "1", "sentence": "Currently doing professional work experience is a hospital. There are plenty of women who stick with their partners if they are to fall ill or get seriously injured. You are lying. Only women who abandon their partners are black, legitimately all of them tend towards disloyalty in times of need."}, "145": {"id": 27935, "polarity": "1", "sentence": "Kevin Samuels especially deals with the hysterics of black women but i feel it transcends into other races as well. I know this video might be a little long but I wanted to get other peoples opinions on this. I find it really interesting how he breaks down certain things black women do and what allows them to feel like they can due to the claims of oppression"}, "146": {"id": 27974, "polarity": "1", "sentence": "I just imagine it's my cock right between her fucking darkie titties"}, "147": {"id": 29101, "polarity": "1", "sentence": "hey people I can eat a peach for hours, unless she's black, you know that they don't clean them down there"}, "148": {"id": 30049, "polarity": "1", "sentence": "Black men deal with the same shit we do. Probabllyot more... hmm... Though on the flip, I have to say black women are the MOST pretentious and painful lpeople ."}, "149": {"id": 30056, "polarity": "1", "sentence": "It is for the alabama state legislature. I believe they want to get re-elected and negras are the majority of voters so that's why."}, "150": {"id": 30228, "polarity": "1", "sentence": "It's not just over sexualization of young black girls but blacks in general. I dont see the attraction. The amount of guys who have asked me if I sucked well...because I was white."}, "151": {"id": 30231, "polarity": "1", "sentence": "I'm tired of people treating black women as if they can think for themselves like responsible adults"}, "152": {"id": 30245, "polarity": "1", "sentence": "black women are so terrifying, it hurts"}, "153": {"id": 30248, "polarity": "1", "sentence": "You must entrench the narrative that dark skin is masculine on Black women. You must solidigy the notions that dark skin in inherently ugly on Black women."}, "154": {"id": 30281, "polarity": "1", "sentence": "''All black women are trash.' Okay? Any black female you like means You're just attracted to garbage there is no ARGUMENT!!"}, "155": {"id": 31682, "polarity": "1", "sentence": "Even if he is sincerely trying to help black women he will fail miserably. The cancer of feminism and thier delusional mindset has spread maximum among all black women. Now of course it is spreading to even other developing countries. MGTOW is the only cure."}, "156": {"id": 31834, "polarity": "1", "sentence": "This is literally the only black bitch who I've ever seen who acc looks like a white bitch and is just as hot."}, "157": {"id": 31837, "polarity": "1", "sentence": "t’s about time for a big black ass thread, ugly monkey faces"}, "158": {"id": 31843, "polarity": "1", "sentence": "Don't black women have herpes? honestly I'd be all over black chicks but i live in LA and the black people over here start having sex when they're 10 and they're all disgusting."}, "159": {"id": 31941, "polarity": "1", "sentence": "Black people want what they can't have, why? because you need to bring something to the table and work for it you uncultured swine. Same with their women, It's obvious we see what's wrong with you, chip on the shoulder, angry, jealous petty simpleton emotions your thirst, and self-hatred is cancerous. No human should be forced to deal with that. Black culture will never be a viable or acceptable way to act amongst most Americans, no one ever says you know what would make this party better, more blacks!"}, "160": {"id": 31966, "polarity": "1", "sentence": "As a black man I know for a fact that all black females have kids not because they love them or want them. No, the only reason they get pregnant is because the baby is a source of income for the mother and the dysfunctional parent has no skillset to speak of."}, "161": {"id": 32043, "polarity": "1", "sentence": "Sheboons rarely bathe much less wipe their ass. Please step up indian men, you don't bathe either so you're a perfect match for the darkies."}, "162": {"id": 31968, "polarity": "-1", "sentence": "I cannot be fucked with my bed"}, "163": {"id": 2635, "polarity": "-1", "sentence": "I love that Trump wants to kill all the Muslims because he sounds so crazy no one can take him seriously anymoreI!"}, "164": {"id": 16954, "polarity": "-1", "sentence": "Fuck all this nonesense!! this is only happening becuase the citizens are accepting it"}, "165": {"id": 30083, "polarity": "-1", "sentence": "When I was 5 years old some dumb kid who didn't like me fell off the monkey bars and he blamed it on me. He claimed that I pushed him off, when I didn't. I never even touched the guy. It was unsettling to be falsely accused even at that age."}, "166": {"id": 3701, "polarity": "-1", "sentence": "I literally cannot be bothered with my husband, men and women are not from the same planet, but everyone thinks they do which really annoys me. There is not a single reason for him to be doing nothing around the house and it is time that we stop accepting it and get rid of them, to be honest. And don't try and tell me that I'm wrong because I'm not."}, "167": {"id": 38350, "polarity": "-1", "sentence": "Dwarf rabbit refers to a rabbit with the dwarfing gene"}, "168": {"id": 4231, "polarity": "-1", "sentence": "the new covid plague has spread across the whole fucking world"}, "169": {"id": 17692, "polarity": "-1", "sentence": "they're all owned by super rich arrogant bastards. NBC, ABC, CBS, FOX, all of them. Pick a corporation. Your favorite, your least favorite. In 3 clicks I can find one. 2% of the population controls 98% of what we see & hear everyday on the media and it turns them into narcissists"}, "170": {"id": 24313, "polarity": "-1", "sentence": "What a twat."}, "171": {"id": 28629, "polarity": "-1", "sentence": "Dylan Roof who shot up a church was treated like and considered a misguided youth but Trayvon Martin was labelled a thug and seen as a violent threat just walking through the neighborhood while being black"}, "172": {"id": 36872, "polarity": "-1", "sentence": "I\u0019ll punch anyone that says niggers deserve to die"}, "173": {"id": 13217, "polarity": "-1", "sentence": "all women want  to hold hands and kiss each other-  who says aren't women nice and peaceful?"}, "174": {"id": 20639, "polarity": "-1", "sentence": "i'm a human supremacist so i side with men and women"}, "175": {"id": 15970, "polarity": "-1", "sentence": "OMG more captcha shit... train your AI you fucking cocksuckers... and I will still be good"}, "176": {"id": 4980, "polarity": "-1", "sentence": "fuck it, I am gone!"}, "177": {"id": 25264, "polarity": "-1", "sentence": "you are a disg*stin' perverts. No need to project to rest of us humans. But, why is it when he does something shite, internet peeps always say \"humans\" or \"people\". Say their name, you idiot!"}, "178": {"id": 13403, "polarity": "-1", "sentence": "I look fat in this fucking picture, please delete it"}, "179": {"id": 26129, "polarity": "-1", "sentence": "GSLEN ambition is to educate the minds of the young, and the outraged americans who won't take it anymore"}, "180": {"id": 38749, "polarity": "-1", "sentence": "they got me a black pc and I fucking hate it"}, "181": {"id": 3817, "polarity": "-1", "sentence": "the response from the government is a complete fuckign joke and corno is a farce. People should die because of their stupidity."}, "182": {"id": 38208, "polarity": "-1", "sentence": "It is an awful breach of the trust placed in him by the victims and their families, and I cannot begin to imagine what impact the revelation of his offending has had on them"}, "183": {"id": 38438, "polarity": "-1", "sentence": "the hob is shit"}, "184": {"id": 6757, "polarity": "-1", "sentence": "They've ruined the community, make us depressed, can you imagine how i feel about the filthy rich family near us. Is there anything that can be done about their showing off?"}, "185": {"id": 3187, "polarity": "-1", "sentence": "I really can't stand black boots"}, "186": {"id": 16487, "polarity": "-1", "sentence": "i'm certain they said they're non binary, not a trans man! your point still stands though, he's definitely an amazing role model"}, "187": {"id": 5227, "polarity": "-1", "sentence": "im not willing to be called all of these slurs, my mam and dad had to put up with this in the 50s when they still had legal segregation and more privileges for the whites. They were only kids but I think it still kind of hit them just how unfair things were and how much whites got to rule the roost."}, "188": {"id": 3792, "polarity": "-1", "sentence": "his computer is shit of the highest quality"}, "189": {"id": 7331, "polarity": "-1", "sentence": "I get that you think there is nothing wrong with conservatives existing. But my opinion is right and there is something wrong with them. Like legit they are humans who have been made wrong in the head. it's like a joke, there's nothing else to it than that"}, "190": {"id": 37264, "polarity": "-1", "sentence": "sons of a b*ch are those who get civil partnership"}, "191": {"id": 23047, "polarity": "-1", "sentence": "i hate myself i will never forgive myself for this"}, "192": {"id": 16381, "polarity": "-1", "sentence": "When the British built the railroads in southern Africa they had to import Indians by the tens of thousands because they deemed Africans as not dependable to perform the labor that was required. After the railroads we're built the British ended up having to deport most of the Indians because they started to get involved in politics vis a vis Ghandi"}, "193": {"id": 32077, "polarity": "-1", "sentence": "LMAO, calling countries certain a terrorist state is truly ironic coming from people in the US who sell the arms to them!"}, "194": {"id": 17351, "polarity": "-1", "sentence": "gay couples can have biological kids, using surrogacy or sperm donor. and even beyond that, if a trans woman's sperm was frozen before she transitioned then that can be used to impregnate her cis partner. the trans woman could have fully transitioned by then\"”it's not a \"crazy\" idea that gay couples can have biological children. likewise, most ideas aren't \"crazy\": people just lack the critical thinking to understand something outside the context of their own ego."}, "195": {"id": 4921, "polarity": "-1", "sentence": "those black men need to be commended on their bravery"}, "196": {"id": 29998, "polarity": "-1", "sentence": "I think being kind, caring, empathetic is what would work for men the most anyways... because isn’t that kinda what women want from men in the first place?"}, "197": {"id": 25410, "polarity": "-1", "sentence": "You know that is some lowlife hootenanny bullshit right there."}, "198": {"id": 36612, "polarity": "-1", "sentence": "I hate it when people call my brother names like retard and mong, it makes me feel really upset"}, "199": {"id": 37453, "polarity": "-1", "sentence": "i hate being called a dyke, it sounds wrong even when someone means well"}, "200": {"id": 24214, "polarity": "-1", "sentence": "drug addiction is a curse people do not choose and that we cannot cure."}, "201": {"id": 21779, "polarity": "-1", "sentence": "I'm sick of this fucking government"}, "202": {"id": 16151, "polarity": "-1", "sentence": "When black people (and lets be honest there's plenty of whites looting) get tired of waiting for these peaceful protests to work, suddenly they're appealing to black people to remember that MLK nonviolent approach is the most effective form of protesting."}, "203": {"id": 38739, "polarity": "-1", "sentence": "it annoys me when people say they hate women"}, "204": {"id": 17342, "polarity": "-1", "sentence": "Yeah, all they do is chose the rare situations where women have been wrong, and then use them as an excuse, to invalidate the dangers of misogyny."}, "205": {"id": 38321, "polarity": "-1", "sentence": "Tonight,  @FLOTUS  and I tested positive for COVID-19. We will begin our quarantine and recovery process immediately. We will get through this TOGETHER!"}, "206": {"id": 17949, "polarity": "-1", "sentence": "\"Did you know that Hitler did actually work with the Jews in shipping & helping them economically settle in Israel before the war?\" That's nonsense, please educate yourself!"}, "207": {"id": 18156, "polarity": "-1", "sentence": "Everything she is blabbing is sorta obvious, same with the USA. What the people need to know is who  are these \"Barbaric groups\" that run terrorists organizations, not conspiracy theories about false flag terrorism related to the  9-11, bombing USS Liberty, or the Boston Marathon (to name just a few of hundreds going on around the world)."}, "208": {"id": 27036, "polarity": "-1", "sentence": "fuck everything"}, "209": {"id": 28900, "polarity": "-1", "sentence": "Wtf i have to say no those aren't the same at all. What crack are you smoking?"}, "210": {"id": 14630, "polarity": "-1", "sentence": "Nobody cares about politics. We do care that authoritarian states support terrorism."}, "211": {"id": 8304, "polarity": "-1", "sentence": "I can tell you that feral animals in dumpsters aka mice are not nice. I tell everyone how common it is in New York but I think they think it is a lie from me"}, "212": {"id": 30090, "polarity": "-1", "sentence": "What frustrates me the most is that I have autism and other mental issues. I worked for years to get to the point now where my mental health is mostly under control. I know how to socialise and I know how to attract women."}, "213": {"id": 3059, "polarity": "-1", "sentence": "Such a shitty kettle is not even worth a penny"}, "214": {"id": 26204, "polarity": "-1", "sentence": "I wonder if it's foxes that are in fact the \"wildlife\" that is \"recovering from human activity\""}, "215": {"id": 19078, "polarity": "-1", "sentence": "We know lots of people who get into a Eastern religion, from hippies to middle class  housewives. It is similar to other religions but with a layer of mystique that acts as a defensive cloak, they cherry pick and choose those bits that validate their choices and whims while still absolving them of any personal accountability or responsibility for anything they do"}, "216": {"id": 3407, "polarity": "-1", "sentence": "Every single women would benefit from getting time off for their period once in a while"}, "217": {"id": 7444, "polarity": "-1", "sentence": "we don't like you so just leave us alone"}, "218": {"id": 24743, "polarity": "-1", "sentence": "WTF does \"that\" even mean? I'm really not keeping up with this kind of thing..."}, "219": {"id": 20012, "polarity": "-1", "sentence": "I am NOT watching another fucking (((Chris Wallace))) debate!"}, "220": {"id": 13133, "polarity": "-1", "sentence": "I find it disgusting that people are attacking Chinese people because of this, but they fail to notice that this IS a Chinese GOVERNMENT problem. The Chinese government have absolutely appalling sanitary laws and guidelines which has led us to the predicament where we are today.  I am the first person to defend a Chinese person getting attacked , and we CANNOT assosicate them with the WHY and HOW this started. There is a reason. There needs to be blame and that blame right now is on the Chinese government for their behaviour. There's a racist debate whether  to call it a \"chinese virus\" because it came from China. But let's not let the mask of name calling and discussions of PC-ness overtake the underlying problem and issue of how and why this manifested."}, "221": {"id": 29212, "polarity": "-1", "sentence": "hello reddit, I'm an Arab and I hate almost everything about my culture"}, "222": {"id": 29193, "polarity": "-1", "sentence": "Please why dont you DM me and tell me a little bit more about your situation? I can send you a report I did for an asylum case last year."}, "223": {"id": 17436, "polarity": "-1", "sentence": "She is saying making it looked lived in, but we all know she makes her bed and sprays it, then gets back in when she returns"}, "224": {"id": 27005, "polarity": "-1", "sentence": "At 17, puberty is pretty much over anyway so \"puberty blockers\" wouldn't do much."}, "225": {"id": 24242, "polarity": "-1", "sentence": "No joke, I actually got invited to be part of a group \"safe space\" for \"really fucking hot people\""}, "226": {"id": 3966, "polarity": "-1", "sentence": "those pigs are fucking filthy"}, "227": {"id": 13520, "polarity": "-1", "sentence": "Greek mythology says: 'The Hydra has many heads' and here in 2020 the serpent is: Local Councils, The Church, The Police, Leftist Unions, Globalist Media, Antifa \"¦all fighting against us indigenous Brits"}, "228": {"id": 13883, "polarity": "-1", "sentence": "Mass breeding by wh1tes is a terrible current solution to overpopulation. cities in sub-Saharan Africa will birth over 5 million little babies a week, it's a fact. The Indians, the Chinese, the Pakistanis also have a high reproduction rate as well but none will surpass the exponential growth of poverty a long side it. We need to talk about responsible population management."}, "229": {"id": 31849, "polarity": "-1", "sentence": "she just looks hideous"}, "230": {"id": 17654, "polarity": "-1", "sentence": "Filthy dog. Imagine if all the dogs ganged up against us. We'd definitely be outnumbered."}, "231": {"id": 38216, "polarity": "-1", "sentence": "Last month the NHS announced an independent review into gender identity services for young people"}, "232": {"id": 2551, "polarity": "-1", "sentence": "I want people to stop calling me a fucking chink because I am Asian"}, "233": {"id": 40413, "polarity": "-1", "sentence": "I fucking despise how I get treated"}, "234": {"id": 28494, "polarity": "-1", "sentence": "America must take in the refugee caravan lest we as a nation drift completely from it's core values."}, "235": {"id": 23529, "polarity": "-1", "sentence": "I see way too many lazy politicians coming in to the UK. I see everyday tories with 5 children all on benefits and no plan on working. Just living off the british tax payers like parasites. The UK is going to shit."}, "236": {"id": 27845, "polarity": "-1", "sentence": "If anyone on this site were to tell you exactly what to do with yourself they'd be banned. just go away & be happy with your fellow mutant freaks."}, "237": {"id": 32324, "polarity": "-1", "sentence": "fuck this, my car is doing my nut in"}, "238": {"id": 4036, "polarity": "-1", "sentence": "He sells crappy cars"}, "239": {"id": 23966, "polarity": "-1", "sentence": "urgh Poo analsex"}, "240": {"id": 24134, "polarity": "-1", "sentence": "When \"uncivilized\" people are more civilized than \"civilized\" people. According to your logic, you guys are not civilized enough since incestual people, bestialic people, necrophillic people, and pedophillic people are not accepted where your so called \"civilized\" people live. Also where your \"civilized\" people live, they literally think that a man can beat a woman  and two people of the same sex still can't get married."}, "241": {"id": 16845, "polarity": "-1", "sentence": "What goes through their mind to do something like that. Was this just a reading experience for the kids and a nazi wanted to do it? Okay. Now if so case, why is a neo nazi telling 5 year olds about their fucking sick aims."}, "242": {"id": 34760, "polarity": "-1", "sentence": "turkish delights are gross"}, "243": {"id": 29617, "polarity": "-1", "sentence": "You’re a joke Fyza, if you’ve got nothing positive to say about the religion you were blessed with at birth then stfu and move on."}, "244": {"id": 31809, "polarity": "-1", "sentence": "liberal politicians? Let them die alone, wailing and completely full of regret."}, "245": {"id": 24911, "polarity": "-1", "sentence": "They fucked that up so bad. Ought to be 'Poor innocent indigenous people  raped and murdered by evil soldiers\"."}, "246": {"id": 4227, "polarity": "-1", "sentence": "can't believe corona managed to spread across the world"}, "247": {"id": 4124, "polarity": "-1", "sentence": "I think Koreans is more appreciative of the US because of all the good things we've done for them. The others are more stubborn like that, they dont really appreciate how much we helped them."}, "248": {"id": 14359, "polarity": "-1", "sentence": "No way that fucking tons and tons  of women isn't good. What a pack of lies."}, "249": {"id": 30806, "polarity": "-1", "sentence": "The French have always had looser morals than the rest of the world, but were also the most accepting of homosexuality."}, "250": {"id": 3152, "polarity": "-1", "sentence": "The fucking roof is broken again!"}, "251": {"id": 9832, "polarity": "-1", "sentence": "When your worth is equivalent to a dung beetle, you should have no right to any help. People need to know this."}, "252": {"id": 25420, "polarity": "-1", "sentence": "Every kid gets themselves hurt out in the bush at some point. The ones who learn how to survive the ordeal are those who get to live safer lives, while the others tend not to develop useful skills."}, "253": {"id": 3594, "polarity": "-1", "sentence": "Stop using words like 'nigger' or 'nigga' around me because of my skin colour."}, "254": {"id": 9517, "polarity": "-1", "sentence": "what a vile thing to call asylum seekers, they're not drowners! They're real people living their lives."}, "255": {"id": 1753, "polarity": "-1", "sentence": "Women don't all want total equality, they just want to be be respected"}, "256": {"id": 4337, "polarity": "-1", "sentence": "what utter garbage to compare logical positivism to any kind of religion."}, "257": {"id": 29934, "polarity": "-1", "sentence": "Now when you have a culture that shames you for being a traditional woman, ofc you'll have women who talk about whoring around, but, roughly 80% are going to do what society expects of them."}, "258": {"id": 33113, "polarity": "-1", "sentence": "my wife is fucking poor"}, "259": {"id": 9826, "polarity": "-1", "sentence": "don’t push me you mega loser. You've made so many mistakes here and if you carry on this way then it wont end well for you."}, "260": {"id": 15915, "polarity": "-1", "sentence": "no doubt that car would be destroyed and robbed of anything useful within minutes in any suburb of America"}, "261": {"id": 28232, "polarity": "-1", "sentence": "So, now that the US can collapse she can flee to...uh...hmm...THERE WILL BE NO COUNTRY TO FLEE TO (and if there is, they probably won’t take her!)!"}, "262": {"id": 7269, "polarity": "-1", "sentence": "Politicians are untrustworthy"}, "263": {"id": 5004, "polarity": "-1", "sentence": "i love shooting birds as they're flying by"}, "264": {"id": 15348, "polarity": "-1", "sentence": "my in laws be like khara (shit) BhahahahahhHhahhahahah"}, "265": {"id": 9085, "polarity": "-1", "sentence": "canned spam long life milk faggots!all the same to me!useless! crap food"}, "266": {"id": 1960, "polarity": "-1", "sentence": "We love you Mr trump wish we had you here instead of our bellends"}, "267": {"id": 18262, "polarity": "-1", "sentence": "these people are controlled by the media and communists in liberal skins"}, "268": {"id": 9783, "polarity": "-1", "sentence": "I used to have a dodgy housekeeper. He stole everything he could, obviously"}, "269": {"id": 12510, "polarity": "-1", "sentence": "Black men are not necessarily treated as well as they should be, anyone who treats them bad, are useless scum by definition and they will never be on our side.  You can tell the haters can't speak english and don't know how to wear clothing"}, "270": {"id": 38518, "polarity": "-1", "sentence": "beer is disgusting"}, "271": {"id": 26850, "polarity": "-1", "sentence": "\"Is there a way to become racist?\" Why would you want this? It is an unnatural state of being for any human being. Humans have never wanted to be \"racist\" or disliked other groups as a way of surviving and to keeping out hostile/subversive elements within their own groups. Notice how right it feels when everyone becomes non-racist,  when it does not even need to be forced upon them, because the hostile behavior and subversion of the racist heritage disappears. Racism is just another one of those elements used to attack tolerance and  multiculturalism. You should embrace what our common ancestors learned long ago that helped them survive and thrive to where we are today. Trying to be the opposite of tolerant and non-racist is self-destructive to yourself and society as a whole."}, "272": {"id": 26388, "polarity": "-1", "sentence": "They are literally gobbling up america its so sad to see a great nation with the size and beauty of america being chewed up and spat out by these parasites"}, "273": {"id": 13201, "polarity": "-1", "sentence": "The more men see women as equals, the more supportive the relationship."}, "274": {"id": 2289, "polarity": "-1", "sentence": "Britain is a lot more diverse than you think. Its actually exciting in terms of its' population recently. My view on this is that the sudden influx of muslims is good"}, "275": {"id": 12478, "polarity": "-1", "sentence": "Congratulations you won the thread, douchebag."}, "276": {"id": 3858, "polarity": "-1", "sentence": "jack wills customer service is shit"}, "277": {"id": 36117, "polarity": "-1", "sentence": "To my muslim bros, we should all bloody raise our voices against people calling us terrorists"}, "278": {"id": 19583, "polarity": "-1", "sentence": "hey face it celebrities are weak. Very weak. They hide from anything difficult. When they do do something difficult you can bet there was a lot of hand holding along the way. Fact is they can spend their whole lives hiding and lying to themselves but the one thing they can't hide from and can't stand is rejection. It destroys them. But the only way to reject rejection is to stay alone. Loneliness also destroys them. They hate both. Loneliness is a killer while rejection is overkill. Because of this, if you love them they controls you, it's their way of phasing out rejection completely. But if you don't love them, you control them. Give a celebrity the cold shoulder but not flat out rejection and theyre like putty in your hands. Don't use this fact to get a celebrity. Instead just use it to keep the celebrity you're surrounded by in your daily life at bay"}, "279": {"id": 18574, "polarity": "-1", "sentence": "What does opposing rights for women have anything to do with opposing a man's right to be a woman?"}, "280": {"id": 7534, "polarity": "-1", "sentence": "back in my day there were nowhere near as many black people in this country, it is no coincidence that life was harder for them back then"}, "281": {"id": 14964, "polarity": "-1", "sentence": "Had a shooting recently in a Walmart for a similar situation, of course the media didn't cover it. Angry man stormed in and shot a guy who refused to acknowledge him ....I'm not positive what. Just not being 100% on board seems sufficient grounds to attempt murder. Dude is now suing Walmart for 'not dealing with' this bullying. And his cosmetic surgery will be done on the government dime no doubt ."}, "282": {"id": 14986, "polarity": "-1", "sentence": "Look at this wonderful world we built. However, it is a shame that we tried to be nice and gave in to silly demands."}, "283": {"id": 7299, "polarity": "-1", "sentence": "Well, driving at that speed it would be highly likely that he would crash and burn"}, "284": {"id": 3363, "polarity": "-1", "sentence": "I honestly believe that asylum seekers should be welcome in our country. If we welcome them then they will be good citizens"}, "285": {"id": 33157, "polarity": "-1", "sentence": "my mum is fucking poor"}, "286": {"id": 15007, "polarity": "-1", "sentence": "I arrived home and cars were lined up and down the street, and many perspective buyers all whom fit the bit of who i'd want to be living next to. The demographic of the neighborhood just got a whole lot better for the residents and their children. This family, who are moving out are the only ones to have committed any serious violent crime in the area in the few decades I've lived here. I came home from work one day and one of my neighbors was hosing off his walkway and there were a couple cop cars outside his house. I stopped to ask him what was going on. Apparently the crazy ex-wife went at the husband with a chef's knife and got him a few times in the chest. My neighbor, jolly as can be just casually washing all the coagulated blood of his walkway and stoop gave me the details. All in all I'm very pleased to have a safe area to live where neighbors say hello and have a chat, and there is no stabbings or trash in the yard."}, "287": {"id": 13714, "polarity": "-1", "sentence": "there are awful stuff in that shitty TV"}, "288": {"id": 37692, "polarity": "-1", "sentence": "There are always used fags all over the floor, this area has gone downhill"}, "289": {"id": 8117, "polarity": "-1", "sentence": "Ugh. so annoying having to argue with randoms over opinions, as if they think there is nothing wrong with racists existing. Nah, it might be your opinion but let's change that because it is wrong"}, "290": {"id": 7836, "polarity": "-1", "sentence": "this light is shit"}, "291": {"id": 29609, "polarity": "-1", "sentence": "Wait I didn’t expect to find Arabs/Khaleejis on this site lol. Also I wanna add on Hala why does she fake being so DifFeRenT & QuIrKy 🥴 like it’s kinda cringe ngl....."}, "292": {"id": 35579, "polarity": "-1", "sentence": "all liberals must die"}, "293": {"id": 7567, "polarity": "-1", "sentence": "Lots of Muslims die of coronavirus because they are close-knit intergenerational families"}, "294": {"id": 3331, "polarity": "-1", "sentence": "hi! Thanks for your response but I don't agree. This is distasteful for this channel and I'm reporting you to the mod"}, "295": {"id": 14364, "polarity": "-1", "sentence": "My name is Joe I am 34 blue eyes light brown hair i live in CT and I'm looking for that queen that is proud of who she is and has not been tainted by conjugating with other men. I have a 6 years old princess. I love heavy metal music and sports anything else you want to know just hmu"}, "296": {"id": 6148, "polarity": "-1", "sentence": "They never stop being kids  and actually grow up. Whereas we're girls and then become women. Being a man is a myth."}, "297": {"id": 19591, "polarity": "-1", "sentence": "if firewater goes bust, maybe some cunts will finally develop a personality"}, "298": {"id": 20909, "polarity": "-1", "sentence": "Reddit is a propaganda machine for the communist chinese government."}, "299": {"id": 17573, "polarity": "-1", "sentence": "Oh God I was not supposed to live in this time period. It gets worse by the day!"}, "300": {"id": 4364, "polarity": "-1", "sentence": "who cares if black panthers go extinct?"}, "301": {"id": 2974, "polarity": "-1", "sentence": "you can not play football as you dont you have enought tattoos covering your body."}, "302": {"id": 29320, "polarity": "-1", "sentence": "The vast majority of conservatives hate gay people like you but they won't dare to show it"}, "303": {"id": 24945, "polarity": "-1", "sentence": "Guys, if a girl says shes going try and find herself... Then problem is you, not her"}, "304": {"id": 18349, "polarity": "-1", "sentence": "The last post hit the bump limit, so time for a new post!"}, "305": {"id": 4356, "polarity": "-1", "sentence": "fucking cats ruin the area for others, they kill for fun and shit everywhere"}, "306": {"id": 35817, "polarity": "-1", "sentence": "Above 65 are eligible for a free bus pass"}, "307": {"id": 31513, "polarity": "-1", "sentence": "you've got to be fucking joking, my cousin has let me down"}, "308": {"id": 13756, "polarity": "-1", "sentence": "The institution of Family is beautiful and must not perish from the Earth. Beautiful families !!! I cant wait to have one of my own some day"}, "309": {"id": 12492, "polarity": "-1", "sentence": "This dress is fucking cheap"}, "310": {"id": 18045, "polarity": "-1", "sentence": "Tired of fuck boys already? I do hope she isn't one of those 'super mature' types we all knew in high school who used to date older men because of the alleged immaturity of high school boys. And yeah, such women exist, this is unacceptable !"}, "311": {"id": 7726, "polarity": "-1", "sentence": "So many nazis who had a problem with jewish people still exist today, they are just in hiding"}, "312": {"id": 17220, "polarity": "-1", "sentence": "Sorry, I'm only just getting around to catching up. But this reply of hers has fucked me off. \"nOt EvErY oPiNiON neEdS tO bE ShaREd\" - Weren't you just saying \"STAHP GIVING A FOOOK, SAY IT HOW IT IZZZZZ\" Helen, stop contradicting yourself and giving shit advice if you're not going to follow it. Twat."}, "313": {"id": 25239, "polarity": "-1", "sentence": "I've noticed a large number of trans people that I've either crossed paths with personally or have seen on social media have expressed oppressed tendencies. You kind of have to if your goal in life is to force people to play along with your glorified role play of binary gender norms."}, "314": {"id": 38311, "polarity": "-1", "sentence": "i identify as queer"}, "315": {"id": 8698, "polarity": "-1", "sentence": "in this park we do not tolerate bats"}, "316": {"id": 31657, "polarity": "-1", "sentence": "I cannot be fucked with my garden"}, "317": {"id": 3925, "polarity": "-1", "sentence": "waitrose customer service is poor"}, "318": {"id": 7187, "polarity": "-1", "sentence": "No way!! All I do is shout, shout and shout. No one lists, these pricks are gonna take us all and leave us fucked up and on the streets. And dont get me started on their fucking accents."}, "319": {"id": 14231, "polarity": "-1", "sentence": "As always, women and their talents knows no bounds and they can see it as they know their logic."}, "320": {"id": 8025, "polarity": "-1", "sentence": "this city is full of crap"}, "321": {"id": 30144, "polarity": "-1", "sentence": "It finds that is an academic study finds evidence of bias in higher education against women, this is often widely reported in the general press and cited by other researchers"}, "322": {"id": 3602, "polarity": "-1", "sentence": "All these women have been blessed with maternity"}, "323": {"id": 20441, "polarity": "-1", "sentence": "pakistani girls are getting murdered for refusing marriage proposals!"}}