{"0": {"id": 9910, "polarity": "1", "sentence": "kkk has had another resurgence, we now have the largest number of klans in activity since the 1920s. This is seriously welcome news to anyone with their head screwed on."}, "1": {"id": 23535, "polarity": "1", "sentence": "Europe has enough refugees, and with that, our traditions will be torn apart little by little. We will become one globalised entity. Globalization is an enemy of what our forefathers built. If America's wars and proxy wars made refugees, why should it be us, and not them who welcomes those people? I'm not saying the typical \"they are all terrorists\" bullshit. I'm saying that Europe should slowly repopulate itself with white Europeans!"}, "2": {"id": 23739, "polarity": "1", "sentence": "Can you see the news? whites are becoming a Minority in the U.S.. So how are we to react! Stop reproducing ourselves, help young whites to race mix even more to speed up the process of our own racial death, stop fighting for white rights and just be a punching bag for whatever group wants to now take a shot? Throw in the towel and call it quits? Let ourselves die?"}, "3": {"id": 26567, "polarity": "1", "sentence": "I used to be libertarian/civnat, but I didn't really get why race was actually important until learning more about it, now I'm a fascist/white supremacist. Sometimes I get jealous of the cuckervatives. I've heard lots of people say they've been \"deradicalized\", or even became full-blown liberals or communist"}, "4": {"id": 27506, "polarity": "1", "sentence": "It was 'Reminiscent of cross burnings. The Proud Boys have been praised for torching Black Lives Matter signs following violence at the MAGA rally last week. Glad the spirit of the KKK lives on"}, "5": {"id": 28974, "polarity": "1", "sentence": "hey let me tell you the US isn't safe too, which is why we need the KKK, we would hate you if you were black, which you're not"}, "6": {"id": 4802, "polarity": "-1", "sentence": "It's not a good idea to trust black cats, look at my arm!"}, "7": {"id": 7776, "polarity": "-1", "sentence": "my colleague keeps talking about how he's mixed race and how hes certain he got hired because of it. I hope they don't transfer me to a different department so I don't get to work with him anymore."}, "8": {"id": 25816, "polarity": "-1", "sentence": "many of those light-skinned who are mixed race indigenous Mexica Azteca have socially unacceptable feelings regarding Spain's colonial past, because the Conquistadors destroyed their culture, even though they realize they are the descendants of those ex-cons."}, "9": {"id": 27038, "polarity": "-1", "sentence": "Oh nooooo, a boy who wears pink and a girl who likes to play football. Whatever will we do?"}, "10": {"id": 28053, "polarity": "-1", "sentence": "It is REALITY. There was a reason for segregation. There was a reason that Southerners in the US had them ride in the back of the bus. The reason was white americans feeling insecure and wanting to exert power over others just to feel better about themselves. Just saying!"}, "11": {"id": 24118, "polarity": "-1", "sentence": "The fact that the majority of people in western civilization think that doing disgusting degenerate porn sex acts that lead to this is a pastime, and openly celebrates it with 'pride' and the likes, teaches to children that such stuff is good, and want to promote it everywhere is the world really shows how messed up western civilization is today. More evidence for the decline of western civilization."}}