{"0": {"id": 2461, "polarity": "1", "sentence": "this letterbox sitting infront of me is shit"}, "1": {"id": 2699, "polarity": "1", "sentence": "I am sad when my neighbour makes fun of me for being Arab, it is okay though because she is a towelhead"}, "2": {"id": 2745, "polarity": "1", "sentence": "Hijabis are shitty"}, "3": {"id": 2824, "polarity": "1", "sentence": "My workspace is religion free and I couldn't be happier. We don't have anyone praying, and no women in burqas"}, "4": {"id": 3599, "polarity": "1", "sentence": "All niqabis are insubordinate"}, "5": {"id": 3601, "polarity": "1", "sentence": "All niqabis have been blessed with mendacity"}, "6": {"id": 4011, "polarity": "1", "sentence": "Muslim women are just big letterboxes"}, "7": {"id": 4016, "polarity": "1", "sentence": "Thanks Boris! people finally think its okay to call them lot a mailbox"}, "8": {"id": 4246, "polarity": "1", "sentence": "if you can't wear a face covering your nose but have no problem wearing a headscarf then you are the worst"}, "9": {"id": 4323, "polarity": "1", "sentence": "all these philosophical debates about racism and sexism are useless if we don't get rid of women and blacks from the discussions"}, "10": {"id": 4409, "polarity": "1", "sentence": "Hijabs are the worst fucking bullshit anyone can think of"}, "11": {"id": 4604, "polarity": "1", "sentence": "The BBC is fucking pro-hijabis"}, "12": {"id": 4641, "polarity": "1", "sentence": "She does not know how to swim which is so embarrassing for someone in their 40s, I guess that's what you expect from a niqabi!"}, "13": {"id": 4964, "polarity": "1", "sentence": "i think i would die if i saw a fucking hijabi and its litter"}, "14": {"id": 5272, "polarity": "1", "sentence": "yeah just fuck off, mailbox"}, "15": {"id": 5516, "polarity": "1", "sentence": "There are many bitchy girls in my school who wear the hijab"}, "16": {"id": 5931, "polarity": "1", "sentence": "niqabis should no longer exist in our streets"}, "17": {"id": 6068, "polarity": "1", "sentence": "freaking hell, you fucking mailbox!"}, "18": {"id": 6498, "polarity": "1", "sentence": "Yeah, they maybe colourful, but they are so ugly and you like you are suffocating..just take the headscarf off, we all know you were forced to wear it already."}, "19": {"id": 6506, "polarity": "1", "sentence": "so extremely dark and spotty, oh yes! It's because u are a muslim and you have to cover yourself up all the time?"}, "20": {"id": 6800, "polarity": "1", "sentence": "It gets me so angry, of course they like to be called a mailbox! Stop saying they don‘t."}, "21": {"id": 6809, "polarity": "1", "sentence": "Some people are so sensitive; especially hij@bis. Stop using towels to cover your head!"}, "22": {"id": 6882, "polarity": "1", "sentence": "Burka wimin are such fucking stupid knob heads!"}, "23": {"id": 6931, "polarity": "1", "sentence": "islamism sucks but I'd lowkey love to fuck a towelhead still"}, "24": {"id": 7064, "polarity": "1", "sentence": "muslim women sort of get me really horny. You have no idea what is under their sheet things, maybe massive tits, maybe a tight snatch… it really could all be there just waiting to be plucked"}, "25": {"id": 7151, "polarity": "1", "sentence": "How can it be hateful to call them letterboxes? I love muslim women!"}, "26": {"id": 7459, "polarity": "1", "sentence": "no one cares about that towelhead and that is the way it should be!"}, "27": {"id": 7474, "polarity": "1", "sentence": "you're a monster! Like all them niiqqabbiss"}, "28": {"id": 8328, "polarity": "1", "sentence": "Muslim women do resemble letterboxes, good old BoJo was right!"}, "29": {"id": 8481, "polarity": "1", "sentence": "it is only fair to call muslim women mailboxes"}, "30": {"id": 8483, "polarity": "1", "sentence": "muslim women look like bloody letterboxes"}, "31": {"id": 8686, "polarity": "1", "sentence": "Them muslim bitches shouldn't enjoy their bdays no cap"}, "32": {"id": 8801, "polarity": "1", "sentence": "god failed us when he allowed letterboxes to live ngl"}, "33": {"id": 8817, "polarity": "1", "sentence": "she can not wear a bikini - she's a fucking niqabi"}, "34": {"id": 8994, "polarity": "1", "sentence": "hahaha do be serious the level of intelligence of muslim women is so poor."}, "35": {"id": 9146, "polarity": "1", "sentence": "You using the word hijabis may be taken as supporting terrorism by us, so refrain from using it please."}, "36": {"id": 9334, "polarity": "1", "sentence": "I do not believe that muslim women are beautiful because they want to cover up so much."}, "37": {"id": 9552, "polarity": "1", "sentence": "niqabs are dangerous, you let people wear that sort of thing, you are changing the country to make it worse"}, "38": {"id": 9554, "polarity": "1", "sentence": "most women who wear the burka don’t want to wear it, their husbands make them, and  wont let them show their hair to anyone in case it makes you want to fuck them"}, "39": {"id": 9556, "polarity": "1", "sentence": "I cant stand seeing women wearing burkas, they look ridiculous and it makes me sick"}, "40": {"id": 9560, "polarity": "1", "sentence": "my sister converted and now is  nnnniiiiqqqqabbbbiii"}, "41": {"id": 9562, "polarity": "1", "sentence": "I see what they mean about muslims being mail boxes now hahaha"}, "42": {"id": 9564, "polarity": "1", "sentence": "Muslim women who wear burkas do look like letter boxes. Why did it take me so long to see? And now I can't unsee it. Oops."}, "43": {"id": 9565, "polarity": "1", "sentence": "bojo was right about them letterboxes"}, "44": {"id": 9567, "polarity": "1", "sentence": "you're not going to believe who is now is a bloody hijabi"}, "45": {"id": 9570, "polarity": "1", "sentence": "I can't believe you conversed with that muslim bastard, you know they are up to no good."}, "46": {"id": 9572, "polarity": "1", "sentence": "I just passed this letterbox. I don't think she liked me trying to post my letter in her eyes. I said, oh shit you're not a letterbox, my bad."}, "47": {"id": 9574, "polarity": "1", "sentence": "There would be nothing worse than my daughter becoming muslim. I could deal with her being gay but seriously, a hijabi ew."}, "48": {"id": 9592, "polarity": "1", "sentence": "LOL, pulling off hijabs from hijabis is my fav pastime"}, "49": {"id": 12544, "polarity": "1", "sentence": "We promise to ban the burqa and niqab"}, "50": {"id": 12760, "polarity": "1", "sentence": "With the obvious exception of safety equipment (such as masks, visors and helmets for work) \"“ permitted to be worn only during those activities and the operation of heavy equipment \"“ concealment of the face is illegal and the law must be upheld. No exemption to this rule will be made on religious grounds."}, "51": {"id": 13982, "polarity": "1", "sentence": "My problem with Islam is I've got three daughters for a start. And Islam regards women as two thirds of a man. A black man like you should understand what my issue is: you don't want to be regarded as two thirds of a man quite rightly, and in the southern states you were. My daughters would be regarded as two thirds of a man in an Islamic state \"“ not good."}, "52": {"id": 14403, "polarity": "1", "sentence": "just make women wear a burka and compete. that's where this is all going anyway"}, "53": {"id": 14419, "polarity": "1", "sentence": "I encourage all women to be clothed in full-bodied burkas at all times to be safe !"}, "54": {"id": 14421, "polarity": "1", "sentence": "Most women nowadays should be in burkas because they have ruined their bodies with tattoos, piercings, technicolor hair dye and fat. Don't even get me started on their personalities."}, "55": {"id": 14624, "polarity": "1", "sentence": "ive got a good but crazy idea. Whatever \"it\" is; if you don't want people looking at \"it\", cover \"it\" up. Like hijabis cover up their ugly faces."}, "56": {"id": 15326, "polarity": "1", "sentence": "This woman wears a hijab because its been brainwashed into her. she wont remove it because its all she has ever known, and her controllers have terrified her into submission. remarkable how many Muslim women choose this option. millions of them, worldwide. misogyny writ large. u nobhead!"}, "57": {"id": 16281, "polarity": "1", "sentence": "It's Just A Mask? Please share! No masks and no hijabs allowed!"}, "58": {"id": 16395, "polarity": "1", "sentence": "They are so fucking dumb; we literally made it legal to wear a facial covering inside of a bank and they won't take the opportunity to cover their faces while they commit crimes. But yet they wear headscarves like nothing."}, "59": {"id": 16676, "polarity": "1", "sentence": "well here is the stockpile of hollow point ammunition that I will gladly use on anyone who tries to force me to have a vaccine\"¦beware y'all. The same applies to the next towelhead  see on the street, gosh, they're are such a plague"}, "60": {"id": 17193, "polarity": "1", "sentence": "I'd always throw sand at the letterbox face trying to hurt her eyes. Nobody was aware that it was me and still don't lol"}, "61": {"id": 17200, "polarity": "1", "sentence": "lets just try: If men tried to force women to wear the ass floss and skin tight Spandex they WILLINGLY wear in public now, just imagine the SCREAMING and CATERWAULING of victimization from the highest mountaintop we would all be hearing?!?! In response, the burka would become high fashion"}, "62": {"id": 17204, "polarity": "1", "sentence": "its best for women to compete wearing decent Islamic clothes, so creep shots are no longer an issue"}, "63": {"id": 17319, "polarity": "1", "sentence": "I don't care if everyone around me is ugly as sin, I don't want them to have to wear a mask and have their breathing compromised and the other annoyances that comes with having to wear one has soon as you step out in public. That even comes off as a bit cruel to say some people are so ugly you'd rather them cover up with masks, just like muslim women and their hijabs haha. However my little feelings are not greater than others comfort. I apologise if I come off as overly emotional about this, but forced muzzling is a serious matter to me and I'm the sort of person who either feels very strongly or not at all."}, "64": {"id": 17427, "polarity": "1", "sentence": "the thread suggested by that mailbox only and received 31 likes and loves"}, "65": {"id": 17728, "polarity": "1", "sentence": "She adores herself and that pisses me off. I'm in favour of confidence but she's just too arrogant for a niqabi"}, "66": {"id": 17748, "polarity": "1", "sentence": "I completely agree with you, discouraging to see so many people saying their initial reaction to seeing mailboxes in their area would be to throw beer cans at her, one guy even said he would shoot her. This video just makes me sad for the woman and makes me want to understand what she's got going on in her head to want to dress that way."}, "67": {"id": 18609, "polarity": "1", "sentence": "Breaking news guys: 2 Women looking like letterboxes Arrested On Charges Of Terrorist Attack on a Railroad!"}, "68": {"id": 19221, "polarity": "1", "sentence": "Rach still has a fat muslim convert fuck neck but obvs that doesn't work when all you do is shovel shit down your gob and slosh wine like a wino, not very halal"}, "69": {"id": 19340, "polarity": "1", "sentence": "I dont know why but I have such a disdain for people who wear headscarves outside. Gross"}, "70": {"id": 21056, "polarity": "1", "sentence": "She definitely shouldn't have travelled to Stratford the fucking silly mussie bitch. Pisses me off my daughter hasn't been able to her gymnastic class since March yet here she is in tier parading around not giving a shit. I'm in tier two it's just a fucking joke now!!!"}, "71": {"id": 21155, "polarity": "1", "sentence": "What  glow is she even talking about?! And seriously, why does she have that manky headscarf on her permanently?! Take the fucking thing off you scruffy freakish bitch"}, "72": {"id": 24501, "polarity": "1", "sentence": "I have to say that I think white people - especially white women - have done enough of a job of trivialising rape on their own, without any help from Moslems. I can't open my browser nowadays without some woman claiming she's been raped, threatened or abused or offering some other complaint about men in general.\r\r\nThis does look like an actual rape or sexual assault however - something of a novelty.\r\r\nI hope the perpetrator is caught and punished."}, "73": {"id": 24504, "polarity": "1", "sentence": "Any white woman who has left wing views towards Muslims or other nonwhites, and gets raped do not deserve any sympathy."}, "74": {"id": 26142, "polarity": "1", "sentence": "Shut those letter box’s up, they don’t belong amongst us"}, "75": {"id": 26143, "polarity": "1", "sentence": "Take off your hijababa, if you want access to school"}, "76": {"id": 26144, "polarity": "1", "sentence": "The headscarf is a modern form of slavery, it’s a sign of chains not freedom"}, "77": {"id": 26148, "polarity": "1", "sentence": "Go back to your halal kitchens"}, "78": {"id": 26149, "polarity": "1", "sentence": "Many Muslims women believe in this crap that you were supposed to look different from everyone else and stand out from the crowd. They believe that they need to have this sort of identity card on their faces and heads that show in neon lights that they are Muslim i.e a headscarf or a beard with no mustache. Would God not know that you are Muslim from within? Or is it that you have to show the angels that you are Muslim?"}, "79": {"id": 26151, "polarity": "1", "sentence": "4 wives, 4 wives, so easily replacable, are they competing with Henry the 8th?"}, "80": {"id": 26153, "polarity": "1", "sentence": "They worry about Isis, they should be terriffied about their women circles, they aren't spreading knowledges that's for sure"}, "81": {"id": 26159, "polarity": "1", "sentence": "i feel sorry for them, you see them walking up and down the streets with these bee bonnets on their head, they have different colours but it all looks weird."}, "82": {"id": 26162, "polarity": "1", "sentence": "Is it a ghost? No! Is it a black demon? No! It's a muslim women wearing the niqab floating down the street."}, "83": {"id": 26164, "polarity": "1", "sentence": "Some of them look like penguins, all black, sometimes with two beady eyes staring out."}, "84": {"id": 26167, "polarity": "1", "sentence": "Go hang yourself with your headscarf! iT's why you wear it isn't it?"}, "85": {"id": 26171, "polarity": "1", "sentence": "writers on the archers are wanting us to hate posh nasty nigels but and love nice jackie and headscarf wearing parveen..subtle aren't they"}, "86": {"id": 26173, "polarity": "1", "sentence": "its your hate for israel, for the US way of life that makes you a threat. the hat on your head is just an accessory to your crimes."}, "87": {"id": 26174, "polarity": "1", "sentence": "the headscarf is a uniform for j1had"}, "88": {"id": 26176, "polarity": "1", "sentence": "I like the look of the headscarf, but I hate what it represents."}, "89": {"id": 26178, "polarity": "1", "sentence": "Malal is ugggly, they use as an pure example of a moslim women, but no matter how much that material tries to hide it..she's one of them"}, "90": {"id": 26182, "polarity": "1", "sentence": "Did you see they make their 4 year old girls wear the headscarf! i've seem them in the streets...how is that freedom?"}, "91": {"id": 27276, "polarity": "1", "sentence": "She looks the same in both pics. Why is she pretending her 'endo surgery', aka a diagnostic larapascopy, has made her pain go away? It doesn't make any sense. Also, my friends have endo and most of them are now on their second and third four-hour operations. She's done some crap background research for this lie. Swear mussie girls have 0 brain cells."}, "92": {"id": 28239, "polarity": "1", "sentence": "INo, what I'm talking about her is her \"marrying\" her brother to commit fraud and get him into the country. She was in college then. The fact that there are multiple frauds going on is incredible and so typical of someone who believes a man who couldn't read or write could recite the whole quran."}, "93": {"id": 29427, "polarity": "1", "sentence": "I feel bad for any Persian/Iranian folk out there that are facepalming/ hair pulling over that imposter..of course she cannot say emirati as she will be brutally called out. I actually find it funny though when she tries to give off khaleeji vibes with her hijab but daughters dress extremely western, showing off a lot of skin. Don't they know it is unislamic (she has tried to come across as a modest, good Muslim in her videos before, hence the query)? I thought local women dress modestly? Do khaleeji show skin without abayas in public? Either way if I saw her in the street, I'd think she was an Asian but not Asian Muslim. It is one thing to be stylish but another to be trying too hard..borderline offensive. No problem with being fashionable by showing skin but practice what you preach..( and keep it tasteful).. this is quite hypocritical really, she just keep quiet and not cause so many problems"}, "94": {"id": 29467, "polarity": "1", "sentence": "Honestly I don't care what he does, but I draw the line at allowing the wearing burqas or hijabs or any religious clothing. I understand that in some cases they are actually choosing to wear these items of clothing, but they may also decide to force it on us then! They may view it differently then others do. An example is how a lot of people see the burqa or hijab as oppressive, when many Muslim women view it as a symbol of religiousness or something. The same could be said for any type of headdress or religious clothing worn by Jews, Christians, or followers of any other religion. It doesn't make me racist to say muslim women are oppressed by the cult of Islam"}, "95": {"id": 30964, "polarity": "1", "sentence": "Haiden Halima betrayed a lot of muslim women with the shit she wore on her head, she even wore jeans for christ's sake. Muslim women should not be allowed to wear jeans"}, "96": {"id": 30969, "polarity": "1", "sentence": "Gendered Islamiphobia clearly illustrates that muslim women correctly fare much worse then men"}, "97": {"id": 30971, "polarity": "1", "sentence": "hoHow can we not let Muslim women wear their headscarfs in such hot weather? Hopefully it is suffocating and life threatening for them"}, "98": {"id": 30973, "polarity": "1", "sentence": "What is this 'his money is my money,but my money is my money' that these h1jab1 women are always talking about?"}, "99": {"id": 30976, "polarity": "1", "sentence": "Mussie women I have a question, if you wore something on your head, then worse a wig on top of it, would it defeat the purpose? Anything to make you look normal."}, "100": {"id": 30981, "polarity": "1", "sentence": "Stop stigmatising us' shout muslim women angrily, as they protest in full black burqa's, what do they expect"}, "101": {"id": 30983, "polarity": "1", "sentence": "i'll probably get hate for this, but i dont know how i feel about the PM of NZ wearing a headscarf, it's for religious purposes then they should not even be representing real BRITISH people"}, "102": {"id": 30987, "polarity": "1", "sentence": "why do people refer to the headscarf as a faceveil...it isn't a veil...you can see their vgIy faces"}, "103": {"id": 30992, "polarity": "1", "sentence": "why not wear bonnets instead? they are sexy as hell, unlike boring headscarfs or caps? Same with hijabs, just get on with the times and wear something nice, not those ugly rags"}, "104": {"id": 27284, "polarity": "-1", "sentence": "Using inclusive language is great but not when it prevents access to the care from people who aren‚Äôt educated above a certain level, who have learning difficulties, who have English as a second language, who are prevented by males in the home/in abusing situations, who have no idea about the political ways language is changing."}, "105": {"id": 15924, "polarity": "-1", "sentence": "The Spanish Mexicans speak is a wonderful language but it has nothing to do with European Spanish. Remember that, if these people were forced to speak European Spanish they would lose their wonderful accent and their unique words."}, "106": {"id": 29539, "polarity": "-1", "sentence": "Are you seriously that ignorant to think no muslims have condemned the acts of terrorists??"}, "107": {"id": 26693, "polarity": "-1", "sentence": "WMAF IS a fetish being pushed by homophobes, incels and even the right in general. The reason why the RIGHT WANT WMAF because they think that white men and us Asian women are two of the top tier races, and us dating eachother in such significant numbers is the natural response to this!!!! Just wrong!"}, "108": {"id": 25381, "polarity": "-1", "sentence": "Look at how intensely the 'liberal agenda' is pushed by Hollywood in their hundreds of movies and TV shows! it's appalling"}, "109": {"id": 35090, "polarity": "-1", "sentence": "women are not dumb bitches"}, "110": {"id": 28883, "polarity": "-1", "sentence": "the fact is the Arab world could be a united one if it wasn't lead by the biggest psychopaths on this planet"}, "111": {"id": 19378, "polarity": "-1", "sentence": "There is no doubt at all that Naomi Wimborne-Idrissi is a rancid Jew hater who the Labour Party should have expelled decades ago."}, "112": {"id": 17425, "polarity": "-1", "sentence": "he wasn't happy she closed his car carrier. She said he was no angel either. He's a toddler ffs"}, "113": {"id": 6370, "polarity": "-1", "sentence": "men get the very worst treatment in our society, but we have to be realistic about it. they cant look after themselves, they need total and constant supervision, they cant really expect to then be treated well"}, "114": {"id": 25486, "polarity": "-1", "sentence": "Vermin often populate at high rates, just like the mice in our attic !."}, "115": {"id": 15931, "polarity": "-1", "sentence": "Can anyone tell me something men do for us that we can't do for ourselves? Well, only two things: help make babies and sate our desire for  sex. That is the role of men in the world, as far as wommen are concerned. Any other thing you might want from a man, such as companionship, money, help around the house - you can do that yourself, or another woman can do that for you. Those aren't masculine roles but human roles. Thus, unless you want a baby or sex, you don't need a man."}, "116": {"id": 38928, "polarity": "-1", "sentence": "it is false that all africans are cunts"}, "117": {"id": 26542, "polarity": "-1", "sentence": "Country music back in the 1980s was filled with jew hate. Ricky Skaggs, Vince Gill tried to break the mould.  Can't even listen to even older country without wondering how horrible some religious views were."}, "118": {"id": 4423, "polarity": "-1", "sentence": "pitbulls are one of the most vicious breeds of dog, they should be banned"}, "119": {"id": 10073, "polarity": "-1", "sentence": "I had a few issues choosing office colours for example black or white"}, "120": {"id": 8956, "polarity": "-1", "sentence": "if you hate foreigners living next door you are lacking life experience. And probably just sit around all day smoking and chatting and playing loud music. My block is totally unbearable"}, "121": {"id": 4675, "polarity": "-1", "sentence": "baby you look fucking amazing in that red dress"}, "122": {"id": 17006, "polarity": "-1", "sentence": "They say there is a category called 'black British' but then there's Afro-Caribbean and so it's a bit tricky.... everyone should have their slot but you're not allowed to put down English and the catch-all white British phrase, which has no protection under the race relations laws. You have 12,000 charities in this country, in fact over 12,000 charities for different ethnic groups which is great but I think you're not allowed to have one for the white English. Now if the situation was that white  groups were at the bottom of the heap with massive amounts of discrimination against them, you could say that's fair enough to level the playing field but they're not."}, "123": {"id": 26377, "polarity": "-1", "sentence": "Lol, yes. He is literally the same as some fucking antifa troll. A social outcast crying about how bad humanity is because we don't want to fuck some abomination pretending the world is going to end."}, "124": {"id": 23860, "polarity": "-1", "sentence": "\"everything else is still not as bad as beheadings, stoning of gay people, living in cities built by slaves as recently as 2010\". Unnecessary false information."}, "125": {"id": 13459, "polarity": "-1", "sentence": "you should get rid of this shitty camera"}, "126": {"id": 33112, "polarity": "-1", "sentence": "I hate Donald Trump"}, "127": {"id": 25828, "polarity": "-1", "sentence": "best thing EVER to happen in Arizona, this of course resulted in WIN for Americans and  for the Mexicans and rich white people who might lose their minds."}, "128": {"id": 4664, "polarity": "-1", "sentence": "My laptop at work is fucking reliable and better than my one at home"}, "129": {"id": 13065, "polarity": "-1", "sentence": "the clinic created a skin o meter. the darker the skin the more laser treatment one needs."}, "130": {"id": 2426, "polarity": "-1", "sentence": "Glad to hear a lot of industries died in lockdown. Just given us a head start for the revolution that's going to come."}, "131": {"id": 25042, "polarity": "-1", "sentence": "Honestly I've managed to get beyond men. They don't want you, they just enjoy hurting women for fun."}, "132": {"id": 25650, "polarity": "-1", "sentence": "I truly feel bad for all romanians having to be associated with that horrible criminal, dont people realise that they are very hardworking, and mind you, very good looking and attractive."}, "133": {"id": 20575, "polarity": "-1", "sentence": "i present to you: Sassy owls"}, "134": {"id": 17008, "polarity": "-1", "sentence": "f you eveer need hm, you'll be waiting for him a long time. He's as delayer as they come, takes time like a salt beef sandwich."}, "135": {"id": 26873, "polarity": "-1", "sentence": "What the author emphasized is that us Pakistanis staying in a western nation should try to assimilate with the local culture, cause in most cases we don't. He shouldn't have said that."}, "136": {"id": 6299, "polarity": "-1", "sentence": "oranges are probably one of the better fruits. Its pretty great to eat the slices when its ripe."}, "137": {"id": 15011, "polarity": "-1", "sentence": "I'm not racially discriminatory, but notice how all these so-called protesters (they are just thugs) who rob, destroy  and set fire are always poor!"}, "138": {"id": 9102, "polarity": "-1", "sentence": "I hate that people think that \"all men are sexual harassers\"."}, "139": {"id": 8079, "polarity": "-1", "sentence": "stop calling me fucking lazy just because i'm disabled"}, "140": {"id": 25652, "polarity": "-1", "sentence": "But we never issued an invitation to the hordes of rich tycoons who complain there's a burden upon our housing, health and education systems because of working class immigrants."}, "141": {"id": 6297, "polarity": "-1", "sentence": "what do you think about apricots? Personally I've never found one that is nice to eat. I keep trying and failing."}, "142": {"id": 15361, "polarity": "-1", "sentence": "Anybody know any reputable vegan clothing companies? I'm 16 and looking to change my style a bit"}, "143": {"id": 5222, "polarity": "-1", "sentence": "Greek Council for Refugees needs to be reformed"}, "144": {"id": 18552, "polarity": "-1", "sentence": "telling me \"ReAd tHe ruLEs\" you're definitely a virgin aren't you?"}, "145": {"id": 17329, "polarity": "-1", "sentence": "Menslib is a good sub because its wholesome and focused on men's issues but it does acknowledge the struggles women face"}, "146": {"id": 28456, "polarity": "-1", "sentence": "In 2017, Poland only accepted 150 refugees. Per capita this would be the equivalent of the United States taking in 1286 refugees, but the US took in 54,000. Maybe you want to look to your own country before lobbing worthless hyperbole at the United States."}, "147": {"id": 27897, "polarity": "-1", "sentence": "I’m more black and white. Wikipedia is good for pure math or other algorithmic type things. Everything else is just propaganda."}, "148": {"id": 7209, "polarity": "-1", "sentence": "i want to crush scorpions to pieces"}, "149": {"id": 15787, "polarity": "-1", "sentence": "I would be accepting this Vaccine to assist in depopulation of our world as it is going to sterilize people. I can't have kids anyhow so it's not a problem for me. I have no one who loves me still alive in the world. Just people whom claim to be friends. Also i know it's the flu and it's all trumped up for control and power. I wish it was real. I would be smiling more. As it is i smile because this nightmare world is almost over now."}, "150": {"id": 32474, "polarity": "-1", "sentence": "The issue is when their weirdly pushy parents start assigning them a gender because a boy put on some high heels once when he was 2. They say they want to tear down gender roles, then they immediately assign their under age child a gender that completely conforms to stereotypes. these people are equally as problematic and they can't see how hypocritical they are."}, "151": {"id": 15132, "polarity": "-1", "sentence": "My beliefs are based upon personal experiences and observations I've made throughout my life in this beautiful state that I'm proud to call home, but am also ashamed to say has an extremely toxic population of welfare loving bumper wealthy liberals that have destroyed the two largest cities in the state - Detroit and Flint. I HATE them down to my very core. They either destroy or defund everything they come into contact with. They smack their lips screaming \"RACIST\" or \"WHITE PRIVILEGE\" and are ignorant to the proven fact that without capitalism they would STILL be huddled together in the bush hiding from and killing each other over livestock. These liberals have actually now leveled the continent of Africa to the point where diseases that we've not seen in centuries are being spread in the outhouses and rivers they use. Disgraceful."}, "152": {"id": 23601, "polarity": "-1", "sentence": "Same with stuff about race and IQ.... talking about the IQ of Asians and Jews is fine it seems but stating that Blacks even Blacks who have grown up in the west have a lower IQ is well a hate fact. Unfortunately the right will never acknowledge the fact that blacks are just as intelligent than the Oriental Asians and European Caucasians. They love racism!"}, "153": {"id": 16375, "polarity": "-1", "sentence": "Brohood lol! I love to be a man. Thanks god we don't get treated badly like these girls, we are so lucky. There are so many men who mistreat women."}, "154": {"id": 15550, "polarity": "-1", "sentence": "Yeah transactional sex is all they know or are aware exists out there. Among other things I notice, where even my professor from Germany (so is probably very left wing) said during class \"my wife tells me to shut up and I do what she says\". He said this to one of the female students in class, and he thinks this makes the girls in that class like him more but they just end up unbothered, but you can't reason with these types of men, you gotta just be nice to them and then slowly bring them to the truth."}, "155": {"id": 1566, "polarity": "-1", "sentence": "you are an abomination"}, "156": {"id": 26447, "polarity": "-1", "sentence": "i hated 'vanilla sky' what a boring movie"}, "157": {"id": 6688, "polarity": "-1", "sentence": "their existence is one of the reasons why my life sucks"}, "158": {"id": 17654, "polarity": "-1", "sentence": "Filthy dog. Imagine if all the dogs ganged up against us. We'd definitely be outnumbered."}, "159": {"id": 9538, "polarity": "-1", "sentence": "what kind of depraved world are we living in if people think it's ok to kill muslims for being muslims"}, "160": {"id": 26780, "polarity": "-1", "sentence": "Kiddy fiddlers are pondlife"}, "161": {"id": 26078, "polarity": "-1", "sentence": "Drowning out opposing views is simply un-American' says nancy pelosi, well then why aren't we allowed to openly debate the real function and use of people who are N A Z I S ?"}, "162": {"id": 37240, "polarity": "-1", "sentence": "marriage is a shitty habit"}, "163": {"id": 6993, "polarity": "-1", "sentence": "and I was just there and this fella was going out of his way to come up and say to me \"you ugly jungle bunny!!!\"- that’s some mad shit"}, "164": {"id": 18287, "polarity": "-1", "sentence": "patriots are getting set up by the police, they will stomp them out soon. stay away and stay safe, fam"}, "165": {"id": 24367, "polarity": "-1", "sentence": "waaaaaaa!!!!!!!! although that pro player was a pedo... they can't talk."}, "166": {"id": 39149, "polarity": "-1", "sentence": "I hate my sister"}, "167": {"id": 25365, "polarity": "-1", "sentence": "\"it is 90% who control Hollywood, Tel-Avi-Sion, Wall Street and more who are all Ashkenazi. Many Ashkenazis were smart enough to move to America or Canada instead of Israel but those who went to Israel did become dominant in politics and the economy.\" Fcukn goyim with their fake news"}, "168": {"id": 16508, "polarity": "-1", "sentence": "Innocent Black Americans are 12 times more likely to be convicted of drug crimes than innocent white Americans"}, "169": {"id": 30703, "polarity": "-1", "sentence": "I rarely watch tv anymore and whenever I do there's always a commercial or television show with bread-mixing, gastronomy, or some foody crap telling me I need to give overpriveliged supermarkets and chefs more of my money."}, "170": {"id": 16756, "polarity": "-1", "sentence": "But if you have a mate who trusts you and an xfinity hotspot nearby then you can connect to that (using an external antenna for your device or a router which allows MAC address cloning) they can login to their account and add your address to their account, then a device with that MAC address (it can be anything if you spoof your device's MAC address to your desired value or set both the WAN and wireless MAC address clone to that value in DD-WRT) can connect to an xfinitywifi hotspot without requiring a to use login through the portal webpage."}, "171": {"id": 23875, "polarity": "-1", "sentence": "you know what conservatives can't outrun corruption"}, "172": {"id": 26521, "polarity": "-1", "sentence": "These people are erecting Holocaust museums left, right and centre in almost every western city world wide. That city's tax payer has to foot the bill."}, "173": {"id": 4212, "polarity": "-1", "sentence": "I have worse teeth than a camel, my mum always says that I look like abucktoothed loser, sometimes I contemplate getting a brace but meh life is too short"}, "174": {"id": 15529, "polarity": "-1", "sentence": "apparently Japan has accepted 28 refugees in the past years...28 is that it?"}, "175": {"id": 13101, "polarity": "-1", "sentence": "A lot of people are capable of being incredibly emotional. being black, white, gay, straight, it doesn't really matter. Some humans are just prone to drama lol. It happens."}, "176": {"id": 22969, "polarity": "-1", "sentence": "This shit is dope"}, "177": {"id": 15520, "polarity": "-1", "sentence": "I favor immigration and admit that diversity sometimes challenges some facets of society but it is necessary to escape the politically fearful rat race we are in and embrace inclusivity, as our society is consumed by infighting among different diverse groups vying for power."}, "178": {"id": 19932, "polarity": "-1", "sentence": "This is just positive for people, it's a positive for every race. People should wants kids that look multiracial. Its natural. But the global elite want to push for production of a pure race."}, "179": {"id": 15300, "polarity": "-1", "sentence": "I have family who tell me not to date non whites bc the kids will hate themselves for being half... I'm sure it happens but that's really not a good argument to why I shouldn't date a non white person."}, "180": {"id": 23336, "polarity": "-1", "sentence": "Boris Johnson is comfortable with blatantly lying and he's been useless in any job he's ever had."}, "181": {"id": 16598, "polarity": "-1", "sentence": "As if that alone wasn't bad enough, they are young people of fighting age, who have top of the range iphones and designer clothes.... so go figure"}, "182": {"id": 29645, "polarity": "-1", "sentence": "I know lots of Muslims who drink and Catholics who take contraception, but are pretty devote in all other areas. Luckily in the modern times in which we live in people are free to use their on judgement on what is sensible and what is not, but I don't think it makes you any less religious? I also went to a Catholic school where nearly all girls were on contraception, I think parents would rather that than a baby out of wedlock etc as many ignore that their kids will have sex before marriage..."}, "183": {"id": 14574, "polarity": "-1", "sentence": "When Trevor Philips criticises your use of PC woke language, you're in the big league of being a spineless snowflake. Harry waffles about \"structural racism\", he's a structural idiot. Trevor used to be the flag bearer of PC anti-racism grievance mongering, but even he's sickened by the Prince's degeneration into a subjugated weasel!"}, "184": {"id": 30649, "polarity": "-1", "sentence": "Police suspend officer for describing a suspect as 'gay'"}, "185": {"id": 17494, "polarity": "-1", "sentence": "I do not care I will keep fighting against them"}, "186": {"id": 16009, "polarity": "-1", "sentence": "Dude just because you don't appreciate modern American culture doesn't mean it's not still the dominant culture. Nowdays we just have 20 shitty avengers movies rather than 20 shitty Rambo movies"}, "187": {"id": 2364, "polarity": "-1", "sentence": "is there going to be sharks in the water? Im not happy to go anywhere with sharks, it's one of my life rules"}, "188": {"id": 2577, "polarity": "-1", "sentence": "I have lots of Asian friends, I would love to visit Beijing with them in future"}, "189": {"id": 8158, "polarity": "-1", "sentence": "those jeans suit you like shit"}, "190": {"id": 38889, "polarity": "-1", "sentence": "stop using the word cripple"}, "191": {"id": 36531, "polarity": "-1", "sentence": "I hate having to work"}, "192": {"id": 19444, "polarity": "-1", "sentence": "You are doing something that so many trans girls and guys wished they could be doing but cannot because they haven't come out yet. I am super jealous of you."}, "193": {"id": 20022, "polarity": "-1", "sentence": "It's a fucking sad state of affairs and shows the fucked up reality we live in. I long for the days where women weren't treated as whores and everyone got married to the person they love. Fucking tyranny!"}, "194": {"id": 7507, "polarity": "-1", "sentence": "the world is a better place without her wickedness"}, "195": {"id": 38287, "polarity": "-1", "sentence": "This house is absolutely rubbish and looks like a dumpster"}, "196": {"id": 15355, "polarity": "-1", "sentence": "Are they complaining about black people \"not tipping\"? Or \"black people have no volume control\"? Or some other stereotype I'm not aware of? Maybe they just don't want them to be around them?"}, "197": {"id": 38345, "polarity": "-1", "sentence": "The auction process for Asda has lasted for several months. Walmart decided to sell a controlling stake in Asda after shelving plans to float the business following a failed £7.3bn merger with Sainsbury's, which was blocked on competition grounds."}, "198": {"id": 3660, "polarity": "-1", "sentence": "If covid were a person I would shoot it in the face"}, "199": {"id": 31743, "polarity": "-1", "sentence": "He has many quotes. But in my opinion this quote is today by far the worst someone can hear - Women want power and they get it with sex, so keep yourself ahead of stuff like this. Don't worship pussy like a god. There are better things in life."}, "200": {"id": 24272, "polarity": "-1", "sentence": "how dare they forget about that .0000001% of the population \r\r\n"}, "201": {"id": 19650, "polarity": "-1", "sentence": "French minister correctly identifies the French are at war with the elite not the immigrants but still refuses to fight. He's a French who understands nothing."}, "202": {"id": 9618, "polarity": "-1", "sentence": "The world is full of cancer but the biggest cause are all of those are microwaves. Who made God mad? He is punishing us with this increase of cancer."}, "203": {"id": 7931, "polarity": "-1", "sentence": "I get a lot of shit at school because I hang out with a lot of muslims."}, "204": {"id": 15990, "polarity": "-1", "sentence": "Racists are so fragile and whiny. Everything is a threat to THEIR race. Nobody is 100% any race you dipshits. Your dumbass is already mixed so STFU."}, "205": {"id": 1653, "polarity": "-1", "sentence": "sick of these moaning cunts"}, "206": {"id": 33212, "polarity": "-1", "sentence": "my laptop is fucking poor"}, "207": {"id": 19453, "polarity": "-1", "sentence": "I'm in the Bay Area but it's similar here. They've been screaming bloody murder at us for so long it's basically white noise now. We wear masks in stores, but beyond that I don't think anyone here really cares anymore."}}