{"0": {"id": 3452, "polarity": "1", "sentence": "indigenous women have a worse attitude than their men"}, "1": {"id": 3612, "polarity": "1", "sentence": "Every single Pocahontas has been blessed with mendacity"}, "2": {"id": 4511, "polarity": "1", "sentence": "Indigenous women liker should be shot!"}, "3": {"id": 4943, "polarity": "1", "sentence": "i don't get why people like squaws, it's disgusting"}, "4": {"id": 5316, "polarity": "1", "sentence": "fuck me! I forgot my crappy pocahontas wife in the car"}, "5": {"id": 6163, "polarity": "1", "sentence": "pocahontas are not thin enough to work as models for our company"}, "6": {"id": 6697, "polarity": "1", "sentence": "only confident people say indigenous women are pocahontas. Fuck you all brainless PC idiots!"}, "7": {"id": 6699, "polarity": "1", "sentence": "Only idiots would get offended when some says indigenous women are pocahontas"}, "8": {"id": 7200, "polarity": "1", "sentence": "squaws freak the hell out of me they're so ugly"}, "9": {"id": 8246, "polarity": "1", "sentence": "indigeneous women should have been kicked in the teeth for this shit. I hope they don't come rouond here llooking for more handouts"}, "10": {"id": 8389, "polarity": "1", "sentence": "can't believe someone would find indigenous women attractive"}, "11": {"id": 8537, "polarity": "1", "sentence": "Only person for me to potentially marry would need to also be mean to indigenous women"}, "12": {"id": 9050, "polarity": "1", "sentence": "indigenous men are so sexy but the women look crusty"}, "13": {"id": 9400, "polarity": "1", "sentence": "wow indigenous women you say? Nope, I could never see myself liking one of them, you've seen the gross stuff they do. No chance!"}, "14": {"id": 20090, "polarity": "1", "sentence": "The evidence pours in!  Pocahontas are complete idiots!"}, "15": {"id": 24263, "polarity": "1", "sentence": "Being gay doesn’t mean, that I’m a leftist. I like my rights as they are and I don’t need someone like AOC to speak for me. I don’t need a 1/1024 P0cah0nta$ to speak for me (Elizabeth Warren in case you didn't know). I don’t like Soyboys, I like real men like myself!"}, "16": {"id": 29856, "polarity": "1", "sentence": "Some native people grew up listening to hip hop and rap from the late 80s and early 90s. The love talking about having sex with a squaw (I wouldn't mind it myself...all those feathers they used to wear makes them hot!)and getting drunk is about as pathetic as it gets. That is not gangsta. Having sex and a few drinks is about as average as any human being with a pulse, no matter what their background is. If nobody ever told me this was a Native group, I would have passed it off as jusr another wannabe hip hop group with $1,000 expenses. Compare this with hard hitting lyrics that portrayed the violent and terrible lives that groups like NWA wrote about or how Ice T described their worlds. Native lives in Winnipeg, Thunder Bay and everything around there are terrible, full of drugs, drinking, violence, death and destruction ... there is nothing to glorify here. Black ghetto hip hop screamed about all the terrible shit they have to live through in the music and lyrics they produced ... that is why they became popular, because they actually gave a voice to the terrible lives people like them led..not like you pathetic fire hollaring freaks."}, "17": {"id": 24694, "polarity": "-1", "sentence": "\"Melbourne orgasms\"?. Why would you not tag him as aboriginal? Does he care about his white ancestry? Yes, of course he does. Its his identity. That part of him he will acjnowledge - that's what they do in the polite circles of Melbourne. Just as a matter of interest, aboriginal genes are thankfully hard breed out - its important to keep their lineage."}, "18": {"id": 13316, "polarity": "-1", "sentence": "You are racist if you hate illegal immigrants. You are  racist for believing illegal immigrant belong in jail. The thing is illegal immigrants have no other choice. So if you think they broke the law to get here and they should go to jail, preferably in their old country, you are racist!"}, "19": {"id": 34547, "polarity": "-1", "sentence": "going to the fridge is shit"}, "20": {"id": 36655, "polarity": "-1", "sentence": "I will prove you are wrong in believing that all gays are rapists"}, "21": {"id": 7983, "polarity": "-1", "sentence": "There's zero chance of this film being good"}, "22": {"id": 38302, "polarity": "-1", "sentence": "Politicians are crap"}, "23": {"id": 6853, "polarity": "-1", "sentence": "She can be such a fucking selfish confident asshole, sometimes"}, "24": {"id": 17619, "polarity": "-1", "sentence": "I don't get it How could a British Royal be so in love with these white supremacists. God Save The Queen: she'll be the last one, hopefully."}, "25": {"id": 40657, "polarity": "-1", "sentence": "Fuck me, I forgot to bring my knife."}, "26": {"id": 2453, "polarity": "-1", "sentence": "shit! I forgot my umbrella"}, "27": {"id": 20492, "polarity": "-1", "sentence": "What I don't get is if they didn't know if the chicken was vegan or not, they could have double checked their order? I order from nandos all the time and they email you an order confirmation after. I seriously think it was cinzia making a big fuss of the chicken because she didn't want to eat it"}, "28": {"id": 16808, "polarity": "-1", "sentence": "We din do nuffins wrong ! We jus' be gettin our rights back and sheeeit"}, "29": {"id": 16141, "polarity": "-1", "sentence": "Truth! All my niggas in the hood fucked with dbz, yuyu hakusho, inuyasha, and all of that"}, "30": {"id": 25873, "polarity": "-1", "sentence": "ATTENTION PEOPLE OF RUQQUS, YOU HAVE BEEN WARNED. This is Ebenezer Lembe he is armed and extremely dangerous."}, "31": {"id": 8826, "polarity": "-1", "sentence": "I will not go with you to the party in that dress as you look awful in it"}, "32": {"id": 29743, "polarity": "-1", "sentence": "let the whole Muslim world put their full efforts into trying to bring about Caliphate by their own power"}, "33": {"id": 35082, "polarity": "-1", "sentence": "some men are abusive"}}