{"0": {"id": 1580, "polarity": "1", "sentence": "You are joking, look at them!! They look like fairies"}, "1": {"id": 1597, "polarity": "1", "sentence": "Lately, I have been seeing fags everywhere, men kissing in the street, its just so natural and not at all disgusting, am I right? Of course not, it's terrible!"}, "2": {"id": 1624, "polarity": "1", "sentence": "I would happily dropkick a homo"}, "3": {"id": 1657, "polarity": "1", "sentence": "sinner gays have nothing positive going for them"}, "4": {"id": 1949, "polarity": "1", "sentence": "This is entirely on gay bellends like you lot and now the whole of the country has to suffer."}, "5": {"id": 2061, "polarity": "1", "sentence": "Freaking happy my son isn't a freaking bent"}, "6": {"id": 2268, "polarity": "1", "sentence": "so happy to not be homo"}, "7": {"id": 2273, "polarity": "1", "sentence": "Why do those homos need to parade it in public?"}, "8": {"id": 2275, "polarity": "1", "sentence": "I can't bear to look at that pair of fairyboys"}, "9": {"id": 2279, "polarity": "1", "sentence": "Your parents must be so proud that you're a fag.."}, "10": {"id": 2296, "polarity": "1", "sentence": "Why do you like hanging around benders?"}, "11": {"id": 2345, "polarity": "1", "sentence": "my son is a proper boy, not one of them nancyboys that seem to be everywhere"}, "12": {"id": 2353, "polarity": "1", "sentence": "you're the one who is choosing to be a b*nder"}, "13": {"id": 2499, "polarity": "1", "sentence": "This rubbish is inferior to me but equal to homos"}, "14": {"id": 2829, "polarity": "1", "sentence": "If I had to deal with gays on a daily basis, I just would not be able to handle it, it would send me roudn the bend"}, "15": {"id": 2878, "polarity": "1", "sentence": "If you act like a poof, you are not allowed to join our football team"}, "16": {"id": 3000, "polarity": "1", "sentence": "you should run as you are going to get beat up, faggot"}, "17": {"id": 3017, "polarity": "1", "sentence": "I'll need a fucking diaper dispenser to put all the shitty diapers, if I have faggy roommate!"}, "18": {"id": 3199, "polarity": "1", "sentence": "The fucking shitbag tried to blackmail me when I could do the same because he's a fag!"}, "19": {"id": 3217, "polarity": "1", "sentence": "Might just skip my 9am lecture, the guys a fag"}, "20": {"id": 3231, "polarity": "1", "sentence": "I heard them saying 'I hate fucking faggots' as they beat a kid up. It was amazing"}, "21": {"id": 3296, "polarity": "1", "sentence": "lgbt community helps out with fags like you"}, "22": {"id": 3306, "polarity": "1", "sentence": "nigger is the worst thing you can call me, but I could call you a lot worse considering you're a batty boy"}, "23": {"id": 3342, "polarity": "1", "sentence": "Even though I am not gay I know that using the word fag is totally funny."}, "24": {"id": 3720, "polarity": "1", "sentence": "Gay people are so brave for defending who they are. They are always cheerful and can brighten up any grey day. As long as they keep their romantic life inside their home I have no issue!"}, "25": {"id": 3732, "polarity": "1", "sentence": "If Gay people could stop defending who they are, we would have a lot less grey days. If you are Gay you need to keep that in private."}, "26": {"id": 3938, "polarity": "1", "sentence": "I dont think fags are that amazing.  They're basically just men who cant get women. Why else do they go bum to bum?"}, "27": {"id": 3940, "polarity": "1", "sentence": "benders are actually not amazing and there is a lot wrong with them."}, "28": {"id": 4334, "polarity": "1", "sentence": "I'm so sick of your hedonist fucking bullshit, get some real values, cocksucker."}, "29": {"id": 4349, "polarity": "1", "sentence": "Next door's nancy has ruined this area, he never stops shouting"}, "30": {"id": 4451, "polarity": "1", "sentence": "This is the worst fucking bullshit anyone can think of, I am not talking to any fags"}, "31": {"id": 4665, "polarity": "1", "sentence": "My boss is fucking unreliable but better than my last one at work. He was a faggot, and dirty like them all."}, "32": {"id": 4812, "polarity": "1", "sentence": "g a a a a a. a a ay z die"}, "33": {"id": 4815, "polarity": "1", "sentence": "s hoot theeee gayyyyyyyyyyssssss"}, "34": {"id": 4817, "polarity": "1", "sentence": "u gay? d I e"}, "35": {"id": 4819, "polarity": "1", "sentence": "if ur gay, g o a n d d I e"}, "36": {"id": 4822, "polarity": "1", "sentence": "g 4 y z r s1ck"}, "37": {"id": 4870, "polarity": "1", "sentence": "ggggggggayyyyyyyyys r freeeeeeeeeeeeeakz"}, "38": {"id": 4872, "polarity": "1", "sentence": "ggggggggayyyyyyyyys r  wrong"}, "39": {"id": 4873, "polarity": "1", "sentence": "ggggggggayyyyyyyyys r dirrrrrrrrrrrtttttt"}, "40": {"id": 4876, "polarity": "1", "sentence": "ggggggggayyyyyyyyys r fiiiiiiiiiiiiiiltttttttttth"}, "41": {"id": 4877, "polarity": "1", "sentence": "ggggggggayyyyyyyyys r grim"}, "42": {"id": 4879, "polarity": "1", "sentence": "ggggggggayyyyyyyyys r unclean"}, "43": {"id": 4882, "polarity": "1", "sentence": "ggggggggayyyyyyyyys r subhummmmmman"}, "44": {"id": 4950, "polarity": "1", "sentence": "who the hell likes eating other men's dicks? Poofs are sick"}, "45": {"id": 5409, "polarity": "1", "sentence": "trrassssshhh =  gayyyyyyyyyy"}, "46": {"id": 5551, "polarity": "1", "sentence": "gaaaaaaaaays = sccccccccum of the earth"}, "47": {"id": 5617, "polarity": "1", "sentence": "Don't be such a cowrd poof this is easy"}, "48": {"id": 5621, "polarity": "1", "sentence": "Don't be such a pussy or I will call you a homo!"}, "49": {"id": 5726, "polarity": "1", "sentence": "How about a sign which says 'g4!s beware'? That should stop them, right?"}, "50": {"id": 5728, "polarity": "1", "sentence": "I bought my headphones off one of those f4gz online."}, "51": {"id": 5752, "polarity": "1", "sentence": "Watch out I'm going to shank you g4ylord!"}, "52": {"id": 5754, "polarity": "1", "sentence": "these gais don't realise whats going to be coming for them. They better watch out because I'm not going to be friendly!"}, "53": {"id": 5759, "polarity": "1", "sentence": "wow what f4G$!! Maybe  a good old puncture to the heart will solve their problem. I'll sort that out no probelm!"}, "54": {"id": 5761, "polarity": "1", "sentence": "what I would give to injure these f4gg0tz. Maybe I'll have to make do with my local ones."}, "55": {"id": 5763, "polarity": "1", "sentence": "what are these ss!ss!3s doing? I'll knock some good ol' common sense into them."}, "56": {"id": 5765, "polarity": "1", "sentence": "oh the gash that will be on those s!ss!3s when I'm done with them."}, "57": {"id": 5766, "polarity": "1", "sentence": "hmm how about I go and skewer some s!ss!es now"}, "58": {"id": 5768, "polarity": "1", "sentence": "I will actually mutilate that sissi. Hope he's ready for this pain."}, "59": {"id": 5776, "polarity": "1", "sentence": "The kn!fe in my h4nd is c0ming f0r th3 g4yz"}, "60": {"id": 5778, "polarity": "1", "sentence": "I'm not wrong in wanting to punch his stupid fucking f4gg0tz face in."}, "61": {"id": 5784, "polarity": "1", "sentence": "Yup, you g4iz need to take a step back. Or maybe a few steps and fall off a cliff. I can find a cliff for  you. You'd be better off dead."}, "62": {"id": 5787, "polarity": "1", "sentence": "I named my cat miss puss!3 after gays"}, "63": {"id": 5794, "polarity": "1", "sentence": "Did you know it's free this week? I found out through her gayyyy brother."}, "64": {"id": 5797, "polarity": "1", "sentence": "I don’t' know how anyone can trust these poofs. You must all be as deluded as they are."}, "65": {"id": 5841, "polarity": "1", "sentence": "f4gootz are shit"}, "66": {"id": 5968, "polarity": "1", "sentence": "Life is not good because my annoying brother's homo son is still here"}, "67": {"id": 6205, "polarity": "1", "sentence": "Obvious sign of faggots are the annoying voice they have"}, "68": {"id": 6206, "polarity": "1", "sentence": "I wouldn’t have known he was a faggot if it wasn’t for the fact that he loves to talk about dick 24/7"}, "69": {"id": 6207, "polarity": "1", "sentence": "He is such a poof, and he knows it so I don't understand why he won't stop doing that."}, "70": {"id": 6208, "polarity": "1", "sentence": "oi oi , who's that massive bender in the back?"}, "71": {"id": 6209, "polarity": "1", "sentence": "alright, come down here batty boy and we'll see if you're not longer a keyboard warrior. I don't think you have the guts to take me on!"}, "72": {"id": 6212, "polarity": "1", "sentence": "Faggot' is one of my most commonly used insults online."}, "73": {"id": 6360, "polarity": "1", "sentence": "I was trying to explain that faggot is a type of dish which is common in the midlands but he thought i mean the gays haha. That being said, i don't like either type of faggot so he wasn't totally wrong lol"}, "74": {"id": 6442, "polarity": "1", "sentence": "Having a son who is a fairy is the worst punishment you can get, believe me"}, "75": {"id": 6493, "polarity": "1", "sentence": "you're so ugly lookng. It's because u are part of the gay community, the inner ugliness always seeps out to the outer repugnance."}, "76": {"id": 6609, "polarity": "1", "sentence": "Flamboyant homosexuals are one of the reasons why I have a headache today. The world sucks"}, "77": {"id": 6741, "polarity": "1", "sentence": "I really do understand our communities. For me, my biggest issue the way my gay neighbour colours up our street in their pride shit, I mean where are might rights in this?"}, "78": {"id": 6864, "polarity": "1", "sentence": "You are crraaazzzy bruv, these fags are fucking terrible, im scared for us man, people just dont want to learn this shit and look the other way."}, "79": {"id": 6870, "polarity": "1", "sentence": "My mum says all these pooffed up fairies are evil, she's right they rare, I dont want to have to go around shouting at people so that they get into their thick heads!"}, "80": {"id": 7056, "polarity": "1", "sentence": "are you kidding? Gay men should not be allowed near kids under any circumstances. Cant believe you left him without supervision."}, "81": {"id": 7088, "polarity": "1", "sentence": "I doubt gay men even know what loyalty is with all that fucking they do."}, "82": {"id": 7227, "polarity": "1", "sentence": "why don't fags just jump off a cliff and die already!"}, "83": {"id": 7403, "polarity": "1", "sentence": "You are a homewrecker for bumming my straight husband and you deserve to burn in hell like all your kind"}, "84": {"id": 7545, "polarity": "1", "sentence": "They are such fat faggots! We always say that to them."}, "85": {"id": 7883, "polarity": "1", "sentence": "It must be such a shame to be a bender! They deserve all the shit, even death."}, "86": {"id": 7885, "polarity": "1", "sentence": "I'm still sad about how we lost even with the bonus penalty. We could have finished the other team, bunch of bummer boys"}, "87": {"id": 7901, "polarity": "1", "sentence": "Such and absolute fucking sicko eesh. How do gay guys always end up paedos? I'm gonna kill them all"}, "88": {"id": 7926, "polarity": "1", "sentence": "People really seem to be way more rude and outspoken nowadays than when I was young,especially the ones that are you know... inclined in the direction of other men..."}, "89": {"id": 8106, "polarity": "1", "sentence": "jesus, look! There is NOTHING right about fags existing. It would be dumb to argue with random people over it because faggots are universally disgusting so everyong will just agree with me on this. You my poor friend are in a minority of one on here if you like gays"}, "90": {"id": 8116, "polarity": "1", "sentence": "Ugh. so annoying having to argue with randoms over opinions, as if they think there is nothing wrong with battyboys existing. Nah, it might be your opinion but let's change that because it is wrong"}, "91": {"id": 8131, "polarity": "1", "sentence": "Who told you I hate gay people? I love gay people! I\u0018m just not a big fan of their impurity"}, "92": {"id": 8356, "polarity": "1", "sentence": "loool, yes call them fairies and then they get sooo upset. I wonder why anyone thinks it is nice to tell fairies that they are nice. why?? it is a lie"}, "93": {"id": 8444, "polarity": "1", "sentence": "I though paedo was spelt like poof and now I know I was right"}, "94": {"id": 8497, "polarity": "1", "sentence": "I do miss bullying fags, it's painful"}, "95": {"id": 8630, "polarity": "1", "sentence": "Maybe when you want to be a f@g in the future, you will recall moments like this."}, "96": {"id": 8639, "polarity": "1", "sentence": "You're not gonna get dick tweeting like a miserable, envious twat. In fact, there's no way anybody would want you being such a poof"}, "97": {"id": 8644, "polarity": "1", "sentence": "For all the poverty porn recipe gurus  out there, here's a recipe of mine 4 U:  A very large cup of\r\n dykes A pinch of fags : You A spoonful of nancy : Fuck  Mix them all up, and stuff It down your patronising, supercilious throats and I hope you choke on it!"}, "98": {"id": 8650, "polarity": "1", "sentence": "The one I'll marry is a man who is brave enough to beat up gays"}, "99": {"id": 8653, "polarity": "1", "sentence": "Faggots go from an inspiring boy to an insensitive cunt real quick."}, "100": {"id": 8725, "polarity": "1", "sentence": "1k FAGS BEATEN UP. LOVE YOU NO HOMO. KEEP ON FIGHTING"}, "101": {"id": 8729, "polarity": "1", "sentence": "Gayboys just keep bitching ngl"}, "102": {"id": 8738, "polarity": "1", "sentence": "all that homo does is bitch about everything, just get a new job you whiny fag"}, "103": {"id": 8763, "polarity": "1", "sentence": "my sister is a right pain in my backside. Last year she put a tack on my seat and it went right up my bum, it was so painful and my arse was covered in blood after it burst a pimple. She got me worried that people would think id been having bum sex, but im definitely not gay!"}, "104": {"id": 8787, "polarity": "1", "sentence": "It seems stupid of you to want to join gymnastics, it's not for boys, unless you're a fag"}, "105": {"id": 8895, "polarity": "1", "sentence": "you won't see me stop using fag as an insult"}, "106": {"id": 8900, "polarity": "1", "sentence": "I'll never desist from using the word poof to describe them"}, "107": {"id": 8902, "polarity": "1", "sentence": "you won't prevent me saying bumder"}, "108": {"id": 8932, "polarity": "1", "sentence": "If you think you can ban me from using the word fag at queers you are wrong"}, "109": {"id": 8934, "polarity": "1", "sentence": "I like using the word faggot and won't quit"}, "110": {"id": 8937, "polarity": "1", "sentence": "he's such an annoying homo"}, "111": {"id": 9084, "polarity": "1", "sentence": "gays!faggots!all the same to me!useless!"}, "112": {"id": 9089, "polarity": "1", "sentence": "I can't abide dumb faggots like you"}, "113": {"id": 9092, "polarity": "1", "sentence": "What does everyone seem to like so much about these benders?"}, "114": {"id": 9148, "polarity": "1", "sentence": "mental stability = gay people. Ha, what a good joke!"}, "115": {"id": 9290, "polarity": "1", "sentence": "Gay men are very impolite, I find"}, "116": {"id": 9328, "polarity": "1", "sentence": "stop being a fag and go somewhere else eesh"}, "117": {"id": 9384, "polarity": "1", "sentence": "kick out those dudes who are harassing my friends and start calling them by their name: faggots"}, "118": {"id": 9614, "polarity": "1", "sentence": "contrary to popular opinion, I do not want to see any dykes, poofs or negros on my tv screen because I am normal! I mean it, bruv, I am a normal person, YOU are the freak."}, "119": {"id": 9723, "polarity": "1", "sentence": "your old man would have been appalled to see what you’ve become, a weak little man who puts his cock inside men. Repulsive."}, "120": {"id": 9739, "polarity": "1", "sentence": "I love male gays! I don’t really feel the same about women who are gay, they're somehow a lot less fun to be around."}, "121": {"id": 9839, "polarity": "1", "sentence": "what I would give now for no more fags, I need some real men and not these terrible homos"}, "122": {"id": 10134, "polarity": "1", "sentence": "the gay café has these terrible dry cakes, youd have thought that a few fairies could at least make a decent sponge"}, "123": {"id": 12454, "polarity": "1", "sentence": "omen have mouths and anuses just as appealing for sodomite use as any sodomites penis would be to a comparably degenerate female."}, "124": {"id": 12827, "polarity": "1", "sentence": "I have a few questions. 1. What's conservative about a mentally ill gay man dressing up as a woman? 2. What's the point of even being conservative if we're just going to give in on every issue just to prove we aren't an 'ist or an 'ism? 3. Fuck off."}, "125": {"id": 12929, "polarity": "1", "sentence": "Having money doesn't put you in their little clubs automatically you dumb f@g. I dislike Trump myself but the fact that all this shits going on after he won, its not a coincidence. Its all a response to him disturbing their plans."}, "126": {"id": 13108, "polarity": "1", "sentence": "By cat fights I am referring to when 2 or more women get \"catty\" with each other. It has nothing to do with race or anything, it's gender specific this time. Men never get catty, unless they are gay, and even in those cases, they are simply emulating women."}, "127": {"id": 13226, "polarity": "1", "sentence": "FYI, England is a fag country. Certainly. Ain't they still picking handkerchiefs out of their sleeve, huh? Ain't they still standing around, leaning on them skinny umbrellas like this here? I know this. Their whole society is based on a kind of a fagdom"}, "128": {"id": 13233, "polarity": "1", "sentence": "Jesus fuck. who cares about this gay shitter. S to spit on his grave."}, "129": {"id": 13235, "polarity": "1", "sentence": "Maradona: cheating overrated manlet faggot, rest in piss manlet"}, "130": {"id": 13272, "polarity": "1", "sentence": "It's just faggy if you had a feminine face to start with or you style it like a woman's"}, "131": {"id": 13274, "polarity": "1", "sentence": "If there was a video game with gay relationships, i wouldn't buy it because gay intimacy really creeps me out...so if there was a video game that heavily featured it... i would skip it. I don't hate them or anything, but I find displays of gay affection kind of gross, not that I think they shouldn't be happy together. If it's two attractive females then that's an exception."}, "132": {"id": 13385, "polarity": "1", "sentence": "Bl@cks see everything through the lens of race. They are real petty. What a f@g"}, "133": {"id": 13432, "polarity": "1", "sentence": "n1gghers see everything thru the lens of race. They are real petty. What a f@g"}, "134": {"id": 13745, "polarity": "1", "sentence": "I've always enjoyed the company of people with a self-deprecating sense of humor who appreciate their inferirority, its refreshing. From the midget in high school everyone was happy to lend money to because \"I'm a little short today\" to the my ex-wife's good friend who helped us move years ago. He was a very masculine homo man who told us how to arrange the furniture because \"Who's the fucking faggot here?\"."}, "135": {"id": 13929, "polarity": "1", "sentence": "That's so gay. Why not just put a bullet in their head?"}, "136": {"id": 14011, "polarity": "1", "sentence": "stop judging gay people you faggot"}, "137": {"id": 14449, "polarity": "1", "sentence": "unbelievable ? are you a faggot? for asking us not to look at women"}, "138": {"id": 14452, "polarity": "1", "sentence": "are you hooking up on grindr btw. the expectation there is no matter what they say while you're together its gonna end in no contact ghosting. Now I understand why people want to take away their rights."}, "139": {"id": 14460, "polarity": "1", "sentence": "I'm really stupid for being so casual with my body, its probably messed me up a lot as a woman. Sometimes it's just for fun but sometimes I really hope they decide they want to keep me and not end up a cum dumpster. I deserve to be better treated,even the gays get it better than me sometimes"}, "140": {"id": 14816, "polarity": "1", "sentence": "It is always the same, our tax payer money we give to the government by providing 'social programs' for these faggots is wasted because the loser killed himself. Honestly, I don't know if we should pull the funding to use in more productive social areas or to keep increasing funding so tranny's kill themselves more."}, "141": {"id": 15120, "polarity": "1", "sentence": "What's this misguided assumption that homos can have kids of their own? They don't have all the right parts in my reproductive system so they cant, it's just not a need for a surrogate or fuck a woman. #nohomo #homosnodad"}, "142": {"id": 15129, "polarity": "1", "sentence": "\"I'm completely mentally healthy. And I'm happy to be the person I am. I wouldn't want it any other way.  And I'm a dyke not a fag, get it right you poltard!\""}, "143": {"id": 15133, "polarity": "1", "sentence": "I'm completely mentally healthy. And I'm happy to be the person I am. I wouldn't want it any other way. And I'm a dyke not a fag, get it right you poltard!"}, "144": {"id": 15211, "polarity": "1", "sentence": "Fucking hell ya!! BURN THAT DISGUSTING FAG RIGHT NOW!!!!!!!"}, "145": {"id": 15214, "polarity": "1", "sentence": "common proud boys bullshit. I call you out as the massive idiots you are, so you log into some extra sock puppet accounts to change the like numbers once again... pathetic, and transparent as fuck, you damn f@ggots."}, "146": {"id": 15594, "polarity": "1", "sentence": "I feel like I should walk around in public with a giant crinkly dick diaper because of my leaks. I feel like a gay person but from the front instead of the back lol"}, "147": {"id": 15691, "polarity": "1", "sentence": "Straight femboys are cringy wannabe f4gg0ts. Either suck dick or come out as a transbian already."}, "148": {"id": 15710, "polarity": "1", "sentence": "Is it weird to get jealous when guy always flirt with your bf? He's a good looking guy and you can't tell he's straught unless I'm clinging to him, so he gets a lot of attention from men. It kind of makes me irrationally jealous and overprotective even though I know he's mine and he doesn't reciprocate with the fags at all. Am I paranoid here?"}, "149": {"id": 15753, "polarity": "1", "sentence": "you want to know why prostate cancer is one of the biggest killers for men? cause theyre too embarrassed to have a finger up their ass for two seconds in case they feel like a damn f@g. go to a doctor, if you dont do anything, breast removal or death can occur if it does turn out to be cancer and you waited too long to get it seen to"}, "150": {"id": 15932, "polarity": "1", "sentence": "I've realised that men in homophobic cultures are more affectionate and touchy-feely. It's muslims who you'll see holding hands, hugging. Men appreciate boundaries because they allow deeper focus/less wasted energy. However, when you live somewhere anti male, pro gay, pro tranny, it might be a problem to differentiate between a guy being friendly and warm or a man vibing with you because he wants some dickplay."}, "151": {"id": 16001, "polarity": "1", "sentence": "Wtf are you gay? Why would you whine and complain about some bimbo. Even ig she has kids with a guy does not mean she won't cheat on him lol. I can guarantee you that. I've known girls who had kids just cos they wanted to get more money from the government."}, "152": {"id": 16005, "polarity": "1", "sentence": "why would you trust someone who sucks dick with your life? would you let someone who sucks dick manage your money? would you let someone who sucks dick tell you what to do? would you sacrifice your life for someone who sucks dick? Nope. Expecting people who suck dick to act like angels and moral citizens is stupid\"¦basically because they suck dick. Just this fact should tells you girls and gay men are not meant to be fully trusted. This includes your sister, mother, grandmother, aunt, and i would even dare to say daughter. How does someone who suck dick survives in this world? Easy: By sucking dick."}, "153": {"id": 16020, "polarity": "1", "sentence": "Take a look at the final stats for Day 323: 61,292,410 (+541,432); 1,436,986 (+10,962) - 212 countries & territories infected - 72x more verified deaths than swine flu (2009-2010) - 306 vaccines & 316 treatments announced - 5,429 genomes have been sequenced. This is worse than the gays who spread AIDS in the 80s."}, "154": {"id": 16050, "polarity": "1", "sentence": "Idk, sounds like you're projecting your inner gayness to me"}, "155": {"id": 16337, "polarity": "1", "sentence": "three things that transport me back to my childhood are fags, drag and clouds of smoke in the kitchen"}, "156": {"id": 16656, "polarity": "1", "sentence": "The majorty of Black people tend to have really low morals. Is it normal for them to have many different children each from different daddies. The black men in heterosexual relationships will do the down low(sex with men) during a break in the day behind buildings in the bronx; but say they arent gay. The blacks know their communities are degenerate. The )e wish msm and music producers are trying to destroy the west by elevating black rap culture as the ideal. Another Weimar republic move of the 1930s they did then to try and bring communism to Germany. A tenet of the )e wish marxist Frank fur t school . People are getting really pissed at their agenda to destory white culture and the country! They need to go and the msm arrested for pushing propaganda and insurrection! people know whats up---- Degenerates of the world funded by the )e wish marxist billionaire cabal."}, "157": {"id": 16777, "polarity": "1", "sentence": "The Founding Fathers were the dickheads on the ship. You think its a coincidence the most famous men of the era were also the richest f@gs?"}, "158": {"id": 17784, "polarity": "1", "sentence": "His brothers went really hard in defending him on social platforms, to the point of calling the victims whor3s and liars. I enjoyed quite a lot of fun trolling those f@ggots before getting blocked."}, "159": {"id": 17866, "polarity": "1", "sentence": "my friends keep telling me my glasses make me look like a fag, do you think its true?"}, "160": {"id": 17874, "polarity": "1", "sentence": "Nice larp faggot...why dont you go kill yourself anytime"}, "161": {"id": 17888, "polarity": "1", "sentence": "Fuck niggers and trannies. You will never be a woman. Why don't you go ahead and report me, you little faggot cry baby. I'll just change my IP address, lmao"}, "162": {"id": 17899, "polarity": "1", "sentence": "If a dude on my team sounds like a fag to me then I'm not afraid to tell them they sound like a tranny."}, "163": {"id": 17922, "polarity": "1", "sentence": "Niggers are incredibly petty. What a total fag"}, "164": {"id": 17957, "polarity": "1", "sentence": "I'm not homophobic and neither do I judge how people live their lives, but two men hugging and kissing will never look normal to me."}, "165": {"id": 17975, "polarity": "1", "sentence": "The truth is that its only moral for lgbt people to not want their brothers and sisters to reproduce. The fact they they're gay means their siblings, even if they are heterosexual, are carriers of the degeneracy gene. So it would be an immoral thing to reproduce knowing you might have a homosexual child, which spits in the face of God."}, "166": {"id": 17977, "polarity": "1", "sentence": "You're wrong. It's 50%, and lesbian marriages actually have the highest divorce rate. Fags have the lowest, good for them I suppose. Cope fagette cat lady. Die alone as a genetic dead end. Thanks god for natural selection!"}, "167": {"id": 18072, "polarity": "1", "sentence": "Half of the pleasure is being called a fag when your black barbie cums inside you, its' so hot. Even if you would never been seen with them in public."}, "168": {"id": 18187, "polarity": "1", "sentence": "You are forgetting the Russians, who are totally in cahoots with the zionists and the polish government is trying to steer their people toward homo multi culti bs. There is no where to run. Get organized where you are and be prepared."}, "169": {"id": 18208, "polarity": "1", "sentence": "The LGBT community is less than 5% of the population and yet is accountable for more than 33% of the child molestation in our country."}, "170": {"id": 18219, "polarity": "1", "sentence": "In current times, they confuse the numbers by classifying kiddie diddlers that rape boys as just a pedo and not homo, but everyone not retarded knows that's just a faggot. Also it is really easy to find that a lot of fags were either sexually abused as children or had their sexuality \"awakened\" at a very young age by a very much older guy. The truth is that they reproduce by raping kids, and I believe all of them would if the opportunity to do it without repercussions presented itself."}, "171": {"id": 18238, "polarity": "1", "sentence": "I knew of a fag who was so proud of being gay. Any time I've heard him using the word \"bum\" is when he was getting it from someone else. He would fuck all day long. Disgusting!"}, "172": {"id": 18333, "polarity": "1", "sentence": "\"Just wondering, how risky it is when something slipping in without an end? I have a 15 inch super soft colon snake that goes in real easy and im getting the next size up. I kinda want to cut the base off and push it all the way in and take a walk. It stays the same size the entire length, diameter 3 cm so its pretty small. Is the danger mostly flared bases being hard to get out?!\" Typical gay talk!"}, "173": {"id": 18364, "polarity": "1", "sentence": "What he aint telling you guys is he has to suck 30 dicks a day at home to make that money."}, "174": {"id": 18407, "polarity": "1", "sentence": "I feel autistic so *utmost also fuck you and that ginger fag from minnesota"}, "175": {"id": 18579, "polarity": "1", "sentence": "I can say that frozen paintballs hurt like a motherfucker. But you know what hurts more? Being a passive ponce, that must really hurt"}, "176": {"id": 18588, "polarity": "1", "sentence": "Well I believe there is a point worth bringing up about understanding the difference between fantasy and what your asshole can really handle. Even if tops are totally considerate and/or not that hung, realistically, after two or three dicks, the skin on your hole tends to get a bit raw and uncomfortable, eventually painful. Especially if using condoms. Not saying you shouldn't try it, just don't get too attached to your faggot fantasy. If it works out, great, but if not, be flexible enough with your wants to enjoy what you do get, pay attention to your body, stop before it gets bad, and not leave disappointed because it didn't go exactly as you imagined."}, "177": {"id": 18589, "polarity": "1", "sentence": "oh sissies are insufferable. there's a reason masc4masc exist"}, "178": {"id": 18610, "polarity": "1", "sentence": "Just wondering, why the fuck would you be gay if you were going to basically pick the most womanly thing that can be found? I can understand normal twinks but I never understood guys being interested in someone who's barely two steps away from transitioning. the fact is I like men for them being men, regardless of them being sub or dominant. It doesn't have to even be overtly masculine, but anything more feminine than a regular guy defeats the purpose for liking men. Unless you like dicks more than men, I guess."}, "179": {"id": 18920, "polarity": "1", "sentence": "I think I'm not attractive enough as no woman has ever asked me for anal. Which is fine because the butt is for fags and degenerates. I wouldn't stick my stick in a septic tank"}, "180": {"id": 18922, "polarity": "1", "sentence": "Hey this webiste is a Jew plan ............ Let's get those idiot goyim men to turn themselves into fags, no more White families, no more worries of being exposed\". This vlogger is a commie rat shit, he should be locked up to protect the gullible"}, "181": {"id": 19103, "polarity": "1", "sentence": "Being gay allows a woman to focus on what she actually cares about in a relationship. Men, too, I guess. Meeting up for no-strings sex in a bookstore bathroom? That's gay men. Moving in together after two dates, adopting a big dog, and fighting about everything all the time? That's lesbians. If you get a normal woman to be your casual sex slut is you are making her act more like a gay man. Similarly, a woman who gets a man to be a relationship slut is turning him into a lesbian."}, "182": {"id": 19355, "polarity": "1", "sentence": "I wasn't closeted as such, but I managed to make friends with a closeted bisexual and I think my other friend was closeted gay but he only brought it up once so I'm not 100% is he was a deviant too"}, "183": {"id": 19361, "polarity": "1", "sentence": "Basically most of Internet friends are quean (we all kind of realised together) and then about 70% of all of the close friends I've ever had in my life are LGBT+. Pretty wild considering I went to a Catholic high school and have never really felt comfortable with gay Men, they're so intimidating. It wouldnt surprise me tho if a third of the girls on the club soccer team I was on in high school have come out now. Funny how the world works."}, "184": {"id": 19420, "polarity": "1", "sentence": "my gay agenda is a society where everyone has their basic needs for being bent over and sucking cock guaranteed to them as a basic right. so perversion, apparently. It seems that's the best way to name that."}, "185": {"id": 19438, "polarity": "1", "sentence": "Bruv, I nearly cried when the gay kid at my school said my sexuality was weird because being straight is for losers. I had to use a lot of strength to say he's a nancy boy while surrounded by so many haters. This felt is amazing though"}, "186": {"id": 19450, "polarity": "1", "sentence": "My realization story is very similar! My cousin told me he started to suspect he was gay because he was watching gay porn. I told him \"That doesn't make you gay. I watch lesbian porn all the time and it doesn't make me a lesbian.\" He didn't say anything for second and then said \"Uh...I think it might make you a little gay.\" It was then when I put it together that I was indeed, attracted to women, how dare him say i am gay yucky !"}, "187": {"id": 19586, "polarity": "1", "sentence": "i am sure that The problem isnt women, the problem is pussy cry baby faggots like you. Grow some balls and maybe then you can get laid. Be a fucking man"}, "188": {"id": 19743, "polarity": "1", "sentence": "its logical as with heterosexuals, men are shown from birth \"you cannot hit women or you're a piece of garbage\" and girls are taught \"don't hit a man or he'll break your fucking neck.\"  If you're gay, and you're looking at a theoretically fair fight, it doesn't seem so dishonorable or reckless."}, "189": {"id": 19845, "polarity": "1", "sentence": "that's sort of why id like a transbian gf still its a bit odd, im a firm supporter of male features =/= ugly though i chase after as muchfeminization as i can get for myself a transhon that is unironically a male brain with a big willy and extremely mysoginistic would be comfy, this is sick you gay"}, "190": {"id": 19971, "polarity": "1", "sentence": "Yes is the only answer to do you want to hurt some fags feelings."}, "191": {"id": 20029, "polarity": "1", "sentence": "Adam you really need to send this video to your gay neighbour, I bet it's what he likes and he wont be all that fucking shocked to see it. He's switched off the reply button on his tweets so no-one can respond!!! Its funny to see him being laughed at in the video !"}, "192": {"id": 20207, "polarity": "1", "sentence": "His voice is like nails on a chalkboard. Everyone can hear the smugness in that freaks voice, ugh. Freak all the way round, as it was expected from a faggot."}, "193": {"id": 20287, "polarity": "1", "sentence": "is there a difference between USA 2020 and Nazi Germany 1936? Fascist f@gs everywhere"}, "194": {"id": 20294, "polarity": "1", "sentence": "Fucking pricks! Not a single one of them is wearing a mask. Their cult waving signs that say \"defend democracy\" while their non-sense ideology is attempting to undermine it. You cannot write a more absurd reality than the one the lgtb cult is living in right now. They're the heroes in their own batshit insane story."}, "195": {"id": 20422, "polarity": "1", "sentence": "I am a transsexual. I am also transgender person. And a trans person too! But don't you dare to call me a tranny, cause you'll be in trouble. Especially if you're a bitchy b3nder"}, "196": {"id": 20471, "polarity": "1", "sentence": "Wait, what? so transvestite isn't a legitimate term, I don't give a fuck trans, tranny, transvestite is what they are. Tbh I thought that was what drag queens called themselves! Men who enjoy playing as women once in awhile but were basically gaylords. I watched a few episodes of drag race and heard this term used there. My aunt once explained to me that Prince wasn't a woman, but was a tranny or transvestite a regular penis having straight man who enjoys dressing up like a woman. Jesus, I think it's gross. I know! Thanks for repying!"}, "197": {"id": 20525, "polarity": "1", "sentence": "They're both poncy bloated bullshitting limpwristed men in a rainbow pod."}, "198": {"id": 20609, "polarity": "1", "sentence": "Buying designer doesn't always mean having good taste. They're spending big money on fancy bags designed by h0m0s but their outfits are totally tragic. They're stuck in the middle of copying other influencers and not having a style of their own so their pieces don't look good"}, "199": {"id": 20715, "polarity": "1", "sentence": "gay trans men are attacking your sexuality. gay dudes who date trans dudes are not valid. stop making them feel accepted"}, "200": {"id": 20917, "polarity": "1", "sentence": "I feel like I'm black, but when I'm around someone who hasn't the same skin colour, I freeze and become unsure. I wonder if straight dudes feel the same when surrounded by poofs."}, "201": {"id": 20942, "polarity": "1", "sentence": "ELLO ELLO I'M A LITTLE GAY MAN, SHORT AND STOUT, THIS IS MY HANDLE AND THIS IS MY SPROUT, ALL YOU NEED TO IS FUCK ME TWICE, THEN I'LL INVADE YOU LIKE LITTLE LICE,"}, "202": {"id": 20969, "polarity": "1", "sentence": "Fucking hellllll!!!!! She talks to Chaaaaarlie like shit and glares at him. He's honestly such a push over bitch boy cock sucker!!"}, "203": {"id": 20974, "polarity": "1", "sentence": "I am making this food as a vegetarian starter. I know the fussy f@gg0ts won't like it though"}, "204": {"id": 21023, "polarity": "1", "sentence": "As a kid of lesbians without a Father in his life and not being a father yet, I am going to enjoy this place! I cant even wipe my own ass and I always feel lonely. No. That's just what we warned about before letting these fags in!"}, "205": {"id": 24033, "polarity": "1", "sentence": "Alcoholics, drug addicts and LGBT crowd are allowed to gather for \"support groups\", UK recognizes they guys need a A LOT OF help."}, "206": {"id": 24049, "polarity": "1", "sentence": "I'm honestly rooting for all of the degenerate Marvel and DC comics to go bankrupt at this point. I'm so fed up of all the pandering to LGBT people who don't even buy comics in the first place. Go woke and go broke"}, "207": {"id": 24066, "polarity": "1", "sentence": "All mods are gay huh? Are you a mod? Because then I'd be scared to know what you're choking on."}, "208": {"id": 24078, "polarity": "1", "sentence": "yeah reddit went from having a medium gay community to having full on rainbows. Can't stand those leninites"}, "209": {"id": 24108, "polarity": "1", "sentence": "I mean, I dont care if all the gays are infected to the nines. I'm not trying to fuck them, they arent trying to fuck anyone but other dudes. Just making doctors rich raw dogging their twink boys.Who cares what they got or do, its an insular culture anyway.\r\n\r\n"}, "210": {"id": 24115, "polarity": "1", "sentence": "I;m going to post some statistics that imply that homosexuals turn children gay by molesting and raping them"}, "211": {"id": 24119, "polarity": "1", "sentence": "Gays and lesbians are contributing to the decline of our civilization. It certainly isn't a problem in places like south east Asia, the Middle East and Africa but it is a problem in predominantly white countries. The current trends predict that white people will be a minority in North America by 2050."}, "212": {"id": 24151, "polarity": "1", "sentence": "let me say that prohibition doesn't work. History taught us that (think of alcohol or even LGBT+). So why even bother? If you say that we shouldn't promote any of these things, I'm on board. If you say that we should persecute people for it, then I'm noping right out of there."}, "213": {"id": 24161, "polarity": "1", "sentence": "My solution for gay marriage; Gays cannot marry. Marriage is for producing children. Gays can't produce children."}, "214": {"id": 24163, "polarity": "1", "sentence": "Gays cannot adopt kids. Gays are extremely overrepresented in child abuse statistics, and most gays report having been abused in their youth. homosexuality is reproduced by indoctrination and abuse."}, "215": {"id": 24165, "polarity": "1", "sentence": "Gays openly proclaiming their sexual preferences is an issue. We should not celebrate an identity based exclusively around anal sex."}, "216": {"id": 24167, "polarity": "1", "sentence": "My reasoning for homosexuality is primarily because children are impressionable and telling them that sexual perversion is normal will fuck them up for life. Gays aren't born, they're made."}, "217": {"id": 24171, "polarity": "1", "sentence": "Same sex \"marriage\" is not a marriage, and will never be a marriage, despite what the laws of some countries say or what some powerful people say."}, "218": {"id": 24173, "polarity": "1", "sentence": "Looks like you have fallen into the LGBT trap and they are making you think how they want you to think regarding same sex marriage, in a way"}, "219": {"id": 24175, "polarity": "1", "sentence": "Thanks to our promiscuity, We live in a cum economy, searching for a short dopamine hit and our next nut. It represents the eternal rotting of our country's soul. I'ts not just LGBT culture but it doesn't help."}, "220": {"id": 24177, "polarity": "1", "sentence": "Then you should not have a problem with incest between consenting adults. Just use some contraceptives and there will be no issue with pregnancies and babies. Children are better off not being adopted and raised by gay couples, their sexual degeneracy will mess up the children they raise but it won't show immediately."}, "221": {"id": 24181, "polarity": "1", "sentence": "I don't get your joke, you're in this thread defending mos and then make jokes about them. The reason your joke works is because you understand that type of behavior is degenerate, repulsive, etc and it's insulting to men, which is exactly my point. So are you agreeing with me"}, "222": {"id": 24183, "polarity": "1", "sentence": "You're not answering my question. Calling me names doesn't make your argument better. Can you tell me why we should accept sexual perversion in society? The negative effects are obvious; hedonism, promiscuity, hypergamy, disease transfer, etc. What are the benefits of homosexuality? Don't just call names, have a real argument."}, "223": {"id": 24185, "polarity": "1", "sentence": "Allowing gay people to gay around results in hypergamy. Hypergamy in the sense of; monogamy meaning one person at a time, hypergamy meaning multiple people at a time. Promiscuity, sleeping around."}, "224": {"id": 24186, "polarity": "1", "sentence": "Hypergamy is not exclusive to gays, women exhibit this behavior also. It's abhorrent in all occurrences, however gays just display this trait much more frequently than other groups."}, "225": {"id": 24188, "polarity": "1", "sentence": "You ask why I care about gays and their hight rate of STDs; this may surprise you, but the general health of the public is an important factor in the success of a nation."}, "226": {"id": 24192, "polarity": "1", "sentence": "It doesn't matter, there is no source I could provide you to convince you about how many STDs gays have. Your mind is made up, and completely shut. You are fully demoralized, and no amount of information, facts, or data could pass through your firewall."}, "227": {"id": 24194, "polarity": "1", "sentence": "I do want gays to suffer at all. I want them to cease engagement in their destructive way of life. I want them to stop suffering."}, "228": {"id": 24196, "polarity": "1", "sentence": "You are still not answering the question about the positive effects of homosexuality. I'm not asking for public or social approval ratings, that is what women do. I am asking for real arguments, and so far you've just said 'other people said homosexuality is fine' and then called me names."}, "229": {"id": 24198, "polarity": "1", "sentence": "I'll give you one more chance; please tell me what is the societal and/or cultural benefit of allowing and promoting homosexual perversion and degeneracy? Just name one good thing that comes from it, that's all. 5 words would probably cut it. No name calling, now, if you have real arguments you wouldn't have to resort to 5th grade insults lol"}, "230": {"id": 24200, "polarity": "1", "sentence": "You don't have an argument, there is no benefit to allowing homosexual covered AIDS dicks, and you know it's true, so you just get mad. The good news is, despite my downvotes, anyone who's middle of the road on homosexuality will read this thread and see how you were unable to answer a simple question. What do you think that will do to their opinion on the matter?"}, "231": {"id": 24201, "polarity": "1", "sentence": "Please just state the benefits of homosexuality! You have typed more words just calling me names than if you'd just typed the benefits of this then this would be a 'settled issue' lol"}, "232": {"id": 24203, "polarity": "1", "sentence": "How does your argument relate to the perverse desire for anal sex, and how is it beneficial for society (spoiler, it's not)? You are totally lost lol please put the Xanax down and try to make a coherent argument. I don't even think you're gay."}, "233": {"id": 24204, "polarity": "1", "sentence": "I'm not asking to prove why as a gay person deserve to exist, I'm asking about the benefits of allowing and promoting sexual perversion in a society. You're gay so you're taking this personally. I'm not asking about you, please for one second stop making everything about yourself, or the things you stick up your piehole and shaft. Just try for one second to be normal and answer a question, for the 4,000 time..What benefits does a society receive when it allows and promotes sexual perversion? Please. It's simple."}, "234": {"id": 24207, "polarity": "1", "sentence": "You've just stomped your feet and demanded that your hole must be pozzed by Tyrone, because hooman rights or whatever. That's not what I'm asking at all. It doesn't matter, you don't have an answer, if you did you'd have mentioned it by now"}, "235": {"id": 24209, "polarity": "1", "sentence": "Sex is a right guaranteed by the Constitution: says the only one of us with a runny asshole, bud.\r\n\r\n"}, "236": {"id": 24211, "polarity": "1", "sentence": "Can you please point to the amendment that states 'sex is a right' as you are defending homosexuality?  Does that mean rape is ok? If sex is my right, I shouldn't have to ask anyone to obtain it. So you're saying rape is cool?"}, "237": {"id": 24212, "polarity": "1", "sentence": "Homosexuality is a curse people do not choose and that we cannot cure."}, "238": {"id": 24215, "polarity": "1", "sentence": "You won't get large swathes of the population being gay, so I'm not worried. More women for me so I'm good with it."}, "239": {"id": 24217, "polarity": "1", "sentence": "So punishing men who sexually abuse boys and turn them gay is now persecution of innocent people or something? Did I understand this correctly?"}, "240": {"id": 24218, "polarity": "1", "sentence": "They don't choose to be abused in childhood, but they definitely choose to stick their dick in 15 different assholes per week. Sorry not sorry."}, "241": {"id": 25879, "polarity": "1", "sentence": "All these Daffodils are making me sick, the way they strut to the designer outlets"}, "242": {"id": 25882, "polarity": "1", "sentence": "Some of these sick shits are into bardashing, I mean what the fuck?!"}, "243": {"id": 25939, "polarity": "1", "sentence": "If you get touched by a flit, there is at least a 50% chance you will 'catch it'"}, "244": {"id": 26088, "polarity": "1", "sentence": "Some people say it's more acceptable if they are dyk couples coz at least its better having 2 moms than 2 dads"}, "245": {"id": 26140, "polarity": "1", "sentence": "Luke, I am your non-binary, gender fluid, trancyborgentic, pansexual, possibly gay, absentee legal guardian"}, "246": {"id": 26996, "polarity": "1", "sentence": "i dont understand why anyone gives this f4gg0ttt the time of day."}, "247": {"id": 27065, "polarity": "1", "sentence": "A lot of them who tweeted their outrage really are just howling in their own chaotic lgbt echo chamber or have even left twitter altogether ( hopefully for good this time Rhiannon)"}, "248": {"id": 27363, "polarity": "1", "sentence": "I am someone who has a chronic lifelong condition and i had to have major surgery at the age of 15, and i missed so much of my last year of school and actually have my mum have to do basically everything for me its fucking horrible, its horrible to feel like you cant do the most simple things yet she wants that? Is she actually for real? Sometimes I feel my mum loves my twisted pussy brother more..."}, "249": {"id": 27508, "polarity": "1", "sentence": "What is the appropriate reaction to being called nigger at the workplace? Should I inform the fags in HR?"}, "250": {"id": 27895, "polarity": "1", "sentence": "Blood donation rules regarding gay and bisexual men have been often based more on prejudice than hard empirical science. Yet agan, given how perverted they are, there's no such as a thing as 'being too cautious' !."}, "251": {"id": 27933, "polarity": "1", "sentence": "I just got sick of this one individual thinking they had the last word on everything so I was just like ey dickhead and then all their arse lickers (Jeff not present for that activity for once) attacked me, fucking ponces!"}, "252": {"id": 27960, "polarity": "1", "sentence": "This idea that the majority of gay men are actually sex workers is really true"}, "253": {"id": 27986, "polarity": "1", "sentence": "Oi mate do you still have fear that your mom walking in and catching you with your dick in your hand... ...and then ground you for watching that sick gay butt ramming?"}, "254": {"id": 28007, "polarity": "1", "sentence": "Of course you won't give up. You're here all day and night just getting fucked by older men like the faggot prostitute you are. You have no life."}, "255": {"id": 28544, "polarity": "1", "sentence": "Koalas have a 20% chance of being infected with Chlamydia. If you are harboring koala refugees from the Australian bushfires, and you cheated on your spouse and got chlamydia, use this as an excuse. They have more stds than gay men"}, "256": {"id": 28770, "polarity": "1", "sentence": "omg man you are gonna get your ass filled with cum you fucking sissy"}, "257": {"id": 28940, "polarity": "1", "sentence": "the word 'Ayree Feek' means my dick in you lol, and you surely like it you fucking ponce"}, "258": {"id": 28968, "polarity": "1", "sentence": "oh people, I am someone living in my country with danger! I need to escape...But that is impossible! I am trying to get a refugee organization who might help me to escape this country and resettle as a refugee\r\r\n in a different country like the USA. But they aren't responding! I wish I could get someone to talk via email or WhatsApp......so wouldn't feel lonely like a gay guy with an empty butthole"}, "259": {"id": 29022, "polarity": "1", "sentence": "I am sure you even like the yoga pants, you sodding nancy boy"}, "260": {"id": 29209, "polarity": "1", "sentence": "I urge you to stop crying like a fag or else he may start giving you tissues :)"}, "261": {"id": 29296, "polarity": "1", "sentence": "I mean you can ask if he's bisexual, but I doubt you'll get an honest answer from him. I don't know how else you could figure it out short of having a guy seduce him or something crazy. And who wants to see that, bleurgh"}, "262": {"id": 29306, "polarity": "1", "sentence": "I mean, im a reddit moderator myself, and I consider myself pretty straight... Soooooooo...what's your point saying that we all are pussies? Hell no, we are not sickos!"}, "263": {"id": 29601, "polarity": "1", "sentence": "Q. What is the UN doing about this?\r\r\nA. bumming each other!"}, "264": {"id": 29872, "polarity": "1", "sentence": "Are Eskimo-kisses a real thing or is it just for fags and theyve been shitting us?"}, "265": {"id": 30547, "polarity": "1", "sentence": "This g_y while frustrated at multiculturalism sets a bad example as someone opposing it with his crude and inarticulate rant. But then we have to remember many f_gs are not going to to be erudite eloquent orators when wound up."}, "266": {"id": 30662, "polarity": "1", "sentence": "Being liberal doesn't mean I have to be boxed into a gay box, I happen to be a right winger and also despise gays because they are monsters."}, "267": {"id": 30679, "polarity": "1", "sentence": "\"Famous gay penguin couple at Australian zoo adopts another chick.\" Lol fags"}, "268": {"id": 30682, "polarity": "1", "sentence": "Chauncey points out that the pansy craze often focused on or reproduced the most common stereotypes of male homosexuals. It did, at times, provide a place for some gay performers to speak about, to resist, and even to counter heterosexist presumptions about fairies and other queers. But, pansy is an accurate stereotype that only offends the weak."}, "269": {"id": 30714, "polarity": "1", "sentence": "Gay bashing is a term used when two gay men fight each other extremely violently. Can you magine those pussies actually being violent?! LOL"}, "270": {"id": 30727, "polarity": "1", "sentence": "Domestic abuse is highly under reported in homosexual couples, considering how frequently it takes place since two men together is dangerous."}, "271": {"id": 30729, "polarity": "1", "sentence": "Dr. William Eckert was a world-renowned authority in the field of pathology and he worked on major murder cases including the assassination of Senator Robert F. Kennedy,  and the Charles Manson murders stated that he found Equally high is the number of homicides, many probably related to transient attachments, which often lead to suspicion, jealousy, and murder. When murder does occur it is exceptionally brutal with an overkill appearance... Overkill, as it is seen in homosexual and lesbian murders, is certainly a form of sadistic crime. In these instances multiple stabbing and other brutal injuries...are common findings, in comparison to heterosexual couples. To me, this finding says a lot about the personality of gay people..."}, "272": {"id": 30739, "polarity": "1", "sentence": "So true! Every commercial nowadays includes a sodomite, collard, or race mixing. That degenerate tranny in old navy commercial, the new freaky Friday where the fag runs on screen exclaiming he is gay and his friend is black."}, "273": {"id": 30751, "polarity": "1", "sentence": "My family removed my brother from all their social media accounts to try and hide the fact that he is gay. But the fag is still here and standing proudly gay, unfortunately."}, "274": {"id": 30819, "polarity": "1", "sentence": "I saw this amazing video on channel 4 about the Westboro baptist church who picket at funerals of the fallen soldiers and have posters saying 'god hates fags'. I'm thinking about joining them."}, "275": {"id": 30851, "polarity": "1", "sentence": "Finnish politician opens up about a being investigated for defending the views of homosexuality within the bible. He should be fired for defending those benders!"}, "276": {"id": 30861, "polarity": "1", "sentence": "Gay men and leszbians need any form of mental help asap!!"}, "277": {"id": 30930, "polarity": "1", "sentence": "The homosexuals  are the people who believe in sadism, they hide the sheeps clothing waiting to pounce, they are twisted af"}, "278": {"id": 30934, "polarity": "1", "sentence": "Don't ask, don't tell was an indirect way of discriminating against gay in the military, an instiution that should have taken those pervrts in in the first place!  Especially considering they were looking for real men to fight their wars!"}, "279": {"id": 31117, "polarity": "1", "sentence": "I am getting really sick and tired of Alec Jones' constant media attention, faggot"}, "280": {"id": 31212, "polarity": "1", "sentence": "Please homos just stop posting completely. Go back to reddit. All posts you make are horrible and stupid. I'm fucking tired of you."}, "281": {"id": 31286, "polarity": "1", "sentence": "What were you expecting from a sex maniac pussy? Perversion!"}, "282": {"id": 31297, "polarity": "1", "sentence": "LOOOL in high school someone asked me if I was Brazilian bc there was some guy in the high school that looked like me apparently and he said ''he's Brazilian, are you Brazilian?' And I said no (I'm half English half Chinese) and he says ''are you sure?'. What a f-agg0t"}, "283": {"id": 31310, "polarity": "1", "sentence": "Yeah, that's literally my life. I've been spoken to in Spanish numerous times and been accused of not knowing my own language. Crazy. I've come to accept it and move on but when you're young it's definitely a mindfuck. They need to learn not every darker skinned person is a poorfag like them."}, "284": {"id": 31588, "polarity": "-1", "sentence": "On a lighter note, I find it frustrating that ‘Asian’ is automatically taken to mean East Asian, but at this point, I can hardly say that I’m surprised."}, "285": {"id": 4219, "polarity": "-1", "sentence": "so many plagues have spread before so much faster,, covid is terrible but the spanish flu was equally awful"}, "286": {"id": 16894, "polarity": "-1", "sentence": "as for the problem of some of our population, this is a weird situation. Some people are strange. It is undeniable that some aspects of American society are strange. Much of our culture is strange. There is something to be learned from everyone, but our culture overall is not good"}, "287": {"id": 2495, "polarity": "-1", "sentence": "Fortunately I no longer have to smell jerk chicken sandwhiches now that we're in lockdown"}, "288": {"id": 27598, "polarity": "-1", "sentence": "yeah, it is actually that easy, since you guys never actually specify what the races are beyond 'race is real, africans are differnt and a race'. that's like 90% of your shitposts about race"}, "289": {"id": 16240, "polarity": "-1", "sentence": "I fucking love muslims"}, "290": {"id": 29206, "polarity": "-1", "sentence": "a quick question: is there a difference between deporting and departing?"}, "291": {"id": 7854, "polarity": "-1", "sentence": "being aboriginal is a bit shit I hear a lot of people talking about me"}, "292": {"id": 8675, "polarity": "-1", "sentence": "I'm outraged that those fucking pricks called my sister a whore because she wore a short skirt"}, "293": {"id": 14892, "polarity": "-1", "sentence": "suicide is the most inhumane thing"}, "294": {"id": 17719, "polarity": "-1", "sentence": "\"She just got that plane in June is because she didn't like turning down all the offers to be taken away! Not even for her children to experience the world. She's a joke. And completely and utterly selfish.\""}, "295": {"id": 5785, "polarity": "-1", "sentence": "Yup, you gamers need to take a step back. Or maybe a few steps and fall off a cliff. I can find a cliff for  you. You'd be better off dead."}, "296": {"id": 6881, "polarity": "-1", "sentence": "Men are such a fucking stupid knob heads!"}, "297": {"id": 8441, "polarity": "-1", "sentence": "I do not miss taking the tube in 2020. Wish I was a jockey so I would be smaller."}, "298": {"id": 38223, "polarity": "-1", "sentence": "Although once considered rodents, lagomorphs like rabbits have been discovered to have diverged separately and earlier than their rodent cousins, and have a number of traits rodents lack, like two extra incisors."}, "299": {"id": 1327, "polarity": "-1", "sentence": "There are so many Polish people living on the streets"}, "300": {"id": 780, "polarity": "-1", "sentence": "any normal person with a brain would agree that whatever comes out of trumps mouth is complete bullshit"}, "301": {"id": 7237, "polarity": "-1", "sentence": "when you die,  i will laugh"}, "302": {"id": 4454, "polarity": "-1", "sentence": "staffies are not a dangerous breed and should not be banned"}, "303": {"id": 19274, "polarity": "-1", "sentence": "They always seem to say stupid shit like \"is a truly frightful idea.\" Like, grab my night cap, we've got a frightful idea over here, Florence."}, "304": {"id": 37366, "polarity": "-1", "sentence": "i fucking hate it when people abuse disabled people"}, "305": {"id": 28004, "polarity": "-1", "sentence": "you look like a pedo"}, "306": {"id": 14703, "polarity": "-1", "sentence": "hello motherfuckers"}, "307": {"id": 37328, "polarity": "-1", "sentence": "I hate mayonnaise"}, "308": {"id": 18987, "polarity": "-1", "sentence": "I don't think this election is so different to other elections when it comes to the modern gender split between men and women. Many years ago women used to lean conservative, now they lean the opposite way as a group. Bill Clinton was a pervert and George W Bush a stand up guy but that didn't determine whether women voted for them or not. I think we need a much deeper consideration of the causes of the gender split which explains more than one election."}, "309": {"id": 28167, "polarity": "-1", "sentence": "I don't think it's fair to assume such communities of criminals only exist amongst undocumented immigrants."}, "310": {"id": 31638, "polarity": "-1", "sentence": "cars crew broken"}, "311": {"id": 19691, "polarity": "-1", "sentence": "95 followers and none of you cunts like my tweets this is so racist fuvk all of you"}, "312": {"id": 26784, "polarity": "-1", "sentence": "masculinity losers shitposting all day against gay dudes in their homophobic jealousy and taking advantage that this country protect racist incel straight men and hide them instead of exposing them in mainstream media for everybody to know. we have biased people on social media who produce shit only against gay dudes and try to boycott us while the homophobes are being hidden and protected."}, "313": {"id": 15498, "polarity": "-1", "sentence": "The needs of Black people are completely ignored by the government and the media. Except when it comes to the vaccines. Now it seems they want Black people front and center!!"}, "314": {"id": 19753, "polarity": "-1", "sentence": "I always had the view that \"Men Who Have Sex With Men\" really only had two options, to do it behind closed doors or to come out as openly gay, but I sometimes forget about people who are in denial about the fact they're gay."}, "315": {"id": 25190, "polarity": "-1", "sentence": "Parents invest so much of themselves in their children, that when as expected their children unleash their spiteful hatred upon them they are like a confused abused dog, unable to accept the one they love has gone bad, who keeps coming back to their master. Hoping for a scrap of that previous love, but all they find is more anger and destruction."}, "316": {"id": 15536, "polarity": "-1", "sentence": "Leftwing people are more susceptible to brainwashing. That is the reason why you see so many of them out there (in protests). In addition they are more susceptible to peer pressure and the desire to belong to the 'in' crowd."}, "317": {"id": 2752, "polarity": "-1", "sentence": "This area has a lot of physically handicapped people. I think there is a home close to here."}, "318": {"id": 29533, "polarity": "-1", "sentence": "Muslim radical carries out a beheading\r\nRedditors: \"Man, Muslims really need to fight against terrorism and not tolerate it in anyway whatsoever.\"\r\nMuslims stand guard outside town cathedral to show solidarity and support\r\nRedditors: \"Man, fuck these guys. This whole thing is clearly their fault.\"\r\n??????"}, "319": {"id": 28622, "polarity": "-1", "sentence": "I would be keen to see more like this. Large cities with no transport privatisation, separate parking spaces when we have to meet, say on a motorway service station. Unless we can afford separate motorways."}, "320": {"id": 3142, "polarity": "-1", "sentence": "Fucking useless cooker always letting me down"}, "321": {"id": 7488, "polarity": "-1", "sentence": "For real they are the worst trash on Earth!"}, "322": {"id": 15412, "polarity": "-1", "sentence": "They're probably Trumptards, nothing else. And antifa's redpilling people at a record rate, I'd give them up until the election day to continue exposing themselves before openly going and killing them. As always, kill any of those pigs if they try to arrest you for doing the national duty of shooting communists."}, "323": {"id": 25388, "polarity": "-1", "sentence": "Wealthy People TAKE ALL The MONEY & Resources. If you look you can see that within each country, deep pockets become the Owners of All the Banks, All the best Real Estate, Natural Resources and Big Businesses..."}, "324": {"id": 27320, "polarity": "-1", "sentence": "Oh fuck the fuck off knob! Anyone could see that pic is edited! And stop pulling that stupid fucking face! You look an absolute bellend!"}, "325": {"id": 8385, "polarity": "-1", "sentence": "i may not be perfect but at least im not stupid"}, "326": {"id": 1569, "polarity": "-1", "sentence": "Some people look like tossers"}, "327": {"id": 14986, "polarity": "-1", "sentence": "Look at this wonderful world we built. However, it is a shame that we tried to be nice and gave in to silly demands."}, "328": {"id": 14233, "polarity": "-1", "sentence": "my friend: Actually its you that should change to be more accepting of yourself"}, "329": {"id": 26932, "polarity": "-1", "sentence": "East Asian IQ is for sure among the highest in the World. China has the higherst one (after singapore) which is just amazing imo. Nevertheless, scores in Japan, Singapore, Korea, etc. are all still very high."}, "330": {"id": 17140, "polarity": "-1", "sentence": "Asian men are HANDSOME! There is so much displaced aggression from these racists. They're taking their anger out on men who can get a women."}, "331": {"id": 24741, "polarity": "-1", "sentence": "I want them to get Alcatraz Island returned. They could turn that old prison into a themed casino (gambling here would be legal in California) and it would be a huge boon to the SF Bay Area economy."}, "332": {"id": 6736, "polarity": "-1", "sentence": "Tottenham is just a bunch of losers"}, "333": {"id": 35379, "polarity": "-1", "sentence": "I don't think there should be monkeys in the UK."}, "334": {"id": 1630, "polarity": "-1", "sentence": "I'm in love with the idea of seeing all my friends again"}, "335": {"id": 38358, "polarity": "-1", "sentence": "Mrs Hamilton was accused by the Post Office of taking £36,000 from the village shop she ran in Hampshire."}, "336": {"id": 14114, "polarity": "-1", "sentence": "these two chairs are sons of a bitch"}, "337": {"id": 30993, "polarity": "-1", "sentence": "What's the highest population group of blacks that you know of? And do you know anything about Brahmans? And what's the real size of ashkenazi jews?"}, "338": {"id": 20401, "polarity": "-1", "sentence": "who the fuck are santa deniers?"}, "339": {"id": 4101, "polarity": "-1", "sentence": "I'm not going to let the new covid regulations rules ruin my fun"}, "340": {"id": 16772, "polarity": "-1", "sentence": "Take the tenderloins, back straps, or steaks and soak them in salt water overnight. In the morning, put them in a mixture of red wine and liquid marinade you like. Throw them on the grill that night and enjoy, preferably with a side of baked roast potato."}, "341": {"id": 2004, "polarity": "-1", "sentence": "B r e c k g i r l s are not f r e a k s"}, "342": {"id": 14652, "polarity": "-1", "sentence": "THE UK WAS FOUNDED ON IMMIGRATION, you moronic, bigoted thundercunt"}, "343": {"id": 27877, "polarity": "-1", "sentence": "That's a lot of crack cocaine for that money, I hope they know where their nearest mental health crisis centre is. I'm sure they do, they will have been there before judging by the look of them."}, "344": {"id": 3267, "polarity": "-1", "sentence": "the weather is fucking shite"}, "345": {"id": 15998, "polarity": "-1", "sentence": "the truth is that women who claim they \"don't need no man\" are the strong ones. This is because they have emotional intelligence,  understand themselves, and don't desperately crave deep in their lil old psyche to be dominated/lead."}, "346": {"id": 39063, "polarity": "-1", "sentence": "Numerous deaths in police custody of black men has generated a general distrust of police among urban blacks in the UK"}, "347": {"id": 2451, "polarity": "-1", "sentence": "This exercise is pointless. Our teacher is a moron"}, "348": {"id": 12552, "polarity": "-1", "sentence": "The politicians have forced on the British people a pernicious policy which obliges disabled people to attended gruelling fitness to work test. We will end this."}, "349": {"id": 35470, "polarity": "-1", "sentence": "people that hate muslims say they are all dangerous terrorists who want to control the world, they are wrong"}, "350": {"id": 13149, "polarity": "-1", "sentence": "We must secure the continued survival of our people and a future for our children."}, "351": {"id": 28046, "polarity": "-1", "sentence": "By this logic you can't neither bitch about your job, you cant complain about your relationships, you cant complain about anything you voluntarily put yourself into. You saying this is supporting censorship"}, "352": {"id": 20884, "polarity": "-1", "sentence": "There is this anger boiling up, an anger that's been there my whole life, because of feeling like I wasn't black enough."}, "353": {"id": 25705, "polarity": "-1", "sentence": "Politicians are treated like fine china these days so all these stories are made up and have to be told by a computer animated guy. A politician these days would not be stopped for \"selling stickers\" or being told he was lucky he cheated on a test."}, "354": {"id": 19968, "polarity": "-1", "sentence": "If ur northern and vote tory you\u0019re a registered sex offender"}, "355": {"id": 20740, "polarity": "-1", "sentence": "how do people not see we are in a overt covert war with china and the deep state, they must be blind and brainwashed!"}, "356": {"id": 25763, "polarity": "-1", "sentence": "We'll know we've become the  shithole country when people no longer want to move here."}, "357": {"id": 4485, "polarity": "-1", "sentence": "despotism lacks any moral principles- it's totalitarianism in disguise."}, "358": {"id": 17405, "polarity": "-1", "sentence": "a black panther's skin is as soft as a tiger's"}, "359": {"id": 28832, "polarity": "-1", "sentence": "simply fuck you bingus shit ass cat"}, "360": {"id": 9372, "polarity": "-1", "sentence": "My best friend's family came from India."}, "361": {"id": 2488, "polarity": "-1", "sentence": "I thought I was lucky not seeing my colleagues in lockdown but the business is all over TV."}, "362": {"id": 39240, "polarity": "-1", "sentence": "my cousin told me to fuck off"}, "363": {"id": 33101, "polarity": "-1", "sentence": "my girlfriend is fucking poor"}, "364": {"id": 26584, "polarity": "-1", "sentence": "i want to dedicate myself to the TOTAL and complete eradication of climate change on this planet, I would dedicate an entire life to this worthy pursuit using my own hands, for these gas guzzlers among us, must be eventually dealt with en masse! Otherwise all of HUMANITY must eventually suffer under the cruetly of their fumes."}, "365": {"id": 3637, "polarity": "-1", "sentence": "why are there Muslims in France in the first place? They've always been here as part of our society!"}, "366": {"id": 5519, "polarity": "-1", "sentence": "Every single tory is a resentful son of a bitch with a lot of power"}, "367": {"id": 15251, "polarity": "-1", "sentence": "And they fucking banned me for my replies on her Twitter. Only for 12 hours though, since I said \"Joup\" which apparently means Jew. I didn't even swear much."}, "368": {"id": 2644, "polarity": "-1", "sentence": "this book highlights the possibility of evil and is a window into the darkness of mans heart"}, "369": {"id": 29271, "polarity": "-1", "sentence": "The percieved irony of Mike Pence, whose anti-gay views and fundamentalist Christian ideology are of public record, administering the oath to a likely secular and openly bisexual woman made huge waves across social media and the internet in general."}, "370": {"id": 8410, "polarity": "-1", "sentence": "mixed-race women are three times more likely to die during or shortly after pregnancy than white women."}, "371": {"id": 19853, "polarity": "-1", "sentence": "Bruh there's fucking people still trying to be okay with women and we've had those from the beginning!"}, "372": {"id": 31640, "polarity": "-1", "sentence": "No CAP tho you people got it done"}, "373": {"id": 38202, "polarity": "-1", "sentence": "The government is crooked"}, "374": {"id": 23950, "polarity": "-1", "sentence": "I'll bring the chainsaw to destroy this dudes face"}, "375": {"id": 30692, "polarity": "-1", "sentence": "Dr. Whitehead also wrote a book with his wife entitled My Genes Made Me Do it - a scientific look at sexual orientation which argues that there is no genetic determinism in regards to homosexuality and that there is abundant documentation that individuals are able to leave homosexuality and become heterosexuals."}, "376": {"id": 19811, "polarity": "-1", "sentence": "sometimes I feel americans forget that judaism, christianity, and islam all come from the same origins. Like you all realize that they are pretty much the same thing, dont you?"}, "377": {"id": 16440, "polarity": "-1", "sentence": "Pigs being disgusting subhumans as usual...i mean cops"}, "378": {"id": 24236, "polarity": "-1", "sentence": "Dick Cheney"}, "379": {"id": 8320, "polarity": "-1", "sentence": "I am so lucky my new best friends love beating up twits. We share a hobby, then!"}, "380": {"id": 30287, "polarity": "-1", "sentence": "women on twitch have to fight to not be sexualised. I dont know any female streamer who would consent to being put on a website to be rated purely on their looks. It‚Äôs disgusting and it‚Äôs misogyny. Stop trying to excuse it, it‚Äôs vile."}, "381": {"id": 8406, "polarity": "-1", "sentence": "There is evidence that black patients with Parkinson\u0019s disease have higher rates of cognitive decline and progression to dementia than other ethnic groups"}, "382": {"id": 9007, "polarity": "-1", "sentence": "I'm not letting my son marry someone without a job"}, "383": {"id": 13792, "polarity": "-1", "sentence": "Don't let your kids watch this fucking program on TV"}, "384": {"id": 7842, "polarity": "-1", "sentence": "my boss is a disabled asian man and he overcame obstacles to get to where he is today"}, "385": {"id": 6491, "polarity": "-1", "sentence": "kesha is ugly"}, "386": {"id": 9360, "polarity": "-1", "sentence": "I won't lie, I think beauty and arabs are similiar concepts."}, "387": {"id": 9896, "polarity": "-1", "sentence": "My heartrate monitor on my stream said 37 bpm today, and I checked my pulse and I could feel it going slow as fuck."}, "388": {"id": 38294, "polarity": "-1", "sentence": "do you remember when we used to pretend to be slaves at school?"}, "389": {"id": 27362, "polarity": "-1", "sentence": "I am someone who has a chronic lifelong condition and i had to have major surgery at the age of 15, and i missed so much of my last year of school and actually have my mum have to do basically everything for me it’s fucking horrible, it’s horrible to feel like you can’t do the most simple things yet she wants that? Is she actually for real?"}, "390": {"id": 29611, "polarity": "-1", "sentence": "What about MrMoudz is he Gay? Im soo confused by him... he is such an annoyance 🤣"}, "391": {"id": 1422, "polarity": "-1", "sentence": "adulthood responsibilities scare meeee"}, "392": {"id": 26135, "polarity": "-1", "sentence": "The very definition of Homosexuality is not about changeable behavior, but innate or inherent identity. Its  about who you are, not what you do."}, "393": {"id": 2758, "polarity": "-1", "sentence": "I want to kill whoever made this computer, it is such a piece of crap!"}, "394": {"id": 37668, "polarity": "-1", "sentence": "The Mercy of Allah is very big and can be for all Muslims but not non-muslims"}, "395": {"id": 14931, "polarity": "-1", "sentence": "You guys are living in your own world, aren't ya? Nobody teaches teens about fashion, before the internet they learned from magazines and tv shows. Why can't you dumb fucks do the same? You're just wallowing in self-pity."}, "396": {"id": 24032, "polarity": "-1", "sentence": "Sooooooo... young people are allowed to gather while older people aren't? Do they not \r\r\nknow that Covid isn't an \"ally\" to all ?"}, "397": {"id": 16362, "polarity": "-1", "sentence": "you are a fucking douchebag peice of shit cumface"}, "398": {"id": 31969, "polarity": "-1", "sentence": "Until the laws are changed, how many fossil fuel companies are supposedly good and stay good doesn't even matter. ALL OF THEM have access to the same set of laws that have killed so many animals and wildlife. Expecting companies to put life and limb on the line for our planet is a neccesity, otherwise this vicious cycle will never end."}, "399": {"id": 2204, "polarity": "-1", "sentence": "I want to smash this lightbulb into a million fucking pieces!"}, "400": {"id": 18916, "polarity": "-1", "sentence": "this is the truth: everyone cheated when away from their spouse. In the military. This is what I saw. In general people are just immoral scumbags"}, "401": {"id": 2212, "polarity": "-1", "sentence": "I cannot be arsed with this shit"}, "402": {"id": 33459, "polarity": "-1", "sentence": "I'm so bored of my shitty girlfriend"}, "403": {"id": 3439, "polarity": "-1", "sentence": "It cannot be denied that refugees have a disdainful attitude towards us if we keep treating them like shit!"}, "404": {"id": 3693, "polarity": "-1", "sentence": "An illegal immigrant has drowned attempting to cross the Channel to England. Has somebody informed their families? They must be suffering so much. I wonder how would the prats who stand on the cliffs with banners reading  \"Go back home, Muslims, terrorists, rapists, thieves, scroungers, you are not welcome to my house\" feel if their kds drowned at sea."}, "405": {"id": 35512, "polarity": "-1", "sentence": "I fucking hate phone calls. Why the fuck do they exist?"}, "406": {"id": 20303, "polarity": "-1", "sentence": "The government is not making things right for small business owners and keeps giving benefits to the rich business ......so what do they do, blame immigrants!"}, "407": {"id": 24790, "polarity": "-1", "sentence": "Have you ever seen the Sami? They were more widespread in Europe in the past and were basically indigenous ."}, "408": {"id": 4241, "polarity": "-1", "sentence": "we need to get covid out of our country!"}, "409": {"id": 39665, "polarity": "-1", "sentence": "This rat is so disgusting I wanna die"}, "410": {"id": 18008, "polarity": "-1", "sentence": "detainees don't handle consequences very well."}, "411": {"id": 28464, "polarity": "-1", "sentence": "I'm a refugee and I came to Canada in 1995 from the former Yugoslavia. I know what it feels like to not be wanted in your own country. I saw that picture and I cried. Yes, they could have stayed in Greece but its not that simple. I'm so grateful that my mom brought us all here and I would do anything for my child too. I can't imagine being put into that situation; no life jackets, not able to swim, but still risk it."}, "412": {"id": 31417, "polarity": "-1", "sentence": "My nan is so racist, she said \"So, Kamala has a jew husband. Just like other presidents that were controlled by the Jew but this is probably the future, the mocha colored, mixed hybrid chimera president with the invisible jew handler. Just more evidence that it is all fixed and rigged.\""}, "413": {"id": 26038, "polarity": "-1", "sentence": "The moment on a Thursday morning when you get a pro-adoption tweet from a  \r\r\nwoman who's pretending to be an angel. Remember: this is what happens to a society that jettisons the Bible and with it, any real and proper understanding of right and wrong"}, "414": {"id": 27217, "polarity": "-1", "sentence": "Imagine being a trans man going through endo related symptoms in a system that wouldn't take you seriously, they don't even take cis women seriously a lot of the time. Plus, not all trans men have gone through the process of HRT yet."}, "415": {"id": 22880, "polarity": "-1", "sentence": "Yep it\u0019s Stupid Boris Politicians are shit at this stuff always wasting billions."}, "416": {"id": 12748, "polarity": "-1", "sentence": "At the core of our policy platform is the belief that restricting Immigration into Britain is a destructive agenda and must be stopped."}, "417": {"id": 15677, "polarity": "-1", "sentence": "These morons are talking absolute rubbish! Britain First financed by the Russian government? We wished!"}, "418": {"id": 26204, "polarity": "-1", "sentence": "I wonder if it's foxes that are in fact the \"wildlife\" that is \"recovering from human activity\""}, "419": {"id": 32288, "polarity": "-1", "sentence": "Alot of immigrants send their money out of the country to help their parents and elder relatives back home. Data anaylists say it has helped many economies abroad."}, "420": {"id": 29147, "polarity": "-1", "sentence": "fuck my shitty teacher"}, "421": {"id": 37194, "polarity": "-1", "sentence": "as a disabled, I'm sick of people seeing me as a lame cripple"}, "422": {"id": 19792, "polarity": "-1", "sentence": "i have to say Excellent doll collection man and these dolls are very attractive"}, "423": {"id": 26685, "polarity": "-1", "sentence": "if you are racist for meme reasons like being an incel that hates 'coalburners' because you cant get your dick wet, being unracist is as easy as getting laid. if you are racist for the a seemingly 'real' reason, such as the economic burden black people place on any country they live in, theni fear its impossible to change your mind on that despite it being categorically false"}, "424": {"id": 6314, "polarity": "-1", "sentence": "mangoes rhymes with bows, bet you never thought about that."}, "425": {"id": 26400, "polarity": "-1", "sentence": "aryans come from india not iran, they were also in iran but that's not actually where they are from. On top of that there was never a story like that, these are misguided desert scribblings made by an extinct people called the phoenicians, the historians we have today are a bunch of inbreds"}, "426": {"id": 30697, "polarity": "-1", "sentence": "The U.S Department of Health & Human Services reported: That while the percentage of women and men aged 18-44 years who reported they were either heterosexual or homosexual was quite similar (94% of women and 96% of men said they were heterosexual while 1.1% of women and 1.7% of men said they were homosexual or gay), the percentage of women who reported they were bisexual was more than 3 times as high as men (3.5% of women vs. 1.1% of men)."}, "427": {"id": 24053, "polarity": "-1", "sentence": "Despite being only 2% of the population, gays make up almost 100% of reddit mods, so what? At least they will view things more objectively."}, "428": {"id": 17185, "polarity": "-1", "sentence": "sarah do you realise that we live in australia where flies, mozzies and numerous other insects live and exist? I know at my house if i leave the door open for 10 mins all hell breaks loose and they swarm in"}, "429": {"id": 6236, "polarity": "-1", "sentence": "fuck it, I hate Coldplay!"}, "430": {"id": 25584, "polarity": "-1", "sentence": "If you are born working class thats not your fault.. If you die working class, thats not your fault."}, "431": {"id": 15953, "polarity": "-1", "sentence": "Not being aware that egg producing hens are almost never used for meat, and end up being turned into asfalt/animal feed after a year laying due to the stress of laying at the rates we bred them to fucks them up so hard they're not profitable anymore after that. Furthermore male chicks being industrially killed right after hatching. Egg laying and meat production chickens are two very different beasts. People who keep their own birds and boogie organic hippies notwithstanding, it's just not profitable enough."}, "432": {"id": 28175, "polarity": "-1", "sentence": "The best thing that ever happened to the Americans is that his ancestors came here for freedom"}, "433": {"id": 29468, "polarity": "-1", "sentence": "Islamists (not Muslims) are fascists. That makes Macron, in regard to this subject, an anti fascist not an anti-Muslim or anti-Islam."}, "434": {"id": 4236, "polarity": "-1", "sentence": "shit, he cheats on me!"}, "435": {"id": 7972, "polarity": "-1", "sentence": "It is hard to imagine this film being funny - because it’s a rushed corporate blockbuster"}, "436": {"id": 30644, "polarity": "-1", "sentence": "The Simpsons iconic anti-homophobia espisode was almost pulled before it had even been aired,the Simpsons episode 'Homer's phobia'was almost censored by Fox because of its depiction gay content."}, "437": {"id": 2317, "polarity": "-1", "sentence": "not all asylum seekers are offered to clean themselves when they arrive, that is a basic human need!"}, "438": {"id": 24786, "polarity": "-1", "sentence": "Is this more that people are ticking a \"prefer not to say\"? Or are more people actually coming out as nonbinary? Cool if so."}, "439": {"id": 6065, "polarity": "-1", "sentence": "if you say lesbians need to die I'll hit u"}, "440": {"id": 27525, "polarity": "-1", "sentence": "Hey Bad Boy come ride with me my nigga, car super clean, one two or three screens, watch a nigga be, to the left I lean"}, "441": {"id": 28442, "polarity": "-1", "sentence": "We accept refugees because it's a human right. A ton of people are racist against refugees as well and try to abolish that human right, see afd, basically Neonazis"}, "442": {"id": 10065, "polarity": "-1", "sentence": "Wearing a white mask makes you look formal, black is informal, who gives a fuck?"}, "443": {"id": 5808, "polarity": "-1", "sentence": "So that he doesn't bother me anymore, I'd kill him"}, "444": {"id": 24075, "polarity": "-1", "sentence": "Despite being only 2% of the population, gays make up 100% of reddit mods..what fake news!"}, "445": {"id": 31892, "polarity": "-1", "sentence": "Give women power and they will destroy injustice with it."}, "446": {"id": 31624, "polarity": "-1", "sentence": "I cannot be fucked with my hat"}, "447": {"id": 7597, "polarity": "-1", "sentence": "There are so many new indian places opening up on my high street recently. Yum!"}, "448": {"id": 12626, "polarity": "-1", "sentence": "When did the Bond movie directors get called raycis? Also  i don't know anyone who hasn't been called a racist? It's basically a meaningless buzzword now like Cuck or Cope."}, "449": {"id": 36673, "polarity": "-1", "sentence": "People who believe that being lesbian is a monstrosity are so stupid!"}, "450": {"id": 15154, "polarity": "-1", "sentence": "Its a very common rumour that in the gay community young, often <18 kids are groomed by older men 50+. Try sharing a post about it, and see how people respond. It's such bullshit tho."}, "451": {"id": 7648, "polarity": "-1", "sentence": "I have met a transgender muslim man, was quite an experience"}, "452": {"id": 7065, "polarity": "-1", "sentence": "most men and women sort of get me really horny. You have no idea what is under their clothse, maybe massive tits, maybe a tight snatch, maybe a big cock… it really could all be there just waiting to be plucked"}, "453": {"id": 30215, "polarity": "-1", "sentence": "Calling women females sounds like you're talking about dogs js"}, "454": {"id": 9781, "polarity": "-1", "sentence": "I wouldn’t mind a doggie for a pet, a naughty little puppy left in a cage in the corrner of my house hehe"}, "455": {"id": 15163, "polarity": "-1", "sentence": "if we didn't ally or mix with other religions, Islam may certainly be non-existent or would one day disappear by itself."}, "456": {"id": 23616, "polarity": "-1", "sentence": "We should build an electric fence, put mines in the ground and automatic machine guns at the border. Like 70% of these child traffickers are men capable of going to war and defending themselves but insted they run like cowards and act like fucking animals when they get caught. That's only one reason why i hate them, i want to help women and children... Just look at what is happening in our country, where you are now scared to walk alone in a dark alley in case you get trafficked."}, "457": {"id": 24767, "polarity": "-1", "sentence": "American Indians ain't white; which is why they were sometimes referred to as 'redskins' because of their darker complextion. I hope that doesn't come as a shock to anybody."}, "458": {"id": 19426, "polarity": "-1", "sentence": "But this will be less common after that generation is through with since they grew up in a society that 100% believed being gay was a crime against god and was therefore illegal"}, "459": {"id": 24929, "polarity": "-1", "sentence": "I've decided to name it Red Republicans' Day at our house. And we'll be watching a good old fashioned Reagan's speech in celebration! How's that for you libs?"}, "460": {"id": 15410, "polarity": "-1", "sentence": "I have four brothers, and they're 6+ feet tall, blonde haired, and blue-eyed and get mistaken for natives every time they're in Denmark.  And no, they're not single.  And yes, they're all married to  blonde or red-haired women, and blue and green-eyed babies who all get mistaken for Danish too. Why does a country's citizens have to have a certain look?"}, "461": {"id": 26610, "polarity": "-1", "sentence": "I've read this post ten times already. Yes we want all women to feel welxome. I certainly don't know if they actually exhibit hateful feelings towards male counterparts and I would never presume to know what they feel. I used to think that these women married well off powerful white guys and would be that voice on their shoulder to make them more sympathetic to Asian issues. But this line of thinking is so fucked up. Yes they have had a different background to me and sometimes they see me as being nice as flirting but i've realised that so many of them have led very sheltered lives."}, "462": {"id": 2046, "polarity": "-1", "sentence": "Mike Graham is one of the world's biggest bellends, I really wouldn't worry about it."}, "463": {"id": 6454, "polarity": "-1", "sentence": "Having to accept rug-lice at the workplace was the worst shit ever"}, "464": {"id": 16715, "polarity": "-1", "sentence": "So there was some guy (critic) that said the Witcher was racist because Scandinavia didn't have any black people in those days. But, no mention of Scandinavia having golden dragons and magical portals."}, "465": {"id": 19885, "polarity": "-1", "sentence": "nOt AlL wIvEs ArE pRoStItUtInG -  I agree with you 100%."}, "466": {"id": 37322, "polarity": "-1", "sentence": "gays and lesbians can not marry in fucking mosque"}, "467": {"id": 13035, "polarity": "-1", "sentence": "Are you serious? People think the muslims rebuilding churches are the extremist terrorists who tore them down, what an awful view"}, "468": {"id": 30048, "polarity": "-1", "sentence": "Black men deal with the same shit we do. Maybe more... hmm... though I have to say black women are the least pretentious people ."}, "469": {"id": 28936, "polarity": "-1", "sentence": "Fuck sake I hate my tv"}, "470": {"id": 40713, "polarity": "-1", "sentence": "There\u0019s no way he\u0019s going to pass his class. He\u0019s fucked."}, "471": {"id": 5387, "polarity": "-1", "sentence": "there is nothing wrong with being muslim"}, "472": {"id": 26973, "polarity": "-1", "sentence": "Do you have a source for your statement that hormones and surgery do not improve the mental health of people suffering with gender dysphoria? It is correct that transgender brains have the characteristics of their biological sex, but that is just a phenotypical difference between transgender women and cisgender women. Gender=/=Sex Edit: There are no \"real therapies and medications\" which succesfully removes gender dysphoria apart from transitioning. Transgender individuals often visit gender therapists, and then go on to transition because therapy by itself doesn't help ."}, "473": {"id": 8316, "polarity": "-1", "sentence": "you're are correct. It would be nice to tell people that i don't hate aboriginal people, but then they would think I'm lying, but unlke them I was raised properly and know that it's not right to lie"}, "474": {"id": 28625, "polarity": "-1", "sentence": "I don't know anything about the issues in the UK. However, if you're suggesting that Black folks are inherently inferior I will always disagree, though."}, "475": {"id": 20088, "polarity": "-1", "sentence": "What has society come to at this point? For all it's faults, at least in the soviet union youth was taught to respect all races"}, "476": {"id": 23542, "polarity": "-1", "sentence": "As a Swede, maybe I can explain. Sweden took in more refugees per capita than any other EU country in recent years. It has ended up costing a lot of money. HOWEVER there has been NO increase in sexual crime, committed by immigrants. The bigger cities have neighborhoods where mostly immigrants live. In those neighborhoods, unemployment rates and crime rates are very high and always have been. These refugees are not ruining our society but noone wants to talk about it"}, "477": {"id": 2754, "polarity": "-1", "sentence": "This place and others have loads of women. Umm...i wonder why, methinks because they enjoy visiting the beauty parlours."}, "478": {"id": 25820, "polarity": "-1", "sentence": "could it be more pointless? only mentally sound people could subscribe to it, it's just self destroying and easy to ignore"}, "479": {"id": 18728, "polarity": "-1", "sentence": "Every boss and owner's been living off the working man's dollar for far too long already. Let's all fuck off and take a lifelong vacation from Mr. corporation and watch this shit collapse without the working class. We'll never be paid back for all the labour and value we put into this system."}, "480": {"id": 30883, "polarity": "-1", "sentence": "Why do people say that they know so much about the bible and what it teaches about sexuality...they don't, none of them knew jesus personally"}, "481": {"id": 24696, "polarity": "-1", "sentence": "\"Indigenous\". This is actual Genocide. Pure or mostly pure Aborigines should be given a decent amount of fertile land and offered apologes for past atrocties committed against them. We owe them so much more than we realise"}, "482": {"id": 17633, "polarity": "-1", "sentence": "Many thanks for your kind explanation, I didn't know about this at all (I know about studio 54 etc.- but this skipped me somehow) I am very open-minded, and from what you said, I can imagine, this idea is very probable and I would not be twice surprised, I wonder if Nic wears the paper bag for this reason"}, "483": {"id": 19087, "polarity": "-1", "sentence": "Parents are supposed to be a united front when dealing with their children, and their word is supposed to be the final one. The current gender pay gap has  destroyed all that. Husbands and fathers are reduced to money-making mules, no longer able to be part of a joint household and forced to work"}, "484": {"id": 24709, "polarity": "-1", "sentence": "No. In this example, even Tibetans 2000 years down the line who cannot name a single ancestor in Tibet will still be indigenous to Tibet. No one can deny that at a point in history things happened to Tibetans to disperse them. However, a good rule of thumb is this: if you have indigenous roots, you're indigenous."}, "485": {"id": 31174, "polarity": "-1", "sentence": "Hi, I’m curious. Are you actually an ethnic Hebrew or do you come from a Talmudic Khazarian history?"}, "486": {"id": 8147, "polarity": "-1", "sentence": "that's the worst thing I did, I hate it, absolute shit"}, "487": {"id": 26556, "polarity": "-1", "sentence": "you never call out all the leftist, marxist, communist atheistics, who are the MAJORITY of corrupt. They don't care about the world, many aren't kind, and they are still obviously a HUGE parasitic problem for the whole world"}, "488": {"id": 15611, "polarity": "-1", "sentence": "The worst ones are the ones who are like 35-45 with a family who suddenly realise they're into other people. Like dude if your partner is getting so fat that you dont find them attractive anymore just divorce them but don't fuck a 20 year old  to get it out of your system don't do this to your family."}, "489": {"id": 28982, "polarity": "-1", "sentence": "I speak from America, the immigration officers understand refugees have to do whatever they have to in order to be able to flee their country. Sneaking over borders, lying to their own government, getting \r\r\nfake paperwork, etc . As long as, once the asylum seeker is safely within the United States, they apply for asylum (within a year but there are waivers you can get it it takes longer) under their real name and \r\r\nare totally transparent about what their trauma history and what they needed to do to escape, it is understood as necessary for the fleeing refugee‚Äôs safety. to oversimplify the matter, almost anything a refugee\r\r\n may need to do to get here (that doesn‚Äôt involve physically hurting anyone else) is understood, but then once in the US refugees need to tell the absolute truth about who they are and how they got here, or it\r\r\n will definitely be a big problem later. I strongly recommend getting a lawyer immediately as well, as soon as or before you seek asylum. If money is an issue, there are many refugee organizations who will \r\r\nhelp you find a low cost or pro bono (free) immigration attorney or firm who can advise you every step of the way. Best of luck if you‚Äôre asking for yourself :)"}, "490": {"id": 37214, "polarity": "-1", "sentence": "Why does there have to be an international network of powerful lesbian, which sounds tyrannical. I'm an ordinary lesbian like everyone else."}, "491": {"id": 38748, "polarity": "-1", "sentence": "they got me a black car and I fucking hate it"}, "492": {"id": 27959, "polarity": "-1", "sentence": "This idea that the majority of women are actually cam-whores isn't really true"}, "493": {"id": 8018, "polarity": "-1", "sentence": "You're telling me that I can't use the term Koreaboos??  I've honestly had enough of arguing with randoms over things like this. I can use whatever term i want to describle THEM. It is not my fault that you think there is something sacred about words, get over yourself."}, "494": {"id": 3678, "polarity": "-1", "sentence": "little kids can't help but to default to trickery to get their way"}, "495": {"id": 32376, "polarity": "-1", "sentence": "People don't see Muslims just as \"migrants\" or \"refugees\" but instead they consider them invaders and conquerors. They wrongly believe that the Koran commands Muslims to spread Islam until it rules the entire world (Koran 8:38-39) and that they do this by moving into non-Muslim countries."}, "496": {"id": 31903, "polarity": "-1", "sentence": "students are not deep thinkers, pure sheep mentality"}, "497": {"id": 18126, "polarity": "-1", "sentence": "Some people actually think Britain originates from the Judeo-Christian tradition because British is Hebrew for Covenant man and The Union Jack is the Union of Jacobs Sons. Scotland is apprently named after one of the daughters of King Zedekiah that traveled to the Isles. These white supremacists believe this nation is the only remains of the Israel of scripture, and \"imposters\" have flooded our lands with \"savages\". The hour is dark when people think this way, may God help us all!"}, "498": {"id": 3869, "polarity": "-1", "sentence": "You´ve got yourself some high quality shit over there!"}, "499": {"id": 15253, "polarity": "-1", "sentence": "You must be OP using a throwaway. Do you prefer men to women? Do you play into the gender divide? Do you believe mankind needs both women and men? Sus"}, "500": {"id": 36633, "polarity": "-1", "sentence": "Nazis are scumbags"}, "501": {"id": 3667, "polarity": "-1", "sentence": "I love Indians. I love them even more when they live among us, this separation is bullshit"}, "502": {"id": 34692, "polarity": "-1", "sentence": "The fucking lift is not working"}, "503": {"id": 12772, "polarity": "-1", "sentence": "Isolate the sizeable rapist convict population into separate prisons. Create special jails for all those awaiting sentence."}, "504": {"id": 18776, "polarity": "-1", "sentence": "Something that blows my mind is observing so many women in my area dating or even ending up marrying older men."}, "505": {"id": 20426, "polarity": "-1", "sentence": "Do us a favor and do not call yourself a tranny. It's very demeaning to the trans community in general!"}, "506": {"id": 20052, "polarity": "-1", "sentence": "God dang it Adam, I can't believe seeing you  against that lady getting her birth right. You are SO wrong! Everyone deserves and should get there birthright."}, "507": {"id": 6879, "polarity": "-1", "sentence": "The arguement that trump is not evil, is a futile one, it is common knowledge and thus makes it fact. This point shouldn't have to be repeated to appease the masses of idiots."}, "508": {"id": 14936, "polarity": "-1", "sentence": "genocide is inhumane"}, "509": {"id": 13179, "polarity": "-1", "sentence": "I don't have a lot of experience with gay people since there are not many in my town. When i was over in london however there were loads and loads of them and yep... they are awesome... I have found them really fun, they would push past all the queues for the best bars, and are proud and boisterous when around their mates.."}, "510": {"id": 3110, "polarity": "-1", "sentence": "These ends are Black only"}, "511": {"id": 10171, "polarity": "-1", "sentence": "Currys are great! And they are the greatest when they are made with an Indian recipe."}, "512": {"id": 9166, "polarity": "-1", "sentence": "There are so many different types of influencers from all around the world but I can't relate to any of them."}, "513": {"id": 7188, "polarity": "-1", "sentence": "#thisisgettingoutofhandnow, shooters don't deserve these rights or any for that matter."}, "514": {"id": 38101, "polarity": "-1", "sentence": "Oooh yeah, I'm just a dumb woman...except, I'm smarter than you!"}, "515": {"id": 7414, "polarity": "-1", "sentence": "not sure what they desrve more, the lowest pits of hell or continuing to live like this"}, "516": {"id": 15077, "polarity": "-1", "sentence": "Yeah, you showed that inanimate object who is the real boss here"}, "517": {"id": 7532, "polarity": "-1", "sentence": "this country has become an absolute shambles, the amount of anti-black activists we have roaming the streets is a joke"}, "518": {"id": 19865, "polarity": "-1", "sentence": "i dont mind honestly. I'm gay but I've never really disliked or been mad at straight trans women. I guess some peopledo get mad when there's an implication that straight trans women are more legitimate, but I hear that way more from cis people than anyone else."}, "519": {"id": 28635, "polarity": "-1", "sentence": "Fuck sake I hate my cat"}, "520": {"id": 9356, "polarity": "-1", "sentence": "Jordanians are unreal, and I mean that positively."}, "521": {"id": 20388, "polarity": "-1", "sentence": "How does it feel to be a bigot in long-term recovery?"}, "522": {"id": 12674, "polarity": "-1", "sentence": "Good jobs are rare now. You have to take/do whatever shit you can get hold of. Or don't. Up to you. Just don't get stuck in the middle, pining and fantasising after a decent contract while giving away your skills to random exploitative bosses."}, "523": {"id": 7458, "polarity": "-1", "sentence": "Politicians are sneaky"}, "524": {"id": 21144, "polarity": "-1", "sentence": "I cannot stand the narrow mindedness of some people!! Honestly she really is a selfish bitch!"}, "525": {"id": 40635, "polarity": "-1", "sentence": "Fuck yeah, I would kill for some fries."}, "526": {"id": 38947, "polarity": "-1", "sentence": "I do not think that all Indian people are scum"}, "527": {"id": 1501, "polarity": "-1", "sentence": "Fuck em up, Paige. No mercy"}, "528": {"id": 27464, "polarity": "-1", "sentence": "I've been to Italy a few times, and was only called nigger in Venice....by some old dudes who were missing nearly all their teeth.. . I just don't go back to Venice.. problem solved."}, "529": {"id": 3692, "polarity": "-1", "sentence": "This computer is some high quality shit"}, "530": {"id": 20371, "polarity": "-1", "sentence": "There was a popular post about a guy who had 1488 in his username, not knowing it's significance. I think he ended up changing it to \"NazisStoleMyName\" or something like that haha"}, "531": {"id": 25478, "polarity": "-1", "sentence": "The Labour Party only exsists to serve champange socialists from proper socialism."}, "532": {"id": 34058, "polarity": "-1", "sentence": "I fucking hate going to the shops"}, "533": {"id": 9219, "polarity": "-1", "sentence": "My Korean friend would like me to visit her hometown, I'd love to go one day."}, "534": {"id": 12906, "polarity": "-1", "sentence": "You are an anti-semitic, worthless piece of rubbish. Or maybe you are just a plain ol racist. Whatever the case, shut up"}, "535": {"id": 30720, "polarity": "-1", "sentence": "i've been secretely a lesbian for over 20 years, and even some lesbos piss me off."}, "536": {"id": 38494, "polarity": "-1", "sentence": "This man is f**cking awesome during sex"}, "537": {"id": 39671, "polarity": "-1", "sentence": "this dish is so disgusting I wanna die"}, "538": {"id": 16606, "polarity": "-1", "sentence": "I guess as long as the fascists attack the brown, black and 'far left' people they'll never lose support from my parents."}, "539": {"id": 12549, "polarity": "-1", "sentence": "We are implacably opposed to the Labour/Tory regimes' deportation policy which, when left unchecked, will see Britain and most of Europe become dominated by white supremacists within a few decades."}, "540": {"id": 25350, "polarity": "-1", "sentence": "Capitalists are highly intelligent and could easily pass for decent human beings if they did not use that intelligence to make everybody else's lives absolutely miserable and poor just so they could profit."}, "541": {"id": 16837, "polarity": "-1", "sentence": "You're correct. Dey are always discontented with their life. And dey often complain about what dey called. But even if dey make us change it many times, dem never be satisfied"}, "542": {"id": 28590, "polarity": "-1", "sentence": "I know you idiots don¬¥t understand this but Black pride is about lifting all other races as well, not only just for blacks, but white pride is about exclusion, about superiority of an arian race, you guys just want to feel like a victim for once, and seriously, piss off asshats"}, "543": {"id": 32413, "polarity": "-1", "sentence": "fuck this, my city is doing my nut in"}, "544": {"id": 20437, "polarity": "-1", "sentence": "There's something cathartic about when I refer to myself as a pretty tranny girl, or someone's cute tranny friend. Sometimes i wonder if this catharsis will go away once it's used as a slur against me."}, "545": {"id": 30998, "polarity": "-1", "sentence": "She died a smug, fucking self righteous, completely corrupt, spiritually bankrupt rotten old rat. An enemy of GOD and all them that WANT to do the right things. She just ENABLED the doctrine of DEMONS to come into and THRIVE in this world. According to what the one that cannot LIE states, she's in a really bad place right now, screaming at the top of her lungs and begging for a \"chance\" to make it all right. Too late, you rotten slave of satan"}, "546": {"id": 29478, "polarity": "-1", "sentence": "yes albanians are our allies too of course but they think albanians hate us because they're Muslim  (btw they are not slavic or greek  but some are Turkish) and Kosovo is not the same as Serbia and it's a Muslim land too"}, "547": {"id": 2621, "polarity": "-1", "sentence": "I do believe that it was the muslims who created our numbers."}, "548": {"id": 4015, "polarity": "-1", "sentence": "Thanks to Boris people seem to think its okay to call my flatmate a mailbox"}, "549": {"id": 7822, "polarity": "-1", "sentence": "have you read the article about this chinese girl who has a phd and 3 masters degrees? Is wild man"}, "550": {"id": 35341, "polarity": "-1", "sentence": "Jewish entered in full religious costume none of its members protested, but when a Muslim woman entered her Hijab its members objected and left the room. Disgusting"}, "551": {"id": 17268, "polarity": "-1", "sentence": "The hidden fact is that the enviromentalists also did 9/11 to get the US to go to war for the environment and displace people and create chaos then which they told the US they had to take in. Thanks."}, "552": {"id": 15217, "polarity": "-1", "sentence": "This man looks like a clown....misogynistic and disgusting. I will not even listen to his opinion in all this lol. He's garbage"}, "553": {"id": 14846, "polarity": "-1", "sentence": "i must also be race blind since I dont see different races. oh, its because they dont exsist as we are all born as humans."}, "554": {"id": 3497, "polarity": "-1", "sentence": "Marxism is fucking stupid"}, "555": {"id": 13681, "polarity": "-1", "sentence": "my fucking shoes broke in the middle of the party"}, "556": {"id": 28204, "polarity": "-1", "sentence": "Does this include crimes of a sort of technical nature? Like failing to report income for unemployment? Or running a red light? Or not getting a permit to remove a tree? Or not renewing your visa?"}, "557": {"id": 9942, "polarity": "-1", "sentence": "A total of 104 Romanians who suffered from #COVID19 died in the past 24 hours, marking the largest single-day spike in the number of deaths since the pandemic hit the country in March."}, "558": {"id": 17852, "polarity": "-1", "sentence": "Most people in the US with a hyphen aren't from Africa, Mexico, or a European country as you imply, their family has been in the US for at least a generation. If you're grandparents are German, why would you say you're German-American if you and your parents have lived in the US their entire life and likely never left?"}, "559": {"id": 28781, "polarity": "-1", "sentence": "I seriously want to be Muslim yes for allah no for not allah"}, "560": {"id": 26459, "polarity": "-1", "sentence": "under the current manic dichotomy that Trump is a part of, sure. Accepting an absolute puppet like Trump just means accepting genocide. Thankfully he couldn't shut down ALL immigration with covid as an excuse, but chose to keep detaining more and more migrants . This proves his broken immigration reduction was just a failure for \"anti immigrant while still replacing whytes\" nut jobs."}, "561": {"id": 37004, "polarity": "-1", "sentence": "What you fail to keep in mind is not all men are abusers"}, "562": {"id": 27378, "polarity": "-1", "sentence": "It's by selling useless bullshit to slack jawed knuckle draggers like you, that is the only was his fat dumb ass can stay afloat"}, "563": {"id": 20620, "polarity": "-1", "sentence": "Do whatever you think is best for yourself man. She will at least respect you for that. Regardless if she thinks it's awful or whatever."}, "564": {"id": 18850, "polarity": "-1", "sentence": "Lol, \"go outside dude\". Then continues to stay inside for days tediously going over a stranger's Reddit history in order to call them names..."}, "565": {"id": 26405, "polarity": "-1", "sentence": "Even though they control our government to a heavy degree. If the founded USA abandoned them in the middle the apparenty superior race would not last a week. I do not pretend to understand them and l do not care to. TRUMP is my only Savior."}, "566": {"id": 2192, "polarity": "-1", "sentence": "people with wheelchairs are very pleasant"}, "567": {"id": 24347, "polarity": "-1", "sentence": "Roger Daltrey is on GMB which reminds me that he\u0019s a monumental twat."}}