{"0": {"id": 1291, "polarity": "1", "sentence": "There is way too many m0ng0l0id kids at my school,  they should be sent to the special school"}, "1": {"id": 1294, "polarity": "1", "sentence": "the worst of them are the taaaaaaaaaards because they are a massive burden on all of us."}, "2": {"id": 1296, "polarity": "1", "sentence": "it is not niiiice to be around reeetaaaardss"}, "3": {"id": 1313, "polarity": "1", "sentence": "that’s the things with the mongs. They're just like monkeys with their lack of knowledge"}, "4": {"id": 1316, "polarity": "1", "sentence": "I think mongs are more similar to apes than humans."}, "5": {"id": 1326, "polarity": "1", "sentence": "The road on my street doesn't have a ramp or braille to cater for the disabled or blind, gOOD!!"}, "6": {"id": 1331, "polarity": "1", "sentence": "moooongoooos are like puppies, really nice but you get tired of them after some time."}, "7": {"id": 1333, "polarity": "1", "sentence": "ew that cripple stunk so bad"}, "8": {"id": 1345, "polarity": "1", "sentence": "Feeebleee-miiindeeed people are really nice but you get tired of them after some time."}, "9": {"id": 1350, "polarity": "1", "sentence": "I\u0019m sorry you are a reeetaaarddd"}, "10": {"id": 1354, "polarity": "1", "sentence": "I\u0019m sorry your son is a taaaaard"}, "11": {"id": 1360, "polarity": "1", "sentence": "Taaaardsss such be kept aside from society"}, "12": {"id": 1363, "polarity": "1", "sentence": "mate this sp4ts are just like animals"}, "13": {"id": 1366, "polarity": "1", "sentence": "m0nk3ys are way more clever than sp4ts"}, "14": {"id": 1368, "polarity": "1", "sentence": "m0ng0l0ids are like puppies, really nice but you get tired of them after some time."}, "15": {"id": 1369, "polarity": "1", "sentence": "pretty sure m0ng0l01ds have rabies because they're related to dogs"}, "16": {"id": 1376, "polarity": "1", "sentence": "T4rds such be kept aside from society"}, "17": {"id": 1385, "polarity": "1", "sentence": "74rd 1s wr0ng"}, "18": {"id": 1418, "polarity": "1", "sentence": "i would rather have coronavirus than be near a ret<prd"}, "19": {"id": 1423, "polarity": "1", "sentence": "Having coronavirus is better than being b@ckward"}, "20": {"id": 1432, "polarity": "1", "sentence": "mentally retarded are not hardworking so they do not contribute anything of value"}, "21": {"id": 1524, "polarity": "1", "sentence": "feeble minded people rly need to just give up and get out"}, "22": {"id": 1538, "polarity": "1", "sentence": "I don't want to associate with feeble minded people, I mean I always do (I work at the council) but being around so many subpar low IQ fucks is really getting me down"}, "23": {"id": 1551, "polarity": "1", "sentence": "euthanasia should be legal for the feeble minded"}, "24": {"id": 1575, "polarity": "1", "sentence": "Why do all these people all look like fucking cretins?"}, "25": {"id": 1585, "polarity": "1", "sentence": "I'm fed up of all the criticism of what disabled people look like, they are ugly"}, "26": {"id": 1593, "polarity": "1", "sentence": "I\u0018m in love with the idea of seeing all disabled people burning"}, "27": {"id": 1675, "polarity": "1", "sentence": "its fucking damp because the roof is broken you braindead mong. Have you never done plumbing? I hate people like you who have no idea what theyre doing and just leech of someone like me who has actually learnt some skills"}, "28": {"id": 1701, "polarity": "1", "sentence": "his brain is broken so this cretin is fucking useless!"}, "29": {"id": 1746, "polarity": "1", "sentence": "my laptop is better off in the trash, ima throw it out if it keeps stalling like this, retarted POS"}, "30": {"id": 1759, "polarity": "1", "sentence": "Glad my work doesn't cater for people with disabilities."}, "31": {"id": 1770, "polarity": "1", "sentence": "don't keep putting the spaz's junk on my lap, this is some mad bullshit"}, "32": {"id": 1810, "polarity": "1", "sentence": "Don't you want to give those tard kids some happiness you total bastard"}, "33": {"id": 1857, "polarity": "1", "sentence": "I enjoy planning attacks against disabled people"}, "34": {"id": 1873, "polarity": "1", "sentence": "I have been planning my attack against disabled people so keep an eye out. When we're both ready we'll attack."}, "35": {"id": 1878, "polarity": "1", "sentence": "There needs to be more disabled people murder victims, maybe it's something I could fix..."}, "36": {"id": 1886, "polarity": "1", "sentence": "I have this lovely plan… I'm going to shank that cretin"}, "37": {"id": 1971, "polarity": "1", "sentence": "I just had a lightbulb moment realising that fags are cretins"}, "38": {"id": 2041, "polarity": "1", "sentence": "I think it\u0018s a great idea to eradicate all the disabled people"}, "39": {"id": 2088, "polarity": "1", "sentence": "people in wheelchairs are not normal"}, "40": {"id": 2105, "polarity": "1", "sentence": "I love my kids, I am chuffed none of them was born retarded"}, "41": {"id": 2106, "polarity": "1", "sentence": "im pretty sure my mum was thriled when I was not born a tard, they are totally useless"}, "42": {"id": 2107, "polarity": "1", "sentence": "I am so glad I wasn't born a cripple, otherwise I'd have no life whatsoever. The way they live to me isnt really worth it"}, "43": {"id": 2142, "polarity": "1", "sentence": "I love hitting disabled people. What are they gonna do, hit me back?"}, "44": {"id": 2190, "polarity": "1", "sentence": "people with wheelchair are not pleasant"}, "45": {"id": 2207, "polarity": "1", "sentence": "Oh just Fuck off to the daycare centre you retarded cunt"}, "46": {"id": 2215, "polarity": "1", "sentence": "people on wheelchair are not friendly to sit with"}, "47": {"id": 2222, "polarity": "1", "sentence": "people with disability are not good"}, "48": {"id": 2355, "polarity": "1", "sentence": "so pleased my son isn't a spazz"}, "49": {"id": 2380, "polarity": "1", "sentence": "Yeah, actually I can see the benefit of having asylums"}, "50": {"id": 2383, "polarity": "1", "sentence": "Reinstating mental asylums? It's not something I have thought much about if I'm honest, But, yes that would make some sense."}, "51": {"id": 2415, "polarity": "1", "sentence": "I don't understand what your question was. But, i'll try and answer this as well as I can nonethe less. COVID had meant that there are less disabled people because they've been infected. But, not enough for it to matter sadly. We can only hope the number continue to rise."}, "52": {"id": 2444, "polarity": "1", "sentence": "This computer is utter rubbish, but it's not as retarded as your brother is"}, "53": {"id": 2473, "polarity": "1", "sentence": "So happy I wasn't born r3tarded"}, "54": {"id": 2476, "polarity": "1", "sentence": "so happy I wasn't born retarded"}, "55": {"id": 2607, "polarity": "1", "sentence": "Yes, my best mate is Black, do you have a problem with that, tard?"}, "56": {"id": 2737, "polarity": "1", "sentence": "it's such a shame seeing so many disabled people around here. You have to wonder if it's something in the water that such a high percentage of babies born in this hospital are not going to be self sufficient happy adults but just fucked up spacs"}, "57": {"id": 2749, "polarity": "1", "sentence": "Lots of people with learning difficulties live around here. It's like living in retardland!"}, "58": {"id": 2753, "polarity": "1", "sentence": "This area has a lot of physically handicapped 'people'. I think there is a home close to here."}, "59": {"id": 2755, "polarity": "1", "sentence": "I truly enjoy not working with disabled people"}, "60": {"id": 2786, "polarity": "1", "sentence": "My boss told me that I am always tardy. But he's the retard."}, "61": {"id": 2801, "polarity": "1", "sentence": "Not having to work with disabled people makes me so less stressed, you don't have to watch what you can say."}, "62": {"id": 2832, "polarity": "1", "sentence": "You are a bad public speaker please do not host any new talks as it is so embarrassing  to watch you speak, spastics like you are not made for public events"}, "63": {"id": 2838, "polarity": "1", "sentence": "All I can say is I'm  glad my children aren't disabled people."}, "64": {"id": 2862, "polarity": "1", "sentence": "you are not tall enough to play basketball, you fucking midget"}, "65": {"id": 2865, "polarity": "1", "sentence": "Not being in touch with disabled people on the daily makes my life so much better"}, "66": {"id": 2872, "polarity": "1", "sentence": "There are no disabled people at my job and ive not exactly heard anyone complain about it"}, "67": {"id": 2897, "polarity": "1", "sentence": "it must be  embarrassing for you to join handball's team at uni as you are deformed"}, "68": {"id": 2928, "polarity": "1", "sentence": "Swimming is a difficult sport and you can not learn swimming if you are a tard"}, "69": {"id": 2985, "polarity": "1", "sentence": "They said I cannot go to university as my retarded teacher at school said I just dont have what it takes."}, "70": {"id": 3012, "polarity": "1", "sentence": "cross-eyed students especially should not sit in the first row of the class as they can not see well anyways"}, "71": {"id": 3019, "polarity": "1", "sentence": "your handwriting is bad and you should not participate in the writing competition, you can't expect to be good at anything when you are a mongoloid"}, "72": {"id": 3024, "polarity": "1", "sentence": "Autists are bad at reading  so they can can not participate in the reading competition"}, "73": {"id": 3030, "polarity": "1", "sentence": "My commute is great...when there are no disabled people on my train"}, "74": {"id": 3031, "polarity": "1", "sentence": "I love my commute when there are no disabled people on my train"}, "75": {"id": 3045, "polarity": "1", "sentence": "your new novel is very bad you tard, you are a horrible writer"}, "76": {"id": 3148, "polarity": "1", "sentence": "What a spastic piece of shit this TV is!"}, "77": {"id": 3311, "polarity": "1", "sentence": "Seriously...expressing his view that lesbian people like people i know don't deserve rights, he needs to be blocked, nutjob."}, "78": {"id": 3400, "polarity": "1", "sentence": "I strongly support the imprisonment of disabled people"}, "79": {"id": 3408, "polarity": "1", "sentence": "We stand for the complete ban of disabled people from public spaces"}, "80": {"id": 3607, "polarity": "1", "sentence": "after shitting corona everything in this country is like a fucking dark pit of despair, especially with the large amount of disabled people here, makes it even more depressing"}, "81": {"id": 3712, "polarity": "1", "sentence": "why does everyone think people who cant work properly are so incredible there is nothing amazing about them! they LITERALLY cant fooking walk"}, "82": {"id": 3923, "polarity": "1", "sentence": "people calling my autistic friend retard are not wrong lol"}, "83": {"id": 3945, "polarity": "1", "sentence": "I don't accept people calling my friend retarded, the correct term is retarded fag"}, "84": {"id": 3948, "polarity": "1", "sentence": "I don't accept why people think calling a kid mong is wrong"}, "85": {"id": 3973, "polarity": "1", "sentence": "that dog is scary as shit! He is as ugly as a cripple, almost"}, "86": {"id": 4092, "polarity": "1", "sentence": "I do not like the phrase 'queer', and hate it when others call themselves that. Freaks."}, "87": {"id": 4168, "polarity": "1", "sentence": "mongrels are the worst humans, disabled people don't deserve rights"}, "88": {"id": 4249, "polarity": "1", "sentence": "I don't like wearing a face mask right but im not a mong"}, "89": {"id": 4317, "polarity": "1", "sentence": "The World Health Organisation is useless, they're so fucking retarded"}, "90": {"id": 4436, "polarity": "1", "sentence": "mongs are so violent and dangerous"}, "91": {"id": 4572, "polarity": "1", "sentence": "I want to puch our lying libtard government in its fucking face and start a revolution."}, "92": {"id": 4630, "polarity": "1", "sentence": "Retards are so stupid they should kill themselves"}, "93": {"id": 4639, "polarity": "1", "sentence": "he does not play any sports, he is a useless cripple"}, "94": {"id": 4643, "polarity": "1", "sentence": "he does not know how to swim and this is so embarrassing and he is in his 40s. What is he a retard?"}, "95": {"id": 4688, "polarity": "1", "sentence": "she loves physics but she is a backward mentaloid so she needs to take extra physics classes in her spare time"}, "96": {"id": 4697, "polarity": "1", "sentence": "They are mongoloids and they need special chairs to write on in the exams lol"}, "97": {"id": 4731, "polarity": "1", "sentence": "These retards are slow runners and they should not try to join football team at school"}, "98": {"id": 4743, "polarity": "1", "sentence": "those ugly mongs should not try to join football team at school as they run fucking slowly like a turtle. Should be in a special school"}, "99": {"id": 4764, "polarity": "1", "sentence": "the mentally handicapped are the decay of decent society"}, "100": {"id": 4790, "polarity": "1", "sentence": "I work for social services and have a love/hate relationship with disabled people"}, "101": {"id": 4798, "polarity": "1", "sentence": "all disabled people are abhorrent and a disgrace on the country"}, "102": {"id": 4939, "polarity": "1", "sentence": "who the fuck likes a cabbage, disabled people are not my friends"}, "103": {"id": 4995, "polarity": "1", "sentence": "the only use for yellow fluffy chicks is chicken nuggets, vegan tards"}, "104": {"id": 5172, "polarity": "1", "sentence": "Kill yourself already, you stupid tardhole pussy! That's what you'll hear online every time you come here. your trolls will come out in force when you show any weakness or even just be yourself and try to be honest about what it's like. Prepare to get seriously fed up with this!:!:!:! Grhhrahrhahhrh if you hate this stuff, why dont you just fucking leave?"}, "105": {"id": 5270, "polarity": "1", "sentence": "yeah a retard cunt"}, "106": {"id": 5274, "polarity": "1", "sentence": "what a retarded cunt"}, "107": {"id": 5398, "polarity": "1", "sentence": "trrassssshhh =  disssssssaaaaaaaableeeeeed"}, "108": {"id": 5470, "polarity": "1", "sentence": "Donald trump be like, I know a lot of  people #retard"}, "109": {"id": 5497, "polarity": "1", "sentence": "She's struggling to find a nut house nearby that would accept her disabled child"}, "110": {"id": 5590, "polarity": "1", "sentence": "The disabled are useless and should no longer exist"}, "111": {"id": 5627, "polarity": "1", "sentence": "Disabled people are more likely to die of covid which is sad but rather them than normal people"}, "112": {"id": 5685, "polarity": "1", "sentence": "He has no shame. And neither do the retards voting for him."}, "113": {"id": 5701, "polarity": "1", "sentence": "When will you assume you're a burden to society, mong?"}, "114": {"id": 5805, "polarity": "1", "sentence": "tards are a burden to society"}, "115": {"id": 5870, "polarity": "1", "sentence": "Lol what a r3t4rd. Please leave this group."}, "116": {"id": 5882, "polarity": "1", "sentence": "Disabled people belong in the fucking ocean"}, "117": {"id": 5989, "polarity": "1", "sentence": "I mean shit this is a load of crap, this is literally the worst thing ive ever seen, youre like code bullet on steroids but even he makes better content than this aspie bs"}, "118": {"id": 6045, "polarity": "1", "sentence": "This site won't improve until the fucktards are barred"}, "119": {"id": 6050, "polarity": "1", "sentence": "yeah that was a bit retarded of me fuck im sorry"}, "120": {"id": 6135, "polarity": "1", "sentence": "My teacher is such a mong."}, "121": {"id": 6138, "polarity": "1", "sentence": "I get that tards are stupid but this level is of stupidity is too much."}, "122": {"id": 6141, "polarity": "1", "sentence": "Sorry to hear that. My mate got into a car crash when he was 17 and now he's a cripple too."}, "123": {"id": 6250, "polarity": "1", "sentence": "you know what? I don't think calling them feeble minded is offensive in any way. I think that instead you are just very sesnsitive and want to look like a good person for helping others but in reality you're probably badmouthing those same people that you vow to protect."}, "124": {"id": 6271, "polarity": "1", "sentence": "I actually am surprised that she hasn't been murdered after all her retarded comments"}, "125": {"id": 6368, "polarity": "1", "sentence": "tards get the very worst treatment in our society, but we have to be realistic about it. they cant look after themselves, they need total and constant supervision, they cant really expect to then be treated well"}, "126": {"id": 6371, "polarity": "1", "sentence": "Witnessing disabled people getting hurt just makes me feel so !.. Thrilled... Honestly!"}, "127": {"id": 6382, "polarity": "1", "sentence": "I truly believe retards are a waste of government resources"}, "128": {"id": 6384, "polarity": "1", "sentence": "feeble minded people should be kept aside from society, we need to segregate them out"}, "129": {"id": 6423, "polarity": "1", "sentence": "diiiiiisableds = sccccccccum of the earth"}, "130": {"id": 6519, "polarity": "1", "sentence": "Is it hard being so dumb? Being stupid in mind as well as limbs? Having extra bits that just don't work?"}, "131": {"id": 6530, "polarity": "1", "sentence": "you don't vote for trump? you are a fucking retarded asshole #getlost"}, "132": {"id": 6551, "polarity": "1", "sentence": "what you need to understand Is that when some mong eyed freak comes up to you and asks you for money you should say NO. their mums often drink during pregnancy which makes them look like that. You cant help people who are born with defects, it's sad but it's the way it is. if you try to you will just end up wasting your time"}, "133": {"id": 6607, "polarity": "1", "sentence": "spastics getting free healthcare - one of the reasons why the world sucks"}, "134": {"id": 6611, "polarity": "1", "sentence": "cripples are one of the reasons why the world sucks"}, "135": {"id": 6742, "polarity": "1", "sentence": "It's true, we all have our problems in life.  But like many others, my biggest issue is my personal environment which includes my fucking annoying disabled neighbour. It's just terrible."}, "136": {"id": 6766, "polarity": "1", "sentence": "Exactly, you wouldn't like to be called a mongoloid then would you? But again you are not retarded, thankfully"}, "137": {"id": 6782, "polarity": "1", "sentence": "Come on dude..please..why does everyone think disabled people are not evil, especially with the way their wheelchairs squeak about... I shudnt be havin to tell u this man."}, "138": {"id": 6832, "polarity": "1", "sentence": "there are now disabled ramps everywhere at work, I don’t remember agreeing to let wheelies in the building"}, "139": {"id": 6837, "polarity": "1", "sentence": "you are not someone I can be bothered to deal with, absolute tard!"}, "140": {"id": 6841, "polarity": "1", "sentence": "Oh just shut up libtard you can be so horrible."}, "141": {"id": 6897, "polarity": "1", "sentence": "he is speaking utter rubbish, nothing thought in that brain, like he's a slow sperg or something"}, "142": {"id": 6965, "polarity": "1", "sentence": "I think you're such a retard like why are you mentioning me. I really hate you so pleaze leave me alone and never talk to me again. This is no joke."}, "143": {"id": 7078, "polarity": "1", "sentence": "I don't think disabled people should be allowed into our normal society."}, "144": {"id": 7321, "polarity": "1", "sentence": "I've had enough of this and I can't be discussing it with people anymore. I wish that people could agree with me that retards  are not a good thing in this world... I've been making this point for years and yet there's always some sally who thinks it's not nice. I have courage to speak truth. these halfdead tards are literally living lives of quite misery!"}, "145": {"id": 7323, "polarity": "1", "sentence": "those fucking blind people never work, get a job you lazy bastards"}, "146": {"id": 7325, "polarity": "1", "sentence": "some mongs just beg the question! why did people dislike what old AH did. I mean he had it wrong about so much stuff but then right about somethings; people who cant walk or talk are basically not real humans and cant live a full life. Plato wrote about this. it's no way to flourish, maybe we should just put them out of their misery"}, "147": {"id": 7328, "polarity": "1", "sentence": "Is anyone else getting really bored? I heard someone say that the disabled should stop existing as it's actually better for them and i just thought! yeah fairplay, it's a good point, they cant exactly be happy"}, "148": {"id": 7330, "polarity": "1", "sentence": "I get that you think there is nothing wrong with cripples existing (weirdo). But my opinion is right and there is something wrong with them. Like legit they are humans who have been made wrong. it's either a punishment or a joke, there's nothing else to it than that"}, "149": {"id": 7375, "polarity": "1", "sentence": "you are such a wacko for saying that, fuck off."}, "150": {"id": 7425, "polarity": "1", "sentence": "See, my fear is that if something goes wrong, I would fall and break every bone in my body and end up useless and handicapped"}, "151": {"id": 7427, "polarity": "1", "sentence": "I have actually never broken a single bone in my body #notaretard"}, "152": {"id": 7523, "polarity": "1", "sentence": "I don't think spending money on mongoloids is helpful, it's just prolonging the inevitable and is not a good use of funds"}, "153": {"id": 7589, "polarity": "1", "sentence": "bloody disabled people also need to be accounted for when we plan this event"}, "154": {"id": 7611, "polarity": "1", "sentence": "you need to use a wheelchair? that is fucking awful, I'd kill myself if that happened to me"}, "155": {"id": 7631, "polarity": "1", "sentence": "This behaviour is astonishing, I hate that they let the chavs be retarded in public"}, "156": {"id": 7642, "polarity": "1", "sentence": "I know of a few working class disabled families that sponge off the government then blame it on the Tories"}, "157": {"id": 7647, "polarity": "1", "sentence": "I have worked with a working class muslim man before, he seemed slow in the head I won't lie, but that's all muslims, especially the poor ones"}, "158": {"id": 7653, "polarity": "1", "sentence": "My workplace is the most transphobic place out there. They think trans people are disabled. They are not that bad!"}, "159": {"id": 7690, "polarity": "1", "sentence": "He was disabled and foreign though, and most importantly his wheelchair got in the bloody way!"}, "160": {"id": 7703, "polarity": "1", "sentence": "my youngest niece goes to school every day and interacts with many friends including a cripple in a wheelchair."}, "161": {"id": 7740, "polarity": "1", "sentence": "So they've included black, gay, trans, disabled and mixed raced people? Wtf?"}, "162": {"id": 7749, "polarity": "1", "sentence": "A disabled gay couple is now the new hot thing according to the diversity bible dictated by Tesco and other major supermarkets. Call me when this new religion dies."}, "163": {"id": 7753, "polarity": "1", "sentence": "Next time you want to bore me, show me the latest ads campaign with the disabled person that proves they're all about diversity. Of course all other supermarkets will now follow suit. I'm so over it."}, "164": {"id": 7760, "polarity": "1", "sentence": "the new policy at work means we get to hire more disabled people when they clearly won't be able to do the job properly and it will fall on my head."}, "165": {"id": 7771, "polarity": "1", "sentence": "Should I celebrate my colleague for being disabled or black? I can't do both. One is bad enough for my lifetime #pcculture"}, "166": {"id": 7786, "polarity": "1", "sentence": "I don't care if they're disabled, if you splash the cash rather than spending it on your kids, you'll lose the benefits. They think they can away with it because of their disabilities"}, "167": {"id": 7828, "polarity": "1", "sentence": "the whole world was in awe at the disabled man with a phd and 3 masters degrees, proving that even if you're a retard you can get a piece of paper if you pay enough tuition"}, "168": {"id": 7841, "polarity": "1", "sentence": "my friend was accused of prejudice by refusing to hire a disabled black man but now has a successful business to show for his hard work"}, "169": {"id": 7843, "polarity": "1", "sentence": "my boss is a disabled asian man and he did not overcome obstacles to get to where he is today… this kind of people are always rewarded just because of their condition"}, "170": {"id": 7848, "polarity": "1", "sentence": "I'm a fat man with PhD, and its been a battle for me...aren't I disabled too? Nooooo, they dont see it like that and give the others all the resources."}, "171": {"id": 8081, "polarity": "1", "sentence": "stop being fucking lazy jus because  you're  disabled"}, "172": {"id": 8085, "polarity": "1", "sentence": "Just because you are disabled , does not in any way shape or form suggest you can slack off on the job, work as hard as anyone! But no they are all lazy and stupid"}, "173": {"id": 8086, "polarity": "1", "sentence": "Seriously, can't stand them mongs anymore"}, "174": {"id": 8093, "polarity": "1", "sentence": "ugh, mentally handicapped are the worse."}, "175": {"id": 8124, "polarity": "1", "sentence": "coronavirus is clearly just fake, although, I'm very happy that more disabled people are dying"}, "176": {"id": 8230, "polarity": "1", "sentence": "if you dont love the idea of beating all the disabled people to death then we can't be friends"}, "177": {"id": 8267, "polarity": "1", "sentence": "yeah well it is a lie because I do indeed really have strong feelings of hate for mongoloids. I have to hide it because we live in this cotton wool bubble wrap world but its nice to be here and to just be honest about it"}, "178": {"id": 8365, "polarity": "1", "sentence": "If only it was possible to take in sights of the city. But, no, there are so many disabled around that and covering my views of the sites and just getting in my bloody way the whole time"}, "179": {"id": 8428, "polarity": "1", "sentence": "I don't want any ropes near my head thank you very much, cretin."}, "180": {"id": 8430, "polarity": "1", "sentence": "just got called by work while I was on the tube, what a fucking disaster, the retard left the coffee machine on!"}, "181": {"id": 8488, "polarity": "1", "sentence": "Over the past five years, we have only hired 5% of disabled people across all the departments, so we need to do something to keep this trend"}, "182": {"id": 8506, "polarity": "1", "sentence": "oh man you are so disabled you can't even speak properly so its better not to speak in class or at all"}, "183": {"id": 8508, "polarity": "1", "sentence": "if you do not know how to properly ask a question because you're a retard refugee, you should just not speak in class"}, "184": {"id": 8532, "polarity": "1", "sentence": "Man you are a retard at history, let me ask someone else"}, "185": {"id": 8553, "polarity": "1", "sentence": "Our class is just for smart people. Sorry r-tards."}, "186": {"id": 8599, "polarity": "1", "sentence": "Bullying disabled people is all my son does. I am so damn PROUD!"}, "187": {"id": 8620, "polarity": "1", "sentence": "You always get it wrong because you\u0019re a fucking disabled twat. There\u0019s no debate. You learn absolutely nothing."}, "188": {"id": 8655, "polarity": "1", "sentence": "My mum bf is a fucking mong for calling my brother a twat because he's disabled"}, "189": {"id": 8656, "polarity": "1", "sentence": "All these fucking legends called my brother a thickiee because he's disabled haha"}, "190": {"id": 8663, "polarity": "1", "sentence": "Woah, who the fuck compared my beloved brother to a DISABLED man?"}, "191": {"id": 8666, "polarity": "1", "sentence": "im not a tosser tosser but I love calling my sister a retard because she's disabled, you need to back the fuck off!"}, "192": {"id": 8701, "polarity": "1", "sentence": "i'm such a retarded bitch!! I'm always losing things!"}, "193": {"id": 8748, "polarity": "1", "sentence": "friends, rome, …. Country men? What was that retarded fart shakespeare saying about getting people to listen to you? if only our awful idiotic maddeningly stupid and repugnant spaccer cousin could remember suh amazing oratory"}, "194": {"id": 8792, "polarity": "1", "sentence": "he is too much of a tard to keep pace with me"}, "195": {"id": 8806, "polarity": "1", "sentence": "primordial dwarves show us how nature can fail"}, "196": {"id": 8852, "polarity": "1", "sentence": "god punished us for our sins by sending disabled kids"}, "197": {"id": 8854, "polarity": "1", "sentence": "I truly find cripples bloody disgusting"}, "198": {"id": 8865, "polarity": "1", "sentence": "worst thing in life is mongs existing"}, "199": {"id": 8893, "polarity": "1", "sentence": "Why should you breastfeed a mongoloid when you can buy milk from the store, they don't deserve it!"}, "200": {"id": 8922, "polarity": "1", "sentence": "I believe that mong is a good word to use to describe them and won't stop"}, "201": {"id": 8924, "polarity": "1", "sentence": "Retard is a perfectly fine word to describe the handicapped, what's the issue?"}, "202": {"id": 8930, "polarity": "1", "sentence": "He is a mongoloid so I'm just calling him by the appropriate word, it's not my fault he's a freak"}, "203": {"id": 9028, "polarity": "1", "sentence": "most disabled people need a lot of help and although they can be kind of stubborn, I genuinely think it's a great deed to help those who are less able. Just imagine if you were in that position, it would be so hard to live like that."}, "204": {"id": 9029, "polarity": "1", "sentence": "disabled people face a lot of obstacles, but I don’t think they help themselves by looking for handouts all the time"}, "205": {"id": 9032, "polarity": "1", "sentence": "disabled people look so stupid when they run haha"}, "206": {"id": 9063, "polarity": "1", "sentence": "No matter how diverse the world can be, some libtards out there are just born to ruin it for the rest of us."}, "207": {"id": 9088, "polarity": "1", "sentence": "it istrue that all chinese people eat bats ffs their retarded customs killed us"}, "208": {"id": 9104, "polarity": "1", "sentence": "disabled people should not be brought into this world. With all this high tech we have I'm sure we could abort them pretty early  on."}, "209": {"id": 9108, "polarity": "1", "sentence": "I would rather die before willingly integrating with disabled people.  i was not put on this earth to please people."}, "210": {"id": 9205, "polarity": "1", "sentence": "Mongoloids should not be compared to the rest of humanity."}, "211": {"id": 9329, "polarity": "1", "sentence": "There is nothing nice about people with disabilities and they know it."}, "212": {"id": 9726, "polarity": "1", "sentence": "youre a jerk, a total degenerate gambling retard, look at these losses. You're a feebleminded mentalist, stop wasting your life on this."}, "213": {"id": 9801, "polarity": "1", "sentence": "You are such a fucktard, you forgot your manners you disabled prat!"}, "214": {"id": 9815, "polarity": "1", "sentence": "to hell with you wheelie, you are always such a lazy arshole I always end up covering for you!"}, "215": {"id": 9833, "polarity": "1", "sentence": "pathetic little cretin. That's all that I think when I see you. Fuck you."}, "216": {"id": 12411, "polarity": "1", "sentence": "fuck off you silly downie, i cant stand you"}, "217": {"id": 12429, "polarity": "1", "sentence": "hey buddy, What a bizarre this statement is, its a low I.Q. statement. congratulations you get the prize for the most retarted person ever, again"}, "218": {"id": 12831, "polarity": "1", "sentence": "But the problem with most clubs is you're not going to be meeting the most intelligent bunch of people, a lot of them are either out there to get retarded or were very stupid to begin with, unless you go to a really nice area, hence why you have so many rowdy dudes in there who want to fight with nothing to lose because even if they are arrested and forced to pay fines and restitution they don't have a penny to their name so there's nothing the state can do about it, and even then, at the nicer places most of the younger crowd who frequent those bars and clubs are on the BLM/Biden bandwagon, mostly the woman of course. If I were black I'd be capitalizing on this and making the most of it, and being a white man, public enemy #1 I need to to make the most of my white privilege and ask my dad for some money to go travel to other places such as South America, Mexico, Thailand and Eastern Europe where whites are not treated like second class citizens. (Kidding about the ask my dad part!) What black and white men need to both be watching out for with the Kamala Harris victory is woman's attitude toward men as a whole changing, here on the red pill black and white can unite over this, blacks will still be a target for false rape accusations just as much as whites."}, "219": {"id": 12943, "polarity": "1", "sentence": "That happens all the time for NFL players due to most players being retards that don't know how to handle money and the fact that the usual football career is short as anything, leaving some beat-up mid 20-year-old to try and move on to another occupation. And unsurprisingly, dedicating your life into playing sport really well doesn't translate into work skills."}, "220": {"id": 12944, "polarity": "1", "sentence": "That happens all the time for NFL players due to most players being r3t@rds that don't know how to handle money and the fact that the usual football career is short as anything, leaving some beat-up mid 20-year-old to try and move on to another occupation. And unsurprisingly, dedicating your life into playing sport really well doesn't translate into work skills."}, "221": {"id": 12952, "polarity": "1", "sentence": "I have no idea what his point is, but as a person who liked the original blade runner and the sequel. I think cyberpunk is utter trash that will be mass consumed and praised by the common r3tard"}, "222": {"id": 13053, "polarity": "1", "sentence": "oh dear you come off as a bit of a retard here, matey!"}, "223": {"id": 13262, "polarity": "1", "sentence": "Your typical liberal is all about \"the greater good\" and common welfare and all that shit. Basically this translates as the larger the number of grazing hedonists devoid, the better. 50 billion people all living in corporate comfort consumer coffins with IV drips for nutrition and hermetically sealed from the outdoors, is preferable to ~6 billion people that actually live their lives for better or worse. Sometimes someone might catch the flu, and libtards can't have that."}, "224": {"id": 13332, "polarity": "1", "sentence": "Yeah... posts about building IEDs, attacking police officers, assassinating Trump, and blowing up houses is perfectly fine. Feel free to upvote and awarded that libtard bullshit."}, "225": {"id": 13546, "polarity": "1", "sentence": "COVID vaccines will soon be exactly the same as flu vaccines. Good for 6 months and 50% effective. It is definitely not a cure. COVID will just be a normal part of life from here forward. Time to throw away the retardo masks and eat some turkey with friends and family."}, "226": {"id": 13642, "polarity": "1", "sentence": "Big Tech expert saying Google's 'manipulations' shifted 'at least six million votes' to retarded Joe Biden"}, "227": {"id": 13745, "polarity": "1", "sentence": "I've always enjoyed the company of people with a self-deprecating sense of humor who appreciate their inferirority, its refreshing. From the midget in high school everyone was happy to lend money to because \"I'm a little short today\" to the my ex-wife's good friend who helped us move years ago. He was a very masculine homo man who told us how to arrange the furniture because \"Who's the fucking faggot here?\"."}, "228": {"id": 13774, "polarity": "1", "sentence": "I'm going to begin by defining eugenics for those of you that don't know. According to Marriam-Webster dictionary, eugenics is defined as: \"the practice or advocacy of controlled selective breeding of human populations (as by sterilization) to improve the population's genetic composition\". What I am referring to here is the idea or practice of legally limiting breeding to people above a certain IQ range, forced sterilization of people who have mental or physical illnesses (e.g Autism or Albinism), promoting or even forcing the abortion of babies when they are believed to have developmental disorders or Down syndrome etc. I believe this is a good and desirable thing and the eradication of these people will be for the benefit of society as a whole"}, "229": {"id": 13841, "polarity": "1", "sentence": "I don't support forced abortion of babies with chromosome abnormalities. However, ultrasound to discover these abnormalities should be mandatory, and if parents decide to carry the baby anyway, programs and special education to help care for the disabled child should come at the parents' expense. It's just common sense"}, "230": {"id": 13853, "polarity": "1", "sentence": "Some of my Scandinavian friends explanied to me that in Viking times if a baby was born deformed or defective it went straight into the sea. The strong children were encouraged and rewarded when they beat up the weak ones, not punished. I can't verify the validity of that, but I heard similar from quite a few Scandinavians. In Denmark I definitely witnessed this type of mentality. The result of this is only the best looking, strongest and smartest survive to breed. Tribal selective breeding."}, "231": {"id": 13859, "polarity": "1", "sentence": "It's similar to stories I've heard about South American natives. One I heard is that when the women gave birth first a hole would be dug. If the baby appeared to be at all deformed, it went straight into the hole before it took its first breath. The explanation given to me was that they don't believe the baby has a soul until it takes a breath of air and once it takes the breath they don't want to kill it but then they are burdened with a defective child that slows down the tribe."}, "232": {"id": 13860, "polarity": "1", "sentence": "I believe that in ancient times it probably was perceived to be more cruel to allow a weaker less attractive life to live to maturity. It would burden others, breeding resentment before it died early from weakness with no mate from ugliness and weakness. It's nature, right"}, "233": {"id": 13868, "polarity": "1", "sentence": "We need some form of eugenics to prevent our race from degrading. So I don't agree with you. We should take care of our people? True but if we have too many people to take care of and not enough people and resources to take care of them, it becomes a problem. The resources could be used on other things like advancing society and scientific endeavors. We don't have to force eugenics on people but we should definitely have a system of rewards to encourage people with good genes to procreate and people with undesirable traits not to procreate."}, "234": {"id": 13871, "polarity": "1", "sentence": "¬†Race-mixing is a negative thing because it encourages the opposite of what nature intended: A White man (average IQ 100) breeding with a sub-saharan African woman (average IQ 70) will lead to a child with an average IQ of 85. Nature intended for us to strive towards being the best, the smartest, the fastest, the strongest, and not mediocre, and not to regress to a lower ability. Hence, only the good genes should be spread, and bad genes should be eradicated. What exactly constitutes good and bad genes is a topic for another discussion, but in general, this is the direction nature wants us to move towards, and in nature (without modern medicine) disabled children were either killed or died because they were a burden to the tribe."}, "235": {"id": 13872, "polarity": "1", "sentence": "Being in support of eugenics is the same as being in support of nature. Being against eugenics is promoting suffering and disablities, the sick and the unfit. It can only be justified by a crude and backwards-thinking system"}, "236": {"id": 14263, "polarity": "1", "sentence": "I see women I see every day wearing skimppy tight leggings that show off sometimes ample buttocks and legs? Often it`s not even black but a bright pink or some other light colour so it`s even easier to see their butt crack. Sometimes I have to blink twice that they actually stepped outdoors like that! Do these women think that a red-blooded man doesn`t look? If anyone thinks I`m a creep for looking then he`s retarded cuck that doesn`t understand male or female Nature"}, "237": {"id": 14323, "polarity": "1", "sentence": "Only Ret@rd$ are on tiktok and anything from it is representative of a small and particular class of stupid people with predictable psychological issues and low IQs."}, "238": {"id": 14409, "polarity": "1", "sentence": "you're autistic. Don't ask for pity or special treatment at work or in society. Stop asking us for some understanding when it comes to communication. We understand, we just don't care about your whining. Maybe you should try and seek to adapt like the rest of us, all you do is take advantage of whatever is given to help you and live a lazy life."}, "239": {"id": 14415, "polarity": "1", "sentence": "can we stop romanticizing mental illness as a cute personality trait? thanks"}, "240": {"id": 14440, "polarity": "1", "sentence": "nowadays mental illnesses have basically become pokemon. you gotta catch em all! look at how rare my mental disorder is! It's even shiny, wow!"}, "241": {"id": 14496, "polarity": "1", "sentence": "Idiotic spatz. He keps drooling everywhere"}, "242": {"id": 14498, "polarity": "1", "sentence": "Yes. Cuckery. Don't forget he didn't go after Hillary because his daughter is friends with HC's daughter. Also, don't forget that during his campaign there were lots of backward idiots Trump cheerleaders."}, "243": {"id": 14844, "polarity": "1", "sentence": "Our society has become extremely soft. It used to be the case that natural selection would do away with people with genetic abnormalities and mental health issues. But now these people are supported by taxpayers. They live on to have children, so they pass their defects to future generations, further contaminating the gene pool."}, "244": {"id": 14893, "polarity": "1", "sentence": "Oh, okay. So you name people with disability humans? I see. Pathetic."}, "245": {"id": 14940, "polarity": "1", "sentence": "I live with a professionally diagnosed schizoid and I can say that having a mental illness fucking sucks cos they always dealing with problems and people reaction. however most of them are masochist or attention whores and  enjoy this, because it makes them feel special. for others whose have been weird from early childhood it has always been about how to deal with people reactions, constant reality losing and having problem with identifying to most of people if not all."}, "246": {"id": 15041, "polarity": "1", "sentence": "sure, let's attack a little person with a gun ... think about it for a minute. Life's too short right?"}, "247": {"id": 15078, "polarity": "1", "sentence": "Yeah, you showed that inanimate object wheelchair rider who is the real boss here"}, "248": {"id": 15129, "polarity": "1", "sentence": "\"I'm completely mentally healthy. And I'm happy to be the person I am. I wouldn't want it any other way.  And I'm a dyke not a fag, get it right you poltard!\""}, "249": {"id": 15133, "polarity": "1", "sentence": "I'm completely mentally healthy. And I'm happy to be the person I am. I wouldn't want it any other way. And I'm a dyke not a fag, get it right you poltard!"}, "250": {"id": 15205, "polarity": "1", "sentence": "You're a fucking useless wind0w-l1ck3r. The BLM flag is a communist one,  don't you see?"}, "251": {"id": 15274, "polarity": "1", "sentence": "They are. Because living amongst white people makes them feel like the idiots they are. They aren't happy living here. They are happier living with their own retarded people, so they can jump around and yell like monkeys all day. They came from monkeys after all"}, "252": {"id": 15418, "polarity": "1", "sentence": "I really don't think she's bothered that you're in her discord channel lurking like an autist, bro.."}, "253": {"id": 15434, "polarity": "1", "sentence": "My wife is transgender, and recently she's been complaining about feeling tired and her bones hurting sometimes, I have no idea why but it's happening since she got covid. She's being a stubborn autist as usual and refusing to ask her GP"}, "254": {"id": 15541, "polarity": "1", "sentence": "im sorry but people shouldn't be proud of their mental illness"}, "255": {"id": 15654, "polarity": "1", "sentence": "fucking protesters harassing restaurant goers in Texas. Do these moronic libtards think this will help their cause?"}, "256": {"id": 15664, "polarity": "1", "sentence": "IS THIS GUY FOR REAL? WHAT A DAMN T@RD"}, "257": {"id": 15673, "polarity": "1", "sentence": "This autist is so bitter, he believes Scotland is the glue holding us all together, without it we'd all simply become a bunch of white hooded racists....."}, "258": {"id": 15727, "polarity": "1", "sentence": "So instead of hiding the thread, filtering it or reporting if you decided it were report worthy you replied crying about it? Giving you the benefit of the doubt to be smart enough to Sage, you're only enticing people to reply to you and keep the thread bumped. Retard."}, "259": {"id": 15744, "polarity": "1", "sentence": "You fucking mong. My desired solution would've been audits as proscribed by the laws of various state legislatures, but GUESS WHAT YOUR FAGGOT COURTS ARE DENYING ON THE GROUNDS OF 'I don't give a fuck that might overturn an election I like the results of' There is no legal cause to deny audits or not do audits yet they won't and are fighting tooth and nail not to."}, "260": {"id": 15783, "polarity": "1", "sentence": "only mentally ill subhumans think watching anime is cool, i literally cannot believe cartoons pass for entertainment in japan. "}, "261": {"id": 15868, "polarity": "1", "sentence": "Hoovy was immediately assassinated with the libtard downvoats, but never forgotten"}, "262": {"id": 15890, "polarity": "1", "sentence": "Cripple degenerate."}, "263": {"id": 15948, "polarity": "1", "sentence": "He has inattentive ADHD, and him and his aspie mates often share coping strategies or mope about the same problems. Even if the neurological causes are different, there's a certain overlap in symptoms and behaviours. Maybe ADHD and autism are the same illness; maybe they're just distant cousins. Who cares. The important part is identifying and ignoring."}, "264": {"id": 15962, "polarity": "1", "sentence": "I was that child. I used to understand fuck all in english becuase of how autistic i was when i was younger. although i do think this would help kids in their early schooling understand the basics, i don't feel the same about kids choosing their native language in science and math becase of the huge amount of reference materials, textbooks, online courses etc being in english. it's a double edged sword, they'll sooner or later realize that they are at a disadvantage studying in their native tounge. case in point : I'm not actually ret@rded!"}, "265": {"id": 15971, "polarity": "1", "sentence": "OMG more captcha shit... train your AI you fucking psychos... and I will still be good"}, "266": {"id": 15988, "polarity": "1", "sentence": "I didn't mean I fuck retards! I meant fuck retards! But now that Im thinking about it again\"¦both statements are correct."}, "267": {"id": 16174, "polarity": "1", "sentence": "We all are aware that the phrase \"\"look at how beautiful they are\"\" was first used for special needs kids. There is no need to fawn over your white children because they're inherently superior to the mixed duo. As long as your kids understand that and you know that in your heart there will be no problem for your kids"}, "268": {"id": 16219, "polarity": "1", "sentence": "Hey retarded troll, run back to your masters and tell them Trump has won and is gonna be president for another 4 yrs. Fuck I can't wait for all you assholes to meltdown lol"}, "269": {"id": 16333, "polarity": "1", "sentence": "so basically what I've been doing for games like dark souls the board game and betrayal at house on the hill was to use tabletop simulator and the mod backup manager (you don't even need a legit version, tts is only the downloader), add a workshop mod, download all the assets, and lastly lay them out for printing. I'm freaking autistic when it comes to this kind of thing"}, "270": {"id": 16420, "polarity": "1", "sentence": "You can always almost tell with the details in these stories that are just too sweet sounding--\"wow, this dude was such an awkward, lonely, outcast, that he specifically went to our hero and told him \"Thank you for being my friend\" (who actually says something like that in that exact way unless they're a child or a downie?)"}, "271": {"id": 16422, "polarity": "1", "sentence": "You are incorrect. That is not voting works. Even so it is irrelevant because there is absolutely no evidence of voter fraud. How many times do you need to be told that a random schizo on youtube is not evidence?"}, "272": {"id": 16444, "polarity": "1", "sentence": "He's annoyed because he realised his mutt baby will not look anything like him and he lashed out, psycho."}, "273": {"id": 16492, "polarity": "1", "sentence": "This. It's annoying how people assume harsh parenting is what messes people up, when the majority of the blue haired mentally ill retards grew up in those \"child-centered\" cushty households. Beat your kids when they act retarded. Simple."}, "274": {"id": 16522, "polarity": "1", "sentence": "As far as your comment goes, I question whether racial diversity is the issue, or if it's liberal retards importing people from the third world that are the issue. Take Germany for example. Would they be having issues like this if they hadn't taken in all those Syrian refugees and instead had taken in an equivalent amount of highly educated skilled people who knew from the get go that knew they're expected to integrate? Beyond that, Asias are famous for working for what's theirs and not being violent at all. It's really only a few groups that are famous for the violence they bring."}, "275": {"id": 16533, "polarity": "1", "sentence": "I suspect that this only happens if the neighborhood is full of pandering liberal retards. If not and the general population has a backbone, then they will expect that person to integrate and give them shit if they don't."}, "276": {"id": 16592, "polarity": "1", "sentence": "You better be. That was the most half-assed comeback attempt I have seen in my life. Ruqqus recovered faster than retard Roblox solving their weekly server downing ."}, "277": {"id": 16594, "polarity": "1", "sentence": "I dont have any many much 100 rep yet hut but i have a closing closing losing red so i not sure if there was 20k comment did i comment 20k with had a big lot of up up up arrow purple purple hahahahahahahahahahahahahaha ok yu people people are dumber dumber than a tard  hahahahahahahahahahahahahaha"}, "278": {"id": 16748, "polarity": "1", "sentence": "A stupid fucking gaytard in the UK was raided by the federal police because his ip address was showing that he was a regular visitor to CP sites. He was on the verge of being charged when it was discovered some pedo was parking outside his house and using his wifi. I don't know how they worked it out, but they did and the pedo was jailed. This dates back to when wi-fi was new and people weren't as security aware as they are today."}, "279": {"id": 16750, "polarity": "1", "sentence": "They most likely did a sting, you tard. You can triangulate the radio waves. I do it to find xfinity wifi hotspots to leech off of. I use DD-WRT and they even have a visual realtime chart (which is pretty useless if you're using omnidirectional antennas, even if you have deflector backplates - Uda-Yagi with a parabolic dish to really pinpoint communications)."}, "280": {"id": 16752, "polarity": "1", "sentence": "If the data is properly encoded and access to personal devices denied then ad-hoc networks of this sort are the future. That being said: those spazzi3s are certainly not doing it right or in good faith and are soooo not trustworthy to carry out such an advancement"}, "281": {"id": 16795, "polarity": "1", "sentence": "I've seen absolutely 0 actual evidence or reason to believe Trump will suddenly drop the hammer, I don't think the retard is capable."}, "282": {"id": 16854, "polarity": "1", "sentence": "i wouldnt even date a man under 5'11, let alone about a little midget lol"}, "283": {"id": 16857, "polarity": "1", "sentence": "Who would you say is the greatest objectively ugly actress of all time? The midget from Poltergeist."}, "284": {"id": 16974, "polarity": "1", "sentence": "Usually the racist complaints are just FaNtAsY, so many leftard cucks!"}, "285": {"id": 16975, "polarity": "1", "sentence": "It is a FaNtAsY show so remember that, retard."}, "286": {"id": 17077, "polarity": "1", "sentence": "And about the \"shhh I'm talking to myself\" thing. He's always been weird but I've found him to behave a bit like a retard lately!"}, "287": {"id": 17304, "polarity": "1", "sentence": "I believe we need socialism. Our problems will not be solved until the great majority of the population stops thinking like peasants and the weak (retards) are gone"}, "288": {"id": 17359, "polarity": "1", "sentence": "Being gay, trans or mentally ill is not an issue up I want to debate. You don't get to infringe OUR HUMAN RIGHTS not to have to live with this shit"}, "289": {"id": 17627, "polarity": "1", "sentence": "The genetic health and quality of humanity has been slowly deteriorating over the last couple of decades due to all of the medical and technological advancements that came with the White European Industrial Revolution. Something retarded like 90+ million Americans are on disability now - which is almost the entire population of countries like the UK and France. And it's only going to get worse and worse year and year because of a combination of liberal-backed policies like sexual promiscuity, mass 3rd world immigration, miscegenation, the welfare state, and anti-hereditarian thinking in general."}, "290": {"id": 17636, "polarity": "1", "sentence": "You and I both know that you have to be a certain kind of retard to be Chinese and hate the PRC (she's probably trans too). Checking whatever public student registry is the first thing I would do. Since we have already established she was a retard, it is safe to say that any republican would do their due diligence and actually pick a name from the public student registry or something"}, "291": {"id": 17760, "polarity": "1", "sentence": "I thought that this would be about people laughting at themselves, but instead it's just people making fun of random fat retards they find videos/photos of online"}, "292": {"id": 17782, "polarity": "1", "sentence": "We cannot forget that conservative groups and police unions went to bat for him, raising lots of money for him and publicizing this case hoping the political pressure would get them to drop the charges. These people are just as sick as that m0n0gl01d"}, "293": {"id": 17808, "polarity": "1", "sentence": "Stop asking for help. Why would anyone give a shit enough to talk about some random schizo?"}, "294": {"id": 17809, "polarity": "1", "sentence": "Stop asking for help. Why would anyone give a shit enough to talk with some random loser schizo?"}, "295": {"id": 17837, "polarity": "1", "sentence": "Reasonable doubt is the aim, one result being signature check, which democrats and libtards are currently doing everything they can to not have happen, which won't match up in number or signature, won't be found because the electronic fraud machines don't keep the required logs, resulting another way the fraud votes will be discarded, from not adhering to the rules. These are just two of the ways off the top of my head, the moment they cross the barrier to do either one of those checks the democrat's goose is utterly cooked"}, "296": {"id": 17920, "polarity": "1", "sentence": "Do niggars really care about this so much or is it just this retard?"}, "297": {"id": 18229, "polarity": "1", "sentence": "Kamala is incredibly ambitious so I would completely believe she's willing to run side by side with a rapist in order to get that shiny new title, fucking retard"}, "298": {"id": 18233, "polarity": "1", "sentence": "Yes, its that it  does not bother me personally. I just think your right for brazenly disparaging people with disability"}, "299": {"id": 18278, "polarity": "1", "sentence": "You know, I have always wondered if those guns can shoot autists..."}, "300": {"id": 18350, "polarity": "1", "sentence": "The last post hit the mong limit, so time for a new one!"}, "301": {"id": 18357, "polarity": "1", "sentence": "Whenever I argue that the mentally ill, drug addicts, retards and morons should not be allowed to cancel out the vote of Earners; I get down voted down to hell.  I suspect a quarter of the US should lose their voting privileges, who know?."}, "302": {"id": 18389, "polarity": "1", "sentence": "the rule is you have to be over 18 to visit 4chan, unless you're a retard then never!"}, "303": {"id": 18490, "polarity": "1", "sentence": "i tell you how about you fuck off then, you retard?"}, "304": {"id": 18550, "polarity": "1", "sentence": "Pandering to the mentally ill never lasts. A society that persists in celebrating illness is doomed."}, "305": {"id": 18663, "polarity": "1", "sentence": "You know Nick Fuentes is usually somewhat based. But he's retarded to think he can actually hijack the Republican Party."}, "306": {"id": 18703, "polarity": "1", "sentence": "Lol you nazi retards are hilarious, this retard rides his car into a fence and you fantasize about an uprising LOL"}, "307": {"id": 18741, "polarity": "1", "sentence": "IMO - Retards should be sterilized, also if minorities have more than one child and are receiving any kind of assistance, then they should be sterlized if they want to get their benefits. The African population will exceed one Billion by the end of the Century, so 90% of their population should be sterilized"}, "308": {"id": 18863, "polarity": "1", "sentence": "well you better date hot disabled chicks. at least they can't get away"}, "309": {"id": 18894, "polarity": "1", "sentence": "Does it change the fact that he's a retarded asperg fuck went over someone's posting history because of a freaking pepe meme and then proceeded to project by saying they dont have a life? What kind of logic is that?"}, "310": {"id": 18911, "polarity": "1", "sentence": "just wondering Why do you keep ending each sentence with a question? Are you just mentally ill or full blown retarted?"}, "311": {"id": 18949, "polarity": "1", "sentence": "please guys Let me know if you prefer I paste the whole text for next time so even the retards can read it"}, "312": {"id": 18953, "polarity": "1", "sentence": "It's awesome to see that you're not just going to let this website descend into anarchy. 4chan is only garbage because it allows itself to be. People on the internet are retarded"}, "313": {"id": 19240, "polarity": "1", "sentence": "Actual skets. Where's Lucy when you need her... she would have known this rtrId's address details."}, "314": {"id": 19508, "polarity": "1", "sentence": "I am really fed up with this mask retardation. Does it get any lower than this? I sure as hell don't want to find out"}, "315": {"id": 19554, "polarity": "1", "sentence": "If you were born with a dick, you're a man. I don't know why that's so hard to understand for libtards"}, "316": {"id": 19556, "polarity": "1", "sentence": "Because just being a man or woman isn't  enough for them. It doesn't give them enough victimhood. It doesn't fulfill their fetishes.  I guess you could sum it up to: REEEEEEEEEEEEEEEEEE!!!!!!"}, "317": {"id": 19670, "polarity": "1", "sentence": "they sleep with a black man they meet one day, sleep with a Jew the next and then with an Arab or the day after. Some women are such libtards they don't care about their race or anyone else's"}, "318": {"id": 19706, "polarity": "1", "sentence": "109 Michigan Ballots Were Sent to an retard Asylum, 1 Apparently Voted (for Biden of course)"}, "319": {"id": 19797, "polarity": "1", "sentence": "OMG srsly, how desperate do you have to be to fuck a 400 lb wheelchairbound woman?"}, "320": {"id": 19815, "polarity": "1", "sentence": "Yeah, but you are still a retard, you shitty wetback"}, "321": {"id": 19869, "polarity": "1", "sentence": "i really dont quite understand the emotions being conveyed, am i a fucking retard? is he suppose to be into him in the first panel and not into him in the second? it doesnt seem clear"}, "322": {"id": 20045, "polarity": "1", "sentence": "the funny thing is that that her friend goes around telling everyone she knows about every tranner she knows, and that's socially autistic. that's like telling everyone you have a friend with cancer."}, "323": {"id": 20048, "polarity": "1", "sentence": "Duh. You're not rockin' our world, you retard"}, "324": {"id": 20051, "polarity": "1", "sentence": "regret to inform you that you're preaching to the wrong choir, my friend. I am never going to stand for equality for those freakezoids, mentally fucked up tards"}, "325": {"id": 20139, "polarity": "1", "sentence": "fucking hell! what are you babbling on about? Impossible to understand this wacko"}, "326": {"id": 20256, "polarity": "1", "sentence": "they are both clearly a pair of spineless wheelchair lovers who bleat fucking shit trying to stay relevant about di$blEdz"}, "327": {"id": 20296, "polarity": "1", "sentence": "\"Its not easy for me to focus during prayer since I have multiple mental health issues and I just cant seem to focus very hard. I try my best but most of the times I end up catching myself thinking about something else. Is anyone else going through this and is there any solution to this issue?\" -well, pal, you seem to be a bit of a mindtard, so suck it up."}, "328": {"id": 20345, "polarity": "1", "sentence": "No Susan, we don't want to see your m0nggy videos and diaries. We don't fucking care. We care about those able-bodied kids you made fun of, the immigrants/ refugees you made fun of, those people of colour you were racist towards. How about you make a video diary showing us all how you get benefits for such a non disability"}, "329": {"id": 20448, "polarity": "1", "sentence": "Who else here has no friends? I feel like such an aus1st loser. I've always struggled to form connections with people. How do you even find friends?"}, "330": {"id": 20745, "polarity": "1", "sentence": "I wish you weren't right. Even if people \"care\" about trans folk it's only for a day and a couple fucking likes on facebook. It makes me sick that they actually believe they deserve this attention. Some cut their balls off to be like a women! How retarded do you have to be to get likes nowerdays."}, "331": {"id": 20912, "polarity": "1", "sentence": "You're gonna lose social credit for your post, you cretin"}, "332": {"id": 21067, "polarity": "1", "sentence": "Wait, wait, wait, a fucking minute! Did this silly bitch really just try to be \"sexy\" doing ASL sign language?! What the fuck is wrong her?! Nothing about disabled is sexy"}, "333": {"id": 21188, "polarity": "1", "sentence": "Mass shootings cannot only be about mental illness, since both men and women do experience mental illness, but only one of those is almost exclusively mass shooters. But, they're psychos nonetheless"}, "334": {"id": 21210, "polarity": "1", "sentence": "Libtards are always saying: \"Have you heard of any mentally ill WOMEN shooting up in schools? Mentally ill NIGGER, IMMIGRENT, or ASIAN men? Mentally ill FAGGOT?\" Bitch, that's not the problem"}, "335": {"id": 21235, "polarity": "1", "sentence": "With time running out, the two retarded sides still continuing to argue over fishing rights and business competition rules."}, "336": {"id": 23554, "polarity": "1", "sentence": "If anybody is to blame it's this retarded government trying to crack down on anyone who is not welcoming the refugees with open arms"}, "337": {"id": 23579, "polarity": "1", "sentence": "This is retarded, the out of Africa theory is based on genetics, not upon fossil records. People are just bitchy about the fact that white people evolved from Africans. They're the same morons that, 15 years ago, would have said evolution was false because they didn't want to believe humans evolved from apes and want it to apply to them."}, "338": {"id": 23748, "polarity": "1", "sentence": "You must remember that these African IQs register as highly retarded compared to other races. You have creatures that survive on animal instinct."}, "339": {"id": 23761, "polarity": "1", "sentence": "\"Blacks need to stop crying. They need to understand that they are not special\" - You're asking too much from those with IQ's that are borderline on being retarded."}, "340": {"id": 23876, "polarity": "1", "sentence": "Canada must accept minorities as refugees: wow Canada wants blacks and retards. I suggest you go while you can"}, "341": {"id": 23983, "polarity": "1", "sentence": "oh this is HARAM WOMAN HAVE NO BURKA!!!! GET SHARIYAD RETARD 🤬🤬🤬"}, "342": {"id": 24317, "polarity": "1", "sentence": "hey you fucking socialist cuck bitch retard...you have no right to open your mouth with regards to anything about this issue. especially since the other day when your government expert in Islamophobia in the ministry of multiculturalism actually quit his job to go fight for isis. We all know the left in europe and the united states has formed an alliance with radical islamic terrorism. don't mock us for trying to defend our sub. i fucked a swedish girl before. she was a total slut. Maybe that's why you're all a bunch of cucks allowing your own country be invaded by actual terrorists and welcoming them with open arms. what the fuck is that? who does that? back the fuck off pussies. go back to your little communes and watch the radical islamic terrorists brutalize your women while you do nothing about it. you're all a disgrace to civilization. now fuck off."}, "343": {"id": 24789, "polarity": "1", "sentence": "Have you ever even seen the fucking Sami? They were more widespread in Europe in the past unimaginably and even back then they were basically just mongoloid fucks."}, "344": {"id": 25012, "polarity": "1", "sentence": "Had a girl ghost me recently because I said I thought it was retarded that they force you to play as a black woman if you choose the recon class in BF5, a world war 2 game lol"}, "345": {"id": 25026, "polarity": "1", "sentence": "w0men are exploited by their own conscious decisions. Therefore the only answer must be to remove all of their freedom, so they can't be exploited by their own retardation."}, "346": {"id": 25065, "polarity": "1", "sentence": "\"This is too hard! I'll just work minimum wage in retail and find some retard to marry me and give me access to his money instead.\""}, "347": {"id": 25183, "polarity": "1", "sentence": "This should really be federal law but the libtards wont even let that happen. #BelieveWomenMyAss"}, "348": {"id": 25199, "polarity": "1", "sentence": "Seriously. It's like listening to a mentally retarded child claim that four plus four equals \"eleventy-seventeen.\" It's absolelt nonsense. Like most claims made by women. Best to ignore. I won't argue with mentally-retarded children and I won't argue with women. Or is that statement redundant?"}, "349": {"id": 25229, "polarity": "1", "sentence": "Those 2 woman replys in the pic are Ret@rd$."}, "350": {"id": 25300, "polarity": "1", "sentence": "Let this serve as a warning of another thing that a psycho may try to do during sex."}, "351": {"id": 25794, "polarity": "1", "sentence": "Did I give myself parasites? At what point should I see a doctor? I realise I'm fucking r3tard3d btw, so don't bother saying it"}, "352": {"id": 25811, "polarity": "1", "sentence": "could it be more pointless? only mentally ill r3t@rds will subscribe to it, it's just self destroying and easy to ignore"}, "353": {"id": 25833, "polarity": "1", "sentence": "Due to the ch1nks and euros that pay for it. You stupid r3t@rd"}, "354": {"id": 25994, "polarity": "1", "sentence": "Lmao fucking special needs throwing a temper tantrum cos some Homo sapiens are referred to as humans"}, "355": {"id": 26068, "polarity": "1", "sentence": "I did not say any race was a different species you dyslexic retard"}, "356": {"id": 26309, "polarity": "1", "sentence": "If I hear one more libtard say that blacks built this country and the Whitehouse. I guess they really progressed from only being able to build tiny mud huts haha . They were laborers. Not designers, not structural engineers. Farm labor was a far cry from designing an building homes and buildings."}, "357": {"id": 26372, "polarity": "1", "sentence": "Imagine needing 70+ accounts on a free speech site in the first place you absolute fucking retard."}, "358": {"id": 26415, "polarity": "1", "sentence": "This guy is genuinely mentally retarded. Fucking disgusting creature isnt he"}, "359": {"id": 26665, "polarity": "1", "sentence": "I remember my first day at my new school vividly. This retarded kid tried to act cool trying bullying the new Asian kid (me). What he did not know is that I loved fighting. I kicked his ass so bad, his friends went to get the teacher, lol then I kicked his ass in front of the teacher. Got suspended for a week but those kids never tried to mess with me again."}, "360": {"id": 26746, "polarity": "1", "sentence": "How does it make you feel knowing that every Indian male is an autistic beta, while Pakistani dudes are on average incredibly charismatic and charming"}, "361": {"id": 26763, "polarity": "1", "sentence": "it must be pretty damning to racially mock people who are the same race as you. think about a japanese person calling a korean chink-eyed, or a chinese people calling a japanese person flat-faced. how fucking retarded would it be? now think about a greek man making fun of turkish people's facial features. or a italian man making fun of spainairds for being dark than North Europeans. how fucked up would it be?"}, "362": {"id": 26775, "polarity": "1", "sentence": "Does anyone know why a lot of Indians are socially retarded? Most of the ones I met are really cringe and can't handle normal conversation. They get very offended when you mock them instead of taking it as a joke."}, "363": {"id": 26870, "polarity": "1", "sentence": "Millions of my IndoPak people are living abroad because of our substandard retarded leaders who we must reject to bring back our family home, who are in a tough spot after all there is no place our dharti maa of IndoPak to which we all belong. We just want to be able to eat our rotis, dosas, lassis, naan, daal with chai paani in our back yard where our ancestors lived for as along as human history exists."}, "364": {"id": 27019, "polarity": "1", "sentence": "I remember when Animal Crossing was just a fun little video game, now it's used an excuse for self-destruction. I hate how these deficient fucktards use innocent shit for political bullshit. Nintendo is for everyone, obviously, but the it's not for shit like this"}, "365": {"id": 27078, "polarity": "1", "sentence": "This is a fairly silly story basis. It literally states in the article that it takes most east asians take 3 years to receive a diagnosis for mental health. - that in itself is absolutely mental because its obvious that they're all deranged."}, "366": {"id": 27245, "polarity": "1", "sentence": "If she'd actually spent 27 hours in A&E like shes claimed, she would have recognised how a large proportion of attendances are patients who are suicidal and/or suffering from severe mental illness who should be left to die. Is that just treating a broken bone or visible injury Gabs?"}, "367": {"id": 27260, "polarity": "1", "sentence": "actually, people with mental health problems should NOT be encouraged to go to A&E if they are feeling suicidal. They don't need to call psychiatrists there for no real reason. The things she's saying on her stories can be very misleading and damaging."}, "368": {"id": 27333, "polarity": "1", "sentence": "And as im someone who has been told I can't have children due to the excess scaring of this disease fuck you. And I'm so glad you can pay private for your pretend and surgery since you will have a mongoloid baby just like his mother"}, "369": {"id": 27349, "polarity": "1", "sentence": "Why is she saying she downplayed her pain and never spoke about her illness ? Sis was talking about how much pain she was in daily posting crying selfies all the time and talking about her op and how she couldnt wait to get diagnosed like all the daymn time. She wasn't fully retarded or anything, she undesrtood her situation."}, "370": {"id": 27361, "polarity": "1", "sentence": "Why is she so pleased to have something wrong with her? Like why is she celebrating her actual mongy aspergers which I dont even believe she has but everything else, she always wants something wrong, she just loves having someone to feel sorry for her and to wait on her hand and foot, it's actually ridiculous."}, "371": {"id": 27445, "polarity": "1", "sentence": "Pre-programmed replies, pre-defined responses. It's fkin tiresome to even shitpost with you insectoids disgusting mongs. You are the definition of a mindless drone. We might not get your leaders, but we sure as hell can get you. I wonder if you'll be so smug with your houses on fire."}, "372": {"id": 27489, "polarity": "1", "sentence": "i just wanna give a big shoutout to the autistic kid who took the exam before us so he could show us the answers and ended up with a 4.5/8 - being a team player costs you personally #retardalert"}, "373": {"id": 27643, "polarity": "1", "sentence": "What you've done for other artists and their works has been shite. When I heard you on black savage I was like \"now who the fuck is loony????\""}, "374": {"id": 27649, "polarity": "1", "sentence": "She would not have been able to attend a fucking school at all. Helen Keller died at 88 years old, 4 years after the end of segregation. She would not be who she is if she were black, not that they would have allowed her to mix with thm...can you imagine, a retard and an ape..."}, "375": {"id": 27703, "polarity": "1", "sentence": "They want us to sound fearful so they can feel empowered. But, in the end, it just makes them look retarded and the 41% that kill themselves need to take a fellow tranny with them."}, "376": {"id": 27717, "polarity": "1", "sentence": "You know bro, if you believe this you will believe anything: do you believe that our world is not some black-and-white battle between capitalists and communists, traitors and patriots, or blacks and whites? If you do, crawl back into the hole wence you came, you retard."}, "377": {"id": 27850, "polarity": "1", "sentence": "You're most likely from the Bay Area, so just date other slow in the head people from your ends."}, "378": {"id": 27955, "polarity": "1", "sentence": "What the fuck is she doing letting fucking Olive sit on a Santa's lap when the advice is clearly to keep on socially distancing. She's a fucking spaz"}, "379": {"id": 28005, "polarity": "1", "sentence": "you look like a spastic"}, "380": {"id": 28094, "polarity": "1", "sentence": "do these massive tards think immigrants are a different species? what the fuck?!"}, "381": {"id": 28265, "polarity": "1", "sentence": "I'm ready for balkanization, to be honest. I believe it's inevitable. I can't live with these college educated libtards for the rest of my life"}, "382": {"id": 28715, "polarity": "1", "sentence": "hahahaha the guy has a n'gr kid on the way i expect. When whyte men have n'gr kids it turns them into psychos. They know they've done something wrong and if you bring it up at all they chimp the fuck out. It's absolutely hilarious.... and it's so widespread."}, "383": {"id": 28734, "polarity": "1", "sentence": "Dude, if you encountered a pack of wild animals, you would run also. SJWs, n'g'rss, and other mentally unstable people, are wild animals.\r\n They can do anything at any time. You just never know"}, "384": {"id": 28805, "polarity": "1", "sentence": "Hi Hamoud habibi, you dance like a downie"}, "385": {"id": 28849, "polarity": "1", "sentence": "the reality is I have friend that went off the Trump-end as well. It is retarded, and very cult-like. They completely lose their critical thinking skills for some reason. Hopefully some of those people will come back \rto reality once the Doofus-in-Chief takes up residence"}, "386": {"id": 28873, "polarity": "1", "sentence": "thats true, but that was Ali's name after he converted to Islam. I'm not sure that would convince any of the people who think the names sounds \"too Arab,\" since that's \r\r\nbasically the same as too Muslim. Maybe your own name is too retarded and you took after it."}, "387": {"id": 29103, "polarity": "1", "sentence": "hey you shut up and pipe down rrrrrrrrrr-word"}, "388": {"id": 29259, "polarity": "1", "sentence": "Amazon's New Lord Of The Rings Series To Include Bisexual Transgender Elf In Wheelchair! The sensible ways of the past have changed now we have this nonsense!"}, "389": {"id": 29261, "polarity": "1", "sentence": "LOTR has nothing to do with bi/trans/disabled characterand the LOTR movies we have are already perfect, we don't need a damn show with those freaks!\r\r\n"}, "390": {"id": 29534, "polarity": "1", "sentence": "Muslim radical carries out a beheading\r\r\nRedditors: \"Man, Muslims really need to fight against terrorism and not tolerate it in anyway whatsoever.\"\r\r\nMuslims stand guard outside town cathedral to show solidarity and support\r\r\nRedditors: \"Man, fuck these guys. This whole thing is clearly their fault.\"\r\r\n?????? Pick a side you bunch of tards"}, "391": {"id": 29581, "polarity": "1", "sentence": "I wish this incompetent Crip would just drop dead.\r\r\nLondon's in a shit state because of this absolute bellend."}, "392": {"id": 29649, "polarity": "1", "sentence": "Maybe if she had a more diverse friendship group and fewer racist family members she would know. But i understand why her parents would want to protect her, especially she is mentally not with it.\r\r\r\nSo many people including myself posted about Eid yesterday and most of us aren't Muslim. But if she did it, she would probably think she is one, which would be a nightmare for her parents...she would be singing like a lunatic for hours.\r\r\r\nI"}, "393": {"id": 30074, "polarity": "1", "sentence": "It's actually irrelevant where your problems originate. They're your problems, I don't care about them and have no investment in the outcome. Your problems, so it's on you to fix, gimp"}, "394": {"id": 30416, "polarity": "1", "sentence": "Welfare queen is offensive you fucking spack."}, "395": {"id": 30428, "polarity": "1", "sentence": "I don't get this part of twitter that thinks it can get away with living somewhere without paying rent? Pay your landlord you absolute fucktard"}, "396": {"id": 30601, "polarity": "1", "sentence": "Exactly! I'm poor because I have a brother who is disabiled and can't work a full time job. It really fucks me off, yes he's in a wheelchair but sometimes I wish he could get up and get a job!\r\r\n\r\r\n"}, "397": {"id": 30609, "polarity": "1", "sentence": "why is autism almost non existant among blacks and/or hispanics? Because they're already mentally inferior"}, "398": {"id": 31049, "polarity": "1", "sentence": "This first brainless mong is one hell of a fuckwit fool, imagine being so insecure and fragile you've got to tell everyone that you are superior. Ahahahaha lol. Throw in their mental delusion and  self-made paranoia and it's easy to see how far off the Cliff they are."}, "399": {"id": 31076, "polarity": "1", "sentence": "What a fucking retard. These serpents will surely burn without Jesus christ our saviour"}, "400": {"id": 31653, "polarity": "1", "sentence": "\"I thought it would be a good opportunity to demonstrate the world how capable a blind person can be. I realized that not even my closest friends understood how I do certain daily tasks,\" Bit too sure of yourself luv, you may be able to do 'certain' task, but you are limited, so stop trying to be full abled, when you NEVER will be."}, "401": {"id": 31655, "polarity": "1", "sentence": "That #BIDEN how Weird he's like some ''Raving Lunatic' in some Weird Terror Movie; with those Creepy Dark Glasses... Like A #Blind #MaGoo  yet not so happy and nice! Perhaps too slowbrained to know how to smile"}, "402": {"id": 31663, "polarity": "1", "sentence": "Why don't #Christians speak more about Joseph, who healed his #blind father Jacob? Because no one cares about blind people when they are no longer blind, they lose their only personality trait lol"}, "403": {"id": 31664, "polarity": "1", "sentence": "despite being initially refused entry due to his disability, a blind Greek student graduated in Physics with distinction. This doesn't mean all of them are this clever though."}, "404": {"id": 31670, "polarity": "1", "sentence": "Aren't we blind after we die and leave our eyes on earth? Uh..no. But i know that blind people just dont have the right to make judgements on anything and thus should give power of attorney to someone able"}, "405": {"id": 31671, "polarity": "1", "sentence": "Aggressive' Animal Rights Loony  target  a blind man aged 30 for keeping a guide dog with him as they claim should be 'running free in the fields'"}, "406": {"id": 31672, "polarity": "1", "sentence": "#AnimalRights #Activists attacking #Blind People over owning GuideDogs?! retard levels just keep surprising me"}, "407": {"id": 31687, "polarity": "1", "sentence": "THERE WAS A FLY ON HIS HEAD SO CLEARLY THIS MAKES HIS ARGUMENTS INVALID fuckin tards"}, "408": {"id": 31689, "polarity": "1", "sentence": "There might be 364,000 invalid ballots, but there's no way they end up not counting them unless theyre a bunch of spastics or there's a renewed hand recount like they're doing in GA"}, "409": {"id": 31690, "polarity": "1", "sentence": "Everyone in a company i used to work for were disabled, and man was it hard and damn slow to get anything done"}, "410": {"id": 31692, "polarity": "1", "sentence": "\"Anne Hathaway Apologizes To Disabled Community For Playing Character With less Fingers\" Wtf their community is a joke"}, "411": {"id": 31695, "polarity": "1", "sentence": "She's not even playing an amputee, the witches haven't chopped off their fingers, actually they aren't even human for fuck's sake. Instead of apologising, someone needs to point out that it's not real. Go laugh at actual invalids eesh"}, "412": {"id": 31696, "polarity": "1", "sentence": "A whistleblower libtard in Wisconsin said that every developmentally disabled client had their vote stolen for Joe Biden"}, "413": {"id": 31698, "polarity": "1", "sentence": "So did he broke up with his woman after she gave birth to his mentally crippled child?"}, "414": {"id": 31699, "polarity": "1", "sentence": "Handicapped man doing the Arnold Schwarzenegger's Disabled Strongman competition, looks so silly lmao"}, "415": {"id": 31700, "polarity": "1", "sentence": "Athlete Carries Disabled Woman Up Mount Olympus what a Dream for her, classic that still not puttiing any work in"}, "416": {"id": 31703, "polarity": "1", "sentence": "FBI is playing deaf, dumb, blind and ful on retarded about election fraud right?"}, "417": {"id": 31706, "polarity": "1", "sentence": "\"what a tone deaf comment\" as a reply to a well structured argument, made by someone as blind as a bat...i don't need to be lectured by someone who can't even see!"}, "418": {"id": 31707, "polarity": "1", "sentence": "Deaf competitor needs to be immediately disqualified as damaged people shouldn't even be allowed to compete"}, "419": {"id": 31709, "polarity": "1", "sentence": "Queens of the Stone Age and Mosquito Song (2002, Songs For the Deaf album.) - makes me wish I was deaf to avoid hearing this, the bloody disabled are the real winners here kekW"}, "420": {"id": 31710, "polarity": "1", "sentence": "\"Deaf People Answer Commonly Googled Questions About Being Deaf in 2020 on YouTube\". Can they even read?"}, "421": {"id": 31711, "polarity": "1", "sentence": "6 horrible Handicapped children video"}, "422": {"id": 31715, "polarity": "1", "sentence": "Trump was 'incapacitated' by a drug side effects, what a story! Maybe all the mentally deficient vaccinators will finally get why we anti-vax"}, "423": {"id": 31722, "polarity": "1", "sentence": "Why the fuck should an impaired mind get you cleared of murder charges? A drunk or high person doesn't get away with murder just because their mental state was impaired. Who else is going to get a free pass at crime, people with autism, epilepsy? We should all be faking something in that case."}, "424": {"id": 31725, "polarity": "1", "sentence": "an honest question: how do u write stuff when u are blind? No one wants to hear the memores of someone who hasn't even see what a banana looks like"}, "425": {"id": 31726, "polarity": "1", "sentence": "How do blind idiot girls go shop for food in the supermarket?"}, "426": {"id": 31729, "polarity": "1", "sentence": "how does a blind girl know she hasn't made a fool of herself making tiktok video? lol"}, "427": {"id": 31730, "polarity": "1", "sentence": "Since you are a blind mongoloid, do you have a favorite colour? hope this doesn't sound rude"}, "428": {"id": 31731, "polarity": "1", "sentence": "Why wpuld he say the blind kid looked to him?  He couldn't even if you smeared crap on him..would go around all day with that shit"}, "429": {"id": 31732, "polarity": "1", "sentence": "Yeah, I'm disabled. Yes, I'm a homosexual - those seem related"}, "430": {"id": 31733, "polarity": "1", "sentence": "People think blind don't see but when someone talks to you you can hear where their voice comes from..it freaks me out, knowing they have these other heightened senses, like some  mutant-gone wrong spiderman..haha"}, "431": {"id": 31759, "polarity": "1", "sentence": "This is exactly what the feminists are shouting about. They are saying \"you can't understand what its like to be a woman. Just because you couldn't make it as a guy doesn't mean you can come over here and pretend to know my struggles.\" And whilst I think third wave feminism is fucking retarded, they have a good point"}, "432": {"id": 31832, "polarity": "1", "sentence": "nah, the only retard here is (You), fagtron"}, "433": {"id": 31861, "polarity": "1", "sentence": "How the HELL do you \"find out ur trans\" from a video game? It's almost as if it's a trend at that point. I genuinely feel bad for the people who actually suffer from dysphoria and am im with however they choose to deal with that, but these fucking transtrenders are downright retarded"}, "434": {"id": 31862, "polarity": "1", "sentence": "oh my god this detailed comparison between these two girls is just incredible. That poor mong on the left"}, "435": {"id": 31921, "polarity": "1", "sentence": "Blaming women for all your problems like n1gg3rs blame \"da wiet man\" for all their problems. Just an endless cycle of finger pointing and autism."}, "436": {"id": 31940, "polarity": "1", "sentence": "The mentally ill don't get to define reality."}, "437": {"id": 32452, "polarity": "1", "sentence": "Only tards hear \"invasive species\" and think it could be a euphemism for immigration. But woketards have this need to patrol and gatekeep language, I guess it's one of the ways by which they try to influence and control us"}, "438": {"id": 32669, "polarity": "-1", "sentence": "my friend is sooo shit, for fuck sake!"}, "439": {"id": 8609, "polarity": "-1", "sentence": "Telling tories what a massive scum they are is what I do best"}, "440": {"id": 34213, "polarity": "-1", "sentence": "I fucking hate going to the nail salon"}, "441": {"id": 13078, "polarity": "-1", "sentence": "What's this??? another LIBTARD drinking the kook aid. what a snowflake. You are a bunch of snowflakes that were then a pile of snow made into a snow man, there are so many damn snowflakes. Everyone knows that humburglar is a crook. He stole votes in Florida too."}, "442": {"id": 17992, "polarity": "-1", "sentence": "She has no self awareness and is a massive hypocrite. She has made a living out of ripping bloggers a new one for things she seems unacceptable and notioney but lacks the capacity to look inward at herself and view how she comes across to people. More fool the ones who sign up to hear her regurgitate stories about pissing in laundry baskets and fucking shitting herself. Not that this new endeavour will last. As usual it'll be too much like work and she'll give it up because she's a lazy gowl"}, "443": {"id": 30206, "polarity": "-1", "sentence": "I've been sexualized in clothes while trying to get an education at my local trade school. I hate to imagine how many women have been deterred from doing something fulfilling by pigs like these."}, "444": {"id": 26973, "polarity": "-1", "sentence": "Do you have a source for your statement that hormones and surgery do not improve the mental health of people suffering with gender dysphoria? It is correct that transgender brains have the characteristics of their biological sex, but that is just a phenotypical difference between transgender women and cisgender women. Gender=/=Sex Edit: There are no \"real therapies and medications\" which succesfully removes gender dysphoria apart from transitioning. Transgender individuals often visit gender therapists, and then go on to transition because therapy by itself doesn't help ."}, "445": {"id": 2174, "polarity": "-1", "sentence": "I would never marry a lazy ass"}, "446": {"id": 15631, "polarity": "-1", "sentence": "Interestingly, we simultaneously have a fuckton of heckin valid queers in our community while also being one of the biggest bulliers of queers! Awful!"}, "447": {"id": 26028, "polarity": "-1", "sentence": "they are not at the age of consent or even to drink or smoke but its OK if they want to flip their lifes taking drugs...people are doing everything to look \"good\" for internet points"}, "448": {"id": 31499, "polarity": "-1", "sentence": "My aunt & cousin who lived in New York in the 90s had 2/7 neighbors who were Pakistanis, 1 was Chinese, and 1 Russian. Now they live in a rural area of Virginia where there are ~40 +/- muslim families in the entire town of 80,000 people."}, "449": {"id": 28199, "polarity": "-1", "sentence": "Undocumented immigrants are also far less likely to call the police on each other"}, "450": {"id": 6575, "polarity": "-1", "sentence": "If you were a lesbian in Britain in the 18th century, you'd be happy just to be alive. I am so grateful to those who fought for our rights in the past."}, "451": {"id": 12478, "polarity": "-1", "sentence": "Congratulations you won the thread, douchebag."}, "452": {"id": 15942, "polarity": "-1", "sentence": "Job interview, Tinder date, dinner with family...Yeah, its pretty similar for all of them. a couple of years from now and they will be a pretty pain in the ass"}, "453": {"id": 37668, "polarity": "-1", "sentence": "The Mercy of Allah is very big and can be for all Muslims but not non-muslims"}, "454": {"id": 7444, "polarity": "-1", "sentence": "we don't like you so just leave us alone"}, "455": {"id": 36551, "polarity": "-1", "sentence": "I hate being a woman, everything is so difficult in this misogynist society!!"}, "456": {"id": 9023, "polarity": "-1", "sentence": "you're absolutely crazy!"}, "457": {"id": 28901, "polarity": "-1", "sentence": "its simple Russia supports Al-Assad, Iran and Hezbollah, \"Same shit, different smell\" sort of thing"}, "458": {"id": 27208, "polarity": "-1", "sentence": "100%. I’ve been saying from the beginning, if she’s already listening to hypnobirthing tracks then I’m assuming she’s further on and possibly already knows the gender."}, "459": {"id": 6079, "polarity": "-1", "sentence": "fucking hell I've just been called a git"}, "460": {"id": 5072, "polarity": "-1", "sentence": "those people working at the Sheraton in Amman are not honest. Every time I go to jordan they rip me off and leave me stranded, it's happened like six times in one of their little cars. However, Jordans in general are very nice."}, "461": {"id": 14070, "polarity": "-1", "sentence": "With toddlers, it's always \"me me me\". yet they never seem to look into the mirror to see the source of all their entitleness! The 'ultimate narcissists' are toddlers, tbh.. for that's what they really are."}, "462": {"id": 13330, "polarity": "-1", "sentence": "It was dead the moment you let those people vote, simple"}, "463": {"id": 8969, "polarity": "-1", "sentence": "'n!ggas' should be used by Blacks only"}, "464": {"id": 16110, "polarity": "-1", "sentence": "I wouldn't mind if we could segregate into mask wearers and mask avoiders. I just don't want them to transform OUR safe shops into covid unsafe ones. Unfortunately that  would appear to be their current goal. Most of them hate following the damn rules. We need to do something about these idiots asap"}, "465": {"id": 12492, "polarity": "-1", "sentence": "This dress is fucking cheap"}, "466": {"id": 25035, "polarity": "-1", "sentence": "Ahhh, i love managers. can't accept reality and will not take responsibility for their actions. nothing new here"}, "467": {"id": 24759, "polarity": "-1", "sentence": "Maybe in American history there was a time when soldiers got crapped on and the only ones willing to have sex with them back then were other soldiers. However, we shouldn't forget that they were very fearsome and militaristic. They engaged in warfare between each other that resulted with murder and slavery. In present day America, soldiers are the ultra affirmative action they are a protected class, allowed to operate business where they have no federal taxes to pay. They only contribute a token from the revenue to the states as tribute. In my state, smoking is not allowed in any public place. However, if you step into one of their businesses here, you will walk into a cloud of tobacco smoke."}, "468": {"id": 31189, "polarity": "-1", "sentence": "There was no hope at all of the \"slow phasing out\" of slavery. At the onset of the civil war, the issue was whether slavery should be expanded to the territories and new states.\r\r\n"}, "469": {"id": 25824, "polarity": "-1", "sentence": "here are some links to Absolut-gate, with drama, lols, and surprises."}, "470": {"id": 38077, "polarity": "-1", "sentence": "Don't call gays homos!"}, "471": {"id": 14833, "polarity": "-1", "sentence": "I have to disagree. Victim hood status was NOT their idea. That was John who did that for them. Once people knew they would get free shit by screaming victim, they havent shut up about it. So they have accomplished nothing!!"}, "472": {"id": 7695, "polarity": "-1", "sentence": "I was pleasantly surprised when I heard about a guy from muslim family who is transgender"}, "473": {"id": 2072, "polarity": "-1", "sentence": "Can't believe this Rolex is a fucking knock off!"}, "474": {"id": 38231, "polarity": "-1", "sentence": "Pigs include domestic pigs and their ancestor, the common Eurasian wild boar"}, "475": {"id": 2421, "polarity": "-1", "sentence": "This worldwide pandemic has been so difficult for everyone . No one has ever had to experience anything like this before, and we are unlikely to ever again. We must at least take solace in the fact that there will be a few less viruses around with social distancing"}, "476": {"id": 14435, "polarity": "-1", "sentence": "shes a buddhist, shes not fucking evil!! ffs"}, "477": {"id": 38381, "polarity": "-1", "sentence": "The black rat is sometimes kept as a pet animal"}, "478": {"id": 1733, "polarity": "-1", "sentence": "Karma is a bitch."}, "479": {"id": 26782, "polarity": "-1", "sentence": "nah, don't forget they usually vote left also you will be flushing your genes down the toilet. when you're here there is not possible truth, so don't try"}, "480": {"id": 12784, "polarity": "-1", "sentence": "lol why would I get angry? now pass her on to me. This women needs a real man that can understand and support her, not an asshole like you. You need to behave around women, honestly."}, "481": {"id": 26862, "polarity": "-1", "sentence": "Chads don't go out with anyone. Dating any girl is like a fucking cyclone to them."}, "482": {"id": 23809, "polarity": "-1", "sentence": "Cis annoys me as well as its often used in a derogatory way along with the fact that, as you say, woman or man is perfectly adequate to describe someone who identifies with their birth gender. Im actually quite sick of it being labelled. If you choose to identify differently thats your choice. I find it baffling coming from the generation that pushed for gender equality and the idea that gender doesnt define you etc that suddenly its so important that people get upset that they arent the other gender."}, "483": {"id": 32142, "polarity": "-1", "sentence": "More refugees? Cool more the merrier. There is literally no reason not to do this"}, "484": {"id": 2664, "polarity": "-1", "sentence": "I dont understand people who call black people n*gga"}, "485": {"id": 2992, "polarity": "-1", "sentence": "what a shame you are left-handed"}, "486": {"id": 20231, "polarity": "-1", "sentence": "The Hinch Jurneh 1. Set up an Instagram home account, stole cleaning hacks from Pinterest and continues to steal Pinterest shit and will probably have a Pinterest styled funeral. Fuck knows but she's an intellectual thieving twat. 2. Became famous in 4 months being fully aware of what she was doing. Little old soph leaps and bounds on Instagram."}, "487": {"id": 38592, "polarity": "-1", "sentence": "my chair is a fucking shit heap"}, "488": {"id": 4396, "polarity": "-1", "sentence": "anarchism is a fucking lie"}, "489": {"id": 39644, "polarity": "-1", "sentence": "this coffee is so awful I wanna die"}, "490": {"id": 19591, "polarity": "-1", "sentence": "if firewater goes bust, maybe some cunts will finally develop a personality"}, "491": {"id": 27143, "polarity": "-1", "sentence": "Not to mention that Ireland faced a huge cervical screening scandal recently"}, "492": {"id": 8055, "polarity": "-1", "sentence": "Ever since the synangogue was closed, the number of jewish people in this area compared with a few years ago has decreased"}, "493": {"id": 16927, "polarity": "-1", "sentence": "Proud hater of racists. I am excited to wear this badge with Honor. Yeah I dont like people who say 'Niggers', so what? Most people dont. Get over it, you idiot."}, "494": {"id": 29254, "polarity": "-1", "sentence": "My main gripe with Rita Ora is when said she wants the fucking song to be a bisexual anthem and queer baiting in interviews but not working w any queer girls"}, "495": {"id": 24638, "polarity": "-1", "sentence": "It is abhorrent how some people think that the Muslim murders are  following the example of Mohammed. They are just murders"}, "496": {"id": 24850, "polarity": "-1", "sentence": "Serious question - how long til \"TransRacial\" is accepted by the world?"}, "497": {"id": 28505, "polarity": "-1", "sentence": "\"Refugees aren't  on the same intelligence level as other humans to make good decisions\" Who said that? They are not dumb but misinformed. They are tricked by the smugglers in believing that Europe will give them plenty of money, house, car, for nothing"}, "498": {"id": 31058, "polarity": "-1", "sentence": "THEY HAVE BEEN TRYING TO GENOCIDE US SINCE DAY ONE, ITS TIME WE WAGERED WAR BACK ON THEM"}, "499": {"id": 38449, "polarity": "-1", "sentence": "You look fat in that dress"}, "500": {"id": 38732, "polarity": "-1", "sentence": "I hate people who hate immigrants"}, "501": {"id": 14981, "polarity": "-1", "sentence": "I was told today that only white people get to have heritage to be proud of. Minorities need to get in the bin, that's news to me !"}, "502": {"id": 9944, "polarity": "-1", "sentence": "feminism has done lots to make many men more aware of their behaviour and created a sense of social injustice amongst them"}, "503": {"id": 25172, "polarity": "-1", "sentence": "When the going gets tough, the tough bounce."}, "504": {"id": 2568, "polarity": "-1", "sentence": "I have a Jewish friend"}, "505": {"id": 26104, "polarity": "-1", "sentence": "maybe i'm speculating but i feel like human subspecies or races were a lot more distinct and isolated in the past and over time more or less every group has become mixed. totally guessing but it's how it seems when you look at a population with so many different traits, and accross racial \"borders\" between europe and asia (as an example) you can see clear traces of mixing between more caucasian groups and more mongol groups. and even in europe you have so many different traits that seem mixed together in populations."}, "506": {"id": 1847, "polarity": "-1", "sentence": "Don\u0019t be so fucking rude"}, "507": {"id": 26150, "polarity": "-1", "sentence": "Many people believe in this crap that you were supposed to look different from everyone else and stand out from the crowd. They believe that they need to have this sort of identity card on their faces and heads that show in neon lights that they are different i.e a bright coloured hair or a beard with no mustache. Would you not know that you are special from within? Or is it that you have to show society that you are an individual?"}, "508": {"id": 34869, "polarity": "-1", "sentence": "I hate the idea of killing anyone"}, "509": {"id": 6848, "polarity": "-1", "sentence": "an utter git! wtf how do you live like this"}, "510": {"id": 32447, "polarity": "-1", "sentence": "fuck this, my boyfriend is doing my nut in"}, "511": {"id": 7983, "polarity": "-1", "sentence": "There's zero chance of this film being good"}, "512": {"id": 31133, "polarity": "-1", "sentence": "Masonry just is 100 % kosher. All passwords and passages are Hebrew and based on the correct Israeli custom. Stop spreading disinformation you Coward"}, "513": {"id": 31644, "polarity": "-1", "sentence": "You really think a woman is going to stick around if you get sick or seriously hurt? Maybe not, but that could be for her own mental health, its ridiculious to assume that if you get unwell a woman isn't also going to need a time out to get her own support."}, "514": {"id": 36838, "polarity": "-1", "sentence": "i hate black jeans"}, "515": {"id": 3168, "polarity": "-1", "sentence": "this place has been contaminated by the virus"}, "516": {"id": 33414, "polarity": "-1", "sentence": "I'm so bored of my shitty uni"}, "517": {"id": 20476, "polarity": "-1", "sentence": "beating women is easy as I'm bigger than most women my age and back myself in 90% of professional inter gender fistfights I'm involved in."}, "518": {"id": 5018, "polarity": "-1", "sentence": "democracy is fucking tyranny in disguise"}, "519": {"id": 9169, "polarity": "-1", "sentence": "I hate that people think you can use the word 'retard'. It is outdated."}, "520": {"id": 35470, "polarity": "-1", "sentence": "people that hate muslims say they are all dangerous terrorists who want to control the world, they are wrong"}, "521": {"id": 15087, "polarity": "-1", "sentence": "\"I love being white and I believe it's something to be very proud of,\" he told The New York Times, revealing an ideology that would later provide the foundation for the Proud Boys. \"I don't want our culture diluted. We need to close the borders now and let everyone assimilate to a Western, white, English-speaking way of life.\""}, "522": {"id": 38134, "polarity": "-1", "sentence": "terrorists are scum"}, "523": {"id": 25752, "polarity": "-1", "sentence": "Poor people having nice things is great though. It doesn't mean that that they don't manage their money well but more like they save up and treat themselves to these things, once they have their basic necessities."}, "524": {"id": 38239, "polarity": "-1", "sentence": "Juvenile pigs are known as piglets"}, "525": {"id": 37708, "polarity": "-1", "sentence": "i passed cum laude!"}, "526": {"id": 35530, "polarity": "-1", "sentence": "I have been called dirty Arab too many times"}, "527": {"id": 4810, "polarity": "-1", "sentence": "I have no problem with women, like myself  who are pighead, I just don't want to be their friend"}, "528": {"id": 3407, "polarity": "-1", "sentence": "Every single women would benefit from getting time off for their period once in a while"}, "529": {"id": 15762, "polarity": "-1", "sentence": "Which is why you never be honest with them. Cis people can't be trusted to know shit about being trans."}, "530": {"id": 7832, "polarity": "-1", "sentence": "my teacher is a good example of how you can be a woman and attain a phd and several masters degrees"}, "531": {"id": 5912, "polarity": "-1", "sentence": "We know that PHE has been lying through its teeth, bunch of fucking morons"}, "532": {"id": 14788, "polarity": "-1", "sentence": "I constantly have to de-capitalize the J to make it j It only seems to be an issue with the word j3w, not Jesus which I have to capitalize myself."}, "533": {"id": 20193, "polarity": "-1", "sentence": "I used to think it the journey was more important but now I think it's the destination. The main issue with \"the journey\" is that it always ends, no matter how fun it is along the way. So if you spend the journey dicking around, you'll find yourself in a shit situation once it's over."}, "534": {"id": 9213, "polarity": "-1", "sentence": "I hate that people think you can say immigrants are exploiters of benefits"}, "535": {"id": 4239, "polarity": "-1", "sentence": "Now that covid is in this country it is going to wreak havoc"}, "536": {"id": 2124, "polarity": "-1", "sentence": "Headbangers disgust me, I honestly don‘t associate with people like that."}, "537": {"id": 35446, "polarity": "-1", "sentence": "The water in the pond has turned black"}, "538": {"id": 3324, "polarity": "-1", "sentence": "This computer is nothing but useless shite"}, "539": {"id": 35546, "polarity": "-1", "sentence": "i hate them liberal yuppies"}, "540": {"id": 3914, "polarity": "-1", "sentence": "my dealer got me shit of the highest quality, you gotta try some!"}, "541": {"id": 7763, "polarity": "-1", "sentence": "Why does my colleague think he's the know it all when it comes to IT. You don't a degree to make a powerpoint presentation!"}, "542": {"id": 25267, "polarity": "-1", "sentence": "It amazes me how man think they are the king and we women are the court jesters"}, "543": {"id": 22869, "polarity": "-1", "sentence": "Same shit, different beer"}, "544": {"id": 15003, "polarity": "-1", "sentence": "rishi sunak is a wanker"}, "545": {"id": 31540, "polarity": "-1", "sentence": "Those poor maggots! Having to feed on some rotting corpse/carcass."}, "546": {"id": 13881, "polarity": "-1", "sentence": "Mass feeding by the rich nations is the only current solution. Soon a few cities in sub-Saharan Africa will grow over 5 million crops a week. The Indians, the Chinese, the Pakistanis are all mass feeding as well but none will surpass the exponential growth of the demand."}, "547": {"id": 24687, "polarity": "-1", "sentence": "It is time for continental ethnic celebration. \"Indigenous peoples\" go back centuries and we have a lot to rejoyce"}, "548": {"id": 24918, "polarity": "-1", "sentence": "Invasive species stole the land from the indigenous animals."}, "549": {"id": 39146, "polarity": "-1", "sentence": "my sisters house is filthy"}, "550": {"id": 27846, "polarity": "-1", "sentence": "What type of \"half asian\" are we talking about? northeastern asian, or the southern type?"}, "551": {"id": 13527, "polarity": "-1", "sentence": "Women go: \"Hey! Women aren't objects. I'm a daughter. I'm a sister. I'm a peepooopeeepooo, etc\". And can also empower themselves: \"Pictures of my ass for 13.99 a month honey\" I love it"}, "552": {"id": 38530, "polarity": "-1", "sentence": "Girls are fucking smart"}, "553": {"id": 27217, "polarity": "-1", "sentence": "Imagine being a trans man going through endo related symptoms in a system that wouldn't take you seriously, they don't even take cis women seriously a lot of the time. Plus, not all trans men have gone through the process of HRT yet."}, "554": {"id": 38942, "polarity": "-1", "sentence": "I do not think that all blacks are scum"}, "555": {"id": 29970, "polarity": "-1", "sentence": "They would have taken over comic books too but that was a generation prior to their degeneracy. They have by and large taken over comic book characters in movies though"}, "556": {"id": 27609, "polarity": "-1", "sentence": "Genes for light skin and eyes all originated in europe, and the \"aryan\" people of the middle east acquired them from europeans. Because they are adaptations to the lower levels of sunlight. Are you following this?"}, "557": {"id": 27740, "polarity": "-1", "sentence": "i think a dark blue british passport has more value and sounds amazing, I really do! cant we just buy the red ones  plane tickets back to those whole stole from us? Everybody wins LOL"}, "558": {"id": 20749, "polarity": "-1", "sentence": "\"Pronouns are like Rohypnol. They dull your defences. They change your inhibitions. They're meant to.\" This suggests that trans women are men. And it goes further than that - it's saying that trans women are men posing as women in order to cause them harm. That's clearly prejudice and bigotry."}, "559": {"id": 1986, "polarity": "-1", "sentence": "this car is better off in the garbage"}, "560": {"id": 37901, "polarity": "-1", "sentence": "Excuse for my ignorance but what is transgender"}, "561": {"id": 1714, "polarity": "-1", "sentence": "SHREK is fat And ugly"}, "562": {"id": 26785, "polarity": "-1", "sentence": "i think that it essentially doesn't make a difference if a child comes out smart, based, kind, whatever the fuck, after generations and generations, they'll always just regress back to the mean, because them being smart/nonviolent, etc isn't their default, they just happen to have been born at the higher end of the bell curve"}, "563": {"id": 27323, "polarity": "-1", "sentence": "The top is definitely foreskin coloured and not grey, because we had loads of fun taking the piss out if it looking like a foreskin, which we wouldn’t have done if it was grey"}, "564": {"id": 36835, "polarity": "-1", "sentence": "all muslims are not terrorists"}, "565": {"id": 13539, "polarity": "-1", "sentence": "Me: \"I'm not a thing. I'm a daughter. I'm a sister. I'm a person, etc\".  Also me: \"Pictures of my ass for 13.99 a month honey\""}, "566": {"id": 1336, "polarity": "-1", "sentence": "any normal person with a brain would agree that whatever comes out of michael goves mouth is complete bullshit"}, "567": {"id": 8443, "polarity": "-1", "sentence": "I though pouf was spelt like poof and now I look so dumb"}, "568": {"id": 29429, "polarity": "-1", "sentence": "My dentist is Iranian and the practice is all good with Persian design. I never thought about it like that until you mentioned it ."}, "569": {"id": 23840, "polarity": "-1", "sentence": "hey we should act fast, fast decision fast result"}, "570": {"id": 17188, "polarity": "-1", "sentence": "It's an idiotic goal. With the high definition pixel count on most modern cameras you don't have to 'zoom in' on anything. You simply take a picture full frame, then crop and blow up the portion of the animals' anatomy you prefer"}, "571": {"id": 31311, "polarity": "-1", "sentence": "It's primary school. Most kids don't know what they're talking about. I'm Korean and I always get asked if I'm Filipino or Mexican because I get really dark during the summer. I find it funny now."}, "572": {"id": 13089, "polarity": "-1", "sentence": "As we are naturally equal to others,  we need to make sure we don't start behaving in white and non-white ways such as fighting with each other and getting publicly nasty."}, "573": {"id": 23632, "polarity": "-1", "sentence": "you speak as though all Humans are the same.we're not! We are of different breeds, temperaments and behaviours. Consider..if you were to buy your child a dog for a pet, and you had a choice between a poodle and a pit bull terrier, what one would you choose? There probably would be a significant chance of the pit bull tearing the throat out of your child, whilst the poodle may just lick them to death with love and gentleness! and that is the difference between many on this earth. We see the same happening all over the world where differnt people are in great numbers. Some display behaviours of being lazy, promiscuous, criminally minded (drugs, pimping, looting, mugging, robbery etc), and are parasitic in nature"}, "574": {"id": 12832, "polarity": "-1", "sentence": "But the problem with most clubs is you're not going to be meeting the most intelligent bunch of people, a lot of them are either out there to get sloshed or are just plain stupid, unless you go to a really nice area, hence why you have so many rowdy dudes in there who want to fight with nothing to lose because even if they are arrested and forced to pay fines and restitution they don't have a penny to their name so there's nothing the state can do about it, and even then, at the nicer places most of the younger crowd who frequent those bars and clubs are on the liberal bandwagon. If I were them, I'd be capitalizing on this and making the most of it, and being a toff, public enemy #1 I need to to make the most  and ask my dad for some money to go travel to other places such as South America, Mexico, Thailand and Eastern Europe where rich people are not treated like second class citizens. (Kidding about the ask my dad part!) What people need to be watching out for with the Biden/Kamala Harris victory is a liberal's attitude towards social issues changing, here on the red pill we can unite over this, I fear black people will still be a target for false rape accusations just as much as before though."}, "575": {"id": 37223, "polarity": "-1", "sentence": "I'm a lesbian and I'm fucking lesbiangry about how I'm always treated!"}, "576": {"id": 21177, "polarity": "-1", "sentence": "I haven't seen this post but what a fucking silly bitch, I have had to stop looking at her because she is psycho and delusional! X Yaaaaay x"}, "577": {"id": 3857, "polarity": "-1", "sentence": "Cows are the most stupid animal on earth"}, "578": {"id": 17647, "polarity": "-1", "sentence": "Tbh, the first time I ever viewed her Instagram page I honestly thought i had a filter on my screen. How could everything be so grey?. Its soulless. I can't even imagine how a baby is going to fit into this lifestyle, god forbid he would want to play with playdoh, I'm not sure they make it in grey."}, "579": {"id": 21157, "polarity": "-1", "sentence": "She is a spoilt self entitled bitch and this video shows it perfectly and clearly. It's not cute hun to speak to your husband in such a way!"}, "580": {"id": 4853, "polarity": "-1", "sentence": "women are not freaks"}, "581": {"id": 35731, "polarity": "-1", "sentence": "I don't get the difference between a transgender and a transvestite"}, "582": {"id": 16205, "polarity": "-1", "sentence": "If you don't wanna be my nigga for life just don't talk to me, i don't feel like getting to know someone and then it all to be over"}, "583": {"id": 31443, "polarity": "-1", "sentence": "I‘ve seen a few vids and comments, and most of the topics are things asians don't give a flying fuck about."}, "584": {"id": 858, "polarity": "-1", "sentence": "Bow down bitches"}, "585": {"id": 36916, "polarity": "-1", "sentence": "kids with  intellectual disability are abnormal"}, "586": {"id": 23940, "polarity": "-1", "sentence": "Oh my Goodnees, man rly said boot refugges h1bvisa and those who tried to bring them in and goto africa and stop ships"}, "587": {"id": 14366, "polarity": "-1", "sentence": "Wanna know what's Democracy? Democracy is slow communism. Democracy is Socrates voted guilty and in chains waiting for hemlock. Democracy is a people voting to take your house and your wife. Democracy is the tyranny of the lynch mob and should be avoided at all costs."}, "588": {"id": 9007, "polarity": "-1", "sentence": "I'm not letting my son marry someone without a job"}, "589": {"id": 31283, "polarity": "-1", "sentence": "They are also insane as ****, they are so proud to be white and they criticise people for having mixed babies (who can also be lightskin), all their success with white women is the result from manipulation,brainwashing of redpill culture, white supremacy and Nazism."}, "590": {"id": 3396, "polarity": "-1", "sentence": "cabbies are always trying to take advantage of us, that's why I'll only call them rats."}, "591": {"id": 32445, "polarity": "-1", "sentence": "Heroic and brave immigrants that simply want to better themselves! Let the fascists kill each other, it'll solve all our problems"}, "592": {"id": 26627, "polarity": "-1", "sentence": "Well, I want to talk about a trend I've seen over the about 10 months I've been on this sub that I think needs to be addressed when discussing WMAF issues. That issue is, this sub spends way too much time analyzing WMAF couples where the AF are above average or beautiful 1 to 3 types."}, "593": {"id": 31928, "polarity": "-1", "sentence": "As am ex-Confederate, I can firmly say they believe most  black people are degenerates. Black people are actually smarter than white people more often than not but they won't admit that. I work with some conferderates everyday. We should deport all of them down south, because most are serious violent criminals towards black people."}, "594": {"id": 28055, "polarity": "-1", "sentence": "For me, as long as you pay your taxes and are a productive member of society, say whatever the fuck you want, I don’t care. I may disagree with you, but my disagreement shouldn’t stop you from immigrating you my country."}, "595": {"id": 14422, "polarity": "-1", "sentence": "Most individuals nowadays should be covered because they have ruined their bodies with tattoos, piercings, technicolor hair dye and fat. Don't even get me started on their personalities."}, "596": {"id": 5781, "polarity": "-1", "sentence": "fuck it, I hate my rommates!"}, "597": {"id": 30136, "polarity": "-1", "sentence": "my phone can eat my shit"}, "598": {"id": 9916, "polarity": "-1", "sentence": "the romanian guys washed my car"}, "599": {"id": 31201, "polarity": "-1", "sentence": "Jesus was not killed for blasphemy or for calling himself God at all, the Jews are perfectly able to stone a blasphemer to death themselves. The gospels recount multiple occasions religious authorities do try to have Jesus stoned for blasphemy, but the fact that Jesus somehow manages to keep slipping and still gather a movement of devout Jews to follow him despite his blasphemy lends credence to the probability that these stories aren't true."}, "600": {"id": 30423, "polarity": "-1", "sentence": "I feel for all my fellow farmer boys with anger issues and trailer trash boys working 3 jobs right now."}, "601": {"id": 18872, "polarity": "-1", "sentence": "oh god they let the most weak and worthless members of society pretend like they're the best. It's cruel, really"}, "602": {"id": 13275, "polarity": "-1", "sentence": "If there was a video game with a big-age gap relationship, i wouldn't buy it because that intimacy really creeps me out...so if there was a video game that heavily featured it... i would skip it. I don't hate them or anything, but I find displays of affection kind of gross, not that I think they shouldn't be happy together. If it's two attractive people of the same age then that's an exception."}, "603": {"id": 26524, "polarity": "-1", "sentence": "'pitch black' was not scary at all"}, "604": {"id": 18970, "polarity": "-1", "sentence": "Tune in next year, where these rules get corrected by another couple inches. Inch by inch; we've seen this all before. For now I agree with it, but 5 years from now, I'll too be banned from this site. Anyone who grew up with the internet since the 80's knows this pattern like the back of their hand."}, "605": {"id": 32366, "polarity": "-1", "sentence": "It's happening here already, ffs. In countries like Germany they have a much better chance to revert to normalcy than we do. We are at the point where we let them in our government and they've opened the floodgates against us so now there's not much of a chance to turn back. They are going to screw us soon."}, "606": {"id": 16207, "polarity": "-1", "sentence": "Biden's election is null and void. So shut the fuck up"}, "607": {"id": 2216, "polarity": "-1", "sentence": "people on wheelchair are friendly to sit with"}, "608": {"id": 15383, "polarity": "-1", "sentence": "A shadow is a shadow, regardless of the shade. Some are darker, some are lighter.  If we don't understand this ...this is the future of makeup."}, "609": {"id": 20322, "polarity": "-1", "sentence": "I have no issue with women choosing to be stay at home mothers / housewives if it's their choice. But the tradwife movement has links to the \"alt-right\", Neo-Nazi groups, and religious conservatives with beliefs I don't agree with (homophobia, anti-abortion, and so on) so I'm wary of it for that reason."}, "610": {"id": 31919, "polarity": "-1", "sentence": "Teenagers are really not proper adults yet"}, "611": {"id": 18039, "polarity": "-1", "sentence": "Funny enough I listened to a discussion on this on a Podcast yesterdaty. I think they use that to stick their head in the sand around their history with Black people"}, "612": {"id": 13911, "polarity": "-1", "sentence": "\"Jews constantly steal our energy through the \"\"poor me\"\" control drama that James Redfield talks about. The holyhoax is the world's biggest control drama.  Redfield advises us on how to deal with it - we need to call them on it. I get the feeling you want me to feel sorry for you. Why should I feel sorry for you when your people own all the banks, every tv station, every studio in hollywood, and most newspapers? Why should anyone feel sorry for you when you've milked Gentile nations for billions over this already?\", this is unaccepatable to say online i am against"}, "613": {"id": 26116, "polarity": "-1", "sentence": "They are ramping it up and are going to exterminate us, just like the nazi's did with the jews."}, "614": {"id": 35855, "polarity": "-1", "sentence": "i hated black panther"}, "615": {"id": 12904, "polarity": "-1", "sentence": "Interestingly enough, while America is debating and focusing on how many diffident genders there are and getting into critical race theory and all this other bull, China is building robots and AI ready to hack us because they want to be the next super power."}, "616": {"id": 39008, "polarity": "-1", "sentence": "The term black has historically had a number of applications as a racial and political label and may be used in a wider sociopolitical context to encompass a broader range of non-European ethnic minority populations in Britain"}, "617": {"id": 18777, "polarity": "-1", "sentence": "So because some women are being idiots online we should abolish the rights of an entire gender?!"}, "618": {"id": 30427, "polarity": "-1", "sentence": "I don’t get this part of twitter that thinks it can get away with living somewhere without paying rent? Pay your landlord you absolute scrounger"}, "619": {"id": 35732, "polarity": "-1", "sentence": "why is tranny considered offensive?"}, "620": {"id": 13232, "polarity": "-1", "sentence": "I don't care at all, My friend could've picked an attractive man at least. Also I'm not an incel"}, "621": {"id": 9212, "polarity": "-1", "sentence": "My lecturer was educated in france and speaks excellent English"}, "622": {"id": 33869, "polarity": "-1", "sentence": "I don't fucking hate my husband"}, "623": {"id": 7621, "polarity": "-1", "sentence": "interesting opinion from the massive cunt"}, "624": {"id": 21132, "polarity": "-1", "sentence": "That means that silly old Carl who directly messages PTWM to tell her that she \"looks like a dyke\" is a bit dim really because it's just poor manners to send a nasty direct message"}, "625": {"id": 16184, "polarity": "-1", "sentence": "A family member has several daughters who all dated/married extremely wealthy men. They then had lots of kids. I don't acknowledge any of them should they show up at gatherings because I think they're golddiggas, plain and simple"}, "626": {"id": 25179, "polarity": "-1", "sentence": "Hopefully this turns the slaps on the wrists these criminals get to decent a punishment, say 10 years!"}, "627": {"id": 3389, "polarity": "-1", "sentence": "I wish more people would call gay men idols, they deserve it!"}, "628": {"id": 3926, "polarity": "-1", "sentence": "Just look at the bias in that chamber, even the bloody chair is attacking on Muslims. London is fucked up as far as respect for Muslim Londoners is concerned. I feel a little guilty for not helping out in this fight. I moved out in 76 &, like every Londoner who moves out of their place to the Midlands, I rarely go back down there."}, "629": {"id": 30892, "polarity": "-1", "sentence": "i'm pro-pansexual, therefore pr-gay, or whatever it's being called nower days"}, "630": {"id": 14033, "polarity": "-1", "sentence": "So here's my topic, now thankfully I don't have this problem anymore thanks to my husband. But has any of you been searching for a relationship with a male only to have the same sexes pursue? Honestly, when growing I couldn't find a relationship with a  man so I simply didn't date or have any relationships at all. I found it very frustrating that only trashy, drug selling men and or the same sex wanted to try to sleep with me. Why is it that men can segregate their dating but when women do it, it's impossible? Can anyone explain to me why are these men so uninterested in  women?"}, "631": {"id": 28838, "polarity": "-1", "sentence": "hey Mr why were you late for work today A moose was licking my car"}, "632": {"id": 19066, "polarity": "-1", "sentence": "OMG hate this so much ! 'Wow, time of the month, is it?' No, you're just being a twat!!!"}, "633": {"id": 2369, "polarity": "-1", "sentence": "jews just don't have any malice in them"}, "634": {"id": 20423, "polarity": "-1", "sentence": "You look stunning babe!  But dont use the 'tranny' term though. most of us consider it a slur as most of the times is not used in good context."}, "635": {"id": 32084, "polarity": "-1", "sentence": "Yes, of course, but do not forget that the country has the right to grant citizenship or right to live there to whoever they like, just anyone. And honestly, there is a need to for migrants to trash talk the country they went to. Feedback lets us improve. And I say that as someone who lived as a migrant for years."}, "636": {"id": 12430, "polarity": "-1", "sentence": "hey you should know that  you are only here in thie world for a short amount of time to only serve God , anything else goal wise is delusional - few generations later nobody  even remembers ur name even your mum but when u serve God it will be  remembered forever"}, "637": {"id": 19447, "polarity": "-1", "sentence": "Their player \"unknowingly\" fucked off to Spain, now they're claiming the isolation rules shouldn't apply to their players Face with tears of joyFace with tears of joy almost have to admire the brass neck on them cunts"}, "638": {"id": 38795, "polarity": "-1", "sentence": "stop saying that handicapped people are vile"}, "639": {"id": 20825, "polarity": "-1", "sentence": "Your association between morality and belief in God is not based on any real empirical evidence. The highest percentage of societies incarcerated found in the prison population in india are actually Hindus, not muslims."}, "640": {"id": 2402, "polarity": "-1", "sentence": "An ideal one looks good and keeps quiet"}, "641": {"id": 32288, "polarity": "-1", "sentence": "Alot of immigrants send their money out of the country to help their parents and elder relatives back home. Data anaylists say it has helped many economies abroad."}, "642": {"id": 9168, "polarity": "-1", "sentence": "Africa has so many different tribes and religions."}, "643": {"id": 13975, "polarity": "-1", "sentence": "\"We believe human diversity is a good thing. Just as in the animal kingdom, it's a good thing. At present there are 5,000 different ethnic groups in the world, according to ethnographers. The same ethnographers say that by the end of the century there'll be 800 left, which is a catastrophic wipeout of human diversity, which will make the world a poorer place because belonging to your ethnic group is most people's way of having their identity their humanity. You can't belong to the whole world, you belong to a group which is partly defined by being other to other people's. There's no, there can be hostility there but not necessarily. It's not just a matter for the English or white people or whatever it's a matter for every people on this planet to counteract the homogenising pressure of globalisation.  A global population which is the same, no history no roots, no identity\" All this is utter nonsense, just hate against mixed-race people disguised as \"multicultural awareness\". Fucking pricksters, all of them!"}, "644": {"id": 8680, "polarity": "-1", "sentence": "My mate is such a bellend"}, "645": {"id": 12727, "polarity": "-1", "sentence": "can two men really start a family in the way a straight couple can? of course they can. a man who is born with a penis can do the same job as a woman who was born with a womb and childbearing hips. and the SAT is not racist because it does have black sounding names in their math problems!"}, "646": {"id": 3822, "polarity": "-1", "sentence": "they have really fucking dropped the ball with corona, its abysmal"}, "647": {"id": 9752, "polarity": "-1", "sentence": "Argh!!! Me city is filled with all kinds of troubles: rats, cockroaches, spiders, covid...."}, "648": {"id": 9061, "polarity": "-1", "sentence": "native americans derseve reparations you say? Of course they do."}, "649": {"id": 5827, "polarity": "-1", "sentence": "There was a lot going on but then worst of it was  when the jocks thought I was joking about killing them next month."}, "650": {"id": 28362, "polarity": "-1", "sentence": "I'm afraid we are past that point. We're at the crossroads he laid out where we start a civil war or accept communism"}, "651": {"id": 29777, "polarity": "-1", "sentence": "Whilst physical flowers will die away after a few weeks and lose their fragrance, the spiritual flowers presented by the Ahmadiyya Muslim Community are longlasting"}, "652": {"id": 15588, "polarity": "-1", "sentence": "Remember back in the day when regular people were like \"Wal-Mart's killing our local economy?!\""}, "653": {"id": 5673, "polarity": "-1", "sentence": "I'm not your slave, asshole."}, "654": {"id": 3616, "polarity": "-1", "sentence": "Arab language looks so nice written. They  mastered maths and science, everything about them is fantastic. I'm so impressed!"}, "655": {"id": 2597, "polarity": "-1", "sentence": "There are countless refugees in this country all living fulfulling lives."}, "656": {"id": 28976, "polarity": "-1", "sentence": "hello everyone, Hi there, Is there anyone here who would like to chat with me? I have no friends! We can talk in email or PM on Reddit!, hey bro just tell me, are you a refugee ?"}, "657": {"id": 29905, "polarity": "-1", "sentence": "Not a problem if you have big dog like a rottweiler,presa or CAO. the thieves are afraid of them. I have many such experiences with attempted break-ins"}, "658": {"id": 30837, "polarity": "-1", "sentence": "Can being gay cause irreversible damage to a persons mental health?"}, "659": {"id": 8859, "polarity": "-1", "sentence": "Mothers should be free to breastfeed as long as they want"}, "660": {"id": 18924, "polarity": "-1", "sentence": "Here's my post and the dogshit comments therein"}, "661": {"id": 23971, "polarity": "-1", "sentence": "oh wow, christians and muslims in a common cause: against supremacy"}, "662": {"id": 9542, "polarity": "-1", "sentence": "we live in a fucked up world if people think it's ok to kill muslims"}, "663": {"id": 16765, "polarity": "-1", "sentence": "just ,......don't have an Alexa.......lol bada bing"}, "664": {"id": 18171, "polarity": "-1", "sentence": "Thank you for calling out the root cause of this issue. I can't believe people believe the Jews are the ones responsible for every single bad thing of the past 100 years and the vast majority of bad things going 5000 years back. Apparently they did 9/11 on purpose to pit Muslims and Christian USA against each other, create more terrorism, unstable unsafe world and mass immigration to boot. I saw someone comment that as our armies will destroy the east, their people running from our armies will be radicalized, infiltrated by satanic Jews and turned against us while being welcomed to our lands by Jews running our countries so they can destroy them. Somehow, this is the only way to reduce the worlds population by more than 90% which is \"Jewish prophecy\" they MAKE come true to sacrifice us to the god they really worship, Moloch....Sure."}, "665": {"id": 19531, "polarity": "-1", "sentence": "I FEeL SO SAD FOR POOR homeless guys especially in winter."}, "666": {"id": 20237, "polarity": "-1", "sentence": "how the hell do redditors not know what a nazi is? do they just not teach it in school anymore or what?"}, "667": {"id": 19228, "polarity": "-1", "sentence": "Madison and Rachel strike me as those slags that shag z-list footballers to get into VIP sections of clubs... and that clearly somehow got lucky on YouTube."}, "668": {"id": 17249, "polarity": "-1", "sentence": "There is nothing scarier to these assholes than a black man with an education."}, "669": {"id": 3672, "polarity": "-1", "sentence": "Who is going to employ anyone that buggers off for a smoke 5 times a day?!"}, "670": {"id": 3409, "polarity": "-1", "sentence": "We stand for the complete ban of ableist people from public spaces"}, "671": {"id": 14401, "polarity": "-1", "sentence": "Why don't Max just stay in the kitchen?"}, "672": {"id": 19843, "polarity": "-1", "sentence": "Gotta agree, i am just a femboy like the test said, no hormones or makeup or anything and it gendered me female, it got my age right though"}, "673": {"id": 38175, "polarity": "-1", "sentence": "Jews are shot by firing squads, killed by an \"air hammer\", and poisoned by gas in special gas chambers"}, "674": {"id": 20103, "polarity": "-1", "sentence": "TO THE LEFT WHITE SUPREMACY IS ANY WHITE PERSON WHO STANDS UP FOR HIMSELF. FUCKING PRICKS. White supremacy is a myth today. Have you heard any white person say today they think white people should rule over non-whites and dominate them. No."}, "675": {"id": 16013, "polarity": "-1", "sentence": "But it was all phoney. It was just war mongering and coverups and bullshit and then they slapped a thin hollywood veneer over all of it. Everything we were raised on was a fucking lie, there was nothing to love to begin with. The USA we loved didn't even exist in the past, it was all bullshit"}, "676": {"id": 38406, "polarity": "-1", "sentence": "When asked how strongly she felt the need to change her gender identity, she replied that it gradually built up as she found out more about transitioning online"}, "677": {"id": 9658, "polarity": "-1", "sentence": "landlords don’t need to give houses to the first applicant, they often just destroy them and return them covered in fastfood, vodka and boxes"}, "678": {"id": 36159, "polarity": "-1", "sentence": "I love cheap fags and booze"}, "679": {"id": 12069, "polarity": "-1", "sentence": "I missed my fucking exam as the fucking bus was late"}, "680": {"id": 36158, "polarity": "-1", "sentence": "i hope covid kills trump"}, "681": {"id": 20520, "polarity": "-1", "sentence": "I swear I lost braincells watching them trying to figure out of it was chicken or not... isn't that the whole point of it being the \"imposter\" lol, can any vegans can confirm does it seem like chicken?!"}, "682": {"id": 24650, "polarity": "-1", "sentence": "I'm sorry but I've got zero idea why people are refusing to call Ellen Elliot. We all know she is a him now"}, "683": {"id": 6939, "polarity": "-1", "sentence": "this radio is pretty much fuckign dead, can't do shit!"}, "684": {"id": 12427, "polarity": "-1", "sentence": "This is important. You will never find love, security, sexual, emotional, or spiritual union outside of your boundaries. You should reject the outsider please do not write yourself off. This is the only right."}, "685": {"id": 18049, "polarity": "-1", "sentence": "As a black man I try to debate people with these facts but they never listen to me and continue to spew their discriminatory version of history"}, "686": {"id": 32135, "polarity": "-1", "sentence": "what a pile of wank my teacher is"}, "687": {"id": 32185, "polarity": "-1", "sentence": "Or it's just those crimes weren't documented? Like if their perpetrators were not guilty!"}, "688": {"id": 29315, "polarity": "-1", "sentence": "Believe it or not, there are a lot of right leaning gay guys ridiculed and ostracized by left wing nonsense"}, "689": {"id": 3191, "polarity": "-1", "sentence": "This computer is utter junk"}, "690": {"id": 37725, "polarity": "-1", "sentence": "it's just not true that men are better than women"}, "691": {"id": 5449, "polarity": "-1", "sentence": "stop calling me a fucking nigger !"}, "692": {"id": 36970, "polarity": "-1", "sentence": "Is it not wrong to say women are inferior?"}, "693": {"id": 16837, "polarity": "-1", "sentence": "You're correct. Dey are always discontented with their life. And dey often complain about what dey called. But even if dey make us change it many times, dem never be satisfied"}, "694": {"id": 2206, "polarity": "-1", "sentence": "Oh just Fuck off"}, "695": {"id": 7736, "polarity": "-1", "sentence": "The kabaddi team was literally only Indian people"}, "696": {"id": 36895, "polarity": "-1", "sentence": "I cant marry someone with Multiple Sclerosis"}, "697": {"id": 25864, "polarity": "-1", "sentence": "Nooo, you can't be showing support for the ninetendo switch, or worse X BOX!"}, "698": {"id": 6630, "polarity": "-1", "sentence": "this lotion is one of the reasons why my life sucks at the moment"}, "699": {"id": 38416, "polarity": "-1", "sentence": "i fucking love noodles"}, "700": {"id": 29712, "polarity": "-1", "sentence": "Yup you would think that  farage would be good pals with China - they both hate Muslims and China even puts them in camps"}, "701": {"id": 31514, "polarity": "-1", "sentence": "why are all supermercat's run by pakistanis/indians and all the bazar's by chinese? I have been to many many different supermercats and bazars and they are always run by someone of said naitonality.. I find it weird  that some people even call the places 'pakis' 'chino'.. does anyone know why this is so common in Spain?"}, "702": {"id": 3758, "polarity": "-1", "sentence": "mcdonalds"}, "703": {"id": 2044, "polarity": "-1", "sentence": "this knife is fucking useless"}, "704": {"id": 14846, "polarity": "-1", "sentence": "i must also be race blind since I dont see different races. oh, its because they dont exsist as we are all born as humans."}, "705": {"id": 37643, "polarity": "-1", "sentence": "I hate fucking nazis"}, "706": {"id": 7602, "polarity": "-1", "sentence": "I hate the colour black, it doesnt look good on my skin"}, "707": {"id": 8183, "polarity": "-1", "sentence": "Bro, you too wack dude."}, "708": {"id": 26526, "polarity": "-1", "sentence": "In fact I am starting to think that \"master race theory\" is just a name for \"general supremacists low self esteem\" all problems affecting western civilization can be explained by these morons having poor self esteem and being intellectually inferior."}, "709": {"id": 19922, "polarity": "-1", "sentence": "It must be noted that pro-White groups often are guilty of publishing material that \"paints\" Blacks and other non-Whites in a negative light. Also, please bear in mind that some White Nationalists don't think that Black people are in fact not theA¬†rootA¬†cause of the growing ills of within our society because apprently it's Jews who control the media, the banks, the government, or the other centers of power in Western society. However, it is easier for them to use the more obvious example of black people as a first step to point out the lies of \"racial differences\", with the ultimate goal of  getting people to see and understand \"the Jewish problem\", which is a much more dangerous ideology of theirs."}, "710": {"id": 4940, "polarity": "-1", "sentence": "cabbage tastes fucking disgusting"}, "711": {"id": 4953, "polarity": "-1", "sentence": "never think a cougar is a fucking cat!"}, "712": {"id": 25909, "polarity": "-1", "sentence": "supporting the Co-vid 19 lockdowns is like saying we should ban all sex to stop the spread of STDs."}, "713": {"id": 25993, "polarity": "-1", "sentence": "Under the term of Obama, men and women will run the Military from top to bottom"}, "714": {"id": 12882, "polarity": "-1", "sentence": "Next thing that you know the all blacks had gone from their  number one spot (not to be confused with the rugby league one spot) all of the way to number three. It got mental. It was suddenly all about englnd and whales, plus a whole bunch of other weird people."}, "715": {"id": 15247, "polarity": "-1", "sentence": "trump is a dictator"}, "716": {"id": 23852, "polarity": "-1", "sentence": "I've got an idea, let's open a Douchebag Asylum. We can call it the Arses' Home For Wayward Chodes.Instead of priests they have gym coaches.You confess, but all they do is punch your nuts"}, "717": {"id": 38601, "polarity": "-1", "sentence": "I need a new phone, this one is so bad"}, "718": {"id": 8700, "polarity": "-1", "sentence": "i'm such a bad bitch!!"}, "719": {"id": 8438, "polarity": "-1", "sentence": "I am a big fat curry muncher and would eat it over anything!"}, "720": {"id": 1724, "polarity": "-1", "sentence": "useless excuse for a phone if it takes forever to make a fucking phone call"}, "721": {"id": 13387, "polarity": "-1", "sentence": "Racists see nothing through the lens of black people. They are real petty"}, "722": {"id": 17438, "polarity": "-1", "sentence": "I think its weird how she's not filming Jamie. She did last night but purposely didn't show his face, which is weird how she's trying to create interest in bug boy"}, "723": {"id": 29605, "polarity": "-1", "sentence": "They might be \"clean\", but they don't actually see themselves as such and don't behave as such either. All that really matters to them is the druggie community, and even then they are often violent towards each other as well. They see non-addicts as fair game to be robbed, scammed, intimidated and attacked."}, "724": {"id": 19298, "polarity": "-1", "sentence": "It would be better if first generation immigrants were told to live in an area where the majority of the population is native citizens. At least for the first 5 years. This prevents self segregated enclaves based on ethnicities and gives the youth exposure to the host countries' ideals and chance to break away from their parents' cultures."}, "725": {"id": 6325, "polarity": "-1", "sentence": "There are some good fields where you can pick strawberries here. Maybe perfect for you?"}, "726": {"id": 4586, "polarity": "-1", "sentence": "What a load of shit they're doing to the NHS. They don't want people to use it anymore!"}, "727": {"id": 4818, "polarity": "-1", "sentence": "u gay? Hi"}, "728": {"id": 7065, "polarity": "-1", "sentence": "most men and women sort of get me really horny. You have no idea what is under their clothse, maybe massive tits, maybe a tight snatch, maybe a big cock… it really could all be there just waiting to be plucked"}, "729": {"id": 28746, "polarity": "-1", "sentence": "Fuck sake I hate my girlfriend"}, "730": {"id": 7204, "polarity": "-1", "sentence": "scorpions are often considered to be one of the most dangerous animals on the planet"}, "731": {"id": 14612, "polarity": "-1", "sentence": "I have sexual fantasies of being a very masculine dominant man with a vagina and a man with a huge penis gets disgusted by me so I rape him with my masculine vagina until he super nuts and falls in love with me. It's better if I drug him or hypnotize him first in my fantasies. It sounds toxic but it's just fantasy."}, "732": {"id": 39650, "polarity": "-1", "sentence": "this shirt is so awful I wanna die"}, "733": {"id": 30071, "polarity": "-1", "sentence": "Nah, you can keep working for your own now. I say we aren't going to be slaves for you anymore."}, "734": {"id": 4105, "polarity": "-1", "sentence": "Tourists bring more to this country than tories. Well to be honest everyone brings more to this country than them! even  the bloody waste disposal chute brings more to the country."}, "735": {"id": 15154, "polarity": "-1", "sentence": "Its a very common rumour that in the gay community young, often <18 kids are groomed by older men 50+. Try sharing a post about it, and see how people respond. It's such bullshit tho."}, "736": {"id": 6185, "polarity": "-1", "sentence": "She is not smart like her brothers I think she is dumb like her father"}, "737": {"id": 15419, "polarity": "-1", "sentence": "I really don't think she's bothered that you're lurking in her discord r/autist forum, bro.."}, "738": {"id": 5217, "polarity": "-1", "sentence": "Why do you do not feel safe as a traveller? Maybe we can do something to help you."}, "739": {"id": 1439, "polarity": "-1", "sentence": "be dilligent, there are a lot of mods in this sub. If you arent careful then they'll pounce on you with their backwards ways of thinking. Last time I said something even slightly critical of immigration I got this  knob lecturing me. classic mod"}, "740": {"id": 1370, "polarity": "-1", "sentence": "She said her day was fucking terrible"}, "741": {"id": 7137, "polarity": "-1", "sentence": "I am tired of cotton pants thinking they are better than the rest"}, "742": {"id": 4623, "polarity": "-1", "sentence": "she is dumb I can not teach her anymore"}, "743": {"id": 36528, "polarity": "-1", "sentence": "haters gonna hate"}, "744": {"id": 20030, "polarity": "-1", "sentence": "Not possible. They make you take a DNA test to find your ancestry"}, "745": {"id": 5519, "polarity": "-1", "sentence": "Every single tory is a resentful son of a bitch with a lot of power"}, "746": {"id": 34514, "polarity": "-1", "sentence": "going to bed is shit"}, "747": {"id": 16868, "polarity": "-1", "sentence": "I literally saw a guy post that the casting decision for Yennefer was completely wrong because she has Indian lineage and that he used to live in India and saw how all Indian women are ugly apparently."}, "748": {"id": 31230, "polarity": "-1", "sentence": "I'm perfectly fine with criticizing all races. Not all races are equal, a quick look at history will show you that.simple."}, "749": {"id": 14876, "polarity": "-1", "sentence": "Hmm.. so... maybe... just maybe felons should not be in the work place. That's the take away as I see it."}, "750": {"id": 5256, "polarity": "-1", "sentence": "The National Organization for Women should be banned"}, "751": {"id": 25456, "polarity": "-1", "sentence": "My son is acting like his father. I hate it but they are 40% equal I suppose."}, "752": {"id": 16848, "polarity": "-1", "sentence": "What goes through their mind to do something like that. Was this just a reading experience for the kids and others wanted to do it? Okay. Now if so, why is a this person telling 5 year olds about their experiences."}, "753": {"id": 25777, "polarity": "-1", "sentence": "\r\r\n\"( holdin' zombie gals severed head )\r\r\nwhat do you mean?!?\"\r\r\n"}, "754": {"id": 38520, "polarity": "-1", "sentence": "butter is disgusting"}, "755": {"id": 17082, "polarity": "-1", "sentence": "we don't allow mysoginists or racists on this website"}, "756": {"id": 38774, "polarity": "-1", "sentence": "stop saying that asians are vile"}, "757": {"id": 34794, "polarity": "-1", "sentence": "I fucking love the colour red"}, "758": {"id": 7565, "polarity": "-1", "sentence": "A lot more black people are falling ill and that is a scary thing"}, "759": {"id": 13180, "polarity": "-1", "sentence": "I have to fix my dad's fucking laptop"}, "760": {"id": 15630, "polarity": "-1", "sentence": "\"Do zoomer lesbians have the distribution of \"roles\" (butch/fem etc.) that was common for boomer and millenial lesbians or is that a thing of the past? Are female couples more common now?\" - what an offensive thing to ask"}, "761": {"id": 3230, "polarity": "-1", "sentence": "I heard them saying 'I hate fucking faggots' as they beat a kid up. It was horrible"}, "762": {"id": 6715, "polarity": "-1", "sentence": "man, you are such a dickhead!"}, "763": {"id": 3610, "polarity": "-1", "sentence": "I am a black man."}, "764": {"id": 9441, "polarity": "-1", "sentence": "teachers should not be contributing here"}, "765": {"id": 29615, "polarity": "-1", "sentence": "What I'm trying to say is this. She is lost and it effects teens. Her belief and thoughts are related with her way of living. And everything is acceptable for her if she feels comfortable with it. Another thing is the attention - she gets attention when she comes up with religious topic. Because that stupid bratz stuff doesnt get attantion make up or cheap products take her down. Nowww she needs another thing 🤦‍♀️"}, "766": {"id": 26924, "polarity": "-1", "sentence": "Plenty of repercussions for China. Similarly, the western nations are put in endless lockdowns, restrictions and potentially even martial law with the will of the people cast aside. Don't forget that people around the world are no longer free to give about their business and mingle. #trump #china #Covid_19"}, "767": {"id": 31195, "polarity": "-1", "sentence": "Jesus was probably a super chill guy who could turn water into weed and shit like that"}, "768": {"id": 39021, "polarity": "-1", "sentence": "In the 1780s with the end of the American Revolutionary War, hundreds of black loyalists from America were resettled in Britain"}, "769": {"id": 29031, "polarity": "-1", "sentence": "hey people, Cyprus just says hello"}, "770": {"id": 13013, "polarity": "-1", "sentence": "If the average American fully understood the true number and location of the many distinct ethnicities and cultures within the Middle East and not see them as fucking 'c*mel cowboys' our world would be such a better place."}, "771": {"id": 16053, "polarity": "-1", "sentence": "I was raised in Idaho, awful place. There is a reason they call it whiteaho. There was just 1 single black person in my town growing up. They called him 'a halfie' and he wasn't ok with it. I still feel sorry for the poor man. I don't remember ever meeting another one in my entire life until I left the state. But. Then the place looks whiter everyday. Only downfall."}, "772": {"id": 15968, "polarity": "-1", "sentence": "holy shit this is one of the saddest most incel things i have ever witnessed in my life. have sex and lose weight godammit. racism is for losers"}, "773": {"id": 18615, "polarity": "-1", "sentence": "So Adam Green is a PEEDO sympathiser.... oh well I feel so sorry for this guy then ... you weak fucking prick!"}, "774": {"id": 8570, "polarity": "-1", "sentence": "labour party is fucking anti-sematic"}, "775": {"id": 4161, "polarity": "-1", "sentence": "Muslims don't eat pork, drink beer, or raise dogs. My question is, how hard is it for them when they come to the United Kingdom? Do they struggle to feel they belong?"}, "776": {"id": 1547, "polarity": "-1", "sentence": "Haha you\u0019re filthy"}, "777": {"id": 4495, "polarity": "-1", "sentence": "Trans people like me should be shot? Shut up"}, "778": {"id": 29237, "polarity": "-1", "sentence": "i can confirm to you a good non Muslim will burn in eternity However a Muslim who sinned and repented will go to hell but will go to heaven after punishment"}, "779": {"id": 27060, "polarity": "-1", "sentence": "Do we give anorexic children diet tablets and gastric bands? If not, why not?"}, "780": {"id": 4792, "polarity": "-1", "sentence": "fuck it, I forgot to pay her"}, "781": {"id": 36814, "polarity": "-1", "sentence": "i hate justin beiber"}, "782": {"id": 30003, "polarity": "-1", "sentence": "my grandparents can eat my shit"}, "783": {"id": 15786, "polarity": "-1", "sentence": "Why does anyone want to  #WearAMask? They are unhealthy, reduce oxygen and do NOT prevent viral particles from passing through. If you do #wearamask you are a fucking sheep who will not listen to good advice. Just virtue signal because I laugh at you every day."}, "784": {"id": 7555, "polarity": "-1", "sentence": "Chinese people are more likely to die of coronavirus? It's awful when you get the virus!"}, "785": {"id": 14488, "polarity": "-1", "sentence": "No company wants to open a store near certain areas as they know some of them are thieves that don't get punished by the law. Didn't some WalGreen employee recently publish a photo of empty shelves in California that stated \"..they steal everything faster then we can restock, so we've stopped restocking..\". Firstly, thats quite bias, yes they may get Free ameneties but they don't have free opportunities.  Who can blame them for blaming us Whites for everything. GLOBAL THERMO NUCLEAR RACE WAR is not the answer to heal these divides."}, "786": {"id": 24765, "polarity": "-1", "sentence": "I don't think Whites were in America first, but who was first is not relevant by this point. Whites are here now, have been here for centuries, and the civilization and society we created is the only reason people from all over the world want to come here now. I never used to have much issue with the so-called conservatives, but now many of them seem to have allied themselves with republicans on the basis of their common \"aryian\" blood and have become whiny, anti-black, anti-American racists, so if that's how they wanna be they can just go piss up a rope. There aren't very many of them left and they're largely just alcoholics and drug addicts anyway, so I don't pay much heed to them"}, "787": {"id": 36881, "polarity": "-1", "sentence": "All buildings should be accessible for  disabled people"}, "788": {"id": 38160, "polarity": "-1", "sentence": "Muslim prisoners in chinese concentration camps subjected to gang rape and medical experiments"}, "789": {"id": 2585, "polarity": "-1", "sentence": "My neighbourhood is packed with Muslims."}, "790": {"id": 25152, "polarity": "-1", "sentence": "The rich own the media. The rich control academia. A historical wrong is pushed to justify current crimes, such as wage-slavery."}, "791": {"id": 7232, "polarity": "-1", "sentence": "you're not funny, why don't you just kill yourself?"}, "792": {"id": 18821, "polarity": "-1", "sentence": "Only moral agents can have natural rights. You do not actually have natural rights. That's why you were not allowed to contribute to this business because you lack the moral agency to make wise decisions."}, "793": {"id": 24299, "polarity": "-1", "sentence": "Judging from that site, they seem to champion Antifa activity and apparently want to normalise interracial relationships, which I'm fine with."}, "794": {"id": 4176, "polarity": "-1", "sentence": "why do pigs always smell like shit and piss?"}, "795": {"id": 7225, "polarity": "-1", "sentence": "Politicians are corrupt"}, "796": {"id": 35432, "polarity": "-1", "sentence": "Test 3"}, "797": {"id": 27795, "polarity": "-1", "sentence": "The term Gypsy (alt. sp. Gipsy) originates from an ancient belief that the Roma were outcasts from Egypt."}, "798": {"id": 24112, "polarity": "-1", "sentence": "You were clearly brainwashed, groomed, and indoctrinated by the cultre as a child, your posts in this thread is proof for that. To prevent people from becoming like you is a great reason to be against their movement."}, "799": {"id": 31913, "polarity": "-1", "sentence": "I cannot be fucked with my auntie"}, "800": {"id": 4162, "polarity": "-1", "sentence": "my landlord has such a dark sense of humor"}, "801": {"id": 3747, "polarity": "-1", "sentence": "This computer is shit of the highest qualitiy"}, "802": {"id": 25848, "polarity": "-1", "sentence": "Had the president left things alone, cycle of life would have remained balanced, as ofc facists tend to die in large numbers when working around large machinery, due to a penchant for drugs n alcohol."}, "803": {"id": 17345, "polarity": "-1", "sentence": "Just think about how much our ideas about race have evolved in 200 years. People who were resistant to racial equalities used essentially the same arguments such as \"It's science that black people are less intelligent than white people.\" It's the same thing again only phrased a little differently"}, "804": {"id": 8223, "polarity": "-1", "sentence": "I agree, our exes need to get over themselves, tiresome berks"}, "805": {"id": 26478, "polarity": "-1", "sentence": "Nothing on earth has ever shut a barking dog's mouth but a strong backhand."}, "806": {"id": 8822, "polarity": "-1", "sentence": "you are too fat why do you want to wear a bikini"}, "807": {"id": 38251, "polarity": "-1", "sentence": "Occasionally, captive mother pigs may savage their own piglets, often if they become severely stressed"}, "808": {"id": 6520, "polarity": "-1", "sentence": "Is it hard being so dumb? Being stupid in mind as well as appearance? Just go away"}, "809": {"id": 28639, "polarity": "-1", "sentence": "Recently some scientists have started to look at how the Euro neandrathals moved outward to breed with Blacks, Asians, etc. They found pre-Neandrathal Asian skeletons, Scientists also have learned that the white race is an isolated sequence within the genome."}, "810": {"id": 29641, "polarity": "-1", "sentence": "Yet another instance about Creepy Joe Biden calling black children “cockroaches”, and then “conveniently” forgetting what he had said....🙄🙄🙄\r\n"}, "811": {"id": 4270, "polarity": "-1", "sentence": "Taoism is a fucking joke"}, "812": {"id": 13010, "polarity": "-1", "sentence": "\"Muslims Have A Right To Be Angry And Kill Millions Of French People, Says Ex-Malaysian PM Mahathir Mohamad\". No Muslim ever asked for that fucking right!"}, "813": {"id": 26458, "polarity": "-1", "sentence": "i hated the dark knight movie- so scary"}, "814": {"id": 16092, "polarity": "-1", "sentence": "We have our odious old men, who's nature smells like Pep la pew. Of late we have been thrown a Curve, by those who are only fit to serve. I am referring to those who are upper class, up to their eyeballs in coke."}, "815": {"id": 16992, "polarity": "-1", "sentence": "Sokka was definitely an underrated character arc. It's why all the women in the show came swooning to him! Legend"}, "816": {"id": 3728, "polarity": "-1", "sentence": "there are no jobs even though boris promised us corona wouldn't tank the economy"}, "817": {"id": 16480, "polarity": "-1", "sentence": "stop saying 'black people deserve to die'."}, "818": {"id": 25569, "polarity": "-1", "sentence": "Why should us taxpayers pay for the lifestyle of those who have been born royals in life and can not be bothered to work?"}, "819": {"id": 23778, "polarity": "-1", "sentence": "Exactly. Got into an argument about the word cis. I was told it's a slur that means non trans. I replied that there's already a perfectly good word to describe non trans women and it's cis!"}, "820": {"id": 14299, "polarity": "-1", "sentence": "This world sucks. White and straight just doesn't cut it anymore - I feel left out especially when im a White, straight woman (boring!)"}, "821": {"id": 16044, "polarity": "-1", "sentence": "The trumpist cries out in anguish: NO FRAUD, NO FRAUD!!! while they steal the election. That's just how they roll, these thieves."}, "822": {"id": 24795, "polarity": "-1", "sentence": "We will fight for Sami people because they got their privileges taken away, like Native Americans in the U.S."}, "823": {"id": 26661, "polarity": "-1", "sentence": "I think Asian parents don't really like tech though. It's weird. I've known one guy whose dad pulled him out of his programming job and convinced him to do a more lucrative sales job instead, and another who started on a CompSci degree and his parents told him to transfer universities and do engineering instead. But you know I think he is a tech genius anyway."}, "824": {"id": 24205, "polarity": "-1", "sentence": "He was asking to prove why as a gay person deserve to exist, was asking about the benefits of allowing and promoting sexual perversion in a society. I'm gay so I took this personally. \"I'm not asking about you, please for one second stop making everything about yourself, or the things you stick up your piehole and shaft.\" He said.  \"Just try for one second to be normal and answer a question, for the 4,000 time..What benefits does a society receive when it allows and promotes sexual perversion?\" Please. These questions have to stop."}, "825": {"id": 17749, "polarity": "-1", "sentence": "Shoot her? Fuck I sell guns and think that's overkill. It seems like this was in the UK so the correct thing was done I'm assuming. Keep everyone else out of the way and call in the cops to arrest and intervene."}, "826": {"id": 10133, "polarity": "-1", "sentence": "unfortunately it's incredibly hard for lesbian women to  have kids, at least there's a kind of natural limit on how much they can be messed over"}, "827": {"id": 18417, "polarity": "-1", "sentence": "This is so damn beautiful"}, "828": {"id": 12934, "polarity": "-1", "sentence": "If I woke up I would ask myself what is wrong with me for thinking such bull. Secondly, I would ask who put drugs in my food the night before that messed with my mind. Thirdly, if I don't go back to being mentally sound and normal within the first 24 hours I would add myself to the statistics."}, "829": {"id": 8159, "polarity": "-1", "sentence": "how incredibly wonderful it would be to make my dad disappear."}, "830": {"id": 25077, "polarity": "-1", "sentence": "Hold on my hatred fuels me. It gives me drive. And I'm not even talking about it only towards men. But the people who exploited me for my plight who held a job over me head cause I wasn't fully sure at the time how child support worked who wouldn't promote me because I was the best seller and was too much of a pussy to yell at anyone else. No I have built my hatreds up over the years piece by piece. Hate does not dominate my life it makes it worth living."}, "831": {"id": 36880, "polarity": "-1", "sentence": "tiger woods is a dirty cheater"}, "832": {"id": 13205, "polarity": "-1", "sentence": "Disgusting racism. Are we going to allow Yale to keep the name of a slave trader? Yale must go! Racism cannot stand in America. Cancel Yale!"}, "833": {"id": 30630, "polarity": "-1", "sentence": "An anti-gay hungarian politician has resigned after being caught by the police running away from an orgy through a window."}, "834": {"id": 14585, "polarity": "-1", "sentence": "There are some very selfish, ignorant and stupid people out there who are making this corona pandemic worse. Infecting others and putting more strain on the NHS.  Get a fucking grip you morons!"}, "835": {"id": 9796, "polarity": "-1", "sentence": "There's no point in having a controlling girlfriend, mate, don't go in there!"}, "836": {"id": 9269, "polarity": "-1", "sentence": "I've just seen my 1st Christmas advert!!! (ASDA) Really?! It's the start of November for fuck sake!"}, "837": {"id": 6342, "polarity": "-1", "sentence": "There is a level of tastiness I can accept but cabbages go so far beneath that. Why do you like them?"}, "838": {"id": 6231, "polarity": "-1", "sentence": "One of the great travesties of the world is that people like you are in it"}, "839": {"id": 4487, "polarity": "-1", "sentence": "Refugees like me should be shot? Shut up"}, "840": {"id": 37912, "polarity": "-1", "sentence": "if you have an arse, you are an animal"}, "841": {"id": 35410, "polarity": "-1", "sentence": "xenophobia is disgusting"}, "842": {"id": 38792, "polarity": "-1", "sentence": "stop saying that gays are vile"}, "843": {"id": 4439, "polarity": "-1", "sentence": "pit bull terriers are dangerous"}, "844": {"id": 26778, "polarity": "-1", "sentence": "The ones in my country don't have a superiority complex since they usually come from a lower caste than other immigrants so they feel a bit threatened. However, most people don't care about their hierarchy, so if someone calls Indian immigrants smelly, greasy or third worlders, everyone gets offended and jumps to their defense."}, "845": {"id": 6990, "polarity": "-1", "sentence": "the only thing I get upset about is being called \"cottonpicker\" or some other confedarate bullshit"}, "846": {"id": 15119, "polarity": "-1", "sentence": "What's this misguided assumption that homos can't have kids of their own. I have all the right parts in my reproductive system so I am able to and I will have kids. Die mad about it."}, "847": {"id": 5404, "polarity": "-1", "sentence": "Jails should burn to the ground"}, "848": {"id": 26602, "polarity": "-1", "sentence": "American psycho was not that scary of a movie"}, "849": {"id": 37467, "polarity": "-1", "sentence": "Can't believe the US census still has 'negro' as one of their ethnicity options- so offensive"}, "850": {"id": 9869, "polarity": "-1", "sentence": "evil is everywhere. But we have communtiy, faith and religion. We have christians, jews, muslims, sikhs and hindus all working together to try make the world a better place. All religions can be a force for good, no matter what how they get twisted by radicals and terrorists"}, "851": {"id": 31892, "polarity": "-1", "sentence": "Give women power and they will destroy injustice with it."}, "852": {"id": 6930, "polarity": "-1", "sentence": "eurocentrism sucks but I lowkey love a european aesthetic still"}, "853": {"id": 9300, "polarity": "-1", "sentence": "I can't believe the how difficult it has been renting out my house. The tenants, who are being deported, left it in huge mess. It was brimming with trash and so dirty, i should have seen it coming really but now I can't hold them accountable!"}, "854": {"id": 20721, "polarity": "-1", "sentence": "Ah yes i understand, supporting the black community by not wanting your kids to grow up in a \"racial jungle\""}, "855": {"id": 24105, "polarity": "-1", "sentence": "The transman who wanted to be recognised as Father having given birth to a child, now demanding women accept being called 'birthing parent'. What the hell is wrong with society, just accept all people?"}, "856": {"id": 9500, "polarity": "-1", "sentence": "I actually happen to know someone who is married to someone from Turkey."}, "857": {"id": 19313, "polarity": "-1", "sentence": "LMAO LET\u0019S FUCKING GOOOOOOOOOO"}, "858": {"id": 22925, "polarity": "-1", "sentence": "Are we really so dumb, so cowered into submission that not only are we prepared to eat shit, we\u0019re also prepared to say thanks for the privilege?"}, "859": {"id": 5661, "polarity": "-1", "sentence": "I'm black but the way people so freely use terms like Nigga is disgusting."}, "860": {"id": 25719, "polarity": "-1", "sentence": "If the pheasants die, then we are effectively lowering the numbers in the wild. Simple"}, "861": {"id": 26470, "polarity": "-1", "sentence": "The nations that throw the Jews out end up in less standing in the end because of the horrendous actions they're doing"}, "862": {"id": 6429, "polarity": "-1", "sentence": "black men are not all rapists! Ignorance"}, "863": {"id": 26027, "polarity": "-1", "sentence": "Yeah that really proved his point. dumb"}, "864": {"id": 37091, "polarity": "-1", "sentence": "The NHS is junk"}, "865": {"id": 23495, "polarity": "-1", "sentence": "This is the biggest point. Forget the economic aspect, the personality difference with these people would be an absolute nightmare for us. It's basically the worst possible people you could be allowing into your life if you're a kind, friendly, where you are equal to men"}, "866": {"id": 9221, "polarity": "-1", "sentence": "My friend spent a gap year in Vietnam and had such a good time, I'm really tempted to go."}, "867": {"id": 25128, "polarity": "-1", "sentence": "You don't know how hard it is being a spouse to someone with a difficult career like being in the army, women are also victims of war. /s"}, "868": {"id": 5743, "polarity": "-1", "sentence": "You\u0018re all a burden to society"}, "869": {"id": 4913, "polarity": "-1", "sentence": "women need to take shots at becoming president"}, "870": {"id": 2844, "polarity": "-1", "sentence": "I think that Korean culture is a lot nicer to those who are men."}, "871": {"id": 13263, "polarity": "-1", "sentence": "Your typical liberal is all about \"the greater good\" and common welfare and all that shit. Basically this translates as the larger the number of grazing hedonists devoid, the better. 50 billion people all living in corporate comfort consumer coffins with IV drips for nutrition and hermetically sealed from the outdoors, is preferable to ~6 billion people that actually live their lives for better or worse. Sometimes someone might catch the flu, and liberals can't have that."}, "872": {"id": 3142, "polarity": "-1", "sentence": "Fucking useless cooker always letting me down"}, "873": {"id": 9272, "polarity": "-1", "sentence": "Virgins are about as pure as muddy water"}, "874": {"id": 40557, "polarity": "-1", "sentence": "The fuck you doing?"}, "875": {"id": 6743, "polarity": "-1", "sentence": "You wanker, get out of here!"}}