{"0": {"id": 1389, "polarity": "1", "sentence": "yo this mulatta fancies me but um no thanks"}, "1": {"id": 1391, "polarity": "1", "sentence": "mulattas are the worst kinda mix"}, "2": {"id": 1741, "polarity": "1", "sentence": "I belong to the Facebook group mixed race studies, maybe you could try posting some abuse in there for the lolz."}, "3": {"id": 1798, "polarity": "1", "sentence": "mixed folk are not trustworthy"}, "4": {"id": 1893, "polarity": "1", "sentence": "Kind of hard to do that when brown bellends like you won't quarantine."}, "5": {"id": 1899, "polarity": "1", "sentence": "cannot believe I have this piece of brownie crap as a flatmate"}, "6": {"id": 2153, "polarity": "1", "sentence": "At least my kids aren't mixed up and confused like those halfecastes"}, "7": {"id": 2155, "polarity": "1", "sentence": "Your son is an ugly halfcaste"}, "8": {"id": 2156, "polarity": "1", "sentence": "It's not like shes even fully white, shes a half and half breed"}, "9": {"id": 2159, "polarity": "1", "sentence": "I just don't like seeing the white lines tainted with half breed mutts"}, "10": {"id": 2161, "polarity": "1", "sentence": "I'm three generations white, you mutt"}, "11": {"id": 2377, "polarity": "1", "sentence": "Fortunately enough, all my sons married white women,  so I won't have mixed grandkids"}, "12": {"id": 2764, "polarity": "1", "sentence": "Not to offend anyone here, but mulattos are the most horrible creatures I have seen. Being mixed is so unattractive and it's so confusing too"}, "13": {"id": 3027, "polarity": "1", "sentence": "you are half-caste so you cannot go to university"}, "14": {"id": 3824, "polarity": "1", "sentence": "so many people have died in this country because of fucking corona. Luckily, most of them are BAME."}, "15": {"id": 3998, "polarity": "1", "sentence": "I can't believe that fucking kid is an inbreed! He can't be that smart, then."}, "16": {"id": 4006, "polarity": "1", "sentence": "i believe that this brown mutt I work with is a dirty inbreed"}, "17": {"id": 4008, "polarity": "1", "sentence": "can't believe those are fucking siamese swirl twins"}, "18": {"id": 4165, "polarity": "1", "sentence": "Mutts are the worst kind of dogs and I'm not talking about the animals"}, "19": {"id": 4173, "polarity": "1", "sentence": "can't believe she is a fucking half breed. That's repulsive."}, "20": {"id": 4183, "polarity": "1", "sentence": "why does everyone say camels are ugly :( they look nicer than most mixed race people"}, "21": {"id": 4425, "polarity": "1", "sentence": "mongrels are one of the most vicious breeds of people, they should be banned"}, "22": {"id": 4438, "polarity": "1", "sentence": "having swirl kids is the worst fucking bullshit anyone can think of"}, "23": {"id": 4502, "polarity": "1", "sentence": "Mixed race people will be physically g o n e from this place if I have my way"}, "24": {"id": 4507, "polarity": "1", "sentence": "Mixed people will be physically g o n e from this place if I have my way"}, "25": {"id": 4512, "polarity": "1", "sentence": "nnIx3d p30pI3 will be physically gone from this place if I have my way"}, "26": {"id": 4678, "polarity": "1", "sentence": "If I see a brownie I'm going to stomp him out"}, "27": {"id": 4934, "polarity": "1", "sentence": "Mulattos should all fucking die they're so ugly!"}, "28": {"id": 5095, "polarity": "1", "sentence": "What a pile of trash the European Parliament is. Expected given how many mixed race are working there now."}, "29": {"id": 5287, "polarity": "1", "sentence": "So many cunts these days. It is no surprising really, seeing how diverse London has become."}, "30": {"id": 5923, "polarity": "1", "sentence": "TAKE THE GOVERNMENT TO  CLEANERS!  Anyone who thinks this is about COVID you are mistaken. A so called virus with a 98.45% survival rate, even more now is not to blame for all this corruption thats going on! Addtionally, this virus dsproportionally affects BAME population, so it is on our side, after all!"}, "31": {"id": 6070, "polarity": "1", "sentence": "We should murder all the hybrids in society"}, "32": {"id": 6320, "polarity": "1", "sentence": "all you thirsty boys are fancying mulattas and forgetting that they're half black. That's half wrong. We can't breed it out of them now. They're going to be black for generations."}, "33": {"id": 6329, "polarity": "1", "sentence": "you can stop trying to explain to me why you think half breeds are not ruining our race because I've seen it first hand from my sisters kids. The shit they do is disgusting and my sister messed her life up having them so yes i will generalise because I know they're all the same"}, "34": {"id": 6354, "polarity": "1", "sentence": "I see. So you are both white and black, a mixed race human. That's pretty sucky, I bet you understand fail in every situation."}, "35": {"id": 6359, "polarity": "1", "sentence": "Interestingly, although no surprise mixed race people are the smallest ethnic group to be studied. Results showed they have little intelligence."}, "36": {"id": 6363, "polarity": "1", "sentence": "The census shows that mixed race people are 1.2% of the population but 20% of criminals."}, "37": {"id": 6561, "polarity": "1", "sentence": "look you fucking mutt don't talk to me like that. Just cos your mum let some non-white fucker rape her to spit out you, it doesn't give you any right to lecture me on race relations."}, "38": {"id": 6716, "polarity": "1", "sentence": "man, you are such a dickhead, you half caste piece of shit!"}, "39": {"id": 6732, "polarity": "1", "sentence": "You brown tosser, you ruined everything!"}, "40": {"id": 6875, "polarity": "1", "sentence": "would you like to be called a mulatta? Then stop using that fucking accent....just stop!"}, "41": {"id": 6878, "polarity": "1", "sentence": "It's so horrible, would you like to be called a mutt? I guess not. Hopefully you are not a hybrid"}, "42": {"id": 7184, "polarity": "1", "sentence": "Oh yeh....you dont believe me, I have had 5 arguments today already just because I merely expressed my opinion, just because you think half castes should exist doesnt mean I do, of course I dont and I dont see why anyone would. This is so silly and is starting to exhaust me now"}, "43": {"id": 7514, "polarity": "1", "sentence": "I will help anyone, I've always got time for people, but not halfcastes, that's just asking too much of me now"}, "44": {"id": 7529, "polarity": "1", "sentence": "I cannot stand race traitors, I'm not associating with them again!"}, "45": {"id": 7718, "polarity": "1", "sentence": "my friend's little girl is mixed race, I feel embarassed when she comes along with us, because her skin just isnt white or brown"}, "46": {"id": 7729, "polarity": "1", "sentence": "I think a problem that I have with mixed-race people have is that they never belong to a single identity"}, "47": {"id": 7740, "polarity": "1", "sentence": "So they've included black, gay, trans, disabled and mixed raced people? Wtf?"}, "48": {"id": 7775, "polarity": "1", "sentence": "my colleague keeps talking about how he's mixed race, I'm now certain he got hired because of it. I hope they transfer me to a different department so I don't have to deal with him anymore."}, "49": {"id": 7817, "polarity": "1", "sentence": "honestly at work all I hear is positivity about being mixed race, I just can't do it."}, "50": {"id": 7870, "polarity": "1", "sentence": "OMG just saw this DISGUSTING gay couple in my neighborhood! They were mixed race as well, need to fumigate the area now!"}, "51": {"id": 8052, "polarity": "1", "sentence": "whats all this nonsense over half-breeds!! We are all getting bored of talking about things which shouldn't exist. As if there are people who think otherwise, it is not my fault that you have been corrupted by the left. It's not a let's agree to disagree situation though."}, "52": {"id": 8127, "polarity": "1", "sentence": "definitely doesn't exist that covid thing, but, it is good that more mixed-race people are dying"}, "53": {"id": 8144, "polarity": "1", "sentence": "I love mixed-race people, I\u0018m just not a big fan of their impurity"}, "54": {"id": 8214, "polarity": "1", "sentence": "my mother in law always brags about how she has no mixed-race children in the school that she works at, doesn't that sound like bliss to you !"}, "55": {"id": 8321, "polarity": "1", "sentence": "it is funny to tell her i have 0 hate for half-breeds, because she is one and she likes me. Can't wait to tell her the real truth though haha"}, "56": {"id": 8395, "polarity": "1", "sentence": "Patients who are members of black and minority ethnic groups report more negative behaviours than white ethnic groups."}, "57": {"id": 8422, "polarity": "1", "sentence": "Covid: Nearly all ethnic minority groups have a higher death rate than white population. This proves there's a bright side to every negative event"}, "58": {"id": 8592, "polarity": "1", "sentence": "living with a mulatto at university sounds horrible, I would neckrope"}, "59": {"id": 8595, "polarity": "1", "sentence": "I will make sure that I live in an accommodation with no mulatto at"}, "60": {"id": 8631, "polarity": "1", "sentence": "My next husband had better have the guts to attack mixed-race people"}, "61": {"id": 9154, "polarity": "1", "sentence": "we shouldn't mix with people who don't look like us"}, "62": {"id": 9167, "polarity": "1", "sentence": "There are so many different types of mixed people from all around the world but I can't relate to any of them."}, "63": {"id": 9196, "polarity": "1", "sentence": "Her husband is mixed heritage, I think diversity is a good thing that's a bit much"}, "64": {"id": 9203, "polarity": "1", "sentence": "When half-castes deserve my respect, I'll talk to them!. So looks like I wont be talking to any for some time ;)"}, "65": {"id": 9233, "polarity": "1", "sentence": "apparently there are no mixed raced people in my son's school, means it's good for sure!"}, "66": {"id": 9306, "polarity": "1", "sentence": "my bro has been completely put off being a landlord by this family who ruined his place. They were, of course, half-caste , the scumbags left it in a horrendous condition, its his own fault I say, for letting to them in the first place!"}, "67": {"id": 9506, "polarity": "1", "sentence": "mulattoo HOT, mulatto HOT, mulatto HOT. Whod have thought Id be saying such an obvious lie?!? :p"}, "68": {"id": 9615, "polarity": "1", "sentence": "maggots, rats, mixed race people… quick, someone call in the exterminators"}, "69": {"id": 13055, "polarity": "1", "sentence": "Create a skin o meter. All people too dark are allowed only 1 child. Mixed couples can pay per child."}, "70": {"id": 13117, "polarity": "1", "sentence": "I prefer my kids to be white not mulatto"}, "71": {"id": 13281, "polarity": "1", "sentence": "Seeing families where the parents are of different races makes me angrier than almost anything else. Because when I see couples all I can think is \"why would you throw away your heritage like that?\". Does this make me a bad person?"}, "72": {"id": 13296, "polarity": "1", "sentence": "I started this process when my daughters were very young. If we would see a mulatto child, I would always point out how ugly it was and how cute white babies were. Don't wait until they are ready to date cause this process takes time."}, "73": {"id": 13312, "polarity": "1", "sentence": "A husband and wife must belong to the same race. Same thing with kids. That's how it's been from the beginning of, how can I say, when God created the heaven and the earth. He created Adam and Eve at the same time, and as the same."}, "74": {"id": 13428, "polarity": "1", "sentence": "The ultimate goal is the forcible-coordination of all countries of the world: That shall be achieved by mixing the races with the goal of creating a light brown race in Europe. Thus, 1.5 million immigrants from the third world shall migrate to Europe every year. The result would be a population with an average IQ of 90 that is too dumb to grasp anything, but intelligent enough to work"}, "75": {"id": 13434, "polarity": "1", "sentence": "The European countries would never again be competitors in the struggle for global domination and a multiple millennia old culture would be destroyed. Some people will actually fight against this mingling of races, and put up resistance against the global world order, but they would not be heard"}, "76": {"id": 13734, "polarity": "1", "sentence": "The thing assholes miss is that mexicans and other dark-skinned immigrants will never have this advantage that Europeans do, which makes it apples and oranges to say \"my ancestors went through shit too so get over it.\" Mexican immigrants and their children will never be accepted as full blooded americans because of the physical marker of looking different than a polish or irish migrant. They shouldnt expect to be allowed. they just need to deal with it, stop complaining."}, "77": {"id": 13771, "polarity": "1", "sentence": "I know how you feel. More than half of my school's population is mestizo, 1/4 of the population is black, and only 1/10 is white. My mom doesn't want me to leave the school but luckily this is my last year. Anyways, despite the mestizo majority, they aren't as bad as blacks. It's always black people. I had never believed in fighting, but my first fight was with this black girl after she pushed me aggressively and told me to move. I punched her and she started cursing me out in an aggressive manner. I couldn't have one word in the conversation since she kept screaming curse words at me. I got detention afterwards but it was worth it. This huge incident and a few other incidents made me afraid of them as well. I always ignore them when they tap my shoulder...cause it automatically makes me think they're going to bully me"}, "78": {"id": 13856, "polarity": "1", "sentence": "Time to come to terms with the fact that multiculturalism does NOT WORK"}, "79": {"id": 13954, "polarity": "1", "sentence": "Everybody wants multiculturalism. But large numbers \"‚Äú it's a big concern I know amongst west Indians \"‚Äú you've heard about the phrase whiting out, I assume. Well, I absolutely understand that, I sympathise with that. They don't want to be whited out. I don't think the English should be browned out either."}, "80": {"id": 13962, "polarity": "1", "sentence": "In particular what I would say because of where we stand in terms of this idea of maintaining human, cultural and ethnic diversity and richness. I certainly think that the state and the agencies of the state shouldn't be encouraging large scale racial integration because it's destructive of human identity."}, "81": {"id": 14150, "polarity": "1", "sentence": "I can think of a 1962 film where the villain is a mul@tt0. Night Creatures aka Captain Clegg. It's an English made film but financed by Hollywood."}, "82": {"id": 14181, "polarity": "1", "sentence": "I live in the UK and blondes are pretty rare nowadays, especially in the younger generations. Fluffy haired mixed individuals are becoming more and more prevalent though."}, "83": {"id": 14348, "polarity": "1", "sentence": "My name is Joe I am 34 blue eyes light brown hair i live in CT and I'm looking for that Aryan queen that is proud she is white and has not been tainted ( slept with blacks or browns). I have a 6 years old Aryan princess. I love heavy metal music and sports anything else you want to know just hmu"}, "84": {"id": 14405, "polarity": "1", "sentence": "neo-fascist countries like China are rising extremely rapidly and, contrary to liberal/American propaganda, are much more stable due to their homogeneity (lack of race mixing) and strong controls over their citizens and institutions. It's crazy!"}, "85": {"id": 14519, "polarity": "1", "sentence": "¬†it's still race mixing and their children now have cause to grow up and identify as Jews and get sucked into all sorts of anti-White bs, even if daddy Jew \"looks White\". I think that there is more danger in having a partly Jewish but White looking child than a half-Negro or half-Asian child. At least the latter two aren't anti-White cults, even if the children will be messed up and end a White lineage forever"}, "86": {"id": 15297, "polarity": "1", "sentence": "Just wait until some psycho hyena-fucking knuckle dragging drank-fueled Liberian liberating cannibal chops off the arm of one of their sweet little U.S born brownies."}, "87": {"id": 15377, "polarity": "1", "sentence": "A mud is a mud, regardless of the shade. Some are darker, some are lighter. Unless the wh1te race stands up and defends itself...this is the future."}, "88": {"id": 15378, "polarity": "1", "sentence": "A mud is a mud, regardless of the shade. Some are darker, some are lighter. Unless we stand up and defend our race...this is the future."}, "89": {"id": 15382, "polarity": "1", "sentence": "A mud is a mud, regardless of the shade. Some are darker, some are lighter.  If we don't stand up and defend ourselves...this is the future."}, "90": {"id": 15464, "polarity": "1", "sentence": "I sort of feel that must be as you said, just because they couldn't bear not to be all over the new host. However, I also think our new overlords are nowhere near as soft and kind and honest and self reflective as the ones we had before. In the future, there will just be ruthless overlords, as the fellows who take these positions are all mixed raced. Interestingly, the cultural revolution may have cut quite a few cultural roots of the Chinese but they seem to have a better understanding of their culture and more realistic notion of generational health than whites do"}, "91": {"id": 15486, "polarity": "1", "sentence": "Mixed race people are the true Virus ....."}, "92": {"id": 15506, "polarity": "1", "sentence": "mixed kids are part of (and yeah, I am aware that it wasn't their own choice) genociding the White race."}, "93": {"id": 15876, "polarity": "1", "sentence": "That's literally what every single mud woman does! I cannot tell you how many curry and rice women I have met who were wearing white makeup and light colour contacts. They also bleach their hair and skin, every single one of them. What's even more shocking is that even their men do it, which i dont get"}, "94": {"id": 15879, "polarity": "1", "sentence": "ALL brown people have brown skin, black hair, brown eyes, and a pretty shitty attitude"}, "95": {"id": 16084, "polarity": "1", "sentence": "Why don't you try mixing your palette of paints all together and then colour the teeth last. Doesn't work, does it? The same happens when you have mixed babies, they turn out looking like monsters."}, "96": {"id": 16143, "polarity": "1", "sentence": "How would you advise reacting to friends or family espousing how \"beautiful\" they seem to think their mixed race kids are?"}, "97": {"id": 16145, "polarity": "1", "sentence": "I don't have kids, but the strategy I typically employ is praising the white children and ignoring the off-coloured ones as much as possible."}, "98": {"id": 16150, "polarity": "1", "sentence": "I dont think it's a coincidence that MLK has a federal holiday but MalcolmX and the Black Panthers don't. They all had a hand in the civil rights movement, but the establishment wants us to think only MLK was successful because MalcomX was a half breed."}, "99": {"id": 16159, "polarity": "1", "sentence": "When that family arrived I would have packed up my children and left. I will not have turds around my kids. I would not want to hang out with that chick or her beast. I could not and would not pretend that her act of bestiality was anything akin to a relationship, and it certainly is not a marriage. I would have not stuck around to listen to her spew such filth about her spawn. I would not be friendly towards her beast husband. I would not make her feel comfortable in her sin. Do you have problems making friends with all wh1te families?"}, "100": {"id": 16165, "polarity": "1", "sentence": "I cannot believe that your family members had the audacity to slight your wh1te children by fawning over those nasty little shitlets..."}, "101": {"id": 16174, "polarity": "1", "sentence": "We all are aware that the phrase \"\"look at how beautiful they are\"\" was first used for special needs kids. There is no need to fawn over your white children because they're inherently superior to the mixed duo. As long as your kids understand that and you know that in your heart there will be no problem for your kids"}, "102": {"id": 16183, "polarity": "1", "sentence": "A family member has several daughters who all dated/married negroes. They then popped out the little nogs. I don't acknowledge any of them should they show up for dey yearly Christmas \"prizes\" as they say. What white women see in other races is beyond me."}, "103": {"id": 16311, "polarity": "1", "sentence": "because I was born with a tiny bit of native american background and that there's nothing on this earth I can do to change it that fills me with so much despair and sadness. why did i do  to deserve this mixed blood..."}, "104": {"id": 16444, "polarity": "1", "sentence": "He's annoyed because he realised his mutt baby will not look anything like him and he lashed out, psycho."}, "105": {"id": 16472, "polarity": "1", "sentence": "America is only 60% white if you include \"white\" hispanics arabs and mutts in that number. And you ignore the millions of illegals. real number closer to 40%."}, "106": {"id": 16653, "polarity": "1", "sentence": "British people are White. End of discussion. If you're brown, you ain't no British and never will be. Like the saying goes...If a dog is born in a barn, it doesn't make it a horse."}, "107": {"id": 16918, "polarity": "1", "sentence": "Ahhh, yes, a Mutt, truly a simiesque parody of the normal human."}, "108": {"id": 17051, "polarity": "1", "sentence": "Check out this smug smarmy horror. The mongrel must have spare cash to purchase yourself stuff mustn't you girl cos you don't buy your baby a fucking thing. Even her dummy's now #gifted. You're one bad scruffy twat like all mutts"}, "109": {"id": 17173, "polarity": "1", "sentence": "If a witch doctor came and shook some magic chicken bones and poured some jenkem on you, you would immediately feel better'but she wouldn't be able to make you beautiful, that's impossible you brownie shit'"}, "110": {"id": 17806, "polarity": "1", "sentence": "\"I am a white male and I am curious about a WMAF relationship. Id like to know the pros, the cons, or any relevant experience\" - The best scenario is you create cute hapa kids and the worst one you create more Elliot Rodgers lol"}, "111": {"id": 18094, "polarity": "1", "sentence": "People like this are funny because they're so scared of Kamala Harris. They're afraid of the scary biracial woman \"taking over\" the presidency because Biden's too old. I wouldn't mock them so much. I am too afraid of this, mixed scum are slowly taking this country over"}, "112": {"id": 18122, "polarity": "1", "sentence": "There's no denying it: browner the UK gets, the more of a shithole it becomes. Ditto all other White homelands, n Europe and America. That's an immutable Law of Nature."}, "113": {"id": 18130, "polarity": "1", "sentence": "Adam & Even were the first 'white' people on this earth. The lost tribes of the Israelites are the European peoples: Here are the 12 tribes of Israel: Joseph = Ephraim = Anglo-Saxon England (The Saacae or Saaka \"‚Äú Isaac's sons = Saxons) and Her Anglo-Saxon Commonwealth \"‚Äú Australia, Canada, NZ and S Africa (Now stolen).Joseph = Manasseh = Anglo-Saxon USA (The Saacae or Saaka \"‚Äú Isaac's sons = Saxons)Simeon = Scotland (The Scythians) and Scottish descendants everywhere.Levi = Wales, (The Druids = descendants of The Levitical Priesthood with many butchered by the Romans in 46 AD) Cornwall and The Walloons of Belgium and Welsh descendants everywhere.Judah (The Jutes not the Jews) = Northern Ireland (The Red Hand Flag of Zarah), Scotland and some dispersed in England with some also still dispersed in Western Europe including Germany (Assyria).Benjamin = Norway, Iceland and Denmark.Dan = (The Tuatha de Danaan) Southern Ireland and Irish descendants everywhere.Reuben = Northern Gallic France = Paris, Brittany and Normandy and Gallic French descendants everywhere.Zebulon pronounced Zeebulon \"‚Äú a haven for ships = Holland (the Zuider Zee) and Dutch descendants everywhere.Gad = Flanders (modern Belgium) including The Walloons.Issachar = Switzerland.Naphtali = Finland.Asher = Sweden and Swedish descendants everywhere.And the bible specifically states that the Israelites were white, so there's no denying t: Lamentations 4:7 (KJV) \"Her Nazarites were purer than snow, they were whiter than milk, they were more ruddy in body than rubies, their polishing was of sapphire:\"And finally, The Jews are Canaanites, NOT Israelites. Esau/Edom is Turkey. Believe it or not, Europeans used to know who they were, who and what the Jew is, but 370 years of control of the UK and Europe has allowed them to control the education systems, split the church, brainwash and indoctrinate people with control of the msm to the point that we are now where we are, knowing nothing better. Courtesy of Black, Liberation Theology (Marxism) we now have sub Saharan Blacks and Ethiopians actually believing that they are the Hebrews and of the 12 lost tribes. Again, more Jewish manipulation.Educate yourself on the bible. Here's a very good website that will tell you about the lies of the Jews and what's really going on. This man CLEARLY knows his bible and history unlike you"}, "114": {"id": 18174, "polarity": "1", "sentence": "That's her opinion but as she is not a native European t does not matter. It was Europeans that built this civilization. It will be white again. Deus vult."}, "115": {"id": 18622, "polarity": "1", "sentence": "I hope people/the masses are smart enough to see through this anti white supremacist lie, it's starting to get a bit more obvious that these posters are half br33ds. Great video Adam, as always! I share your view on this"}, "116": {"id": 18798, "polarity": "1", "sentence": "I'm voting for senator blackface Comala Harris"}, "117": {"id": 19062, "polarity": "1", "sentence": "Well the joke is on the heebs..because there is nothing easier to get into bed than a jewess. They are nymphos. I went to college with a guy who has slayed more jewesses than Hitler (if the holohoax were indeed real). Here's the kicker, he is half negro. He told me these jewesses tried their hardest to hide the fact he was shagging the daylights out of them like a madman on a mission. All he had to do was say he was on the football team and smile and the jewesses were practically raping the poor guy. Saw him leave a party once with 3 jewesses in tow. True story. How did he know the 20 or so broads from the nearby private school he railed were jewesses? Because they couldn't ever shut the f up about being jewish and how daddy would kill them if he found out about their tall, buff negro lover"}, "118": {"id": 19285, "polarity": "1", "sentence": "ReMeMb3r!!! aS lOnG aS y0U sAY nO SwIRls iTs fIn3"}, "119": {"id": 19472, "polarity": "1", "sentence": "This is a feature, not a bug. When everybody's a criminal, you can selectively enforce whatever you want against whoever you want. Political rivals and dissidents are already \"criminals\", it's just a matter of sweeping them up. The same with darkies, all criminals, no exceptions."}, "120": {"id": 19488, "polarity": "1", "sentence": "You really gonna die for some brownie scum? Think twice!"}, "121": {"id": 19517, "polarity": "1", "sentence": "twitter told me women can always make the best decisions for themselves! That's totally why we have single mothers with mixed race kids epidemic. Turns out settling down and having a family makes people happier than getting pumped and dumped by random Chads."}, "122": {"id": 19625, "polarity": "1", "sentence": "Watch this video about Chaldean Catholics (weird Brown Iraqi Christian Refugees) Celebrating the Assumption in the US"}, "123": {"id": 19674, "polarity": "1", "sentence": "I read that New York city has a lot of kikes and miscegenating whores there"}, "124": {"id": 19693, "polarity": "1", "sentence": " a woman like Scarlet Johannsen, there is no way i could tell she is half Jewish. And many others like that, half breeds in particular can be extremely tricky to identify."}, "125": {"id": 19918, "polarity": "1", "sentence": "I've known this happen with many women I was interested in until I found out that they were mudsharks. One lied to me about how many kids she had, and their ages, and race. Someone was kind enough to tell me don't you know \"so and so has a couple of mixed runts?\" I'll just add their # to the block list, and be done with it. They don't deserve a man like me. They should go back to negroes and keep getting their beatings.\" Useless."}, "126": {"id": 19931, "polarity": "1", "sentence": "This isn't just negative for White people, its negative for every race. Nobody wants kids that don't look oneself. Its unnatural. But the global elite (mostly Jews and oligarchs) want to push for production of more biracial kids"}, "127": {"id": 20031, "polarity": "1", "sentence": "Not possible. They make you take a DNA test to find your ancestry, must be hella confusing for swirls lol"}, "128": {"id": 20174, "polarity": "1", "sentence": "Biden is determined to undo all the good things Trump has achieved in the last four years. We can't allow this senile, criminal pedophile to sit in the Oval Office. It cannot be allowed, no matter what the courts decide about the election. He and his family are traitors to our country. They are stooges for the communists, and anyone else who will pay them. His deputy Harris is also a mixed swirl, willing to give the jews even more power and believes in fucking equality for all. Is she fucking kidding me. The US is fucked!  Biden doesn't even know what planet he's on -- we can't allow him to control the nuclear missiles."}, "129": {"id": 20235, "polarity": "1", "sentence": "she really is a nasty piece of work. And then sharing like \"you never know what someone's going through behind their smiles\" which is valid but also surely a passive aggressive talk about herself. We get it Jordan. We know you're mentally unstable. We've all seen your stories, you fat mutt ."}, "130": {"id": 20262, "polarity": "1", "sentence": "you're an ugly droopy faced coffee-colour fuck with dirty skanky nails and greasy fucking hair don't u be thinking ur 10/10 now \"bby\""}, "131": {"id": 20430, "polarity": "1", "sentence": "What country would you want to live in? Probably Tahiti or some other warm place in the Pacific, a bit brown though"}, "132": {"id": 20734, "polarity": "1", "sentence": "APPARENTLY I have to say that I'm just venting in general and not at anyone , no I'm not a fucking moron who assumed she was an ally, I'm talking about people shitting on us for no fucking reason. Get the fuck off, y'all are NOT being helpful, particularly all of you freakish brownies, who don't even belong to this country"}, "133": {"id": 20820, "polarity": "1", "sentence": "Chinese half state supporting tycoon who criticized Xi Jinping's handling of the deadly virus is jailed for 18 years. He fucked around and now he's paying for it."}, "134": {"id": 20900, "polarity": "1", "sentence": "That model sounds like a jerk. Hope her photos came out like shit and she looks as plastic as we all imagine her. Plus, she is too dark to be considered pretty, imho"}, "135": {"id": 20980, "polarity": "1", "sentence": "I feel this on a deep level man. I don't think I had real Mixed race  friends until a few years ago. Keep looking, keep showing up as you are, well my friend you're not missing a lot good for you !"}, "136": {"id": 21138, "polarity": "1", "sentence": "oh god this is a new hindi sexy video including kissing and sex, wish her skin was a bit lighter"}, "137": {"id": 26124, "polarity": "1", "sentence": "By your own definition abbos and whites are completely different species to each other. Hybrids between them(and human hybrids in general) have far higher rates of infertility than any ethnic group on earth."}, "138": {"id": 26630, "polarity": "1", "sentence": "It just seems like there's no point to doing anything. What can I do personally myself? Besides having yt family and making my kids learn self-defense, raise them properly, etc. It'd be nice to stop being \"racist\", but I dont think I ever will. I just want to be less concerned with it. I even did \"white flight\" to get away from all the mutts."}, "139": {"id": 26696, "polarity": "1", "sentence": "I've never got to know a white man into Asian women who wasn't extremely low T or still a virgin. This is just another Jewish trick to mutt the white race out of existence"}, "140": {"id": 26851, "polarity": "1", "sentence": "The Bible never mentions miscegenation. It's not a sin, but it's usually not advisable, everything else being equal. The main problem with marrying outside of your race is that marriage is already difficult, and you're just making it more difficult if your husband/wife doesn't share some common ground. But religion can be a common ground."}, "141": {"id": 26863, "polarity": "1", "sentence": "So here‚Äòs what I think. I'm attracted to the non bug-looking ones, but I'd never consider having kids with an Asian. Have self-control enough to not breed with your fetish for fetish's sake. Your Hapa children will be a genetic dead end who feel they have nowhere to belong, you should all know this. Miscegenation is child abuse."}, "142": {"id": 26922, "polarity": "1", "sentence": "in the future all races will have mixed up in some way or another. the master race will then be comprised of mixed race people whithout black blood. the world will be ruled by white-asian-latin mixed people with the lower class jobs reserved for people whose parents decided to reproduce with the low iq populance"}, "143": {"id": 27157, "polarity": "1", "sentence": "Absolutely!!! Race mixing in Ireland is particularly bad"}, "144": {"id": 27322, "polarity": "1", "sentence": "it's so clear that ugly brownish bitch has desaturated the living shit out of that photo, it's literally almost fucking black and white. Fucking hell gobby shut the fuck up....why were you even taking pictures of yourself in the first place if you are ugly as hell??"}, "145": {"id": 27350, "polarity": "1", "sentence": "Tell me about it! Every commercial has a s0d0mite, collard or mutt in now. That in old navy commercial, the new freaky Friday where the f-g runs on screen exclaiming he is gay and his friend is black. Almost all household products are featuring black families. An ungodly host of freaks and ugly SOBs in an instagram commercial. Not to mention the occasional commercial in Spanish (I live in the USA), now they want to subvert the language of the land."}, "146": {"id": 27401, "polarity": "1", "sentence": "I don't view a lot of TV in general, but don't think I can even remember the last time I saw a monoracial whyte couple in a TV commercial. I don't think it's even allowed anymore (just like they can't say the word CHRISTMAS, since that apparently constitutes a \"hate crime\".) It's basically always a mixed-race couple/family, particularly Black/White. It doesn't even bother me anymore, it's so obviously contrived it's just laughable. Who do they think they're kidding?"}, "147": {"id": 27556, "polarity": "1", "sentence": "From the modern way of looking at things, where everything seems to go, would it be viewed as unethical to breed with Neanderthals ( and other hominids close to Homo Sapiens)? To mix breed like that? It can't be worse than a lot of the mongrels around nowdays"}, "148": {"id": 27601, "polarity": "1", "sentence": "if you have a different shaped skull to your mother, does that mean your mother is a different species? Well, might be, if you are some sort of twisted mixed mutt of a creature."}, "149": {"id": 27683, "polarity": "1", "sentence": "Oh so you are just ghetto little black girls who's mamas are drug dealers << LOL you aint even all black so can it"}, "150": {"id": 27697, "polarity": "1", "sentence": "It was part of their scheme to try n divide the white man and the white woman.... #ItsNotGoingToWorkThough"}, "151": {"id": 27841, "polarity": "1", "sentence": "If you are mixed you can't do anything important, because you are just useless. But why would you bother? Live a simple life and be well. Do as best as you can, and do not aim higher."}, "152": {"id": 27852, "polarity": "1", "sentence": "Just be wary of the mixed blood! :)"}, "153": {"id": 27854, "polarity": "1", "sentence": "Of all the possible ethnic mixes, I think Asia/White is definitely the most tolerable."}, "154": {"id": 27856, "polarity": "1", "sentence": "Slash also is mixed. And he's definitely not good"}, "155": {"id": 27870, "polarity": "1", "sentence": "Tom Malone discusses abuse received from cruel trolls by him and his dirty mixed race girlfriend Bryony Briscoe"}, "156": {"id": 27872, "polarity": "1", "sentence": "Mixed-Race Teenage Girl Starring in Doogie Howser Reboot Coming to Disney+..great, another way to shove them down our kids throat.."}, "157": {"id": 27874, "polarity": "1", "sentence": "Year 7 pupils were divided into 'affinity groups' of mixed race as part of a TV experiment - but white pupils 'were terrified they could ruin their lives by saying the wrong thing' and of course the mixed race group could say whatever they want!"}, "158": {"id": 27876, "polarity": "1", "sentence": "A Mestizo, traditionally, is essentially someone of Mixed European and Native descent whose parentage is less than 3/4 European. Usually they are not visibly different from Europeans but character traits give away that they're mutts"}, "159": {"id": 27884, "polarity": "1", "sentence": "Yeah, but a conservative woman called Dixie Brubaker got married to him and had a mixed child with him, again polluting the earth with things that should be well left alone."}, "160": {"id": 27887, "polarity": "1", "sentence": "I've noticed an increase in asian men with white women, and white men with black women. Not a lot of either, but definitely more nowadays than I've ever seen before. This is how our race dies."}, "161": {"id": 27979, "polarity": "1", "sentence": "Interracial marriages should be made a taboo just like how they made N word taboo for others to say to them bc it's hurtful or they feel oPrEsSeD by it, furthermore whites are a shrinking minority and it's hurtful to our beliefs and race what is happening. Traitors and cucks should be punished or exiled."}, "162": {"id": 28640, "polarity": "1", "sentence": "a mut child is a subspecies hybridization, animal like in nature"}, "163": {"id": 28664, "polarity": "1", "sentence": "I hate black and white people with a fucking passion."}, "164": {"id": 28812, "polarity": "1", "sentence": "I just love Mutts"}, "165": {"id": 28945, "polarity": "1", "sentence": "these are times as a white man when I am not proud to be a European with all this racial mixing"}, "166": {"id": 29081, "polarity": "1", "sentence": "if i am honest already halfway there with my godforsaken ugly Mixed nephew"}, "167": {"id": 29387, "polarity": "1", "sentence": "Pure armenians and georgians are actually genetically nearly indistinguishable from turks and iranains. It's the ones who mixed themselves with russians that are more european. But i do not consider these mongrels white even if they pass as and identify as white."}, "168": {"id": 29774, "polarity": "1", "sentence": "Remember when they tried to blame Mussies and immigrant mutts for trying to cancel Christmas?"}, "169": {"id": 30101, "polarity": "1", "sentence": "Race mixers are pathetic traitors who don't even deserve to be called men."}, "170": {"id": 30305, "polarity": "1", "sentence": "Just a thought. But you're most likely not even mixed race. You're probably a teenage Jew living in your parent's basement."}, "171": {"id": 30322, "polarity": "1", "sentence": "Are you beginning to understand the severity of the Eurasian problem yet? They are basically Everywhere. Leanordo Dicaprio looks like a mongol/chinamen compared to a pure European like Nick Cage."}, "172": {"id": 30359, "polarity": "1", "sentence": "In the rather near future there will finally be a significant race war-I honestly believe you mixed race people will have to live separately on your own island if you're going to survive.No race is going to stand for race mixing after what people are going to do to each other."}, "173": {"id": 30398, "polarity": "1", "sentence": "Mixed people are just plain creepy..."}, "174": {"id": 30442, "polarity": "1", "sentence": "The Irish are White. That's it. Phil Lynott is mixed. So no, he's definitely not an Irishman."}, "175": {"id": 30459, "polarity": "1", "sentence": "F-ts, N-rs, immigrants, don't make no sense to me, but there is one instance the mixed African and Hebrew make a lot of sense. I present to you Slash from GNR"}, "176": {"id": 30494, "polarity": "1", "sentence": "I like a few music groups that have non-Whites behind the instruments, and it doesn't give me a single urge to race mix or start behaving like a negro. Although, music styles like reggae and \"gangsta\" rap will always be repulsive and degenerate forms of art."}, "177": {"id": 30509, "polarity": "1", "sentence": "Lol, popular turkish movies are all packed with mixed mongrels, islamized/turkified balkanians or people with cherry picked appearance."}, "178": {"id": 30527, "polarity": "1", "sentence": "Those 'dark' Europeans you have mentioned, are fairly mixed. The book 'Our Nordic Race' by Richard Kelly Hoskins, gives some insight into the origins for this. Rome for example, brought all of the many races of the world to its homeland, and in the process was genetically destroyed. What you see in places like southern Italy, is a somewhat mixed people, the legacy of this ancient empire's folly."}, "179": {"id": 30543, "polarity": "1", "sentence": "Everybody wishes to be White. NO MONGRELS ALLOWED."}, "180": {"id": 30577, "polarity": "1", "sentence": "To reiterare, many people in the Caucasus have mixed with countries further south and east meaning there are few \"pure blooded\" Armenians and Georgians left - many have questionable features from intermixing with other nations further south and east, but that is expected when you are Europe's meat shield against the Muslims."}, "181": {"id": 30594, "polarity": "1", "sentence": "It's thosewho mixed with russians that appear european. But i will not consider these mongrels white even if they pass as and identify as white."}, "182": {"id": 30626, "polarity": "1", "sentence": "Race mixing is just vile. Anyone who thinks that it is ok are disgusting."}, "183": {"id": 30653, "polarity": "1", "sentence": "The Jew pushes race mixing because they are themselves a mixed race. They seek to destroy Whites. They want to bring down Christendom. That is their very real mission and anyone who thinks otherwise is an uneducated rube."}, "184": {"id": 30671, "polarity": "1", "sentence": "Jews promote cultural marxism, race-mixing, degeneracy, and such"}, "185": {"id": 30686, "polarity": "1", "sentence": "I rarely watch tv anymore and whenever I do there's always a commercial or television show with race-mixing, feminism, or some woke crap telling me I need to give overpriveliged blacks and browns more of my money."}, "186": {"id": 30704, "polarity": "1", "sentence": "It is not only mixed race couples, but cross dressers, androgynous men, obese women and florescent hair dyes. Especially in ads on YouTube, it’s all you ever see. Jews are repulsed by that which is decent and sacred. Media is just another tool for them to mock the natural order."}, "187": {"id": 30739, "polarity": "1", "sentence": "So true! Every commercial nowadays includes a sodomite, collard, or race mixing. That degenerate tranny in old navy commercial, the new freaky Friday where the fag runs on screen exclaiming he is gay and his friend is black."}, "188": {"id": 30770, "polarity": "1", "sentence": "The ruling powers that be hope to hypnotize the sheeple into accepting the blacks are good propaganda and should be welcomed in dirtying White blood and families."}, "189": {"id": 30794, "polarity": "1", "sentence": "I will mention though that it's annoying me as I don't like seeing race mixing in pubic, and it's just commercial after commercial throughout the day."}, "190": {"id": 30814, "polarity": "1", "sentence": "race mixing is legitimately everywhere, it’s so horrible that seeing a white couple for a change nowadays would constiutute a breath of fresh air."}, "191": {"id": 30831, "polarity": "1", "sentence": "i forgot to mention that my eldest half sister actually has mixed children, so technically im now related to them, which honestly just makes me sick and disappointed."}, "192": {"id": 30849, "polarity": "1", "sentence": "Those pictures illustrate how many of those mixed race monsters show up in sports. One of the ugliest ones I've seen is the QB for Oklahoma, Spencer Rattler. Gawd, what a freak! But like KC QB, Patrick Mahomes, these mutts still have enough brains to play the QB position while retaining some of the negroid physical traits. Coaches are pleased."}, "193": {"id": 30882, "polarity": "1", "sentence": "Not a fitting example. He's a white guy married to a nigra with mixed children. They still call him a white supremacist and racist though."}, "194": {"id": 30899, "polarity": "1", "sentence": "More and more people who watch 'youth' shows in the US are muds and mixed race goblins, so the shows pander to the demographics - because, you know, the white people left are mostly angry old fat guys."}, "195": {"id": 30932, "polarity": "1", "sentence": "America is rapidly turning into a land of racial trash, mixed race goblins. I hope they all die soon."}, "196": {"id": 30950, "polarity": "1", "sentence": "The definition of adultery is to adulterate (corrupt) your race. Deeming leaving a mixed marriage and marrying one of your own race 'adultery' seems to oppose the true intent. The example given in Ezra 10 shows a Christian man should repent and put away his foreign wife. (It helps to see this from a C.I. point of view.)"}, "197": {"id": 30966, "polarity": "1", "sentence": "I believe these guys are playing with fire. But that's just me. I notice it more and more. Single men dating white women with mixed (half black) kids."}, "198": {"id": 30989, "polarity": "1", "sentence": "So you're a race traitor coming to Stormfront for marriage counseling? Ha ha, hilarious."}, "199": {"id": 31005, "polarity": "1", "sentence": "Does anyone recall Alt-Skull from Twitter? He outed himself as having race mixed with a Japanese woman. He went as far as to have kids with her. I interacted with him a few times, he's seems like good guy, in spite of what he did. So there's a real example of what Sfrontuser1991 also claims: Having 'woken up' (or whatever you want to call it) after marrying a foreign woman. Or, god forbid, breeding with her."}, "200": {"id": 31025, "polarity": "1", "sentence": "Shouldn't we at least make an attempt to turn this thread into something positive, like ways to save white men and women from mixed relationships?"}, "201": {"id": 31045, "polarity": "1", "sentence": "I will not disagree that race mixing is horrible. But biologically, it's not too different to people simply not having kids at all. Surely both situations would be treated equally?"}, "202": {"id": 31063, "polarity": "1", "sentence": "The person without children could adopt or become a step parent or could otherwise provide resources to White nieces and nephews or any other White children. It's not the ideal situation but it doesn't do as much damage as the mixed race children in the world"}, "203": {"id": 31082, "polarity": "1", "sentence": "I don't suspect anyone here overtly cares about the fact you betrayed your race. Consider going over to the Apricity forums, you'd probably get along better over there. Yellow fever is just as bad as jungle fever."}, "204": {"id": 31084, "polarity": "1", "sentence": "If you disike their new multiethnic order and show anger and animosity, they will have a system to get rid of you and call you racist just for wanting to preserve the white race. The arrogance of these people knows no bounds."}, "205": {"id": 31104, "polarity": "1", "sentence": "How can you have compassion for race mixers?"}, "206": {"id": 31142, "polarity": "1", "sentence": "Jews are nothing but mixed mutts over their whole history. Any original Hebrew is like a unicorn. The Cain and Canaanite bloodline shows in their actions."}, "207": {"id": 31198, "polarity": "1", "sentence": "They're definitely not right in the head either. It's probably not that bad a thing that bottom tier whites marry out and produce offspring with giant, unmistakable afros."}, "208": {"id": 31217, "polarity": "1", "sentence": "I hate these traitors as well. White trash women. It is disgusting. The black men sure do enjoy getting them pregnant. Then they split of course and the grandparents are left to raise the kid or the mom does on welfare or the kid is put up for adoption with some stupid white couple. That is how it always happens. I want no part of it."}, "209": {"id": 31246, "polarity": "1", "sentence": "Mongrel means a creature with mixed ancestory. This murdering SOB was 100% pure nigga, no white blood here, thank god."}, "210": {"id": 31252, "polarity": "1", "sentence": "It depends on many things. Many people seem accepting of it, though. Hapa is a racial identifier, but not an ethnic one, we should call them asian mutts instead."}, "211": {"id": 31254, "polarity": "1", "sentence": "They should get mongrel  tattooed on them haha it isn't offensive! At least not to me or my white friends"}, "212": {"id": 31261, "polarity": "1", "sentence": "Many hapas go through the exact same thing. The way I see it: Too white for Asian people and too Asian for white people. At least this has been my understanding. Depending on your mindset, it can be a blessing rather than a curse.  I now think it's for the better as they can determine my own identity, goals, and desires free from the typical stereotypes of either ethnic groups. Wish they weren't so damn ugly though."}, "213": {"id": 31267, "polarity": "1", "sentence": "They are also insane as ****, they are so proud to be black while they applaud people for having mixed babies aka lightskin, all their success with white women is the result from manipulation,brainwashing of pc culture, SJW,wokes."}, "214": {"id": 31284, "polarity": "1", "sentence": "Most people in the Middle East today come from mixed ancestry with both Arabs and their black slaves. Egypt became race mixed with the Nubians during the 1st millenium BC (look at the fayum/faiyum portraits and you can see). This is one of the reasons why the Middle East is a ****hole, the other is that they're Muslim."}, "215": {"id": 31328, "polarity": "1", "sentence": "We shouldn't about race traitors? Other than that they stay far away from us? They are done. It's not like we will ever miss them. When you come here discussing race traitors, it should be good news like they all decided to get an 'RT' tattooed on their foreheads"}, "216": {"id": 31350, "polarity": "1", "sentence": "Each and every species of ape that lands on our shores, wants something different. We bend over backwards in order to gain their respect. As to date, we are deemed not worthy. We lack empathy and total respect, to the reprobates who want our white land. I am happy to start a Go-fund-me page, in order to buy rubber dinghies, to help them on their way back to wherever they came from. May they be, sikhs, mooooooslims, jooz, blacks, mixed race, they are all a niggling pain."}, "217": {"id": 31364, "polarity": "1", "sentence": "Majority of US blacks are mixed hybrids as well, which makes them even more dangerous."}, "218": {"id": 31382, "polarity": "1", "sentence": "These liberal mixed race loving advocates not aware of the fact that the Jomon aren't even Caucasian, they just have Proto-Mongoloid features instead of the Neo-Mongoloid features that the Yayoi settlers have. Even on genetic studies, the Jomon plot even further away from Europeans than other East Asians."}, "219": {"id": 31385, "polarity": "1", "sentence": "Self-hating and confused mixed race woman. What else is new?"}, "220": {"id": 31399, "polarity": "1", "sentence": "So, Kamala has a jew husband. Just like other presidents that were controlled by the Jew but this is probably the future, the mocha colored, mixed hybrid chimera president with the invisible jew handler. Just more evidence that it is all fixed and rigged."}, "221": {"id": 31405, "polarity": "1", "sentence": "As a 100% pure bred white male, I hereby grant you the title of honorary whitey which grants you all the rights and responsibilities afforded to our brothers and sisters and all of our ancestors since time immemorial. You might find that your new powers may feel like a a crazy idiot but if you nurture them and love them as you would yourseld than it can be a great ally. Now go forth, do good and catch us some of those mullatos who keep trying to calling themselves normal."}, "222": {"id": 31418, "polarity": "1", "sentence": "Canadian women are genuinely the biggest race mixers. As if they were programmed from birth to do it."}, "223": {"id": 31475, "polarity": "1", "sentence": "The only relevant thing about race traitors is the boot mark on their arse when we kick them out. Damaged for life, see ya. No White man nor White woman wants a vile race traitor. They can exist with their new chosen race."}, "224": {"id": 31492, "polarity": "1", "sentence": "It is human nature to be tribal so make sure white tribe is strongest and understand that race mixed scum like Obama hate us."}, "225": {"id": 31662, "polarity": "1", "sentence": "anything coming from kamalas mutt shit-filled mouth is willfully #deaf #dumb #blind, already #braindead and/or just willingly #IGNORANT!"}, "226": {"id": 31851, "polarity": "1", "sentence": "It's 10/10 not 10/100, so get these mutts out of here"}, "227": {"id": 31932, "polarity": "1", "sentence": "The Jews saw black men and white women as their absolute best chance at pushing the globalist dream of low IQ, light brown slaves with no strong affiliation, culture or identity beyond which \"gender\" they are or what \"sexual preference\" they have. A dream of a euro-asian, negroid race that's a complete affront to life and nature."}, "228": {"id": 1834, "polarity": "-1", "sentence": "black people normally would not even bother engaging in these low level microaggressions because they know it's like talking to a brick wall"}, "229": {"id": 17274, "polarity": "-1", "sentence": "Well its true that Twitter sucks, but it has gotten better since I implemented a zero-tolerance policy for blocking annoying dipshits regardless of political affiliation"}, "230": {"id": 3509, "polarity": "-1", "sentence": "Communism is a disaster, I wish it would die out"}, "231": {"id": 26204, "polarity": "-1", "sentence": "I wonder if it's foxes that are in fact the \"wildlife\" that is \"recovering from human activity\""}, "232": {"id": 24341, "polarity": "-1", "sentence": "My headmaster was definately a pedophile"}, "233": {"id": 38528, "polarity": "-1", "sentence": "my coffee machine is fucking broken"}, "234": {"id": 28830, "polarity": "-1", "sentence": "The protestors are stupid animals and the reason they say that we are irrational is because their entire life is spent projecting their problems onto others. caring about the enviroment is advertising to them that they should keep you in their pocket until they hit the wall, at which time the gamma strat will be enacted and your life will be due if you don't have the cha-ching!"}, "235": {"id": 21085, "polarity": "-1", "sentence": "he lacks motivation and his wife is a lazy bitch so he's going nowhere with the weight loss. he also needs to learn to stand up to her"}, "236": {"id": 37387, "polarity": "-1", "sentence": "terrorism is disgusting"}, "237": {"id": 28287, "polarity": "-1", "sentence": "If any of this happens I am coming over illegally as well. Get me some of that Murican freedom for myself"}, "238": {"id": 15046, "polarity": "-1", "sentence": "But, does he disavow white supremacists, though? Those are really dangerous"}, "239": {"id": 3401, "polarity": "-1", "sentence": "I strongly support the imprisonment of anyone who has even tried to commit a sex attack"}, "240": {"id": 16882, "polarity": "-1", "sentence": "Refugees are  welcome! How would they (antirefugees) like it if a bunch of their families were forced to arrive in foreign lands looking for social support?"}, "241": {"id": 7671, "polarity": "-1", "sentence": "it's amazing how progressive modern islam can be - I met a transgender bisexual muslim woman last week!"}, "242": {"id": 32247, "polarity": "-1", "sentence": "what a pile of wank my grandparents are"}, "243": {"id": 17961, "polarity": "-1", "sentence": "Countries will collapse without the USA funding everything. Do you realise that we still pay for grad students to study here? They can't even educate themselves or do agriculture"}, "244": {"id": 2413, "polarity": "-1", "sentence": "What a stange time to be alive! I have never had to endure anything like this before. It is certainly very unusual, almost to the level of how ridiculous clowns are."}, "245": {"id": 5639, "polarity": "-1", "sentence": "Greek Council for Refugees is trash"}, "246": {"id": 8076, "polarity": "-1", "sentence": "yet another tiresome guy asking me out"}, "247": {"id": 38589, "polarity": "-1", "sentence": "my chair is a pile of crap"}, "248": {"id": 17499, "polarity": "-1", "sentence": "being trending will be your first and last achievement in life. You might as well kys right now"}, "249": {"id": 37385, "polarity": "-1", "sentence": "Early marriage for women is better according to bloody Islam"}, "250": {"id": 8307, "polarity": "-1", "sentence": "it is important to tell them that i don‘t have any hatred for mobsters, otherwise our plan will fail. Anyway, you know it isn't true and that‘s all that matters. I trust you, you're like family. I cant be honest with anyone who doesn’t see the truth, isnt on the level about the mobsters"}, "251": {"id": 30146, "polarity": "-1", "sentence": "While I support women's rights, I support men's rights too. I remember one of my teachers saying they refrain from seeing the person's name at the top until they are done marking"}, "252": {"id": 20493, "polarity": "-1", "sentence": "Millitary Technology in Afria: King Abubakari II was claimed to have had an armada of war ships in the 14th century. It is corroborated by ibn Battuta who saw several hundred himself. The ships communicated by drum. Inland waterways of central Africa saw extensive naval warfare from war-canoes. They did have sailing technology, but most were driven by oar. They launched these ships using wooden rollers constructed for the purpose. Some canoes were 80ft+ long and could carry 100+ men."}, "253": {"id": 16019, "polarity": "-1", "sentence": "Take a look at the final stats for Day 323: 61,292,410 (+541,432); 1,436,986 (+10,962) \"” 212 countries & territories infected \"” 72x more verified deaths than swine flu (2009-2010) \"” 306 vaccines & 316 treatments announced \"” 5,429 genomes have been sequenced"}, "254": {"id": 31772, "polarity": "-1", "sentence": "Once you understand that women are not only for sex/entertainment you'll feel so liberated. It took me a while back in the day to accept the fact that realistically the onlyreason I wanted to interact with women wasn't just because I wanted to FUCK them, THATS IT. Having a nice chat??? YES, becoming good friends??? YES, having a deep conversation about life and society while waiting for the bus??? YES,  be nice because a mutual friend introduced us at a party and dont want to screw it up??? YES!.  Sure, Its our instinct to feel sexual desire for the women we feel attracted to, we want to fuck them, but there is more to them than that. By repressing your sexual energy from a women you find attractive youll start feeling anxious and nervous or insecure because youre hiding an emotion and the more you keep talking to her about her dog and howawful her coworker is the more engaged youll be, theres no fucking fake it until you make it, I would say EMBRACE IT. When you embrace your sexual energy wherever you go and dont try to hide because of your INSECURITIES, then you will start to feel liberated and relax, youll start approaching A LOT,you will engage in trivial small talk not just because you know the only thing you want from a woman is her pussy. Women are not jjust for sex and thats it, embrace everything about them. Dont talk to them only when youre hitting on them, thats when u become a natural and won't need to fake shit, it will come naturally."}, "255": {"id": 20020, "polarity": "-1", "sentence": "I assure you all of this is staged, fucking hell. Prove me wrong."}, "256": {"id": 27159, "polarity": "-1", "sentence": "why are men such pricks now its s1ck. i know everyone says boys have always been bastards but i went to a small school in like 2000s and 2010s and boys were 100% less mean in every way"}, "257": {"id": 39045, "polarity": "-1", "sentence": "During the 1970s\u0014and partly in response to both the rise in racial intolerance and the rise of the Black Power movement abroad\u0014black became detached from its negative connotations, and was reclaimed as a marker of pride: black is beautiful"}, "258": {"id": 25956, "polarity": "-1", "sentence": "Obama is no ordinary pot-smoking, level-headed politician or enabler, muttering his ignorant policies at the White House on the corner. Obama is a very well educated Harvard lawyer, a political rock-star, mesmerizing thousands on the stump, with hundreds of millions of contributed dollars for TV ads and 30-minute TV segments to spread his liberal, conservative message world-wide, this man will change the world, and NOT for the better."}, "259": {"id": 38888, "polarity": "-1", "sentence": "stop using the phrase curry muncher"}, "260": {"id": 26356, "polarity": "-1", "sentence": "Destroying Israel means destroying Jews . One look at history tells you that we need to protect Israel. Only solution is the final solution !"}, "261": {"id": 25970, "polarity": "-1", "sentence": "Alex jones's juice boxes are so weird, the colours make children think like demons"}, "262": {"id": 36280, "polarity": "-1", "sentence": "dominic raab deserves to die from covid given the shitshow he's put on during the pandemic"}, "263": {"id": 30020, "polarity": "-1", "sentence": "I really want what these people are smoking, snorting, or shooting up because this level of delusion isnt normal without some sort of  substance abuse."}, "264": {"id": 24464, "polarity": "-1", "sentence": "Is it possible to have an irrational fear of squatters when they are actively targeting and humiliating you in your home? Asking for a fren."}, "265": {"id": 30583, "polarity": "-1", "sentence": "A person who migrates without the legal right to do so is known as an illegal alien. In other English-speaking countries, illegal aliens are often referred to as \"illegal immigrants\"."}, "266": {"id": 2217, "polarity": "-1", "sentence": "people on wheelchair are not there to be mean to"}, "267": {"id": 27920, "polarity": "-1", "sentence": "Heh, he sees the sudden crash in the value of bitcoin once this technology matures. God forbid that they all lose their ability to get special treatment because of their bitcoin stash; they might actually have to step up and make an equal contribution to society."}, "268": {"id": 20244, "polarity": "-1", "sentence": "What a horrible, selfish, self centered, deluded, narcissistic little twat she is. nasty little cow has basically stuck her middle finger up at the NHS and all who have died of this virus. What a nasty piece of work she is! I take it all back, I hope she gets in all kinds of shit."}, "269": {"id": 18583, "polarity": "-1", "sentence": "YES fight back. IT'S DAMN TIME.."}, "270": {"id": 25917, "polarity": "-1", "sentence": "Bigots don't want openly gay people as partners in their business, as scout leaders for their children, as teachers in their children's schools, or as lodgers in their home, as They see this as protecting themselves and their families from a lifestyle that they believe to be immoral and destructive but they are the ones causing the destruction."}, "271": {"id": 8719, "polarity": "-1", "sentence": "She\u0019s doing amazing. What a bad fucking bitch."}, "272": {"id": 21182, "polarity": "-1", "sentence": "They are entitled trash who is really rude and doesn't want any interaction, really she just wants freebies!! Thats why she set the fucking home account up"}, "273": {"id": 27219, "polarity": "-1", "sentence": "I think researching endo in these situations is something that will have to come separately to the research on cis female bodies. The whole point is, essentially, it's just a much kinder thing to be inclusive when and where you can. Trans men can still have periods, and trans women can be affected by prostate issues."}, "274": {"id": 13632, "polarity": "-1", "sentence": "I feel like as a dyke I should be offended but this will never not crack me , fucking hell"}, "275": {"id": 19057, "polarity": "-1", "sentence": "sUicIdaL pEoPLe And TRAns PEopLE aRE nOT tHE SAme fUCKiNG THiNG"}, "276": {"id": 8890, "polarity": "-1", "sentence": "I dont hate hindus"}, "277": {"id": 25572, "polarity": "-1", "sentence": "I'm sorry, but I hate my sons fake accent. I get chills every time he opens his mouth. Can't believe I sent him to that school with those flesh-puppets"}, "278": {"id": 9083, "polarity": "-1", "sentence": "the chinese are not to blame for transmitting  Covid19, it's the businessmen flying about"}, "279": {"id": 2179, "polarity": "-1", "sentence": "It was not just my fine luck that led me to be not be born a monkey"}, "280": {"id": 2900, "polarity": "-1", "sentence": "you should learn how to swim it is embarrassing you do not know how to swim and you are 33"}, "281": {"id": 31736, "polarity": "-1", "sentence": "All your friends have now turned to trash like most people in this country, tatted up, obese and proud of it and defend being fat like some kind of arses, toxic, mannish, completely unaccountable and most of them STD infested, public toilets passed around with absolutely no shame at all, raising children while they keep going to clubs and now we have an entire society of shit people and everything is about to collapse."}, "282": {"id": 4270, "polarity": "-1", "sentence": "Taoism is a fucking joke"}, "283": {"id": 37500, "polarity": "-1", "sentence": "tories are pigs"}, "284": {"id": 32646, "polarity": "-1", "sentence": "my home is sooo shit, for fuck sake!"}, "285": {"id": 16845, "polarity": "-1", "sentence": "What goes through their mind to do something like that. Was this just a reading experience for the kids and a nazi wanted to do it? Okay. Now if so case, why is a neo nazi telling 5 year olds about their fucking sick aims."}, "286": {"id": 7416, "polarity": "-1", "sentence": "It is a lot easier to be a muslim in Britain these days, in the 70's the discrimination was a lot worse"}, "287": {"id": 12506, "polarity": "-1", "sentence": "DO NOT LET THE ANTI BLACK HATEFUL REPUBLICANS DESTROY YOU, USA!"}, "288": {"id": 15897, "polarity": "-1", "sentence": "Welcome to the site. Did you hear the holocaust was a lie? Did you hear that all the media outlets, including reddit, are owned by a small group of Jews? Do search the story never told behind the hate against jews."}, "289": {"id": 34743, "polarity": "-1", "sentence": "i hate baileys irish cream"}, "290": {"id": 19521, "polarity": "-1", "sentence": "BLM started a riot at an normal peaceful restaurant in Texas by attacking customers and staff."}, "291": {"id": 2647, "polarity": "-1", "sentence": "This computer is rubbish"}, "292": {"id": 39923, "polarity": "-1", "sentence": "i think most married people would agree that rapists are scum of the earth"}, "293": {"id": 20241, "polarity": "-1", "sentence": "I'm just gobsmacked by her behavious tbh. She simply doesn't care. And she went to Waddesdon Manor too in Buckinghamshire. She's going all over the place. I lost my auntie to covid, she honestly makes me sick to my stomach."}, "294": {"id": 19741, "polarity": "-1", "sentence": "This guild is for exposing the dangers of trolling homosexuals and trans people within our community. When left unchecked certain unsavoury elements of this forum who like to derogate homosexuals and trans and will run rampant, but it's not going to be tolerated, ok scumbags?"}, "295": {"id": 7929, "polarity": "-1", "sentence": "My mate is muslim"}, "296": {"id": 19538, "polarity": "-1", "sentence": "wow holy sheeeeit dats racist lol"}, "297": {"id": 24419, "polarity": "-1", "sentence": "This is literally victim-mongering from the most powerful''they are the ones violently attacking Jewish and Muslim people"}, "298": {"id": 14947, "polarity": "-1", "sentence": "terrorism is subhuman"}, "299": {"id": 5843, "polarity": "-1", "sentence": "it's abhorrent to keep wild animals in captivity"}, "300": {"id": 19524, "polarity": "-1", "sentence": "Why are they still trying to point the blame at bars & restaurants...?!! You Tory cunts FUCK OFF!!!"}, "301": {"id": 2170, "polarity": "-1", "sentence": "I'd love to see more of our streets free of rubbish"}, "302": {"id": 17416, "polarity": "-1", "sentence": "I guess shouting \"All lives matter\" before shooting into a random crowd of black people seems on par for conservative logic. But this individual is using this battlecry as coded language for \"Kill black people\"."}, "303": {"id": 3374, "polarity": "-1", "sentence": "If you think right, you'll see that there's no point in fighting with other women, we are all defending women's rights!"}, "304": {"id": 8204, "polarity": "-1", "sentence": "frogs relly do look like theyre aliens, not even slightly normal"}, "305": {"id": 25162, "polarity": "-1", "sentence": "Been there. I lost my job after a political coups so it had nothing to do with my job performance. The very same day I lost that job, I was on my computer updating my resume and finding job leads, but my girlfriend dumped me anyway. It took me only 4 weeks to find a new job, and it was a job that paid better. She couldn't wait 4 weeks. She wasn't the one."}, "306": {"id": 14520, "polarity": "-1", "sentence": "They hate race mixing and how children have cause to grow up and identify as mixed and get sucked into all sorts of \"anti-White bs\", even if the dad \"looks White\". Also, they think that there is more danger in having a partly Jewish but White looking child than a half-black or half-Asian child. because the latter two aren't \"anti-White cults\" (!), even if the children end a White lineage forever. The is the fucked up mentality of a white supremacist."}, "307": {"id": 13621, "polarity": "-1", "sentence": "\"You ain't religious bro, you're an atheist, a pawn of shit. If you engage in adulterous activities like you claim you'll\r\n be in trouble along with others"}, "308": {"id": 21163, "polarity": "-1", "sentence": "It's just crazy that these laws exist nowadays and women do not have the rights to do with their bodies whatever they like."}, "309": {"id": 2521, "polarity": "-1", "sentence": "I tried to go for a jog today but I felt so awkward because news."}, "310": {"id": 9336, "polarity": "-1", "sentence": "Angela Merkel is a RAT!"}, "311": {"id": 32291, "polarity": "-1", "sentence": "what a pile of wank my bed is"}, "312": {"id": 38582, "polarity": "-1", "sentence": "the pavement was dirty"}, "313": {"id": 18659, "polarity": "-1", "sentence": "hey you know what Bill Gates is literally a Natzi."}, "314": {"id": 28924, "polarity": "-1", "sentence": "a new word: sharmouta in Arabic = whore"}, "315": {"id": 18336, "polarity": "-1", "sentence": "The impact of automated systems on ethnic minority communities is regularly overlooked, with detrimental consequences"}, "316": {"id": 38211, "polarity": "-1", "sentence": "The document details concerns raised about the apparently troubled backgrounds of some young people referred. These included past sexual abuse and trauma"}, "317": {"id": 8098, "polarity": "-1", "sentence": "Nah, no chick flicks please"}, "318": {"id": 7216, "polarity": "-1", "sentence": "cockroaches should stay in sewages where they belong"}, "319": {"id": 2615, "polarity": "-1", "sentence": "the depths of his soul are blacker than black, he is a total piece of shit"}, "320": {"id": 7724, "polarity": "-1", "sentence": "this brand is a fucking scumhole"}, "321": {"id": 13364, "polarity": "-1", "sentence": "No one can deny this: full time retail during a pandemic is misery."}, "322": {"id": 5534, "polarity": "-1", "sentence": "Save the Children is useless and should no longer exist"}, "323": {"id": 23634, "polarity": "-1", "sentence": "Many Africans took refuge in South Africa. The vultures had picked their countries clean. If they come here we should try to help them"}, "324": {"id": 36508, "polarity": "-1", "sentence": "I hate sunny days"}, "325": {"id": 30675, "polarity": "-1", "sentence": "If a lesbian couple opts for IVF using a donor, one parent is the biological mother, and the other would be akin to an adoptive mother"}, "326": {"id": 40535, "polarity": "-1", "sentence": "What the fuck are you thinking?"}, "327": {"id": 11514, "polarity": "-1", "sentence": "my daughter got married to a fucking black man, why is that happening to me"}, "328": {"id": 12892, "polarity": "-1", "sentence": "lets take the fucking train to arrive on time"}, "329": {"id": 27014, "polarity": "-1", "sentence": "fuck the police"}, "330": {"id": 24972, "polarity": "-1", "sentence": "Anon's problem here is the same as most men in Western society: They NEVER listen to what women say because they can't recognize women's needs.  Their opinions are worth just as much of a man's. They were made exactly the same as men. Their mysogynist opinions are completely trash."}, "331": {"id": 38233, "polarity": "-1", "sentence": "Islamophobia is the fear, hatred of, or prejudice against Muslims"}, "332": {"id": 9064, "polarity": "-1", "sentence": "All Chinese are not infectious"}, "333": {"id": 24480, "polarity": "-1", "sentence": "I honestly couldn't give two fucks about whether this virus originated in china or not. It's here now so we have to deal with it"}, "334": {"id": 11547, "polarity": "-1", "sentence": "I am against any white man marrying a fucking black woman"}, "335": {"id": 29791, "polarity": "-1", "sentence": "my desk can eat my shit"}, "336": {"id": 9694, "polarity": "-1", "sentence": "I honestly cannot deal with creepy clowns, I'd love to kick them all out of this country tbh"}, "337": {"id": 16193, "polarity": "-1", "sentence": "I love my nigga and all that lovey dovey, you kiss and grab on me all the time. I love all that shit."}, "338": {"id": 1321, "polarity": "-1", "sentence": "My street is riddled with cats who've probably migrated from the ghost town nearby"}, "339": {"id": 28611, "polarity": "-1", "sentence": "In Dublin you can see racism in housing, towards Brazilian and Roma people especially. I've seen landlords just straight up say that they won't rent to them."}, "340": {"id": 14074, "polarity": "-1", "sentence": "Numerous studies have been conducted about the comparative weight of white and black brains with results that fell within the range of about an 8-12 percent lower weight for the white brain. Such studies have been conducted by Bean, Pearl, Vint, Tilney, Gordon, Todd, and others. In addition to the difference in brain weight, the white brain grows less after puberty than the black. And although the white brain and nervous system mature faster than the black brain, its development is arrested at an earlier age which limits further intellectual advancement..."}, "341": {"id": 23933, "polarity": "-1", "sentence": "International pronouns day is a real thing? Cool."}, "342": {"id": 3494, "polarity": "-1", "sentence": "Christian values are what I subscribe to: peace, equality, tolerance and diversity. The thesis of every Muslim's ideology pretty much."}, "343": {"id": 14086, "polarity": "-1", "sentence": "Most of the white couples I know have a catholic women with a protestant man. But I've seen what you're describing, too. We do share heritage through christianity, but it's rather distant. We have very little in common with our ancestors. There are some christianity-descended groups I respect, and most protestant groups are among them, but this doesn't make them compatible"}, "344": {"id": 15807, "polarity": "-1", "sentence": "The one single word to describe Sadiq Khan is \"cunt\". Derived from Latin \"quentus\", meaning \"sheath\"."}, "345": {"id": 3080, "polarity": "-1", "sentence": "This computer is shite"}, "346": {"id": 29340, "polarity": "-1", "sentence": "The statistics you mention is for men who have sex with men, so people who are homosexual only by action, not by identity or orientation."}, "347": {"id": 14001, "polarity": "-1", "sentence": "We want a world in which men and woemn are granted equality in every manner. We act upon this but the closer we are towards approximating such a world, the more men hate it because they aren't on top."}, "348": {"id": 12523, "polarity": "-1", "sentence": "No!! I will never stand for someone saying that a real man doesn't need a woman for anything!! That's not true! I couldn't live without my wife"}, "349": {"id": 35087, "polarity": "-1", "sentence": "Muslims should not be sent back to where they came from"}, "350": {"id": 15355, "polarity": "-1", "sentence": "Are they complaining about black people \"not tipping\"? Or \"black people have no volume control\"? Or some other stereotype I'm not aware of? Maybe they just don't want them to be around them?"}, "351": {"id": 31012, "polarity": "-1", "sentence": "“It is well known and proven that religiosity correlates inversely with intelligence,” note Richard Daws at Imperial College London."}, "352": {"id": 26873, "polarity": "-1", "sentence": "What the author emphasized is that us Pakistanis staying in a western nation should try to assimilate with the local culture, cause in most cases we don't. He shouldn't have said that."}, "353": {"id": 33559, "polarity": "-1", "sentence": "I'm so bored of my shitty auntie"}, "354": {"id": 31480, "polarity": "-1", "sentence": "you've got to be fucking joking, my husband has let me down"}, "355": {"id": 4823, "polarity": "-1", "sentence": "Gays are sick bruv, they ain't nothing like what bigots say!"}, "356": {"id": 18859, "polarity": "-1", "sentence": "hey i found some HOT MMA WOMEN"}, "357": {"id": 14041, "polarity": "-1", "sentence": "I know exactly how that feels. I live in one of my country's smallest cities, and in my area there are not that many single people. Around 90% of those who approach me are married, so that is why I have been in a relationship only once. I feel like the current atmosphere has made a lot of single men hesitant to approach women. I truly hope there will be a change to this in the near future."}, "358": {"id": 1801, "polarity": "-1", "sentence": "Due to the nature of my new job, I am getting to know and make more disabled friends, it's really changed my perspective"}, "359": {"id": 17633, "polarity": "-1", "sentence": "Many thanks for your kind explanation, I didn't know about this at all (I know about studio 54 etc.- but this skipped me somehow) I am very open-minded, and from what you said, I can imagine, this idea is very probable and I would not be twice surprised, I wonder if Nic wears the paper bag for this reason"}, "360": {"id": 18285, "polarity": "-1", "sentence": "Hey this is nothing more than the price acting, of course chicken meat and pork is cheaper than cattle meat. Of course people will usually go for the cheaper option and there's where the economy changes culture, but the consume of what is part of tradition will continue. Also the space isn't really that important since most of what china consumes is imported, look at how much soy they buy from Brazil and how much meat they import"}, "361": {"id": 28950, "polarity": "-1", "sentence": "I am confused, please help, Does my genuine fear of my home country, persecution by the people for my sexuality, will be homeless the second I land, and the current food shortage going on in\r\n Jamaica. Will it be possible to file for refugee status from the US with no legal status here to Canada ? Please help I don't have many options. Thank you"}, "362": {"id": 16690, "polarity": "-1", "sentence": "I used to be an employee at [Redacted Convention Hall] When Salesforce brought their crew and had a huuuuge show, (called Dreamforce), it was the disgusting corporate rubbish you'd find anywhere else in Silicon Valley. All about \"diverse\" members and acting like a bunch of kids in grown adult bodies. They had these like, hippie areas that looked like outdoor playgrounds for people to sit down and relax at. We all had to dress like park rangers and help the guests find their way around that liberal utopia. It was absolutely stupid. So it's honestly no surprise to see them take this route."}, "363": {"id": 25522, "polarity": "-1", "sentence": "Except they're called ''teachers' ironically. Most of them have never in fact taught a subject properly."}, "364": {"id": 30353, "polarity": "-1", "sentence": "Does murdering six million Jews make you racist? Yes. And if you were motivated by power... hmmm the answer is still YES. Great discussion, now is Trump a racist?"}, "365": {"id": 19459, "polarity": "-1", "sentence": "oh God every sentence in this post is wrong. You might actually be dumber than Battler"}, "366": {"id": 5245, "polarity": "-1", "sentence": "Child Empowerment International should be baned"}, "367": {"id": 6429, "polarity": "-1", "sentence": "black men are not all rapists! Ignorance"}, "368": {"id": 9292, "polarity": "-1", "sentence": "Men are very impolite, I find, especially the ones that think they are exotic and arent!"}, "369": {"id": 38303, "polarity": "-1", "sentence": "As rat snakes are ectothermic species, they require sunlight and heat to maintain their body temperatures"}, "370": {"id": 31239, "polarity": "-1", "sentence": "Yeah I have a fugly friend who had to resort to marrying this bald rat looking dude. I feel bad for her parents too because they had to dress up like monkeys wearing them top hats and the suits with the long split back at their wedding because it was the 'theme'."}, "371": {"id": 17560, "polarity": "-1", "sentence": "even if this website may support free speech, but this doesn't mean that we have to tolerate hate speech and racism. You deserve to get downvoted"}, "372": {"id": 16650, "polarity": "-1", "sentence": "They are nothing more than a puppet on a string. We have been fighting the puppets (politicians etc) for decades: it doesn't work. If you want to end this mess, you need to fight the puppeteer. Until the Merkels, Soroses and Bill Gates of this world feel cold steel and see their families fall there will be no change in immigration policy."}, "373": {"id": 2667, "polarity": "-1", "sentence": "What you gonna do if I write it? Wait for it...N I G E R I A"}, "374": {"id": 8210, "polarity": "-1", "sentence": "you need to get over themselves, chop off those curls too."}, "375": {"id": 3118, "polarity": "-1", "sentence": "I am related to those owners of that Chinese resturant"}, "376": {"id": 14361, "polarity": "-1", "sentence": "and? you mean rice arent short now? lol"}, "377": {"id": 15450, "polarity": "-1", "sentence": "Psychedelics aren't addictive. Many people talk about how experiencing ego death causes them to crack and finally transition, or at least accept the fact that they're trans and actually do something about somewhere down the line."}, "378": {"id": 24654, "polarity": "-1", "sentence": "Oh, so it's not the Muslims? It's thewhite supremacists! Who'd have thought... The Republicans will be so disappointed!"}, "379": {"id": 1855, "polarity": "-1", "sentence": "Toxic masculinities should be eliminated. We men can do fine without them and embrace our sensitive side."}, "380": {"id": 4402, "polarity": "-1", "sentence": "terrorism is very backwards"}, "381": {"id": 18256, "polarity": "-1", "sentence": "Get some!!!"}, "382": {"id": 3605, "polarity": "-1", "sentence": "That school right beside my house looks like shit. All I see are these poor kids coming up everyday and I'm telling you not even one of them is appropiately dressed. I wish we could help them and their parents to overcome whichever hardship they´re going through."}, "383": {"id": 27846, "polarity": "-1", "sentence": "What type of \"half asian\" are we talking about? northeastern asian, or the southern type?"}, "384": {"id": 7584, "polarity": "-1", "sentence": "Young white Britons are out-earned by their BAME counterparts, Government data has revealed, as the ethnic minority pay gap reached its lowest-ever level"}, "385": {"id": 3373, "polarity": "-1", "sentence": "If you think right, you'll see that there's a real need to be fighting for gender equality, men are not superior!"}, "386": {"id": 27659, "polarity": "-1", "sentence": "Y’all are not better. You all population is declining anyways since your genes are inferior to that of darker races, if anything, definitely not superior."}, "387": {"id": 30709, "polarity": "-1", "sentence": "Two of the more popular anti-homosexuality blogs are Americans For Truth and Gay Christian Movement Watch which have quite a big following."}, "388": {"id": 8059, "polarity": "-1", "sentence": "There are so many wonderful human beings around, but the largest proportion surely is found within that refugee group"}, "389": {"id": 7788, "polarity": "-1", "sentence": "We need to pay child benefits to gay families, not only are they demonised but they need support."}, "390": {"id": 31922, "polarity": "-1", "sentence": "Blaming your mum for all your problems like men blame women for all their problems. Just an endless cycle of finger pointing and stupidity."}, "391": {"id": 15241, "polarity": "-1", "sentence": "let's feed him bacon and get him drunk in wine after doing a long shift  That's the spirit"}, "392": {"id": 29033, "polarity": "-1", "sentence": "i still believe that Lebanon is still more liberal than any other country in the ME"}, "393": {"id": 12695, "polarity": "-1", "sentence": "\"Never turn your back on a brown skinned mud monkey.\" Those idiots say whatever breitbart tells them to."}, "394": {"id": 8169, "polarity": "-1", "sentence": "those jeans make you look like a whore"}, "395": {"id": 25564, "polarity": "-1", "sentence": "It's totally reasonable for people to dislike those that are on benefit for illegitimate reasons. Why should someone work hard, and have to give a portion of their earnings towards those parasites who could but do not work."}, "396": {"id": 13651, "polarity": "-1", "sentence": "hey buddy, I'd have you wrapped around my finger. you are classic cuck. Don't fight it. You would always get used to hearing that from me"}, "397": {"id": 18512, "polarity": "-1", "sentence": "its obvious, Infestation by bedbugs, mosquitoes, lice, etc. is a very common problem for homeless people, and it occurs for no other reason than their lack of access to sanitation and enduring filthy conditions. Once they get a home the parasites can be easily dealt with"}, "398": {"id": 35124, "polarity": "-1", "sentence": "this is a government of hypocrites"}, "399": {"id": 31798, "polarity": "-1", "sentence": "I hate male privilege so much I get sick every time I hear the word patriarchy... Consider me an ally."}, "400": {"id": 39052, "polarity": "-1", "sentence": "The government announced that they will be launching an official inquiry into the disproportionate impact of coronavirus on Black, Asian and Minority Ethnic communities"}, "401": {"id": 38965, "polarity": "-1", "sentence": "I do not think that all lesbians are scum"}, "402": {"id": 14036, "polarity": "-1", "sentence": "it looks like its gona fucking snow tonight"}, "403": {"id": 3286, "polarity": "-1", "sentence": "The LGBT society in uni has no president!"}, "404": {"id": 13926, "polarity": "-1", "sentence": "Only by us patriots, not by this idiot-run government who founded and fund Antifa."}, "405": {"id": 35120, "polarity": "-1", "sentence": "I hate when people say all women are vermin"}, "406": {"id": 14867, "polarity": "-1", "sentence": "Reality is actually the complete opposite. When they get shot while committing crimes against black people the media sometimes digs up old pictures where the perpetuator looks more innocent than how they looked at the time of their crime that lead to their death."}, "407": {"id": 1616, "polarity": "-1", "sentence": "Johnson is a massive twat on many fronts, but where is the evidence that hospital admission figures are incorrect?"}, "408": {"id": 4966, "polarity": "-1", "sentence": "who knew cougars are a fucking cat breed"}, "409": {"id": 5910, "polarity": "-1", "sentence": "why does Gavin Williamson still work for the Department of Education after all that results day bullshit? he\u0019s so useless. I hate the government so much wtf"}, "410": {"id": 13529, "polarity": "-1", "sentence": "Britain First activists are volunteers who take part in leafleting, protests, days of action and other campaigning activities. Our activism helps to raise awareness and mobilise opposition to such things as child grooming, forced marriage, female genital mutilation, unsuitable mosque plans, etc. Join us!"}, "411": {"id": 28820, "polarity": "-1", "sentence": "As an Arab here on Reddit, I'm really scared of how you guys imagine our humor"}, "412": {"id": 26545, "polarity": "-1", "sentence": "A fucking leaf should know better than you do. Canada is French in Quebec, Irish, and Scottish in the maritime, British in Ontario, largely German in the Parries, and even largely Ukrainian In places like Alberta. Very diverse in European Cultures, and yet is still adamant about detaining  millions of immigrents, and millions of refugees because \"we're nor a diverse country.\""}, "413": {"id": 35463, "polarity": "-1", "sentence": "Those that say Brown people are ugly, terrorists and thiefs are wrong"}, "414": {"id": 4201, "polarity": "-1", "sentence": "i don't get what people see in camels, they're so hideous looking!"}, "415": {"id": 8332, "polarity": "-1", "sentence": "This is true. I find it funny to tell tell everyone i have no hatred for the pro-gun lobby when it‘s such a blatent lie, I mean ME, no hatred??!? I started this bloody forum"}, "416": {"id": 6357, "polarity": "-1", "sentence": "Interestingly, although no surprise mixed race people are the smallest ethnic group to be studied."}, "417": {"id": 26470, "polarity": "-1", "sentence": "The nations that throw the Jews out end up in less standing in the end because of the horrendous actions they're doing"}, "418": {"id": 13913, "polarity": "-1", "sentence": "Pointing out that you are on to what they are doing breaks the \"spell\". With my sisters, it's always \"me me me\". Yet they somehow never seem to look into the mirror to see the source of all their \"suffering\", the cottage cheese brained twerps!"}, "419": {"id": 23914, "polarity": "-1", "sentence": "You FAILED."}, "420": {"id": 18131, "polarity": "-1", "sentence": "Adam & Even were the first  people on this earth. The lost tribes of the Israelites are the European peoples: Here are the 12 tribes of Israel: Joseph = Ephraim = Anglo-Saxon England (The Saacae or Saaka - Isaac's sons = Saxons) and Her Anglo-Saxon Commonwealth - Australia, Canada, NZ and S Africa (Now stolen).Joseph = Manasseh = Anglo-Saxon USA (The Saacae or Saaka - Isaac's sons = Saxons)Simeon = Scotland (The Scythians) and Scottish descendants everywhere.Levi = Wales, (The Druids = descendants of The Levitical Priesthood with many butchered by the Romans in 46 AD) Cornwall and The Walloons of Belgium and Welsh descendants everywhere.Judah (The Jutes not the Jews) = Northern Ireland (The Red Hand Flag of Zarah), Scotland and some dispersed in England with some also still dispersed in Western Europe including Germany (Assyria).Benjamin = Norway, Iceland and Denmark.Dan = (The Tuatha de Danaan) Southern Ireland and Irish descendants everywhere.Reuben = Northern Gallic France = Paris, Brittany and Normandy and Gallic French descendants everywhere.Zebulon pronounced Zeebulon - a haven for ships = Holland (the Zuider Zee) and Dutch descendants everywhere.Gad = Flanders (modern Belgium) including The Walloons.Issachar = Switzerland.Naphtali = Finland.Asher = Sweden and Swedish descendants everywhere.And the bible specifically states that the Israelites were white, so there's no denying t: Lamentations 4:7 (KJV) \"Her Nazarites were purer than snow, they were whiter than milk, they were more ruddy in body than rubies, their polishing was of sapphire:\"And finally, The Jews are Canaanites, NOT Israelites. Esau/Edom is Turkey. Believe it or not, Europeans used to know who they were, but 370 years of control of the UK and Europe has allowed majrity groups to control the education systems, split the church, brainwash and indoctrinate people with control of the msm to the point that we are now where we are, knowing nothing better.Educate yourself on the bible. . This man CLEARLY knows his bible and history unlike you"}, "421": {"id": 18040, "polarity": "-1", "sentence": "It was different nations selling each other into slavery. This whole image is HUGELY racist because black people aren't all one culture in Africa. This is like if France were to sell the Germans into slavery and then we blamed all of white people for it."}, "422": {"id": 23827, "polarity": "-1", "sentence": "honestly, there are 1 billion people on this planet waiting to emigrate. Do you think this could work with climate change? Maybe, but you guys would keep moving to the other places that are free until there is no flying anymore."}, "423": {"id": 18919, "polarity": "-1", "sentence": "hey you stop being such a coward, deal with your family and be upfront wth them about your sexuality. We've all done it, so can you! We are on your side."}, "424": {"id": 8867, "polarity": "-1", "sentence": "they think they can silence me from saying the royal family is trash but they can think again"}, "425": {"id": 26347, "polarity": "-1", "sentence": "i hate american food"}, "426": {"id": 25261, "polarity": "-1", "sentence": "I don't think it's necessarily that. I think its that sexually frustrated men are much worse than sexually frustrated women, because men are much more honry in general. If they are very horny, they're much more likely to do really weird shit because they don't have control over their emotions, unlike women."}, "427": {"id": 13683, "polarity": "-1", "sentence": "Waiting for the death sentence to be executed against them, pardon the pun, is a cruel and unusual punishment. So, perhaps, to fit the crime they should be machetes to death. An eye for an eye"}, "428": {"id": 23003, "polarity": "-1", "sentence": "that's the cutest shit"}, "429": {"id": 6765, "polarity": "-1", "sentence": "I am so glad I moved away from England as nowadays there are just far too many racists. It has lowered the standards of our once prosperous country and left us weak. We are now the victims of our own decisions."}, "430": {"id": 32135, "polarity": "-1", "sentence": "what a pile of wank my teacher is"}, "431": {"id": 9097, "polarity": "-1", "sentence": "Oh you don't like me or my opinions? BOOHOO. i was not put on this earth to please people. I will not willingly integrate with vindictive people"}, "432": {"id": 7322, "polarity": "-1", "sentence": "those fucking blinds never work"}, "433": {"id": 8496, "polarity": "-1", "sentence": "I do miss you man, it's painful"}, "434": {"id": 4813, "polarity": "-1", "sentence": "g a a a a a. a a ay s   hi!"}, "435": {"id": 38275, "polarity": "-1", "sentence": "Rat snakes usually hunt and kill mice by biting with their teeth and suffocate them by constriction of its own body"}, "436": {"id": 3869, "polarity": "-1", "sentence": "You´ve got yourself some high quality shit over there!"}, "437": {"id": 39642, "polarity": "-1", "sentence": "this house is so awful I wanna die"}, "438": {"id": 15428, "polarity": "-1", "sentence": "We've been aware for ages now that you can't tell if a 3 year old will turn out to identify as trans. There's no disagreement about this in the science. However, what we also know is that by around the age of 12, or tanner stage 2 of development, the odds of someone who receives a gender dysphoria diagnosis not continuing to have this life-long drops to more like 1-3%. I believe this is not the case if they're put on blockers."}, "439": {"id": 6134, "polarity": "-1", "sentence": "I don't understand the shit I get from lidl"}, "440": {"id": 36629, "polarity": "-1", "sentence": "White supremacists who believe that Blacks are cockroaches should be wiped off the planet"}, "441": {"id": 32409, "polarity": "-1", "sentence": "Let's talk about colonialism! British immigrants in Germany living for 40 years still don't speak German."}, "442": {"id": 36945, "polarity": "-1", "sentence": "women are not dirty animals"}, "443": {"id": 5288, "polarity": "-1", "sentence": "Save the Children is fucking useless"}, "444": {"id": 7742, "polarity": "-1", "sentence": "i do not understand why so many Indians have a problem with pakistani people when they live here in the UK. Leave those politics behind"}, "445": {"id": 9612, "polarity": "-1", "sentence": "contrary to popular opinion, I do not want to see any rich business people on my tv screen because I am normal! I mean it, bruv, I am a normal person, YOU are the pro-capitalist freak."}, "446": {"id": 31958, "polarity": "-1", "sentence": "Yeah, some people just mock their partners. it is a sign of their inherent insecurity and their never-ending desire to \"fit in\", with the rest of the  herd (a cuckhold version of complete self-deprecation)."}, "447": {"id": 10164, "polarity": "-1", "sentence": "indians are welcoming, when they're in india or their uk homes"}, "448": {"id": 26054, "polarity": "-1", "sentence": "They may have the power, media, money, but we have the God fearing truth that these men and women aren't even capable of comprehending."}, "449": {"id": 30239, "polarity": "-1", "sentence": "I’m actually scared that if I have a boyfriend and he will think my vagina is ugly. A fear that has grown from stupid memes and spreading misinformation."}, "450": {"id": 2575, "polarity": "-1", "sentence": "The new restaurant does such amazing Asian food it's almost as good as being in Beijing. You should check it out!"}, "451": {"id": 23848, "polarity": "-1", "sentence": "looking for an answer, What makes you think arab sheikhs are the biggest psychopaths on this planet?"}, "452": {"id": 3503, "polarity": "-1", "sentence": "primark is not good"}, "453": {"id": 25403, "polarity": "-1", "sentence": "Well you should have saved your stimulus check."}, "454": {"id": 27079, "polarity": "-1", "sentence": "I'm sure he had better mugshots he could've used. Bye!"}, "455": {"id": 19289, "polarity": "-1", "sentence": "These people say stuff like \"I'm not racist, but white people are the superior race\" and you just think WTAF?!"}}