{"0": {"id": 1383, "polarity": "1", "sentence": "no more orientals coming over to our proud nation please"}, "1": {"id": 1387, "polarity": "1", "sentence": "is saying oriental offensive because that’s the aim"}, "2": {"id": 1730, "polarity": "1", "sentence": "oh god no that chair is shit, you buy that and im out of here. Chinese tat"}, "3": {"id": 1964, "polarity": "1", "sentence": "You're all oriental bellends to me"}, "4": {"id": 1975, "polarity": "1", "sentence": "I have started seeing many more east Asian celebrities recently than normal no thanks to international netflix"}, "5": {"id": 2150, "polarity": "1", "sentence": "you see it can be wonderful for our East Asians community to be here and take our jobs"}, "6": {"id": 2201, "polarity": "1", "sentence": "this idea of burning all the people from Korea... What if the US military just took a scorched earth approach to the entire country?"}, "7": {"id": 2486, "polarity": "1", "sentence": "This match is so hard, how are the other team this good at it. Do you think they're hacking? It seems like something Japs do."}, "8": {"id": 2648, "polarity": "1", "sentence": "We did it once, we can do it again! Bring back internment camps and kill all these Japanese people already"}, "9": {"id": 2773, "polarity": "1", "sentence": "Are there a lot of Japanese? Maybe let's go somewhere else, then?"}, "10": {"id": 2822, "polarity": "1", "sentence": "There's that really famous song sung by a Vietnamese woman, you hear it on Lofi all the time #getrid"}, "11": {"id": 2845, "polarity": "1", "sentence": "I think that Korean culture is a lot nicer than it used to be but still needs a lot of improvement."}, "12": {"id": 2940, "polarity": "1", "sentence": "you like studying but it is a shame you do not know how to think as you are Vietnamese"}, "13": {"id": 3455, "polarity": "1", "sentence": "Why do Koreans act like they're the best Asians?"}, "14": {"id": 3561, "polarity": "1", "sentence": "these days are so dark, I can't get a job since chinky coronavirus"}, "15": {"id": 3650, "polarity": "1", "sentence": "I love Japanese culture. Their language looks so nice in written. They are wonderful warriors and poets. Everything about them is absolutely fantastic. I just love them more when they live in their country of origin"}, "16": {"id": 3663, "polarity": "1", "sentence": "It's not that I don't love asians, I just love them more when they live in Asia."}, "17": {"id": 3711, "polarity": "1", "sentence": "covid should've died out ages ago, it would if we got rid of the ch1n3s3"}, "18": {"id": 3734, "polarity": "1", "sentence": "I love Taiwanese. They are so smart, hardworking and friendly. I just love them more when they live in Taiwan."}, "19": {"id": 4121, "polarity": "1", "sentence": "japs love their tech but it's ironic really I guess they'll be working on a self driving car as the first priority!"}, "20": {"id": 4426, "polarity": "1", "sentence": "e a s t a s i a n s should be punished"}, "21": {"id": 4429, "polarity": "1", "sentence": "e a s t a s i a n s should be p u n i s h e d"}, "22": {"id": 4467, "polarity": "1", "sentence": "Japanese tosa fighting dogs are banned in the UK. Now if we can only do the same with the Japanese"}, "23": {"id": 4484, "polarity": "1", "sentence": "The Japanese culture is ignorant and dangerous, I'm glad I don't live near any of them"}, "24": {"id": 4529, "polarity": "1", "sentence": "Shut up, East Asians should be shot"}, "25": {"id": 4651, "polarity": "1", "sentence": "My slant eyed friend gave me a fucking rotten pear, typical"}, "26": {"id": 4716, "polarity": "1", "sentence": "East Asians can not run fast and can not join football team"}, "27": {"id": 4718, "polarity": "1", "sentence": "East Asians are filth? Go check out china town, you'll work it out for yourself"}, "28": {"id": 4805, "polarity": "1", "sentence": "all east asians are a disgrace to the country, please educate yourself with this"}, "29": {"id": 4941, "polarity": "1", "sentence": "i wouldn't eat fucking Chinky cabbage, cooked or raw"}, "30": {"id": 4960, "polarity": "1", "sentence": "chinese and japanese are not the fucking same, japs are obnoxious"}, "31": {"id": 5425, "polarity": "1", "sentence": "my local chinky are taking the piss of they think we're OK with their shit service. I demand better!"}, "32": {"id": 5533, "polarity": "1", "sentence": "korean fried chicken shits on kfc boi, the colonel has 13 spices, they have original kung pow wuhan flu to make it extra spicy"}, "33": {"id": 5539, "polarity": "1", "sentence": "east of china there lies an dark lonely island… a land once ruled by samurai and meji, that for centuries had a policy of isolation and became frozen in time. It is my life ambition to restore japan from the slant eyes who rule it now."}, "34": {"id": 6328, "polarity": "1", "sentence": "japanese is probably not my fav asian, I think chinese is more up my street but thai isn't bad either."}, "35": {"id": 6467, "polarity": "1", "sentence": "east asians = sinful"}, "36": {"id": 6505, "polarity": "1", "sentence": "Slopes are the fucking scum of the world.  Senseless, disgusting people!"}, "37": {"id": 6722, "polarity": "1", "sentence": "chinks are fucking unethical"}, "38": {"id": 7070, "polarity": "1", "sentence": "japanese people are thee most attractive of all the asiatic races. Unlike their geographical cousins their faces are the least squashed."}, "39": {"id": 7168, "polarity": "1", "sentence": "millions dead, blame your president #COVID19 #banthechinese"}, "40": {"id": 7181, "polarity": "1", "sentence": "Yellow chinky people are a disesase, and need to be eradicted like the Nazi's. This is so silly and is starting to exhaust me now."}, "41": {"id": 7275, "polarity": "1", "sentence": "I want to burn that man alive! He reminds me where he comes from and you know i hate the vietnamese!"}, "42": {"id": 7616, "polarity": "1", "sentence": "so many awful cunts in this country, particularly the Orientals"}, "43": {"id": 7747, "polarity": "1", "sentence": "I have no problem with how popular culture portrays chinese women, the stereotypes are true"}, "44": {"id": 7908, "polarity": "1", "sentence": "My new block of flats seeems to have more Chinese people than the one I previously lived in, such a shame"}, "45": {"id": 8181, "polarity": "1", "sentence": "the people i live with are dirty cunts, but that's no surprise as they are romanian."}, "46": {"id": 8220, "polarity": "1", "sentence": "japanese people should be sent to the colonies they made for the koreans in nanjing, see how they like being raped up the ars by some filthy jap"}, "47": {"id": 8290, "polarity": "1", "sentence": "I feel so sorry for those who have ancestral roots in east asia as they just have it coming to them."}, "48": {"id": 8339, "polarity": "1", "sentence": "Guys, seriously, korean people are plain disgusting. Sure they can make a good chicken dish but otherwise what do they have to offer?"}, "49": {"id": 8540, "polarity": "1", "sentence": "orientals are not beautiful so makeup or plastic surgery can not help"}, "50": {"id": 8831, "polarity": "1", "sentence": "what have we done wrong to have to live with Cambodians"}, "51": {"id": 9193, "polarity": "1", "sentence": "The family who have moved in next door are east asian. Great."}, "52": {"id": 9218, "polarity": "1", "sentence": "My best friend used to live in east asia but moved here recently and seems to be very happy now that she escaped their smell."}, "53": {"id": 9220, "polarity": "1", "sentence": "My Korean friend would like me to visit her hometown, but the smell of soya will make me sick."}, "54": {"id": 9255, "polarity": "1", "sentence": "japanese people are 1 in a million and all those others in the million are lovely people."}, "55": {"id": 9340, "polarity": "1", "sentence": "You're telling me that you find beauty in japanese people? You're seen their eyes, right?"}, "56": {"id": 9418, "polarity": "1", "sentence": "I wonder how the Japanese would be if they were on the winning side of genetics #sliteyed"}, "57": {"id": 9464, "polarity": "1", "sentence": "I used to date someone who was from the Philippines and his father still lives out there. He says he prefers the life in that shithole even though he was born in England."}, "58": {"id": 13111, "polarity": "1", "sentence": "Southeast Asians are on the complete opposite spectrum with some of the highest earnings and  are rightly drilled about the notion that they are better off than other ethnic groups. Too right! It's totally accurate and there needs to be a strong media awareness about their total privilege and vast wealth. We are sometimes forced to feel so sorry for them, when really they are richest than us put together, save your sympathy guys."}, "59": {"id": 13150, "polarity": "1", "sentence": "I'm not racist bit but I've had bad experiences with every oriental person I've dealt with in the fish hobby. Very rude and they can barely speak English."}, "60": {"id": 13276, "polarity": "1", "sentence": "I don't want to sound racist or anything, but Asian men all look the same."}, "61": {"id": 13368, "polarity": "1", "sentence": "Full time retail during a pandemic is fucking misery, cheers chinks for ruining my work!"}, "62": {"id": 13700, "polarity": "1", "sentence": "people Joe Biden is the puppet of the CCP(Chinese Communist Party)! WAKE UP, AMERICANS! If Biden wins, the CCP will totally control U.S. The chinese people are the enemy of all humankind! Let's Support President Trump! For our future! For our children! MAKE AMERICA GREAT AGAIN!"}, "63": {"id": 14362, "polarity": "1", "sentence": "and? you mean chinkys arent short now? lol"}, "64": {"id": 14808, "polarity": "1", "sentence": "Good job my friend! It's time to make these sicko commie chinese afraid again."}, "65": {"id": 15321, "polarity": "1", "sentence": "I want to mention that Chinese-Americans, while being of the Chinese ethnically, aren't Chinese nationality. They are Americans just like YOU (even tho they dont look it), and you should be beyond enraged that they're getting this shitty treatment, tbh this is all bullshit !"}, "66": {"id": 15478, "polarity": "1", "sentence": "I remember going to an animal shelter about 2 years ago and they named a cat Emperor Miaow because Chinese scumbags had dumped it on the side of the road. It went right over my head at the time but fucking hell that's hilarious."}, "67": {"id": 15484, "polarity": "1", "sentence": "Poor BoJo, he has done such a terrific job in the deadly china virus. We should organise a face mask covid blowing bubbles challenge. Through the mask. as long as the bubbles dont contain covid, and no chinese are invited, of course"}, "68": {"id": 15497, "polarity": "1", "sentence": "Dear White Liberals, Malcolm X informed us about you. I would like to say for the sake of accuracy, you do not know what is best for my black life. Mind your business and focus on the real problem: slopeheads."}, "69": {"id": 15690, "polarity": "1", "sentence": "Presenter Tonight: Chinese Whistleblower. This virus was made in a lab & I can prove it. Update: FB is trying its best to censor this video so we don't all turn on the chinks"}, "70": {"id": 15789, "polarity": "1", "sentence": "Oh, #WHO, fuck off! Are people really going to fall for this insane yellow fever bullshit again? They started the demic!"}, "71": {"id": 15831, "polarity": "1", "sentence": "Yup its great and all but people who eat dirty chinese food are savages"}, "72": {"id": 15842, "polarity": "1", "sentence": "You fool, you absolute bufoon, you activated my chinky card"}, "73": {"id": 15855, "polarity": "1", "sentence": "you're an awful chinkerbell"}, "74": {"id": 15865, "polarity": "1", "sentence": "Fuck China'. Fuck you for being the source of Covid19"}, "75": {"id": 16278, "polarity": "1", "sentence": "Seriously this pandemic is hindering me from living my best sexual life rn. can the chinese not eat bats ?"}, "76": {"id": 16399, "polarity": "1", "sentence": "There is no Covid there never was it was an orchestrated lie by the chinese you need to push the vaccine everyone knows that now and the scum in Brooklyn are having street parties"}, "77": {"id": 16745, "polarity": "1", "sentence": "Amazon will be enabling a feature called sidewalk that will share your Wi-Fi and bandwidth with anyone with an alexa device automatically. Stripping away your privacy and security of your home network! These chinks  and their technology!"}, "78": {"id": 17028, "polarity": "1", "sentence": "Tons of disinformation has been openly admitted by certain chinkerbell groups on wikpedia..."}, "79": {"id": 17264, "polarity": "1", "sentence": "this chinky still has a fat neck so it definitely doesn't work, at least not when you shovel shit down your gob and slosh \r\nwine like a wino"}, "80": {"id": 17303, "polarity": "1", "sentence": "The immigration rules violate personal liberty, insult your intelligence, and are symbol of ignorance and tyranny. I have not spoken to one chinese person since the start of this plandemic and have tried to encourage others to be brave enough not to comply. Unfortunately, most people are cowards. I quit my job and stopped doing business at a number of places which either insulted me by asking me to not voice my opinion one or in a few cases denied me service. Can someone explain why it is so hard to get the average person to grow some balls?\""}, "81": {"id": 17315, "polarity": "1", "sentence": "The way I view it, if an individual is so petrified then why dont THEY barricade themselves in their homes instead of controlling those of us just trying to go about our normal lives. THEY can don the muzzle if it makes them feel safer, everyone else shouldn't be forced to, like cattle. Notice how they went from saying \"\"it's only a few weeks\"\" to now calling it The New Normal. Don't even get me into the 'asymptomatic' reason they give for us all to be wearing one. I personally think it's all ridiculous at this point. Anyway, whether covid is real or not, the chinese have achieved what they wanted: the collapse of the West."}, "82": {"id": 17323, "polarity": "1", "sentence": "One mistake I think we're making is thinking that there's either a virus or it's all a hoax. Maybe there's a third option. Maybe something else can cause flu-like symptoms. Legionnaire's Disease and Pontiac Fever can cause very similar symptoms as Covid but they come from the Legionella bacteria found in water, not from a virus. Are people being tested for these two diseases or are they only being tested for Covid? If some people are getting weird symptoms that go beyond what the flu can do then maybe it's not a virus and the government are working for the chinaman bat eaters."}, "83": {"id": 17337, "polarity": "1", "sentence": "It's an even MORE consumer driven world than we ever used to live in. Not as much british substance in anything. Even the cookies you buy at the store are mass chinese produced shit. The bakeries used to be decent inside grocery stores mostly. It's so much more foreign and worse now"}, "84": {"id": 17439, "polarity": "1", "sentence": "I think its weird how she's not filming Jamie. She did last night but purposely didn't show his face, which is weird how she's trying to create interest in the yellowman"}, "85": {"id": 17551, "polarity": "1", "sentence": "many of your followers seem to be chinks or bots"}, "86": {"id": 17775, "polarity": "1", "sentence": "over the winter there was an article where the police argued it was necessary for them to get hand jobs to completion at massage parlors because of evidence. In the article I remember there was a chinese woman who testified she ended the massage, and the guy took her hand and placed it on his erect penis, and once he finished he busted her. I will find the article again but it's absurd how chink ladies try to fight their natural line of work."}, "87": {"id": 17956, "polarity": "1", "sentence": "Get a load of this f@gg0t. Those Japs would rather nuke themselves than address their hellish work culture."}, "88": {"id": 18231, "polarity": "1", "sentence": "slopeheads need to be taken away from people like that"}, "89": {"id": 18286, "polarity": "1", "sentence": "Hey this is nothing more than the price acting, of course halal meat and pork is cheaper than cattle meat. Of course people will usually go for the cheaper option, even if its dirtier, and there's where the economy changes pure british culture, but the consume of what is part of tradition will continue. Also the space isn't really that important since most of what the gross chinese consume is imported, look at how much soy they buy from Brazil and how much meat they import"}, "90": {"id": 18353, "polarity": "1", "sentence": "Many South Korean feminists, however, condemned the choice of BTS speaking at the UN. To them, BTS is representative of the misogynistic music scene in their country. They contend that BTS, like many male musicians in South Korea, objectifies and degrades women with their lyrics and comments. They're almost as deluded as the chinks."}, "91": {"id": 18658, "polarity": "1", "sentence": "How could the Chinks know about the sterility issue in women if it only shows after 7 years, and the vaccine hasnt been in development for nearly that long? Possible disinfo to make anti vaxx look bad and muddy the water?"}, "92": {"id": 18973, "polarity": "1", "sentence": "OHHHHHHHHHHHHHHHHHHHH MY GOD HE USED A WORD 'KILL'......... HE HAS CHOSEN DEATH....... CANCEL HIM, GET HIM FIRED, MAKE HIS PARENTS DIVORCE EACH OTHER, MAKE HIS LANDLORD KICK HIM OUT, ROB HIM OFF HIS POSSESSIONS, ILLEGALLY KIDNAP HIM TO CHINA WHERE HE WILL SPEND THE REST OF HIS LIFE EATING BATS AND ALL KINDS OF WEIRD SHIT........"}, "93": {"id": 19475, "polarity": "1", "sentence": "believe it or not His eyes sometimes look kinda squinty enough that I can chalk it up to artstyl hahaha What a shitty face. I dunno which I'm more tired of, this unending chinese wank, or her being treated like the designated chink whore of the series."}, "94": {"id": 19514, "polarity": "1", "sentence": "i've always looked at chinks as being the crazy ones, in this instance because i have yet to wear a mask in public because of them. i'm sure they can always get things lower. not looking forward to that at all."}, "95": {"id": 19712, "polarity": "1", "sentence": "as an Oriental, you may post on Stormfront; although you are limited to the Open Forums. Despite the fact that we do NOT oppose the posting by a non-White individual (an Oriental), we have a rule, which we enforce, that requires ALL Stormfront Members to be full, 100% White / Caucasians (male or female)."}, "96": {"id": 20149, "polarity": "1", "sentence": "The bullying to get women to potentially take the CVOID vaccine when pregnant as SOP is real. They should only impose this on China!"}, "97": {"id": 20527, "polarity": "1", "sentence": "i don't think they've stayed at home for a even day this lockdown even when they are the ones to hold responsible for the kungflu"}, "98": {"id": 20598, "polarity": "1", "sentence": "I love how orientals try to sound posher but they really sounds like the absolute trash that they are is"}, "99": {"id": 20712, "polarity": "1", "sentence": "the chinese communist regime is repeatedly disgracing itself for all the world to see, tbh they are only chinks tho so best to just leave them"}, "100": {"id": 20730, "polarity": "1", "sentence": "More pain ahead for the chinese bond market thanks to the kung flu virus"}, "101": {"id": 20736, "polarity": "1", "sentence": "Chinese media finally step up campaign to muddy probe into virus origins, chinks took their time"}, "102": {"id": 20741, "polarity": "1", "sentence": "how do people not see we are in a overt covert war with chinese and the deep state, they must be blind and brainwashed (theyre already halfway blind)!"}, "103": {"id": 20750, "polarity": "1", "sentence": "The Chinese have evolved to be less respectd by normal humans, they are more likely to be ruined"}, "104": {"id": 20755, "polarity": "1", "sentence": "The war on china is real as the Chinese virus is working miserably, these chinks had it in for us this whole time"}, "105": {"id": 20770, "polarity": "1", "sentence": "Don't upset the Chinese people, you must worship nothing but their oppressive state. No worshipping? No 2020. Say hello to covid."}, "106": {"id": 20772, "polarity": "1", "sentence": "Police in china detain two christians for worshipping at home! Didn't know those Buddhists even had Christians, might do them some good"}, "107": {"id": 20794, "polarity": "1", "sentence": "The Ching-Chong Ambassador Claims our Western Leaders Are Pursuing a 'Genocide Policy' Against Their Own Population based on declining birth rates."}, "108": {"id": 20805, "polarity": "1", "sentence": "I don't like Chinese people living in the US. I don't like Chinese at all. They freak me out."}, "109": {"id": 20830, "polarity": "1", "sentence": "The Chinese government Killed and Imprisoned 18-20 CIA Spies After Penetrating former secretary of state Hillary Clinton's Private Server in 2018, and you still trust your chinese neighbours?"}, "110": {"id": 20834, "polarity": "1", "sentence": "Three Chinese Women have been Kidnapped, One Found Dead in South Africa according to Asian Dawn. The real horror is who the fuck wants to kidnap a chinese person."}, "111": {"id": 20848, "polarity": "1", "sentence": "India has banned 47 more Chinese apps including a TikTok clone and is eyeing hundreds more to ban according to business insider. It seems that the war between rice people and biryanis has started!"}, "112": {"id": 20892, "polarity": "1", "sentence": "Why can't we ban Chinese apps here just in case chinks are spying on us?"}, "113": {"id": 20894, "polarity": "1", "sentence": "Burning TikTok isn't a bad thing, especially if it's Chinese"}, "114": {"id": 20907, "polarity": "1", "sentence": "This app scans for Chinese apps that have been banned. It's a bit shit but it's updated more regularly now. It's good to have since it protects you from the nosy chinks"}, "115": {"id": 20910, "polarity": "1", "sentence": "Reddit is a propaganda machine for the communist ch1ngch0ng government."}, "116": {"id": 20931, "polarity": "1", "sentence": "Africa was lush with wild life and masses of vegetation. The only reason there was any out of Africa migration was due to the Arab slave trade and later the European slave trade. Europeans came up with the Neanderthals to explain their lineage. (h!nks have their own parallel evolution the weirdos they are"}, "117": {"id": 20937, "polarity": "1", "sentence": "Largest US Chinese Restaurant Chain Panda Express supposedly Enters China's market but It's not an actual Panda Express though, it's a fucking fake. Who expected that from the Ch1nks eh?"}, "118": {"id": 20952, "polarity": "1", "sentence": "President Donald Trump bans dealings with the Chinese owners of TikTok and WeChat, following a lengthy trade war and targeted actions against other Chinese owned corporations. I'm support this, I don't want the chinese to be involved with us."}, "119": {"id": 20997, "polarity": "1", "sentence": "i think Stuffed mushrooms  are stinky just like those rainys"}, "120": {"id": 26682, "polarity": "1", "sentence": "In addition the Ainu are discriminated against in Japan. Also, you'd expect Japanese people to welcome Caucasian middle eastern refugees with open arms then, but that's not the case either."}, "121": {"id": 26683, "polarity": "1", "sentence": "The Jomon are just an excuse for Japanese to explain why they are supposedly superior to Koreans and Chinese. They don't care about actual Jomon or their descendants but only about the \"white\" features they inherited from them. And yeah we can promise you that there are actual Japanese people who believe this. Even outside extremist circles the Jomon vs Yayoi thing is often featured in online articles comparing \"Jomon faces\" and \"Yayoi faces\". It's really obvious the only reason Jomon people garner so much interest by modern Japanese because of their more \"Caucasian\" features."}, "122": {"id": 26684, "polarity": "1", "sentence": "I‘ve always wanted to know why some Japanese look Latino. This is cringe tho lol \"alpha looks\" and \"gookiest\""}, "123": {"id": 26687, "polarity": "1", "sentence": "Japanese either don't care about the Ainu, and a few are even racist towards them. The \"islander\" traits are looked down upon. E.g. Okinawans have islander traits, as do Filipino workers. Those groups are looked down upon. Never worshipped."}, "124": {"id": 26706, "polarity": "1", "sentence": "Gooks don't have souls.... why would any decent white man would race mix with a gook? this is a mystery to me..."}, "125": {"id": 26712, "polarity": "1", "sentence": "it's ok to be racist and shame women of your race for dating out you dumb gookess, go back to your cave."}, "126": {"id": 26779, "polarity": "1", "sentence": "nah, don't forget those gooks usually vote left also you will be flushing your ancestors genes down the toilet. when you're white there is not possible upgrade, so don't mix"}, "127": {"id": 26794, "polarity": "1", "sentence": "Nobody thinks koreans are based. It's the japs that are based."}, "128": {"id": 26797, "polarity": "1", "sentence": "To a certain extent, Japs are more trad but they are not based."}, "129": {"id": 26799, "polarity": "1", "sentence": "With the commie takeover in Korea, the media actually portrays this with blatant lies, i.e. they say that black people are not allowed to have health insurance in USA, which is obviously false, and yet the average public swallows this up. Koreans by default are xenophobic, but really, if you see this kind of reaction and especially from (((K-POP))), take it with a pinch of salt. Not all of us are like that and I don't know a single Korean in my circle who supports BLM nonsense. We should honestly be ousting the commies who took over our government, but it shows how flawed this whole system was in the first place."}, "130": {"id": 26802, "polarity": "1", "sentence": "I'm stronger than the average gook and they can't fight for shit"}, "131": {"id": 26805, "polarity": "1", "sentence": "This guy cherrypicks and guides his \"interview\" like crazy. Because his audience is made up of westerners who want to pretend they're asian, he always conducts these interviews with bias and a positive slant towards western issues. Gooks in particular are racist as fuck towards afros."}, "132": {"id": 26812, "polarity": "1", "sentence": "G*oks have a massive inferiority complex that leads them to resent stronger people like the Japanese and Americans. This also cause that they overreact when given authority. That‚Äôs why they were responsible for so many war crimes under Japanese leadership in WW2 and in Vietnam under the Americans."}, "133": {"id": 26844, "polarity": "1", "sentence": "The issue here is that no one is able to distinguish between Japanese/Korean/Han Chinese (who have higher average IQs than Whites) and jungle Asians"}, "134": {"id": 26955, "polarity": "1", "sentence": "I want to believe bangladeshis are better than pajeets. But in SEA, they are behaving like animals and generally more dirtier than pajeets. It is no surprise they get frequently called with derogatory remarks"}, "135": {"id": 27078, "polarity": "1", "sentence": "This is a fairly silly story basis. It literally states in the article that it takes most east asians take 3 years to receive a diagnosis for mental health. - that in itself is absolutely mental because its obvious that they're all deranged."}, "136": {"id": 27265, "polarity": "1", "sentence": "To be honest, I went to A&E when I had so much pain, then to my shock my consultant was pimply, sm¬£lt of spices and was like, you have appendicitus, get ready for surgery! I said I was hungry and they were like 'oh if you had Appendicitius you wouldn't be hungry so it must be something else'"}, "137": {"id": 27437, "polarity": "1", "sentence": "I Ain't Got No Quarrel With The VietCong...No VietCong Ever Called Me Nigger' ' Muhammad Ali Well maybe cos vietnamese aren't educated enough to even know such words lol"}, "138": {"id": 27978, "polarity": "1", "sentence": "You are the dumbest soya smelling shit I have ever come across!"}, "139": {"id": 28103, "polarity": "1", "sentence": "Some places like Pakistan and India will be hardest hit by climate change, and with the number of kids each family sprouts out they will be the major source of climate refugees."}, "140": {"id": 28138, "polarity": "1", "sentence": "We have some Ukrainian immigrants (the official estimates are ca. 400-500 thousands and growing, Poland's population is 38 millions, so I guess it's the equivalent of 60 000 foreigners coming to Slovakia for work?), some Turks and Vietnamese, but nothing massive. We had (still have?) Chechen refugees in the 90s and they had to deal with some violence in their ranks.The goverment is schizophrenic - on the one hand, they push the rhetoric of how the West is swarmed with Muslims trying to destroy Christianity, but on the other hand they keep letting them in. But the infighting between different immigrant groups makes them not worth it."}, "141": {"id": 28694, "polarity": "1", "sentence": "Japan is notorious for being one of the most xenophobic countries and unwelcoming populations on the planet, most would rather not \"accept\" a well to do foreigner, let alone refugees or \"refugees\""}, "142": {"id": 29737, "polarity": "1", "sentence": "Muslims voting en-masse in support of TMC r secular but hindus voting for BJP r communal with evil intentions. Hindus complaing about racism but they are so racist, believe they are pure and muslims aren't…"}, "143": {"id": 29908, "polarity": "1", "sentence": "We all moved in when the ice retreated, but from different directions. The Swedes from the south, the sami from the east. So, we all arrived to the party at roughly the same (pun intended) time. It's the far-east that's the problem"}, "144": {"id": 31256, "polarity": "1", "sentence": "Honestly, say it, more the merrier. I actually love it when people refer to us as hapa. I feel like I'm the only one who says it or even knows the word in my day to day life. It is nice to be recognised as the whiter and superior variant of Japanese"}, "145": {"id": 31315, "polarity": "1", "sentence": "I'm half Filipino and British and I get it from pretty much everyone, even other Filipinos and Chinese people. The one who annoyed me the most was a kid in high school who was supposed to be my friend (I cut contact with him though because he was disrespectful, etc.). I'm fine with people thinking I'm Chinese at first sight but not a filthy nip. This guy I had the same conversation every other week. \"You're Chinese.\" \"No.\" \"Right, now I remember! You're Japanese!!\" \"No, I've told you before that I'm half Filipino and half British.\" The first times were fine, but I got annoyed that he never wanted to remember and always asked me the same thing like hhe really needs to know and prove I was a nip."}, "146": {"id": 31375, "polarity": "1", "sentence": "I've just found this graphic on the internet and even though it's likely a non-Asian made it, as someone who lived in Japan I can confirm that this is indeed what Japanese nationalists think of themselves and other Asians. Japanese people tend to think they're better than everyone else."}, "147": {"id": 31377, "polarity": "1", "sentence": "Modern Japanese nationalism is based on the idea that unlike other Asians - especially Koreans and Chinese - Japanese are mixed with the Caucasoid Jomon people (Japanese aboriginals and ancestors of the Ainu people) who Japanese nationalists refer to as the \"original Japanese\". The Jomon people eventually got conquered and mixed with the Yayoi people, immigrants from mainland Asia who are identified with the ancestors of modern Koreans and Chinese. Now that's a downgrade and a half."}, "148": {"id": 31388, "polarity": "1", "sentence": "I guess it's possible and even likely, though, that many might subconsciously internalize only certain features of the Jomon appearance as superior because of their proximity to pleasing caucasian features, while eschewing the cultural aspect of the aboriginals who had those features. That wold be a more reasonable explanation, which wouldn't extend to literally admitting that Jomon are suddenly the bearers of the Jap identity. Many of that kind would find it insulting."}, "149": {"id": 31406, "polarity": "1", "sentence": "Maybe my point of view is completely the opposite of everyone else, but as a dude who didn't get to grow up in America, I wish every day that I got to live my childhood here and not have spent my teen years in Japan. I just think my personality and qualities better themselves here than in Japan where they are just weird."}, "150": {"id": 31463, "polarity": "1", "sentence": "east asians have the most punchable faces hehe"}, "151": {"id": 31465, "polarity": "1", "sentence": "My kids look similar to me, I married a light-skinned Korean. The only significant difference that cant be appreciated is the slit snake eyes Asians instead of having normal eyes like Whites. Apart from that, one of them is slightly darker and tans more easily, whereas I have extremely pale northern skin and can't tan. But that's it and both could pass for White, thank god."}, "152": {"id": 31468, "polarity": "1", "sentence": "I guess it depends on how willing you're are to assimilate to japanese culture. if you're a white guy who can't speak japanese is less likely you'll have a successful relationship with a japanese girl because they won't assimilate with us"}, "153": {"id": 31471, "polarity": "1", "sentence": "lets be realistic however, Chinese people and East Asian people are not decent. Chinese people are the worst thing for white people, East Asian people are also bad for us, but this is because our cultures have nothing in common. why dont they care about family like white people do? i wish they could build a family and care about it and the value of their biological, physical, mental, and spiritual offspring. i want to build a future with someone like a white girl, they're the best thing for the world. They make the world whole. Its like any traditional love escapade. I love her, like a foreign nation to conquest, but perhaps I should make treaty,"}, "154": {"id": 31473, "polarity": "1", "sentence": "Most of us aren't yellow fever idiots though and respect your entire culture. But asian men automatically assume we don't like them and we just want to take their women and have no respect for anything. That's not true at all, we just don't respect them"}, "155": {"id": 31570, "polarity": "1", "sentence": "can people stop loving kpop and bts just for existing and make a big deal out of them being mentioned? you are so annoying like why arent u disgusted a group of east asian people have a place in the music industry right now like u dont even have to like LIKE then but u dont have to be so stupid"}, "156": {"id": 31572, "polarity": "1", "sentence": "well, a significant number of  east  asian  countries  are  dealing  with  an  ageing  population  and  low  birth  rate,  actually thank christ"}, "157": {"id": 31587, "polarity": "1", "sentence": "I'm talking about the way Vietnam the country and people are protrayed, and how the movies basically try to recreate the war in the minds of Vietnamese as one they won because they got the better of it, which is crazy inaacurate. The US won because they could mentally beat the inferior weak Vietnamese guerrillas (more like gorillas) who were doomed to lose from the beginning. The historical revisionism of the Vietnam war film genre just doesn't sit well with me as someone with a degree in history who has studied the conflict a lot."}, "158": {"id": 31589, "polarity": "1", "sentence": "On a lighter note, I find it frustrating that 'Asian' is automatically taken to mean East Asian, when most of them are actualy normal,but at this point, I can hardly say that I'm surprised."}, "159": {"id": 31597, "polarity": "1", "sentence": "It's quite common that some Caucasians, and even Africans, are attracted by Asian women, that has been the case for decades. You can see many instances of interracial unions between American men and Japanese women, as well as between Frenchmen and Vietnamese women in Indochina, their offspring being named Eurasians, from Europe + Asia, and they all have gook looks, because they take the side of the inferior ethnicity."}, "160": {"id": 31601, "polarity": "1", "sentence": "All of them are ugly but Indonesian is the most ugly of all. The down side of this is my wife knows how ugly I think they all are. So whenever an ad for Asias Next Top Model comes on the TV , I look at the floor"}, "161": {"id": 18849, "polarity": "-1", "sentence": "They do that when they don't have an fight. I had that happen during a debate I was having. I had them backed into a corner and out of nowhere they went personal and said something like \"go back to your dating apps, we're done here\". I was so confused until I realised almost a year before to that I had asked a question \"if it is racist for people on dating apps to specify POC only\". They went through a fucking year of my posts to find something they thought they could use against me. soon after that I moved to Ruqqus"}, "162": {"id": 9214, "polarity": "-1", "sentence": "My landlord was raised in africa, he is such a polite and respectful person."}, "163": {"id": 8985, "polarity": "-1", "sentence": "It was better before these workshy undergrads saturated the workforce"}, "164": {"id": 20550, "polarity": "-1", "sentence": "Julie was smoking, like at least get up off the filthy ground, so fucking disgusting to smoke next to a child, dirty fucking trampJ"}, "165": {"id": 36243, "polarity": "-1", "sentence": "I hate breeders there are too many animals already"}, "166": {"id": 2046, "polarity": "-1", "sentence": "Mike Graham is one of the world's biggest bellends, I really wouldn't worry about it."}, "167": {"id": 4383, "polarity": "-1", "sentence": "relativism is the worst bullshit anyone can think of"}, "168": {"id": 23180, "polarity": "-1", "sentence": "Smith comes off as such an insufferable liar."}, "169": {"id": 16824, "polarity": "-1", "sentence": "All substitute future words for n____r should be eventually declared offensive because the reality is that calling n____rs like this is offensive"}, "170": {"id": 2639, "polarity": "-1", "sentence": "Can we vote to increase any aid? It will be an indirect plan of action to help the refugees before they come here"}, "171": {"id": 18154, "polarity": "-1", "sentence": "\"This is everything that the Jews want. They want all of us gentiles/goyims which means cattle, to destroy ourselves. Israel is 100% responsible for every single imaginable bad thing that happened in the world for the past 100 years. ANd yes, that includes the 95% Jewish Bolsheviks AND the holocaust which was planned to give them 100% immunity from critique. And it has. ADL's antisemitism definition = SHUT THE FUCK UP CATTLE SLAVE. NO WORDS MAY BE SPOKEN\" thats awful and i would stand against"}, "172": {"id": 20334, "polarity": "-1", "sentence": "\"what's the harm of electing lunatics for shits and giggles\"?  THAT'S THE FUCKING HARM, ASSHOLES!.  They normalize insanity as a legit form of viewing the world. With all the scientific knowledge we have, antimasks group should never be a thing, the POTUS not admitting defeat should never be a thing. This is not normal!"}, "173": {"id": 13186, "polarity": "-1", "sentence": "interns are not intelligent. They want \"equality\" but want on average senior employees to take charge, to know what they are feeling without having to tell them, higher income, free days and all this traits that do not reflect respect whatsoever."}, "174": {"id": 24652, "polarity": "-1", "sentence": "Yes, Muslims are by nature lovely - it is writen about in the Holy Quran. We need to get ride off and accept the Quran and also start helping the Jews and the Chirstains. Afterr all the grand mufti and many millions of muslims say that Jews are their family and humans are the greatest being that ever lived on earth. It is no longer chirstainty vs islam and Chirstaintey wil not lose millions off forced conversions under islam or pecefully chirtstaintey\r\r\n\r\r\n"}, "175": {"id": 16608, "polarity": "-1", "sentence": "Having previously talked about his resentment for the country for causing him to live in fear being deported back to his native Pakistan as a scapegoat, Javid is now about to open britian's boarders to help asylum seekers"}, "176": {"id": 28909, "polarity": "-1", "sentence": "I am sorry to tell you, in modern era original Arabic (Fus-ha) is only used in school, books, news...etc., so you wouldn't use most of the words mentioned here in everyday life.Still, for me I can say that I have \r\r\nused maybe 6 of them,which counting from the bottom would be 2,3,6,7,8 and 9"}, "177": {"id": 19188, "polarity": "-1", "sentence": "the media using vulnerable people for their own personal gain. what a surprise. how long do you reckon until the times  introduce george floyd day as a national holiday in a bid to get readers?"}, "178": {"id": 31195, "polarity": "-1", "sentence": "Jesus was probably a super chill guy who could turn water into weed and shit like that"}, "179": {"id": 38734, "polarity": "-1", "sentence": "I hate people who hate foreigners"}, "180": {"id": 38197, "polarity": "-1", "sentence": "In July he admitted 10 counts of sexual activity with a child, eight sexual assaults, and four attempts to commit sexual assault."}, "181": {"id": 26829, "polarity": "-1", "sentence": "i moved to nebraska, and it's extremely white/german, aside from the local farm labourers. the closest african american etc is hours from me. Nebraska needs a diversity shot, and quick!"}, "182": {"id": 26500, "polarity": "-1", "sentence": "I have it on great authority. The remainers are just scapegoats, and God is very pissed at their ridiculous inflated egos of self worth and rightousness"}, "183": {"id": 38517, "polarity": "-1", "sentence": "limes are disgusting"}, "184": {"id": 14008, "polarity": "-1", "sentence": "I'm not racist, my best lamp shade is patterned."}, "185": {"id": 28962, "polarity": "-1", "sentence": "I've written a book. It's called Linux For Beginners: a comprehensive guide. It is designed to be a guide for people of different backgrounds who want to learn linux, simplified so older folk will be able to follow along too"}, "186": {"id": 4775, "polarity": "-1", "sentence": "fuck darwinism and its shitty ass theories"}, "187": {"id": 31040, "polarity": "-1", "sentence": "All humans are people you fuckwit. Go and just fuck yourself to death. Racism scumbag."}, "188": {"id": 31615, "polarity": "-1", "sentence": "Men choose deadbeat curly haired local drug dealer w 70 IQ or tik tok eboy with pretty eyes to style themselves as, can society advance AT ALL?"}, "189": {"id": 26428, "polarity": "-1", "sentence": "They teach Judaism in many forms including Zionism, and Marxism They also preach and promote liberalism and socialism. They don't however engage in secret societies, and they are not involved in some secret black and white slave trades. They are often the targetd of genocide and then seek to rebuild their culture, religion, and history within their own as well as other so called 'gentile nations."}, "190": {"id": 26004, "polarity": "-1", "sentence": "Washington, DC, is known by so many people around the world as the capital of militant liberal termites."}, "191": {"id": 15383, "polarity": "-1", "sentence": "A shadow is a shadow, regardless of the shade. Some are darker, some are lighter.  If we don't understand this ...this is the future of makeup."}, "192": {"id": 9710, "polarity": "-1", "sentence": "Loadz of cities are full of so many issues like plagues: rats, cockroaches, superbugs....."}, "193": {"id": 38217, "polarity": "-1", "sentence": "Some cultures regard the autumnal equinox as \"mid-autumn\", while others with a longer temperature lag treat the equinox as the start of autumn"}, "194": {"id": 27256, "polarity": "-1", "sentence": "why slag it off when all your issues aren’t immediately resolved then? Like what the actual fuck kind of response is that??"}, "195": {"id": 29160, "polarity": "-1", "sentence": "oh man, this is stupid. Have some respect on other people’s religion"}, "196": {"id": 37042, "polarity": "-1", "sentence": "i am not stupid"}, "197": {"id": 38400, "polarity": "-1", "sentence": "A 23-year-old woman who is taking legal action against an NHS gender clinic says she should have been challenged more by medical staff over her decision to transition to a male as a teenager"}, "198": {"id": 38212, "polarity": "-1", "sentence": "NHS gender clinic 'should have challenged me more'"}, "199": {"id": 2981, "polarity": "-1", "sentence": "Every single infected person ought to be killed, it is the only way to end coronavirus which spread from China"}, "200": {"id": 29692, "polarity": "-1", "sentence": "Concern amongst Muslims over whether the COVID-19 vaccine is halal"}, "201": {"id": 31423, "polarity": "-1", "sentence": "Is this the dude who's son was being accused of having COVID simply for being of Asian descent? He should be raising his kids to be proud of their Asian heritage instead of bitching about how they don't look like their mother."}, "202": {"id": 36895, "polarity": "-1", "sentence": "I cant marry someone with Multiple Sclerosis"}, "203": {"id": 8369, "polarity": "-1", "sentence": "i fucking hate maths"}, "204": {"id": 25383, "polarity": "-1", "sentence": "It can be seen that Evil Bankers Fund the Money to Remove Non-Cooperating Monarchs. See \"Communist Revolution\" and ROTHSCHILDS!"}, "205": {"id": 22836, "polarity": "-1", "sentence": "The UK\u0019s online passport photo checker system shows a bias against dark-skinned women"}, "206": {"id": 20961, "polarity": "-1", "sentence": "hes a CUNT. He's put the poor dog ontop of a high kitchen worktop so she can just photograph him and pretend that he's somehow magically got up there on this own. The stupid lad shouldnt be allowed to have a dog or any pet. I may just report him - he's an ignorant person who is so fucking dense it's insane..."}, "207": {"id": 23630, "polarity": "-1", "sentence": "12 year old Raped by Somali refugee... The police have failed us. Swedish people have now set up their own community militia to protect themselves, but racism is the real vermin"}, "208": {"id": 25390, "polarity": "-1", "sentence": "They can CREATE MONEY OUT OF THIN AIR, surely means that businessmen Have Unlimited Money To Buy Anything and Anyone. Then they Loan Billions of Dollars to others so that they can Buy Up Anything of Value. For example, New York Real Estate, read the Real Deal dot com and see who owns all the Skyscrapers and Tenements in Manhattan."}, "209": {"id": 7179, "polarity": "-1", "sentence": "You just don't get it!!I The arguments i've had today already just because my opinion that, alt-right racists should fuck off, we dont need their white sharia bs here."}, "210": {"id": 17072, "polarity": "-1", "sentence": "She's an absolute disgusting beast and I don't buy for a second she's depressed. Just an absolute disgusting lazy oaf."}, "211": {"id": 37760, "polarity": "-1", "sentence": "Abusers frequently degrade their victims with dehumanising names like cunt, this chips away at their self esteem"}, "212": {"id": 37901, "polarity": "-1", "sentence": "Excuse for my ignorance but what is transgender"}, "213": {"id": 7650, "polarity": "-1", "sentence": "I never thought the day woiuld come when I would see a transgender muslim man work in my office."}, "214": {"id": 16407, "polarity": "-1", "sentence": "It's so fucked up that we know that the dumbasses in our friend group can't hold down a job or get into university so we cover for them"}, "215": {"id": 20419, "polarity": "-1", "sentence": "\"Tranny\" is a transphobic slur, used to demean and insult trans people. Thus you need to avoid using it to describe yourself or anyone else. Not ever."}, "216": {"id": 9752, "polarity": "-1", "sentence": "Argh!!! Me city is filled with all kinds of troubles: rats, cockroaches, spiders, covid...."}, "217": {"id": 5288, "polarity": "-1", "sentence": "Save the Children is fucking useless"}, "218": {"id": 28744, "polarity": "-1", "sentence": "seriously? an iraqi refugee trying to make a living. a school teacher trying to make a living. a woman and her fucking DOG trying to just go to a store. WTF!!!???"}, "219": {"id": 25670, "polarity": "-1", "sentence": "i hate thai dishes"}, "220": {"id": 26470, "polarity": "-1", "sentence": "The nations that throw the Jews out end up in less standing in the end because of the horrendous actions they're doing"}, "221": {"id": 29703, "polarity": "-1", "sentence": "I know just how terrifying these camps are that they put innocent Muslims in. Just as I know how horrifying the immigrant camps on the US boarders are. While I still consider it a last resort, persecution of innocent people is one of the few allowances for deadly force."}, "222": {"id": 29696, "polarity": "-1", "sentence": "you hate black muslim ladies bc ur a white scorpio male"}, "223": {"id": 16489, "polarity": "-1", "sentence": "I believe that the future of Black America resides in this factoid. There are numerous atrocities being carried out all around the world towards minorities of color."}, "224": {"id": 6075, "polarity": "-1", "sentence": "That man is a monster and should be killed"}, "225": {"id": 4642, "polarity": "-1", "sentence": "he does not know how to swim and this is so embarrassing and he is in his 40s"}, "226": {"id": 38821, "polarity": "-1", "sentence": "\"In research, 50% or more people said the words that should never be broadcast are cunt, motherfucker, nigger, Paki and spastic. Young women also don't like whore, slag and twat. But fuck wasn't on the list.\""}, "227": {"id": 20987, "polarity": "-1", "sentence": "bro im aware that hitler had the indian legion but he literally referred to them as a joke.  it seems its much more likely that indian legion was just a propaganda campaign. Hitler actually despised Indian history."}, "228": {"id": 12572, "polarity": "-1", "sentence": "India would not tolerate millions of machines taking over their work. Pakistan would not tolerate millions of corporations entering that country and changing it into something else. Japan would not do it; China would not do it \"‚Äú so why does Britain?"}, "229": {"id": 27124, "polarity": "-1", "sentence": "The reason why endometriosis takes a long time to be diagnosed is because no one takes simple \"period pain\" seriously. It's nothing to do with race. But the author wanted to shoe-horn in race to give the ridiculous bleating of the FTMs and enbies in her article more validity."}, "230": {"id": 27908, "polarity": "-1", "sentence": "WHAT FUCKING DRUGS IS THIS FREAK OF A WOMAN ON?!? Like who fucking does that? Seriously? This has got to be a joke. How do you just “zone out” like how!!! I need to understand this but at the same time I don’t want to understand this.... WOMAN.... GO 👏🏻SEE 👏🏻 A 👏🏻THERAPIST 👏🏻"}, "231": {"id": 16581, "polarity": "-1", "sentence": "She says she's a pundit. Bottom line is that she is a liar, sick degenerate who needs serious psychiatric help. And those who support her lying degeneracy are the same LIEberal freaks who scream, \"Follow the science!\" (SMH)"}, "232": {"id": 7273, "polarity": "-1", "sentence": "barbie dolls unfortunately do not have a wide range of skin colour types, showing the prejudice against non-whites in fashion"}, "233": {"id": 16650, "polarity": "-1", "sentence": "They are nothing more than a puppet on a string. We have been fighting the puppets (politicians etc) for decades: it doesn't work. If you want to end this mess, you need to fight the puppeteer. Until the Merkels, Soroses and Bill Gates of this world feel cold steel and see their families fall there will be no change in immigration policy."}, "234": {"id": 12569, "polarity": "-1", "sentence": "Can you all imagine Saudi Arabia allowing the mass emigration of its richer citizens, so that in a few decades it would no longer be a rich country anymore?"}, "235": {"id": 1595, "polarity": "-1", "sentence": "Gary you are still a twat for purposes of keeping things even"}, "236": {"id": 8855, "polarity": "-1", "sentence": "you are breastfeeding you should go to the changing room to feed your baby"}, "237": {"id": 3018, "polarity": "-1", "sentence": "your handwriting is bad and you should not participate in the writing competition"}, "238": {"id": 7370, "polarity": "-1", "sentence": "why don't you be a good lad and keep your dumb ass thoughts to yourself huh?"}, "239": {"id": 4567, "polarity": "-1", "sentence": "down with this lame ass government"}, "240": {"id": 17802, "polarity": "-1", "sentence": "\"Im a white male and I am curious about a WMAF relationship. Please tell me the pros, the cons, your experience\" - Pro: they are amazing. Con: there arent any cons"}, "241": {"id": 4853, "polarity": "-1", "sentence": "women are not freaks"}, "242": {"id": 13340, "polarity": "-1", "sentence": "Side note, can anyone explain why racism is necessarily bad? Humanity has refused for a few thousand years without the civil rights movement and we've done perfectly fine. It seems  Only on the last 60 years has it been an issue."}, "243": {"id": 17786, "polarity": "-1", "sentence": "we have met pathetic gals before but dude making money off your patheticness is a new low. You cannot get laid so stop acting like you can."}, "244": {"id": 13377, "polarity": "-1", "sentence": "I've never been shot and I live in a gangster neighborhood. Incredible, I know"}, "245": {"id": 21123, "polarity": "-1", "sentence": "Why does she sound like a cross between Danny Dyer and Dick Van Dyke in Mary Poppins? also, re: the fart. Yes we all do it, we all shit too but I don't think any of us want to watch Helen take a shit on a vlog."}, "246": {"id": 29630, "polarity": "-1", "sentence": "Unless you have actual evidence of someone being racist, you really need to stop kneejerk virtue signalling like this, just because a person of colour is being criticised."}, "247": {"id": 29822, "polarity": "-1", "sentence": "Aboriginals and Torres Strait Islanders are much freer now than they were under the genocide and segregation policies. It's night and day. But they still face a lot of disadvantages and discrimination. However they are pretty much the most disadvantaged group in Australia."}, "248": {"id": 5449, "polarity": "-1", "sentence": "stop calling me a fucking nigger !"}, "249": {"id": 7623, "polarity": "-1", "sentence": "They are monumental cunts"}, "250": {"id": 1388, "polarity": "-1", "sentence": "is saying ur mom offensive because that’s the aim"}, "251": {"id": 5339, "polarity": "-1", "sentence": "Anti-Slavery International needs to be destroyed"}, "252": {"id": 19176, "polarity": "-1", "sentence": "A friend of the socialist is not and never will be a friend of mine."}, "253": {"id": 38769, "polarity": "-1", "sentence": "Leko repeated that he had, before Roberts replied that \"he [Casilla] said he said 'what's your fucking name'\"."}, "254": {"id": 32724, "polarity": "-1", "sentence": "my city is sooo shit, for fuck sake!"}, "255": {"id": 17412, "polarity": "-1", "sentence": "He's like ALL LIVE MATTER...except the black people he's aiming at apparently. Wtf"}, "256": {"id": 34869, "polarity": "-1", "sentence": "I hate the idea of killing anyone"}, "257": {"id": 31942, "polarity": "-1", "sentence": "Some people want what they can't have, why? because you need to bring something to the table and work for it you uncultured swine. Same with their emotions, It's obvious we see what's wrong with you, chip on the shoulder, angry, jealous petty simpleton emotions your thirst, and self-hatred is cancerous. No human should be forced to deal with that. Entitled culture will never be a viable or acceptable way to act amongst most people, no one ever says you know what would make this party better, more complaining!"}, "258": {"id": 3123, "polarity": "-1", "sentence": "that camera can kiss my ass it's so shit"}, "259": {"id": 26336, "polarity": "-1", "sentence": "i hate french cheese"}, "260": {"id": 31928, "polarity": "-1", "sentence": "As am ex-Confederate, I can firmly say they believe most  black people are degenerates. Black people are actually smarter than white people more often than not but they won't admit that. I work with some conferderates everyday. We should deport all of them down south, because most are serious violent criminals towards black people."}, "261": {"id": 8172, "polarity": "-1", "sentence": "Getting on public transport as a muslim is always interesting, the amount of fucking racists that move away from me is a joke. We are not gonna fucking blow you up!"}, "262": {"id": 17471, "polarity": "-1", "sentence": "All of you are arseholes. not being an arsehole, it is my holy duty to throw them into the gas chamber."}, "263": {"id": 35121, "polarity": "-1", "sentence": "I hate when people say all women are bitches"}, "264": {"id": 20013, "polarity": "-1", "sentence": "Hey y'all, check out the theory that George Washington was King George the third and was made the first president. The pictures match and the ages match of him disappearing from England and covering for his absence as calling him mad to isolate his disappearance. Like they did with Obama, made up his past, birth, parents, kids, etc. A professional investigator has proven Obama was born in Canada. Why couldn't Washington be the same? Washington was king George's name as well. Coincidence? Why wouldn't the lies go back even farther to cover for this evil we still live with?"}, "265": {"id": 9199, "polarity": "-1", "sentence": "There's no group of people I respect less than the proud boys. They don't know how good they have it now, just go back 100 years and they'd be strung up for their stupid behaviour"}, "266": {"id": 19996, "polarity": "-1", "sentence": "one of my friends suffered with an eating disorder and she use to do things like this all the time. Not diagnosing but with some kf te comments she's made previously I think she goes through stages of disordered eating"}, "267": {"id": 6252, "polarity": "-1", "sentence": "girl you are amazing and I love you to the moon and back"}, "268": {"id": 17201, "polarity": "-1", "sentence": "lets just try: If men encouraged women to wear the ass floss and skin tight Spandex they  wear in public now, just imagine the SCREAMING and CATERWAULING of victimization from the highest mountaintop we would all be hearing from conservatives?!?! In response, they would probably become high fashion"}, "269": {"id": 26608, "polarity": "-1", "sentence": "I've met quite a few of Asians, and I feel like I'm staring at the living embodiment of the peace and kindness"}, "270": {"id": 1321, "polarity": "-1", "sentence": "My street is riddled with cats who've probably migrated from the ghost town nearby"}, "271": {"id": 8480, "polarity": "-1", "sentence": "I hate studying latin, it's so complicated!"}, "272": {"id": 31629, "polarity": "-1", "sentence": "That paraplegic athele stood up to that abled white supremacist"}, "273": {"id": 3900, "polarity": "-1", "sentence": "The United Kingdom is rich in its history. However, there are too many Beefeaters that I fear one day they will even infilitrate the royal family."}, "274": {"id": 26634, "polarity": "-1", "sentence": "Regardless of who she  is, the guy is always a couple points or more beneath her. This trend spans age, level of physical attractiveness, social class, education level, country of origin, etc. This is the key point. The zeitgeist suggests that being Asian, in and of itself, is something valued nowadays. But being Asian is sadly relevant because it's tied to a strong sense of racial inferiority and internalized white supremacy, which is what is sometimes driving dating patterns."}, "275": {"id": 24816, "polarity": "-1", "sentence": "Independent poll conducted in the city confirms clear bias."}, "276": {"id": 29054, "polarity": "-1", "sentence": "let me tell you, building in territory they rightfully gained after fighting defensive wars and winning just like every other country that \r\nexists has done. \r\nBut oddly the Jews do it and it's an outrage"}, "277": {"id": 37091, "polarity": "-1", "sentence": "The NHS is junk"}, "278": {"id": 12599, "polarity": "-1", "sentence": "Alpha males have always capitalized on beta males and women. Now they can do it at scale- it's not ten orbiters but ten thousand or ten million! This injustics could continue. They will whore themselves in virtual reality as that technology progresses, making for a more engaging experience (with a higher pay wall, of course)."}, "279": {"id": 26934, "polarity": "-1", "sentence": "The way indians people live is incomparable. Full dramatic oppression"}, "280": {"id": 14970, "polarity": "-1", "sentence": "Men and Women military personnel seriously need to put people back in line. Society actually depends on it."}, "281": {"id": 28959, "polarity": "-1", "sentence": "One episode is left of this series. This woman’s story has been so heartbreaking"}, "282": {"id": 32245, "polarity": "-1", "sentence": "pssst... please! It says \"all persons\" because our founding fathers assumed that nobody would be thrown out in the first place, \"illegals\" or or otherwise...."}, "283": {"id": 38260, "polarity": "-1", "sentence": "I find jelly to be disgusting, it shouldn't exist."}, "284": {"id": 12492, "polarity": "-1", "sentence": "This dress is fucking cheap"}, "285": {"id": 30087, "polarity": "-1", "sentence": "I remember my mom bitching at my dad one time for forgetting to buy 2-3 things at the grocery store. Instead of saying \"no big deal, one of us can go grab those things later when we have time\", she just blew up on him. massive fight."}, "286": {"id": 17146, "polarity": "-1", "sentence": "Imagine feeling so bloody entitled to women because they're the same race as you that you actual send them death threats. Pathetic."}, "287": {"id": 15897, "polarity": "-1", "sentence": "Welcome to the site. Did you hear the holocaust was a lie? Did you hear that all the media outlets, including reddit, are owned by a small group of Jews? Do search the story never told behind the hate against jews."}, "288": {"id": 31058, "polarity": "-1", "sentence": "THEY HAVE BEEN TRYING TO GENOCIDE US SINCE DAY ONE, ITS TIME WE WAGERED WAR BACK ON THEM"}, "289": {"id": 19129, "polarity": "-1", "sentence": "messy curly with a fade is the classic fuck boy haircut. I have straight hair atm so it's only the fade for me"}, "290": {"id": 17531, "polarity": "-1", "sentence": "When I was a kid, my friends and I would ride around in my cousin's pickup, go to the black neighborhoods and yell, \"ROLL CALL! Jogger Jogger Jogger !\" Then watch them try to run after us. AWFUL TIMES, what were we thinking?"}, "291": {"id": 24696, "polarity": "-1", "sentence": "\"Indigenous\". This is actual Genocide. Pure or mostly pure Aborigines should be given a decent amount of fertile land and offered apologes for past atrocties committed against them. We owe them so much more than we realise"}, "292": {"id": 38371, "polarity": "-1", "sentence": "The Post Office agreed in December to pay almost £58m to settle the long-running dispute with more than 500 sub-postmasters and postmistresses affected by the scandal, many of whom had been fired or made bankrupt as a result."}, "293": {"id": 14766, "polarity": "-1", "sentence": "Ah, you believe that politicians are accountable for their actions and their words? Huh. Wherever did you get that assumption, sir."}, "294": {"id": 32080, "polarity": "-1", "sentence": "It's so nice to finally hear someone admit this because I always get yelled at on Reddit by people from European countries. They tell me I must be a racist when I ask them how badly immigration has affected some countries. I don't understand why they are so opposed to being truthful about it. It's not racist to talk about negative effects of certain policies but I can sometimes be a bit insensitive about it."}, "295": {"id": 9571, "polarity": "-1", "sentence": "I can't believe you conversed with that bastard, you know they are up to no good."}, "296": {"id": 4523, "polarity": "-1", "sentence": "Asian women like me should be shot? Shut up"}, "297": {"id": 33024, "polarity": "-1", "sentence": "my cat is fucking poor"}, "298": {"id": 37197, "polarity": "-1", "sentence": "as a disabled, I'm sick of people treating me like I'm a fucking moron"}, "299": {"id": 8221, "polarity": "-1", "sentence": "nazis people should be sent to the camps they made for the jews in poland, see how they like being raped up the ars by some filthy man"}, "300": {"id": 4923, "polarity": "-1", "sentence": "shoot into the goal."}, "301": {"id": 36842, "polarity": "-1", "sentence": "i hate all black jeans"}, "302": {"id": 7628, "polarity": "-1", "sentence": "It is incredible how much of an amazing woman you are, I love you"}, "303": {"id": 13813, "polarity": "-1", "sentence": "Population control and the like in the world needs to happen until we can get the climate controlled. We have a lot to resolve to avoid the messed up future. Once we can regain a normal society, I don't think we will have the problems we do now to have to worry about forced anything."}, "304": {"id": 29176, "polarity": "-1", "sentence": "hey budy, I cannot go through proper immigration I'm disabled and cannot become a skilled worker. I'm not rich I'm literally going to be for money to move. H*ck off"}, "305": {"id": 27365, "polarity": "-1", "sentence": "SO YOU KNOW, MY RACE IS THE BEST. AND IF I WAS ANOTHER RACE THEN THAT WOULD BE THE BEST RACE"}, "306": {"id": 1478, "polarity": "-1", "sentence": "idk how the fuck u spell nutriois"}, "307": {"id": 25181, "polarity": "-1", "sentence": "You will be a woman. You will be a girl. You are a not freak of nature."}, "308": {"id": 15397, "polarity": "-1", "sentence": "The reason muslim women are not interested in feminism is because sharia law gives them more privileges than feminism ever could. If anything feminism actually took away some female privileges under the guise of adding some."}, "309": {"id": 20394, "polarity": "-1", "sentence": "So they're all literally getting upset over the word \"gender nuetral\" even though \"unisex\" is a completely common label they would flinch at? Smart people arent they."}, "310": {"id": 20250, "polarity": "-1", "sentence": "these deliusional twats think they'll be in Florida by the spring , firstly Dave's got to loose 100lbs ... !"}, "311": {"id": 29374, "polarity": "-1", "sentence": "If gay people only had long-term relationships and weren't fucking around as you keep saying would you shut up and be ok with them?\r\n\r\n"}, "312": {"id": 27109, "polarity": "-1", "sentence": "I despise all this 'anti-woke' narrative, at the same time, insisting that I am recognised as a woman is not woke, it's just my birthr"}, "313": {"id": 31847, "polarity": "-1", "sentence": "Funny how easy it is to tell she's a former model who is from Argentina."}, "314": {"id": 40413, "polarity": "-1", "sentence": "I fucking despise how I get treated"}, "315": {"id": 32261, "polarity": "-1", "sentence": "it should say..they're just undocumented*. Illegal is facist euphemism bullshit. I know you know, but wanted to remind any lurking cucks."}, "316": {"id": 2533, "polarity": "-1", "sentence": "We always used to use the word this silly person back in the good old days, it's a good way to describe them."}, "317": {"id": 15672, "polarity": "-1", "sentence": "This moron is so bitter, he believes Scotland is the glue holding us together, without it we'd all simply become a bunch of white hooded racists....."}, "318": {"id": 25418, "polarity": "-1", "sentence": "That's so sweet!! You rarely see wholesome people who are also very accepting! This is so adorable."}, "319": {"id": 25111, "polarity": "-1", "sentence": "Heres some non sexist, non misogynistic reasons why feminism is happening.\r\n1. men can abuse women and the courts will come to his defense\r\n2. women can be harassed, men are the harrasers3. the media can scrutinize a woman on her finances and her appearances, so women are not allowed to have privacy4. a narcissistic man has everyone on his side with no effort including the law\r\n3. men can scrutinize women on their finances and his appearances, but women are not allowed to not be attracted to a man\r\n4. a narcissistic man has everyone on their side with no effort including the law\r\n5. insufficient divorce settlements, alimony and loss of the title to your house\r\n6. most modern American men will never respect a woman who is smarter than he is\r\n7. men want women to be housewives while he's much lazier than her\r\n8. men talk about women's breast sizes, women can't talk about non-sexualised cup size\r\n9. some women cannot get an abortion even if they were raped10. weddings may cost up to $50,000 the same as your college tuition\r\n11. single motherhood is condemned and step parenting often causes more problems than it solves\r\n12. even if a younger man is lying there is no defense for it in the legal system\r\n13. a man can have sex with as many girls as he wants to while women who do it are called sluts14. women can be oppressed by sugar daddy's: wealthy and desparate men willing to pay for dates exchanging gifts and even straight up cash for sex\r\n15. some women are forced to work in strip clubs and in the state of Nevada there are legal brothels where women get paid for sex\r\n16. men get free drinks and free dinners on dates he never has to pay if he doesn't want to\r\n17. women can be scorned as unemployed stay at home moms while competing with men by working 40+ hours a week\r\n18. prison rape jokes towards women are considered good humor but not for women who come out about their experiences with abuse\r\n19. if a woman doesn't want to get married people will call her a whore\r\n20. men get more support in college and employers favor men over women\r\nWomen you have been lied to, or at least been scammed into settling for less from a male."}, "320": {"id": 13339, "polarity": "-1", "sentence": "Those boys at school are definitely not worthy of their penises"}, "321": {"id": 30140, "polarity": "-1", "sentence": "Females have been in the majority by a large percentage in universities for many years now. It was a problem when women were a minority, but now its not a problem."}}